// جلد یازدہم کا ڈیٹا
// window.bookVolumes میں خودکار رجسٹر ہو جائے گا
window.bookVolumes = window.bookVolumes || {};

window.bookVolumes[11] = {
  volume: 11,
  title: "جلد یازدہم",
  pages: [
    {
      pageNumber: 1,
      text:  `[[heading:  تفہیم المسائل یازدہم
      11]]`
      
    },
    {
      pageNumber: 16,
      text: `[[heading: عقائد کے مسائل]]`
    },
    {
    pageNumber: 17,
    text: `[[heading: عالمِ دین کا کہنا:ہم احمدی ہیں]]
سوال:
کیا فرماتے ہیں علمائے دین شرع متین مسئلہ ھٰذا میں کہ بکر کہتا ہے کہ احمدیہ ہم ہیں، کیونکہ رسول اللہ ﷺ کا نام مبارک احمد ہے، اس لیے احمدیہ ہم ہیں ،قادیانی احمدیہ نہیں ہیں۔ زید نے کہا: احمدیہ قادیانیوں اور مرزائیوں کو کہتے ہیں اور ہمارے عرف میں یہ بات مشہور ہے کہ اگر آپ احمدیہ کہلواتے ہو ،تو وہابی بھی کہلوالو ،کیونکہ وہاب اللہ عزوجل کا نام مبارک ہے۔دریافت طلب بات یہ ہے کہ دونوں میں کس کا قول راجح ہے اور بکر امامت بھی کرواتا ہے،(سائل:محمد امجد رضوی، لاہور)۔
جواب:
یہ بات درست ہے کہ قرآنِ کریم میں سید المرسلین ﷺ کے دو اسمائے گرامی مذکور ہیں :
(۱) احمد ،اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] وَاِذْ قَالَ عِیْسَی ابْنُ مَرْیَمَ یٰبَنِیْ اِسْرَآءِیْلَ اِنِّیْ رَسُوْلُ اللّٰہِ اِلَیْکُمْ مُّصَدِّقًا لِّمَا بَیْنَ یَدَیَّ مِنَ التَّوْرٰىۃِ وَ مُبَشِّرًۢا بِرَسُوْلٍ یَّاْتِیْ مِنْۢ بَعْدِی اسْمُہٗۤ اَحْمَدُ ۫ فَلَمَّا جَآءَہُمْ بِالْبَیِّنٰتِ قَالُوْا ہٰذَا سِحْرٌ مُّبِیْنٌ
ترجمہ:’’اور(یاد کرو)جب عیسیٰ بن مریم نے کہا: اے بنی اسرائیل! میں تمہاری طرف اللہ کا رسول ہوں، اپنے سے پہلی کتاب تورات کی تصدیق کرنے والا ہوں اوراُس( عظیم) رسول کی بشارت دینے والا ہوں ، جو میرے بعد آئے گا، اس کا نام احمد ہے ،پس جب وہ ان کے پاس واضح نشانیاں لے کر آئے تو(کافروں)نے کہا: یہ کھلا جادو ہے، (الصف:6)‘‘۔
(۲)محمد، اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] مُحَمَّدٌ رَّسُوْلُ اللّٰہِ
ترجمہ:’’ محمد اللہ کے رسول ہیں، (الفتح:29)‘‘۔
حدیث پاک میں ہے:’’قَالَ رَسُوْلُ اللّٰہِ ﷺ: أَنَا مُحَمَّدٌ وَأَحْمَدُ ‘‘۔`
  },
  {
    pageNumber: 18,
    text: `ترجمہ: ’’رسول اللہ ﷺ نے فرمایا: میں محمد اور احمد ہوں ،(صحیح البخاری:3532)‘‘۔
 محمد کے معنی ہیں:’’ جس کی بہت زیادہ تعریف کی گئی ہو‘‘ اور احمد کے معنی ہیں:’’بہت زیادہ تعریف کرنے والا ‘‘۔آپ ﷺ کا رب قرآنِ کریم کی آیاتِ مبارکہ میں آپ کی جا بجا تعریف فرماتا ہے اور آپ اپنے ربِ کریم کی تعریف فرماتے ہیں ،ملائکہ اورجنّ وانس میں سے اہلِ ایمان آپ کی تعریف میں رطب اللسان ہیں ۔
	پس نبی کریم ﷺ کے اَعلامِ مبارکہ کی طرف منسوب کر کے معنوی طور پر کوئی صاحبِ ایمان اپنے آپ کو احمدی یا محمدی کہہ سکتا ہے ، لیکن چونکہ ہمارے خطے میں منکرینِ ختمِ نبوت یعنی قادیانی طبقہ اپنے آپ کو ’’احمدی‘‘ کے نام سے متعارف کراتا ہے ، اس لیے احمدی کہنے سے گریز کرنا لازم ہے،سارے مخاطَبین اہلِ علم نہیں ہوتے ،کوئی یہ گمان بھی کرسکتا ہے کہ اس شخص کا تعلق منکرین ختمِ نبوت سے ہے اور کوئی اپنے آپ کو احمدی کہلانے والا قادیانی یہ کہہ سکتا ہے :’’ فلاں مولانا صاحب نے بتایا ہے کہ ہم احمدی ہیں ،تو میں اُن کی تقلید میں ایسا کر رہا ہوں‘‘، اس لیے عوام میں اپنے آپ کو بطورِ احمدی متعارف کرانے سے گریز کرنا چاہیے ، کیونکہ ہر بار اور ہر شخص کے سامنے آپ تقریر کر کے اس کی وضاحت نہیں کر پائیں گے۔حضرت علی کرم اللہ وجہہ الکریم کا قول ہے:
[[arabic]] إِیَّاکَ وَمَا یَسْبِقُ إِلَی الْعُقُوْلِ إِنْکَارُہٗ وَإِنْ کَانَ عِنْدَکَ اِعْتِذَارُہٗ
ترجمہ: ’’ایسی بات کرنے سے بچو جس کا عام لوگ فوراً رد کرنے پر آمادہ ہوجائیں ،اگرچہ آپ کے پاس اس بات کی کوئی (قابلِ قبول) توجیہ بھی ہو، (حاشیۃ الطحطاوی علی مراقی الفلاح، ج:1،ص:680)‘‘۔
علامہ اسماعیل بن محمد العجلونی لکھتے ہیں:
[[arabic]] مَنْ سَلَکَ مَسَالِکَ الظَّنِّ اُتُّھِمَ وَرَوَاہُ ’’الْخَرَائِطِیْ‘‘ فِیْ ’’مَکَارِمِ الْاَخْلَاقِ‘‘ مَرْفُوْعاً بِلَفْظِ: ’’مَنْ اَقَامَ نَفْسَہٗ مَقَامَ التُّھَمِ فَلَا یَلُوْمَنَّ مَنْ اَسَاءَالظَّنَّ بِہٖ‘‘
ترجمہ:’’ جو (بد)گمانوں کی راہوں پر چلے گا،وہ تہمت کا ہدف بنے گا`
  },

  {
    pageNumber: 19,
    text: `اور’’مکارمِ اخلاق‘‘ میں خرائطی نے ان الفاظ کے ساتھ مرفوعاً روایت کیا: ’’مَنْ أَقَامَ نَفْسَہٗ مَقَامَ التُّہَمِ فَلَا یَلُوْمَنَّ مَنْ أَسَاءَ الظَّنَّ بِہٖ‘‘۔
ترجمہ:’’ جو (بد)گمانوں کی راہوں پر چلے گا،وہ تہمت کا ہدف بنے گااور ’’مکارمِ اخلاق‘‘ میں خرائطی نے ان الفاظ کے ساتھ مرفوعاً روایت کیا: ’’جو مقامِ تہمت پر ٹھہرا، اُسے چاہیے کہ بدگمانی کرنے والوں کو ملامت نہ کرے،(کشف الخفاء ومزیل الالباس،الجزء الاول، ص:44)‘‘، یعنی اُس نے اپنے آپ کو ہدفِ ملامت بنانے کا موقع خود فراہم کیا۔ 
علامہ علی القاری نقل کرتے ہیں:
[[arabic]] مَنْ کَانَ یُؤْمِنُ بِاللّٰہِ وَالْیَوْمِ الآخِرِ فَلَا یَقِفَنَّ مَوَاقِفَ التُّھَمِ
ترجمہ:’’جو اللہ اور قیامت کے دن پر ایمان رکھتا ہے ،وہ تہمت کے مقامات پر نہ ٹھہرے، (مرقاۃ المفاتیح شرح مشکاۃ المصابیح،ج:3،ص:77)‘‘۔نیز مقاصدِ شریعہ میں ایک سَدُّ الذَرَائِع بھی ہے، یعنی جس بات سے کوئی خرابی پیدا ہوتی ہو، جواز کی گنجائش کے باوجود اس سے اجتناب بہتر ہے۔ لیکن اگر کوئی صحیح العقیدہ عالم اپنی تاویل اور توجیہ کے ساتھ اپنے آپ کو احمدی کہے تو اس پر کوئی فتویٰ لگانا درست نہیں ہے، تاہم ان کو احسن انداز میں سمجھایا جائے کہ حکمتِ دین کے تحت اور دفعِ مفاسد کے لیے انہیں اس شعار سے گریز کرنا چاہیے، ایسے عالم کی اقتدا میں نماز پڑھنے میں حرج نہیں ہے ،بشرطیکہ کوئی اور شرعی سبب مانع نہ ہو۔
[[heading: کیا ہر صحابی پر ایمان لانا ارکانِ ایمان میں داخل ہے]]
سوال:
	اسلامی عقائد وایمانیات کتنے ہیں، اللہ تعالیٰ پر ،اس کے ہر ایک فرشتے، ہر ایک کتاب، ہر ایک نبی، قیامت کے دن اور تقدیر پر ایمان لانے کے علاوہ آخری نبی رسول اللہ ﷺ کے ہر ایک صحابی پر ایمان لانا ارکان ایمان میں داخل ہے، سائل کا استفتاء ہر ایک صحابی کے صحابی ہونے پر ایمان رکھنے کے بارے میں نہیں ہے بلکہ ہر ایک صحابی پر ایمان لانے کے بارے میں ہے ، (مولانا خطیب الرحمن، یوکے)۔
جواب:
	اسلامی عقائد کا بیان قرآنِ کریم کی متفرق آیات میں موجود ہے ،ذیل میں ہم دو آیاتِ مبارکہ درج کر رہے ہیں:
(۱)
[[arabic]] لَیْسَ الْبِرَّ اَنْ تُوَلُّوْا وُجُوْہَکُمْ قِبَلَ`
  },
  {
    pageNumber: 20,
    text: `[[arabic: الْمَشْرِقِ وَ الْمَغْرِبِ وَ لٰکِنَّ الْبِرَّ مَنْ اٰمَنَ بِاللّٰہِ وَ الْیَوْمِ الْاٰخِرِ وَ الْمَلٰٓئِکَۃِ وَ الْکِتٰبِ وَ النَّبِیّٖنَ
ترجمہ:’’نیکی (کا مرتبۂ کمال) یہ نہیں کہ تم اپنا رُخ مشرق یا مغرب کی جانب پھیر دو ،ہاں ! (کامل)نیکی اُس شخص کی ہے جو اللہ ، قیامت کے دن ، فرشتوں ،(الہامی) کتابوں اور نبیوں پر ایمان لائے ]]،(البقرہ:177)‘‘۔
(۲)
[[arabic]] اٰمَنَ الرَّسُوْلُ بِمَاۤ اُنْزِلَ اِلَیْہِ مِنْ رَّبِّہٖ وَالْمُؤْمِنُوْنَ ۭ کُلٌّ اٰمَنَ بِاللّٰہِ وَمَلٰٓئِکَتِہٖ وَکُتُبِہٖ وَرُسُلِہٖ ۭ لَا نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْ رُّسُلِہٖ ۘ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا ۫ غُفْرَانَکَ رَبَّنَا وَاِلَیْکَ الْمَصِیْرُ
ترجمہ:’’رسول اُس (کلام) پر ایمان لائے جو اُن کی طرف اُن کے رب کی جانب سے نازل ہوا اورمومن (بھی ایمان لائے)، سب ایمان لائے اللہ پر، اُس کے فرشتوں پر، اُس کی کتابوں پر اور اس کے رسولوں پر (یہ کہتے ہوئے)ایمان لائے کہ ہم (ایمان لانے میں) اس کے رسولوں میں کوئی امتیاز نہیں برتتے اورانہوں نے کہا: ہم نے سنا اور ہم نے اطاعت کی ، اے ہمارے رب! ہم تجھ سے بخشش کے طلبگار ہیں اور (ہمیں)تیری ہی طرف لوٹنا ہے ،(البقرہ:285)‘‘۔
	سورۃ البقرہ: 4میں آخرت پر یقین رکھنے کا بھی ذکر ہے ۔موت کے برحق ہونے اور تقدیر کے بارے میں اللہ تعالیٰ نے فرمایا:
[[arabic]] اَیْنَ مَا تَکُوْنُوْا یُدْرِکْکُّمُ الْمَوْتُ وَلَوْ کُنْتُمْ فِیْ بُرُوْجٍ مُّشَیَّدَۃٍ ۭ وَاِنْ تُصِبْہُمْ حَسَنَۃٌ یَّقُوْلُوْا ہٰذِہٖ مِنْ عِنْدِ اللّٰہِ ۚ وَاِنْ تُصِبْہُمْ سَیِّئَۃٌ یَّقُوْلُوْا ہٰذِہٖ مِنْ عِنْدِکَ ۭ قُلْ کُلٌّ مِّنْ عِنْدِ اللّٰہِ ۣ فَمَالِ ہٰٓؤُلَاۗءِ الْقَوْمِ لَا یَکَادُوْنَ یَفْقَہُوْنَ حَدِیْثًا۔ مَآ اَصَابَکَ مِنْ حَسَنَۃٍ فَمِنَ اللّٰہِ ۣ وَمَآ اَصَابَکَ مِنْ سَیِّئَۃٍ فَمِنْ نَّفْسِکَ
ترجمہ:’’تم جہاں کہیں بھی ہو ،موت تم کو پا لے گی ،خواہ تم مضبوط قلعوں میں (محفوظ) ہو،اور اگر اُن کو کچھ اچھائی پہنچے تو کہتے ہیں : یہ اللہ کی جانب سے ہے اور(اے رسول!) اگر اُن کو کوئی برائی پہنچے توکہتے ہیں: یہ آپ کی طرف سے ہے ،آپ کہیے: ہر چیز اللہ کی طرف سے ہے ،تو ان لوگوں کو کیا ہوا کہ یہ کوئی بات سمجھ نہیں پاتے ،(اے مخاطب!)تم کو جو اچھائی پہنچتی ہے ،سو وہ اللہ کی طرف`
  },
  {
    pageNumber: 21,
    text: `سے ہے،اور تم کو جو کوئی برائی پہنچتی ہے ،یہ تمہاری ذات کی طرف سے ہے ،تو(اے مخاطب!) تم کو جو اچھائی پہنچتی ہے ،سو وہ اللہ کی طرف سے ہے اور تم کو جو برائی پہنچتی ہے ،تو وہ تمہاری ذات کے سبب ہے،(النساء:78-79)‘‘۔
	ہمارے ہاں جوابتدائی قاعدے یا نماز کی کتاب پڑھائی جاتی ہے ،اُن میں انہی مسلّمہ عقائد کوایمانِ مُجْمَل اور ایمان مُفصَّل کے عنوان سے بیان کیا گیا ہے ،یہ تو معلوم نہیں ہے کہ ابتدا میں اسے کن صاحبِ علم نے ان عنوانات سے مرتّب کیا ،لیکن یہ بہر حال قرآن وسنت سے ماخوذ ہیں اور معنوی طور پر بالکل درست ہیں ۔جن کتبِ الٰہی کے نام قرآنِ مجید میں صراحت کے ساتھ مذکور ہیں، اُن پر تعیین کے ساتھ ایمان لانا ضروری ہے اور باقی کتب سماوی پر اجمالی طور پر ایمان لانا ضروری ہے، قرآنِ کریم میں سورۃ الاعلیٰ میں صُحُفِ اِبْراھِیْمَ وَمُوْسیٰ ’’علیہما السلام ‘‘کا بھی اجمالاً تذکرہ کیا گیا ہے۔ اجمالی ایمان لانے کے معنی یہ ہیں کہ اللہ تعالیٰ نے جتنی کتابیں مختلف ادوار میں نازل فرمائیں ،وہ سب حق ہیں ۔ اسی طرح اللہ تعالیٰ نے فرمایا:
[[arabic]] وَ لَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِکَ مِنْہُمْ مَّنْ قَصَصْنَا عَلَیْکَ وَمِنْہُمْ مَّنْ لَّمْ نَقْصُصْ عَلَیْکَ
ترجمہ: ’’اور بے شک ہم نے (وقتاً فوقتاً )آپ سے پہلے بھی رسول بھیجے اور ہم نے بعض کے حالات آپ کے سامنے بیان کیے ہیں اور بعض کے حالات بیان نہیں کیے ، (المومن:78)‘‘۔ 
	سو جن انبیائے کرام اور رُسُلِ عظام کے اسمائے مبارکہ قرآنِ کریم اور احادیثِ مبارکہ میں تعیین کے ساتھ بیان کیے گئے ہیں ،اُن پر نام بنام اور تعیین کے ساتھ ایمان لانا ضروری ہے اور جن انبیائے کرام کے اسمائے مبارکہ قرآن وحدیث میں بیان نہیں ہوئے، اُن پر اجمالاً ایمان لانا ضروری ہے ۔بعض روایات کی رُو سے انبیائے کرام کی تعداد ایک لاکھ چوبیس ہزار (یا کم وبیش )، رُسلِ عظام کی تعداد تین سو تیرہ( یا کم وبیش ) اور الہامی کتابوں اور صحیفوںکی تعداد ایک سو دس (یا کم وبیش ) ہے،وَاللہُ تَعَالیٰ اَعْلَمُ بِالصَّوَاب۔ 
	اسی طرح ملائکہ میں سے بعض کے نام قرآنِ کریم میں مذکور ہیں ،جن میں چار ملائک کا تذکرہ`
  },
  {
    pageNumber: 22,
    text: `واضح طور پر آیا ہے،بعض کا حاملینِ عرش کے طور پر آیا،بعض کا ملائکۃ المقرّبین کے نام سے ذکر آیا ہے ،بعض کا کراماً کاتبین کے طور پر آیا ہے ،جہنم کے نگہبان فرشتے کا نام مالک بتایا گیا ہے وغیرہم۔اللہ تعالیٰ کے فرشتوں کی حقیقی اور قطعی تعداد قرآنِ کریم یا احادیثِ صحیحہ میں بیان نہیں فرمائی گئی، اس لیے اُن سب پر اجمالاً ایمان لانا ضروری ہے ۔
	ہر صحابی پر ایمان لانا ضروری نہیں ہے ،جن کی صحابیت احادیث وروایات سے ثابت ہو ،انہیں صحابیِ رسول ماننا لازم ہے اور ہوسکتا ہے کہ کئی ایسے صحابہ وصحابیات ہوں جن کے اسمائے گرامی احادیث وآثار میں مذکور نہیں ہیں ،اُنہیں اجمالی طور پر ماننا لازم ہے۔اگر ہم یہ کہیں کہ ہر صحابی پر ایمان لانا ضروری ہے ،توکسی صحابی کی صحابیت سے انکارپر کفر لازم آئے گا۔بعض صحابۂ کرام کی طرف قرآنِ کریم میں اشارات موجود ہیں ،بطورِ خاص حضرت ابوبکر صدیق رضی اللہ عنہ کا تذکرہ سفرِ ہجرت کے موقع پر غارِ ثور کے حوالے سے قرآن میں بیان فرمایا اور ’’صَاحِب‘‘کہہ کر اُن کا ذکر کیا گیا ہے اور اس پر امت کا اجماع ہے کہ اس کے مصداق وہی ہیں ،یہاں تک کہ اہلِ تشیّع بھی اس کا انکار نہیں کرسکتے ،کیونکہ غار میں آپ ﷺ اور حضرت ابوبکر صدیق رضی اللہ عنہ کے سوا کوئی اورتھا ہی نہیں  اور اس آیت میں چھ مرتبہ اُن کا ذکر ہوا ہے ۔
امام فخر الدین رازی التوبہ:40کی تفسیر میں حضرت ابوبکر صدیق ؄ کی فضیلت اور خصائص کی من جملہ وجوہ میں سے لکھتے ہیں:
’’اللہ تعالیٰ نے ابوبکر کا وصف بیان کیا کہ وہ رسول اللہ ﷺ کے صاحب ہیں اور یہ اُن کی کمالِ فضیلت پر دلالت کرتا ہے، حسین بن فضیل بَجَلی نے کہا: جو ابوبکر کی صحابیت کا انکار کرے ،وہ کافر ہے،کیونکہ امت کا اس پر اجماع ہے :’’ إِذْ يَقُولُ لِصاحِبِهٖ‘‘کا مصداق ابوبکرِ صدیق ہی ہیں اور یہ اس بات پر دلالت کرتا ہے کہ اللہ تعالیٰ نےاُن کا وصف ’’صاحِب‘‘بتایا‘‘۔

علامہ غلام رسول سعیدی  لکھتے ہیں:
’’اس آیت(التوبہ:40) میں اللہ تعالیٰ نے یہ تصریح فرمائی ہے کہ حضرت ابوبکر`
  },
  {
    pageNumber: 23,
    text: `نبی ﷺ کے صاحب ہیں اور یہ نصِ قطعی ہے،اس کا انکار کفر ہے اور تمام صحابہ میں صرف حضرت ابوبکر ؄کی صحابیت منصوص ہے اور آپ کے صحابی ہونے کا انکار کفر ہے،(تبیان القرآن، ج:5، ص:141)‘‘۔
امام احمد رضا قادری نے لکھا ہے:
’’یہ فقہائے کرام کے نزدیک ہے ، متکلمین یعنی ماہرینِ علم العقائد کے نزدیک کفر نہیں ہے، (جِدُّ الْمُمْتَار، ج:3،ص:42)‘‘۔
	سورۃ الاحزاب میں حضرت زید کا نام کے ساتھ ذکر ہوا، بعض دیگر اجلہّ صحابۂ کرام کو بھی بعض آیات کا مصداق قرار دیا گیا ہے ،مہاجرین وانصار ،اہلِ بدر واُحُد ،بیعتِ رضوان،  فتحِ مکہ ودیگر غزوات کے حوالے سے صحابۂ کرام کا ذکرمتعدد مقامات پر قرآنِ مجید میں ہے،چند آیاتِ مبارکہ  پیش کی جاتی ہیں:
(۱)
[[arabic]] لَقَدْ رَضِیَ اللّٰہُ عَنِ الْمُؤْمِنِیْنَ اِذْ یُبَایِعُوْنَکَ تَحْتَ الشَّجَرَۃِ فَعَلِمَ مَا فِیْ قُلُوْبِہِمْ فَاَنْزَلَ السَّکِیْنَۃَ عَلَیْہِمْ وَاَثَابَہُمْ فَتْحًا قَرِیْبًا
ترجمہ:’’بے شک اللہ ایمان والوں سے اس وقت راضی ہوگیا جب وہ درخت کے نیچےآپ سے بیعت کر رہے تھے، سو اللہ جانتا تھا جو کچھ ان کے دلوں میں ہے، پس اللہ نے ان کے دلوں پر طمانیت نازل فرمائی اور ان کو عنقریب آنے والی فتح کا انعام دیا، (الفتح:18)‘‘۔
(۲)
[[arabic]] وَالَّذِیْنَ اٰمَنُوْا وَہَاجَرُوْا وَجَاہَدُوْا فِیْ سَبِیْلِ اللّٰہِ وَالَّذِیْنَ اٰوَوْا وَّنَصَرُوْۤا اُولٰٓئِکَ ہُمُ الْمُؤْمِنُوْنَ حَقًّا ۭ لَہُمْ مَّغْفِرَۃٌ وَّرِزْقٌ کَرِیْمٌ۔ وَالَّذِیْنَ اٰمَنُوْا مِنْۢ بَعْدُ وَہَاجَرُوْا وَجَاہَدُوْا مَعَکُمْ فَاُولٰٓئِکَ مِنْکُمْ ۭ وَاُولُوا الْاَرْحَامِ بَعْضُہُمْ اَوْلٰی بِبَعْضٍ فِیْ کِتٰبِ اللّٰہِ ۭ اِنَّ اللّٰہَ بِکُلِّ شَیْءٍ عَلِیْمٌ
ترجمہ:’’اور جولوگ ایمان لائے اور انہوں نے ہجرت کی اور اللہ کی راہ میں جہاد کیا اور جن لوگوں نے (مہاجرین کو)جگہ دی اور ان کی نصرت کی، یہی لوگ برحق مومن ہیں، ان کے`
  },
  {
    pageNumber: 24,
    text: `لیے بخشش ہے اورعزت والی روزی ہے اور جولوگ بعد میں ایمان لائے اورہجرت کی اورتمہارے ساتھ جہاد کیا، سووہ بھی تم میں سے ہیں اور اللہ کی کتاب میں قرابت دار(بہ طور وراثت) ایک دوسرے کے زیادہ حق دار ہیں ،بے شک اللہ ہر چیز کوخوب جاننے والا ہے‘‘،(الانفال:74-75)‘‘۔
(۳)
[[arabic]] لَا یَسْتَوِیْ مِنْکُمْ مَّنْ اَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقٰتَلَ ۭ اُولٰٓئِکَ اَعْظَمُ دَرَجَۃً مِّنَ الَّذِیْنَ اَنْفَقُوْا مِنْۢ بَعْدُ وَقٰتَلُوْا ۭ وَکُلًّا وَّعَدَ اللّٰہُ الْحُسْنٰی ۭ وَاللّٰہُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ
ترجمہ:’’(اے مسلمانو!) تم میں سے کوئی بھی ان کے برابر نہیں ہوسکتا جنہوں نے فتح ( مکہ) سے پہلے (اللہ کی راہ میں)خرچ کیا اور (کافروں سے)قتال کیا، ان کا (ان مسلمانوں سے) بہت بڑادرجہ ہے جنہوں نے بعد میں (اللہ کی راہ میں) خرچ کیا اور(کافروں سے) قتال کیا، اللہ نے ان سب سے اچھے انجام کا وعدہ فرمایا ہے اور اللہ تمہارے تمام کاموں کی خوب خبر رکھنے والا ہے،(الحدید:10)‘‘۔
(۴)
[[arabic]] وَالسّٰبِقُوْنَ الْاَوَّلُوْنَ مِنَ الْمُہٰجِرِیْنَ وَالْاَنْصَارِ وَالَّذِیْنَ اتَّبَعُوْہُمْ بِاِحْسَانٍ رَّضِیَ اللّٰہُ عَنْہُمْ وَرَضُوْا عَنْہُ وَاَعَدَّ لَہُمْ جَنّٰتٍ تَجْرِیْ تَحْتَہَا الْاَنْہٰرُ خٰلِدِیْنَ فِیْہَاۤ اَبَدًا ۭ ذٰلِکَ الْفَوْزُ الْعَظِیْمُ
ترجمہ:’’اور مہاجرین اور انصار میں سے (نیکی میں)سبقت کرنے والے اور سب سے پہلے ایمان لانے والے اور جن مسلمانوں نے نیکی میں ان کا اتباع کیا، اللہ ان سے راضی ہوگیا اور وہ اللہ سے راضی ہوگئے اور اللہ نے ان کے لیے ایسی جنتیں تیار کی ہیں جن کے نیچے دریا بہتے ہیں ،وہ ان میں ہمیشہ ہمیشہ رہیں گے ،یہی بہت بڑی کامیابی ہے، (التوبہ:100)‘‘۔
(۵)
[[arabic]] مُحَمَّدٌ رَّسُوْلُ اللّٰہِ ۭ وَالَّذِیْنَ مَعَہٗۤ اَشِدَّآءُ عَلَی الْکُفَّارِ رُحَمَآءُ بَیْنَہُمْ تَرٰىہُمْ رُکَّعًا سُجَّدًا یَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰہِ وَرِضْوَانًا ۫ سِیْمَاہُمْ فِیْ وُجُوْہِہِمْ مِّنْ اَثَرِ السُّجُوْدِ`
  },
  {
    pageNumber: 25,
    text: `ذٰلِکَ مَثَلُہُمْ فِی التَّوْرٰىۃِ ۚۖ وَمَثَلُہُمْ فِی الْاِنْجِیْلِ کَزَرْعٍ اَخْرَجَ شَطْاَہٗ فَاٰزَرَہٗ فَاسْتَغْلَظَ فَاسْتَوٰی عَلٰی سُوْقِہٖ یُعْجِبُ الزُّرَّاعَ لِیَغِیْظَ بِہِمُ الْکُفَّارَ ۭ وَعَدَ اللّٰہُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ مِنْہُمْ مَّغْفِرَۃً وَّاَجْرًا عَظِیْمًا
ترجمہ:’’ محمد اللہ کے رسول ہیں، جو ان کے اصحاب ہیں کفار پر بہت سخت ہیں ،آپس میں نرم دل ہیں، (اے مخاطب!) تو ان کو رکوع کرتے ہوئے ،سجدہ کرتے ہوئے دیکھے گا، وہ اللہ کا فضل اور اس کی رضاچاہتے ہیں، ان کی نشانی  ان کے چہروں پرسجدوں کے نشان (انوار)ہیں، ان کی یہ صفت تورات میں ہے اور انجیل میں ان کی صفت یہ ہے:جیسے ایک کھیتی ہو، اس نے اپنی کونپل نکالی، پھر اس نے طاقت پکڑی، پھر وہ دبیز ہوئی ، پھر وہ اپنے تنے پر سیدھی کھڑی ہوگئی ،کاشت کاروں کو بھلی لگتی ہے تاکہ ان کی وجہ سے کافروں کے دل جلیں، ان میں سے جو لوگ ایمان لائے اور انہوں نے نیک عمل کیے ،اللہ نے ان سے بخشش اور اجرِ عظیم کا وعدہ فرمایا ہے، (الفتح:29)‘‘۔
	لیکن یہ ذکر عمومی اعتبار سے ہے ،ہر صحابی کا ذکر شخصی طورنہیں ہے،اس لیے ان میں سے ہر ایک کی صحابیت کاشخصی طور پر اعتقاد رکھنا ضروریاتِ دین میں سے نہیں ہے،لیکن جملہ انبیائے کرام علیہم السلام کی طرح اجمالی اعتقاد یقیناً ہے۔الغرض صحابہ کرام کے عمومی فضائل قرآنِ کریم میں مذکور ہیں،اُن پر سبّ وشتم اور تبرّا کرنے والا ضالّ ،مُضلّ اور مبتدع ہے ۔
[[heading: اسمِ جلالت کی ہیئت میں پنجتن پاک کے نام لکھنا]]
سوال:
	کیا فرماتے ہیں علمائے کرام اس مسئلہ کے بارے میں کہ ہماری مسجد کی تعمیر نو ہوئی ہے اور اس کے محراب میں شیشہ کا کام ہوا ہے ،محراب کی چھت میں کاریگر نے فن خطاطی سے اسمائے پنجتن پاک کو اس طرح ڈھالا ہے کہ بداھۃً اسم اللہ عزوجل معلوم ہوتا ہے اور غور وفکرکے بعداسمائے مبارکہ پنجتن پاک ۔ ایک مفتی صاحب  نے کہا کہ یہ ان غالی شیعوں سے تشابہ ہے جو حضرت علی ؄ یا پنج تن پاک کو ہی اللہ مانتے ہیں اوراس میں تَشَبـُہْ فیِ التَّوْحِیْد ہے، یہ صحیح نہیں ہے ۔دوسرے مفتی صاحب کا کہنا ہے کہ یہ اظہار محبت اہل بیت کا بہترین انداز ہے اور دیو بندیوں وھابیوں کو چڑانے کا خوبصورت مرقعہ ہے ،اب آپ حضرات کو اس تبحر علمی کا واسطہ جو اللہ نے آپ کو عطا فرمایا ہے ہما ری رہنمائی کریں اورمفصل اور مدلل فتوی عنایت کریں ،(سائل:حافظ محمد رمضان مصطفائی ،ٹنڈو محمد خان ، سندھ )۔`
  },
  {
    pageNumber: 26,
    text: `جواب:
	پنجتن پاک کے اسمائے مبارکہ کواس انداز میں لکھنا کہ اسمِ جلالت اللہ کی ہیئت نظر آئے، اگر اس بنا ء پر ہو کہ اَلْعِیَاذُ بِاللّٰہ !اللہ تبارک وتعالیٰ ان پانچ مقدس ہستیوں میں حلول کیے ہوئے ہے، جیسا کہ بعض غالی رافضیوں کا عقیدہ ہے کہ اللہ تعالیٰ حضرت علی میں حلول کیے ہوئے ہے ،تو یہ صریح کفر ہے ۔اللہ رب العزت،کسی مخلوق میں،خواہ اس کا مرتبہ کتنا ہی عظیم تر کیوں نہ ہو، حلول کرنے سے پاک اور منزہ ہے اوراللہ تعالیٰ جسم ،جسمانیات ، اُن کے متعلقات اور تقاضوں سے قطعی طور پرپاک اور مبرّا ہے۔
	قرآن پا ک میں اللہ تبارک و تعالیٰ نے عیسائیوں کے اسی عقیدے کو بیان کرتے ہوئے ارشاد فرمایا:
(۱)
[[arabic]] وَاِذْ قَالَ اللّٰہُ یٰعِیْسَی ابْنَ مَرْیَمَ ءَاَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُوْنِیْ وَاُمِّیَ اِلٰہَیْنِ مِنْ دُوْنِ اللّٰہِ ۭ قَالَ سُبْحٰنَکَ مَا یَکُوْنُ لِیْۤ اَنْ اَقُوْلَ مَا لَیْسَ لِیْ بِحَقٍّ ۭ اِنْ کُنْتُ قُلْتُہٗ فَقَدْ عَلِمْتَہٗ ۭ تَعْلَمُ مَا فِیْ نَفْسِیْ وَلَاۤ اَعْلَمُ مَا فِیْ نَفْسِکَ ۭ اِنَّکَ اَنْتَ عَلَّامُ الْغُیُوْبِ
ترجمہ:’’اور(یاد کرو)جب اللہ فرمائے گا: اے عیسیٰ بن مریم! کیا تو نے لوگوں سے کہا تھا: مجھے اور میری ماں کواللہ کے سوا دومعبود مان لو ،وہ  عرض کریں گے:تو(شریک سے)پاک ہے، میری یہ مجال نہیں تھی کہ میں وہ بات کہتا جس کا مجھے کوئی حق نہیں، اگر(بفرضِ محال)میں نے یہ بات کہی ہوتی تو ضرورتو اُسے جانتا،تو ہر وہ بات جانتا ہے جو میرے دل میں ہےاور میں ہر وہ بات نہیں جانتا جو تیرے علم میں ہے ،بے شک تو ہی سب غیبوں کا جاننے والاہے، (المائدہ: 116)‘‘۔
(2)
[[arabic]] لَقَدْ کَفَرَ الَّذِیْنَ قَالُوْۤا اِنَّ اللّٰہَ ثَالِثُ ثَلٰثَۃٍ
ترجمہ:’’بیشک وہ لوگ کافر ہوگئے جنہوں نے کہا: بلاشبہ اللہ تین میں سے تیسرا ہے ، (المائدہ: 73)‘‘۔
اس آیت کی تفسیر میںصدرالافاضل علامہ سید محمد نعیم الدین مراد آبادی فرماتے ہیں:`
  },
  {
    pageNumber: 27,
    text: `’’یہ قول نصارٰی کے فرقہ مرقوسیہ و نسطوریہ کا ہے ۔ اکثر مفسِّرین کا قول ہے کہ اس سے ان کی مراد یہ تھی کہ اللہ اور مریم اور عیسٰی تینوں اِلٰہ ہیں اوراِلٰہ ہونا ان سب میں مشترک ہے ۔ متکلِّمین فرماتے ہیں: نصارٰی کہتے ہیں کہ باپ ، بیٹا ، روح القدس یہ تینوں ایک اِلٰہ ہیں ‘‘۔
امام فخر الدین رازی تفسیر کبیر میں اس آیت کے تحت لکھتے ہیں:
[[arabic]] اِنَّ الْمُتَکَلِّمِیْنَ حَکَوْا عَنِ النَّصَارٰی اَنَّھُمْ یَقُوْلُوْنَ:جَوْھَرٌوَاحِدٌ ،ثَلَاثَۃُ اَقَانِیْم:اَبٌ ، وَاِبْنٌ،وَرُوْحُ الْقُدُسِ،وَھٰذِہِ الثَّلَاثَۃُ اِلٰہٌ وَاحِدٌ ، کَمَااَنَّ الشَّمْسَ اِسْمٌ یَتَنَاوَلُ الْقُرْصَ وَالشُّعَاعَ وَالْحَرَارَۃَ ،وَعَنَوْابِالْاَبِ الذَّاتَ، وَبِالْاِبْنِ الْکَلِمَۃَ ، وَبِا لرُّوْحِ  الْحَیَاۃَ ، وَاَثْبَتُوا الذَّاتَ وَالْکَلِمَۃَ وَالْحَیَاۃَ ، وَقَالُوْا::اِنَّ الْکَلِمَۃَ الَّتِیْ ھِیَ کَلَامُ اللّٰہِ اخْتَلَطَتْ بِجَسَدِعِیْسٰی اِخْتِلَاطَ الْمَاءِ بِا لْخَمْرِ ، وَاِخْتِلَا طَ الْمَاءِ بِا للَّبَنِ ، وَزَعَمُوْا اَنَّ الْاَبَ اِلٰہٌ وَالْاِبْنَ اِلٰہٌ وَالرُّوْحَ اِلٰہٌ وَالْکُلُّ اِلٰہٌ وَاحِدٌ ،وَاعْلَمْ اَنَّ ھٰذَا مَعْلُوْمُ الْبُطْلَانِ بِبَدِیْھَۃِ الْعَقْلِ، فَاِنَّ الثَّلَاثَۃَ لَا تَکُوْنُ وَاحِدًا، وَالْوَاحِدَ لَا یَکُوْنُ ثَلَاثَۃً ، وَلَا یُرٰی فِی الدُّنْیَامَقَالَۃٌ اَشَدُّ فَسَادًا وَاَظْہَرُ  بُطْلَانًا مِّنْ مَّقَالَۃِ النَّصَارٰی
ترجمہ:’’ متکلمین نے نصاری کے حوالے سے بیان کیاہے :(الوہیت )ایک جوہر ہے اور(اس کی) تین اقنوم (یعنی اصلیں)ہیں : باپ ، بیٹا ، اور روح القدس ، اور یہ تینوں (بحیثیت مجموعی )ایک خدا ہیں، جیسے سورج قُرص ، شعاع اور حرارت تینوں پرمشتمل ہے اور انہوں نے باپ سے ذات ،بیٹے سے کلمہ اور روح القدس سے حیات مراد لی ہے۔ انہوں نے ذات ، کلمہ اور حیات کو ثابت کیا اور کہا: کلمہ اللہ کا کلام ہے جو حضرت عیسیٰ کے جسم میں حلول کر گیا ، جیسے پانی شراب یا دودھ میںمل جاتا ہے اور انہوں نے گمان کیا: باپ(بھی) خدا ہے ، بیٹا (بھی)خداہے اور روح(بھی) خدا ہے اوراس کے باوجود سب ایک ہی خدا ہیں ۔اور جان لو کہ نصاریٰ کا یہ عقیدہ بداہۃًباطل ہے (یعنی اس کے بطلان کو سمجھنے کے لیے کسی غوروفکر کی ضرورت نہیں ہے) ، کیونکہ تین ایک نہیں ہوتا اور ایک تین نہیںہوتے اور نصاریٰ کے اس قول سے زیادہ فاسد اور واضح طور پرباطل بات دنیا میں اور کوئی نہیں ہے‘‘۔
محدث اعظم پاکستان علامہ غلام رسول سعیدی لکھتے ہیں:`
  },
  {
    pageNumber: 28,
    text: `’’نصاریٰ میں سے ایک فرقہ یعقوبیہ ہے ،جس کا عقیدہ ہے کہ مسیح ابن مریم ہی اللہ ہے ، وہ کہتے ہیں : اللہ تین اقانیم (اصلوں )سے مرکب ہے : باپ ، بیٹا اور روح القدس۔ باپ اللہ ہے، بیٹا مسیح ہے اور باپ (اللہ)بیٹے ( مسیح)میں حلول کر کے اسکے ساتھ متحدہوگیا اور روح القدس بن گیا اور ان میں سے ہر ایک دوسرے کا عین ہے۔ ان کے اس قول کا خلاصہ یہ ہے کہ مسیح ہی اللہ ہے ، حالانکہ حضرت عیسی علیہ السلام نے پیدا ہوتے ہی جو کلمہ سب سے پہلے کہا ، وہ یہ تھا:’’میں اللہ کا بندہ ہوں‘‘۔
( تبیان القرآن،ج:3،ص:260،فرید بک اسٹال ،لاہور)
	الغرض عیسائیوں کے مذکورہ باطل عقیدے کی طرح بعض غالی روافض بھی پنجتن پاک بالخصوص حضرت علی ؄ میں اللہ تعالی ٰ کا حلول مانتے ہیں جو کہ صریح کفر ہے ، پس اسمائے پنجتن پاک کو اس طرح لکھنے میں اس کفریہ عقیدے کا ایہام پایا جا رہا ہے اور کسی کفریہ معنی کا ایہام ہی اس بات کے ممنوع ہونے کے لیے کافی ہے ،اگرچہ اس کی کوئی صحیح تاویل بھی موجود ہو ۔رہی یہ توجیہ کہ پنجتن پاک کا نام عقیدت ومحبت کے اظہار کے لیے لکھا جاتا ہے، تو اُس کے لیے ایسا پیرایہ اختیار کرنا چاہیے کہ جس میں اس طرح کا نہ کوئی ایہام اور اشتباہ پیدا ہواور نہ ہی لوگوں کو انگشت نمائی کا موقع ملے۔
علامہ ابن عابدین شامی لکھتے ہیں:
[[arabic]] اَنَّ مُجَرَّدَ اِیْھَامِ الْمَعْنَی الْمُحَالِ کَافٍ فِی الْمَنْعِ عَنِ التَّلَفُّظِ بِھٰذَا الْکَلَامِ وَاِنِ احْتَمَلَ مَعْنًی صَحِیْحاً
ترجمہ:’’عبارت سے محض محال معنی کا وہم پیدا ہونا ہی ایسے کلام کو منع کرنے کے لیے کافی ہے ،خواہ (کسی کے نزدیک)وہ صحیح معنی کا احتمال بھی رکھتاہو‘‘۔
(رد المحتار: ج: 9، ص:625)
	الغرض پنجتن پاک کا نام اسمِ جلالت کی ہیئت میں لکھنا کبھی بھی مسلمانوں کا شِعار نہیں رہا اور ہمیں کوئی ایسا انداز اختیار کرنے سے احتراز کرنا چاہیے جو مسلمانوں میں کسی بھی درجے میں افتراق وانتشار کا باعث بنے اور اس سے دینِ حق اسلام اور مسلکِ حق اہلسنت وجماعت کو کوئی فائدہ بھی حاصل نہ ہو۔خصوصاً اس پر فتن دور میں دینی مصلحت وحکمت کے تحت اس طرح کے اندازِ تحریر سے اجتناب لازم ہے ،حدیث پا ک میں ہے:`
  },
  {
    pageNumber: 29,
    text: `(1)
[[arabic]] عَنْ أَبِی أَیُّوبِ الْأَنْصَارِیِّ رَضِیَ اللّٰہُ عَنْہُ ،قَالَ::قَالَ رَسُوْلُ اللّٰہِ ﷺ:إِذَا صَلَّیْتَ فَصَلِّ صَلَاۃَ مُوَدِّعٍ وَلَا تَتَحَدَّثَنَّ بِکَلَامٍ تَعْتَذِرُ مِنْہُ غَدًا، قَالَ أَبُو بَکْرٍ: وَقَالَ بَعْضُ الْحُکَمَاءِ::إِیَّاکَ وَمَا یُعْتَذَرُ مِنْہُ، وَمَا یُسْتَحْیَا مِنْ ذِکْرِہٖ، فَإِنَّمَا یُعْتَذَرُ مِنَ الذَّنْبِ، وَیُسْتَحْیَا مِنَ الْقَبِیحِ
ترجمہ:’’حضرت ابوایوب انصاری ؄ بیان کرتے ہیں :رسول اللہ ﷺ نے فرمایا: ’’جب تم نماز پڑھو (تو اس انہماک سے پڑھو کہ گویا یہ تمہاری زندگی کی )آخری نماز ہے اور ہر ایسی بات سے بچو جس پر بعد میں تمہیںعذر خواہی کرنی پڑے، ابوبکر نے کہا: کسی دانا کا قول ہے :ہر اُس چیز سے بچو ،جس سے عذر خواہی کرنی پڑے اور اس کے ذکر سے حیا آئے، کیونکہ گناہ پر عذر خواہی کرنی پڑتی ہے اور قبیح بات (بیان کرنے )سے حیاآتی ہے،(مکارم الاخلاق للخرائطی:484)‘‘۔
(2):
[[arabic]] عَنْ أَبِی الْحَوْرَاءِ السَّعْدِیِّ قَالَ::قُلْتُ:لِلْحَسَنِ بْنِ عَلِیٍّ رَضِیَ اللّٰہُ عَنْہُمَا :مَاحَفِظْتَ مِنْ رَسُوْلِ اللّٰہِ ﷺ،قَالَ::حَفِظْتُ مِنْ رَّسُوْلِ اللّٰہِ ﷺ:دَعْ مَا یَرِیْبُکَ إِلٰی مَالاَ یَرِیْبُکَ، فَإِنَّ الصِّدْقَ طُمَأْنِیْنَۃٌ وَإِنَّ الْکَذِبَ رِیْبَۃٌ
ترجمہ:’’ابوحوراء بیان کرتے ہیں: میں نے حسن بن علی سے کہا: آپ نے رسول اللہ ﷺ سے (سب سے مفید بات )کون سی یاد رکھی ہے ؟، انہوں نے کہا: میں نے رسول اللہ ﷺ سے (اہم بات یہ )یاد کر رکھی ہے :’’جو چیز تمہیں شک میں ڈالے،اسے چھوڑ دواوراس کے بجائے اس بات کو اختیارکرو جو تمہیں شک میں نہ ڈالے (یعنی اس کی صحت واضح ہو)،کیونکہ سچائی میں طمانیتِ قلب ہے اور جھوٹ میں بے اطمینانی ہے،(سنن ترمذی:2518)‘‘۔
	البتہ ہمارے لیے حکم یہ ہے کہ ہم مسلمانوں کے بارے میں حسن ظن سے کام لیںاور جب تک`
  },
  {
    pageNumber: 30,
    text: `کسی کے کفریہ عقیدے کا قطعی اور صریح ثبوت ہمارے علم میں نہ ہو، ہم ان پر کفرکا حکم لگانے سے اجتناب کریں،اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] یٰۤاَیُّہَا الَّذِیْنَ اٰمَنُوا اجْتَنِبُوْا کَثِیْرًا مِّنَ الظَّنِّ ۣ اِنَّ بَعْضَ الظَّنِّ اِثْمٌ
ترجمہ:اے ایمان والو! بہت گمانوں سے بچو، بے شک بعض گمان گناہ ہوتے ہیں، (الحجرات: 12)‘‘۔حدیث پاک میں ہے :
[[arabic]] إِیَّاکُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَکْذَبُ الحَدِیْثِ
ترجمہ:’’بدگمانی سے بچو ، پس بے شک بدگمانی سب سے جھوٹی بات ہے،(صحیح البخاری: 5143)‘‘۔
	اگر کوئی یہ فاسد استدلال کرے کہ مخلوق میں اللہ کے حلول کا تصورقرآنِ کریم میں موجود ہے ،چنانچہ  فرمایا:
[[arabic]] فَلَمَّا قَضٰی مُوْسَی الْاَجَلَ وَسَارَ بِاَہْلِہٖۤ اٰنَسَ مِنْ جَانِبِ الطُّوْرِ نَارًا ۫ قَالَ لِاَہْلِہِ امْکُثُوْۤا اِنِّیْۤ اٰنَسْتُ نَارًا لَّعَلِّیْۤ اٰتِیْکُمْ مِّنْہَا بِخَبَرٍ اَوْ جَذْوَۃٍ مِّنَ النَّارِ لَعَلَّکُمْ تَصْطَلُوْنَ۔ فَلَمَّاۤ اَتٰىہَا نُوْدِیَ مِنْ شَاطِیِٔ الْوَادِ الْاَیْمَنِ فِی الْبُقْعَۃِ الْمُبٰرَکَۃِ مِنَ الشَّجَرَۃِ اَنْ یّٰمُوْسٰۤی اِنِّیْۤ اَنَا اللّٰہُ رَبُّ الْعٰلَمِیْنَ
ترجمہ: پس جب موسیٰ نے اپنی مدت پوری کرلی اور اپنی اہلیہ کو لے کر (مصرکی جانب )چلے تو انہوں نے طور کی طرف سے ایک آگ دیکھی ،اپنی اہلیہ کو فرمایا: تم یہیں ٹھہرو، میں نے آگ دیکھی ہے ،شاید میں وہاں سے کوئی خبر لائوں یا آگ کا کوئی شعلہ لائوں تاکہ تم تپش حاصل کرو، پھر جب موسیٰ آگ کے پاس حاضر ہوئے تومیدان کے دائیں کنارے سے برکت والے مقام میں ایک درخت سے پکارا گیا :اے موسیٰ!بے شک میں ہی اللہ رب العالمین ہوں، (القصص:29-30)‘‘۔
	اس سے یہ کہیں ثابت نہیں ہوتا کہ العیاذ باللہ تعالیٰ!اللہ تعالیٰ نے درخت میں حلول کرلیا تھا،اللہ تعالیٰ کی ذات اس سے برتر اور پاک ہے ،ہاں !وہ اس بات پر قادر ہے کہ کہیں سے بھی اُس کی جانب سے ندا آئے،اُس کی ذات کی طرح اس کی صوت (آواز)`
  },
  {
pageNumber: 31,
text:` بھی جسم اور جسمانی تقاضوں اور مادی عوارض سے پاک ہے۔ ہو سکتا ہے کوئی اس حدیث مبارک کا بھی حوالہ دے: [[arabic: عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ : إِنَّ اللَّهَ قَالَ : مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَى عَبْدِى بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَى بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَبْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لأُعْطِيَنَّهُ ، وَلَبِنِ اسْتَعَاذَنَ لَاعِيُنَنَّهُ، وَمَا تَرَدَّدْتُ عَنْ شَيْءٍ أَنَا فَاعِلُهُ تَرَدُّدِى عَنْ نَفْسِ الْمُؤْمِنِ ، يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ]] ترجمہ: حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ نے فرمایا: جس شخص نے میرے کسی ولی سے عداوت رکھی تو میں اس سے اعلانِ جنگ کرتا ہوں اور میری محبوب ترین چیز جس سے میرا بندہ میرا تقرب حاصل کرتا ہے، وہ عبادات ہیں جو میں نے اس پر فرض کی ہیں اور میرا بندہ نوافل کے ذریعے مسلسل میرا قرب حاصل کرتا رہتا ہے حتی کہ میں اس سے محبت کرتا ہوں، پس جب میں اس سے محبت کرتا ہوں تو میں اس کے کان ہو جاتا ہوں جن سے وہ سنتا ہے اور میں اس کی وہ آنکھ ہو جاتا ہوں جس سے وہ دیکھتا ہے اور میں اس کے وہ ہاتھ ہو جاتا ہوں جن سے وہ پکڑتا ہے اور اس کے وہ پیر ہو جاتا ہوں جن سے وہ چلتا ہے اور اگر وہ مجھ سے سوال کرے تو میں ضرور اس کو عطا کرتا ہوں اور اگر وہ میری پناہ میں آنا چاہے تو میں ضرور اُسے پناہ دیتا ہوں اور میں کسی کام میں جس کو میں کرنے والا ہوں ، ایسا تردد نہیں کرتا جیسا تردد میں مومن کی روح کو قبض کرنے میں کرتا ہوں کہ وہ موت کو نا پسند کرتا ہے اور میں اُسے رنجیدہ کرنے کو نا پسند کرتا ہوں۔ (صحیح البخاری : 6502) حاشا وکلا ! یہاں تردد سے یہ مراد نہیں ہے کہ اللہ فیصلہ نہیں کر پاتا، جیسا کہ بعض اوقات بندے کو تردد لاحق ہوتا ہے، بلکہ یہاں مراد یہ ہے کہ اللہ اُس کی اجل میں تاخیر فرما دیتا ہے اور
`},
{
pageNumber: 32,
text:` مہلت دیتا ہے، اس کو تقدیر معلق کہتے ہیں ، قرآن کریم کی یہ آیت مبارکہ : ”[[arabic: وَلَنْ يُؤَخِّرَ اللهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا]]“، ترجمہ: اور جب کسی شخص کی اجل (موت کا مقررہ وقت ) آجائے تو اللہ اسے ہرگز مہلت نہیں دے گا، (المنافقون: 11) ۔ یہ آیت تقدیر مبرم کے بارے میں ہے اور تقدیر مبرم یقینا نہیں ٹلتی ، بلکہ نافذ ہو کر رہتی ہے۔ اس حدیث کے تحت کسی نے بھی یہ قول نہیں کیا کہ معاذ اللہ ! اللہ تعالیٰ بندے میں حلول فرمالیتا ہے، بلکہ محدثین کرام نے اس کی توجیہات کی ہیں، علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں : اللہ تعالیٰ بندے کے کان اور آنکھیں ہو جاتا ہے، اس کی کیا توجیہ ہے، عام طور پر شارحین اور علماء نے یہ کہا ہے کہ بندہ اپنے کانوں سے وہی سنتا ہے جس کے سننے کا اللہ تعالیٰ نے حکم دیا ہے اور اپنی آنکھوں سے وہی دیکھتا ہے جس کے دیکھنے کا اللہ تعالیٰ نے حکم دیا ہے تو بندے کا سننا ، اللہ کا سننا اور بندے کا دیکھنا اللہ کا دیکھنا ہوتا ہے، اس لیے فرمایا: میں اس کے کان ہو جاتا ہوں اور اس کی آنکھیں ہو جاتا ہوں لیکن اس پر یہ اعتراض ہے کہ کوئی بندہ اس وقت تک اللہ تعالیٰ کا محبوب نہیں بنے گا جب تک کہ اس کا سننا، اس کا دیکھنا، اس کا تصرف کرنا اور اس کا چلنا اللہ تعالیٰ کے احکام کے مطابق نہ ہو اور جب اللہ تعالیٰ اس کو اپنا محبوب بنالے گا تو پھر اللہ اس کے کان ہو جاتا ہے اور اس کی آنکھیں ہو جاتا ہے کا معنی یہ نہیں ہو سکتا، اس حدیث کی بہترین توجیہ امام رازی رحمۃ اللہ علیہ نے کی ہے، وہ فرماتے ہیں: بندہ جب عبادات پر دوام کرتا ہے تو وہ اس مقام پر پہنچ جاتا ہے جس کے متعلق اللہ تعالیٰ نے فرمایا: میں اس کی آنکھ ہو جاتا ہوں اور اس کے کان ہو جاتا ہوں، پس جب اللہ کا نور جلال اس کے کان ہو جاتا ہے تو وہ قریب اور دور سے سن لیتا ہے اور جب اس کا نور جلال اس کی آنکھ ہو جاتا ہے تو وہ قریب اور بعید کو دیکھ لیتا ہے اور جب اس کا نور اس کے ہاتھ ہو جاتا ہے تو وہ مشکل اور آسان چیزوں پر اور قریب اور بعید کی چیزوں کے تصرف پر قادر ہو جاتا ہے۔
`},
{
pageNumber: 33,
text: `خلاصہ یہ ہےکہ اللہ کا ولی فرائض پر دوام اور نوافل پر پابندی کرنے سے اس مقام پر پہنچ جاتا ہے کہ وہ اللہ تعالیٰ کی صفات کا مظہر ہو جاتا ہے، لیکن بندہ، بندہ ہی رہتا ہے خدا نہیں ہو جاتا ، جیسے آئینے میں کسی چیز کا عکس ہوتو آئینہ وہ چیز نہیں بن جاتا، اس کی صورت کا مظہر ہو جاتا ہے، بلاتشبیہ تمثیل جب بندہ کامل کی اپنی صفات فنا ہو جاتی ہیں تو وہ اللہ تعالی کی صفات کا مظہر ہو جاتا ہے، ( تبیان القرآن، ج: 5، ص: 418)۔

[[heading: اللہ تعالیٰ کو حاضر و ناظر کہنا]]

سوال:
اللہ تعالیٰ کو حاضر ناظر کہنا درست ہے؟ ، ( حافظ محمد جمشید ہاشمی، کوٹ ادو)۔

جواب:
اللہ تعالیٰ کے اسمائے صفات توقیفی ہیں، تو قیفی سے مراد یہ ہے کہ یہ نقل و سماع پر موقوف ہیں، یعنی جو قرآن وحدیث میں آئے ہیں کسی نے اپنی عقل سے مقرر نہیں کیے۔ پس حاضر و ناظر اللہ تعالیٰ کے اسمائے تو قیفیہ میں سے نہیں ہے، ان کے بعض معانی شان الوہیت کے منافی ہیں ، اس لیے اللہ تعالیٰ کو حاضر و ناظر نہیں کہنا چاہیے لیکن اگر کسی نے تاویل کر کے حاضر کو جاننے والے اور ناظر کو دیکھنے والے کے معنی میں کہا تو اس کی تکفیر نہیں کی جائے گی۔
تنویر الابصار مع الدر المختار میں ہے : ”[[arabic: وَيَا حَاضِرُ يَا نَاظِرُ لَيْسَ بِكُفْرٍ]]“۔
ترجمہ : اور یا حاضر یا ناظر کہنا کفر نہیں ہے۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: فَإِنَّ الْحُضُورَ بِمَعْنَى الْعِلْمِ شَائِعٌ : مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَالنَّظَرُ بِمَعْنَى الرُّؤْيَةِ : أَلَمْ يَعْلَمُ بِأَنَّ اللهَ يَرَى ، فَالْمَعْنَى : يَا عَالِمُ مَنْ يَرَى ، بَرَانِيَّةٌ]]
ترجمہ : ” کیونکہ حضور علم کے معنی میں اور نظر رویت کے معنی میں شائع اور معروف ہے اور یہ قرآن کریم کی ان آیات سے مستفاد ہیں : [[arabic: مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ]]
`}, 
{ pageNumber: 34,
   text:`ترجمہ: ” جہاں تین آدمی سرگوشی کریں ، (وہاں) چوتھا اللہ اُن کے ساتھ ہے، (المجادلہ:7)
[[arabic: أَلَمْ يَعْلَمُ بِأَنَّ الله يرى]] ، ترجمہ:” کیا اس نے یہ نہ جانا کہ بے شک اللہ (سب کچھ) دیکھ رہا ہے، (العلق : 14) ، پس [[arabic: يَا حَاضِرُ يَا نَاظِرُ]] کا معنیٰ ہوا : اے جاننے والے ، اے دیکھنے والے!، بحوالہ بزازیة، ( رد المحتار على الدر المختار ، جلد 13 ص: 126، دمشق)۔
قرآن کریم میں اللہ تعالیٰ کے لیے شہید و بصیر کے کلمات آئے ہیں :
(1) [[arabic: وَاللَّهُ عَلَى كُلِّ شَيْ شَهِيدٌ]]۔
ترجمہ: اور اللہ ہر چیز پر نگہبان ہے، (البروج:9)۔
(۲) [[arabic: إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ]]
ترجمہ: بے شک وہی بہت سننے والا، بہت دیکھنے والا ہے، (الاسراء:1)۔
(۳) [[arabic: وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ]]
ترجمہ : ” اور جو کچھ یہ کر رہے ہیں، اس کو اللہ خوب دیکھنے والا ہے، (البقرہ:96)۔
الغرض اللہ کے لیے رویت کے معنی میں ناظر اور بصیر کے کلمات استعمال کرنا قرآن کریم سے ثابت ہیں لیکن ہم کہیں گے: ہمارا ان کے حق ہونے پر ایمان ہے، اللہ تعالیٰ جسم اور جسمانی اعضا سے پاک ہے ، ان کلمات کے معنی اور مراد ہم اللہ تعالیٰ کے علم پر تفویض کرتے ہیں اور اس کے مصداق کے تعین کے ہم مکلف نہیں ہیں۔
حاضرکا معنی عربی کی مشہور لغت المنجد اور مختار الصحاح میں یہ ہیں : نزدیکی، صحن، حاضر ہونے کی جگہ، جو چیز کھلم کھلا بے حجاب آنکھوں کے سامنے ہو اور ناظر کے معنی مختار الصحاح میں آنکھ کے ڈھیلے کی سیاہی“ کے ہیں، جبکہ نظر کے معنی ہیں : ” کسی امر میں تفکر و تدبر کرنا اور آنکھ سے کسی چیز میں تامل کرنا ہیں ۔ لغوی معنی کے اعتبار سے ان دونوں لفظوں کے معانی سے اللہ تعالیٰ کی ذات پاک ہے، بغیر تاویل کے اللہ تعالیٰ کے لیے ان الفاظ کو نہیں بولا جا سکتا ، کیونکہ اللہ تعالیٰ کے اسماء مبارکہ توقیفی، یعنی نقل و 
سماع پر موقوف
`}, 

{ pageNumber: 35,
   text:`ہیں اور اسماء حسنی میں یہ دونوں کلمات (حاضر و ناظر ) بطور اسم یا صفت شامل نہیں ہیں ، قرآن وحدیث میں اللہ تعالیٰ کے لیے نہ یہ الفاظ آئے ہیں اور نہ صحابہ کرام، تابعین وائمہ مجتہدین نے استعمال کیے ہیں ۔ اسی طرح اللہ تعالیٰ کے اسمائے صفات میں مُعلِّم ، تونہیں آیا لیکن اللہ تعالیٰ کے تعلیم فرمانے کے بارے میں آیات آئی ہیں :
(1) [[arabic: الرَّحْمَنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنْسَانَ عَلَّمَهُ الْبَيَانَ]]
ترجمہ : ” رحمن نے قرآن سکھایا ، انسان کو پیدا کیا (اور) اسے اظہار کی صلاحیت سکھائی ، (الرحمن : 4-1) میں اللہ تعالیٰ کے لیے تعلیم دینے کا کلمہ آیا ہے۔
(۲) [[arabic: وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا]]
ترجمہ: اور اس نے آدم کو سب مسمیات (چیزوں) کے نام سکھائے، (البقرہ:31)۔
(۳) [[arabic: وَ عَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا]]۔
ترجمہ: اور جو کچھ آپ نہیں جانتے تھے، وہ آپ کو سکھایا اور آپ پر اللہ کا بڑا فضل ہے، (النساء : 113)۔
اسی طرح قرآن کریم میں بعض طبقات کے لیے اللہ تعالیٰ کی نظرِ رحمت سے محرومی کا ذکر ہے:
(1) [[arabic: إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا أُولَئِكَ لَا خَلَاقَ لَهُمْ فِي الْآخِرَةِ وَلَا يُكَلِّمُهُمُ اللهُ وَلَا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيِّمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ اليم]] ۔ (آل عمران : 77)
ترجمہ: بے شک جو لوگ اللہ کے عہد اور اپنی قسموں کے عوض تھوڑی سی قیمت لے لیتے ہیں ، ان لوگوں کے لیے آخرت میں کوئی حصہ نہیں ہے اور نہ آخرت میں اللہ تعالیٰ ان سے کوئی کلام کرے گا اور نہ قیامت کے دن ان کی طرف نظر (رحمت) فرمائے گا اور نہ ان کو پاکیزہ کرے گا اور ان کے لیے درد ناک عذاب ہے۔
حدیث پاک میں ہے:
[[arabic: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ عَنِ النَّبِيِّ قَالَ : ثَلَاثَةٌ لا يُكَلِّمُهُمُ اللَّهُ يَوْمَ القِيَامَةِ]]
`}, { pageNumber: 36,
   text:`[[arabic: وَلَا يَنْظُرُ إِلَيْهِمْ : رَجُلٌ حَلَفَ عَلَى سِلْعَةٍ لَقَدْ أُعْطَى بِهَا أَكْثَرَ مِمَّا أُعْطَى وَهُوَ كَاذِبٌ ، وَرَجُلٌ حَلَفَ عَلَى يَمِينِ كَاذِبَةٍ بَعْدَ العَصْرِ ، لِيَقْتَطِعَ بِهَا مَالَ رَجُلٍ مُسْلِمٍ، وَرَجُلٌ مَنَعَ فَضْلَ مَاءٍ فَيَقُولُ اللهُ الْيَوْمَ أَمْنَعُكَ فَضْلِي كَمَا مَنَعْتَ فَضْلَ مَا لَمْ تَعْمَلُ يَدَاكَ]]
ترجمہ : حضرت ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی ﷺ نے فرمایا: اللہ تعالیٰ تین آدمیوں سے قیامت کے دن کلام نہیں فرمائے گا اور نہ اُن کی طرف نظر (رحمت) فرمائے گا: ایک وہ شخص جس نے قسم کھائی کہ اسے اس سودے کی قیمت اس سے زیادہ دی جا رہی تھی جتنی اب دی جارہی ہے اور وہ اس قسم میں جھوٹا تھا، دوسرا وہ شخص جس نے عصر کے بعد جھوٹی قسم پر حلف اٹھایا تا کہ اس قسم کے ذریعہ کسی مسلمان شخص کا مال لے لے، تیسرا وہ شخص جس نے اپنی ضرورت سے زائد پانی سے کسی کو منع کیا، اللہ تعالیٰ اس سے فرمائے گا : آج میں تجھے اپنے فضل سے اسی طرح محروم کر دوں گا ، جس طرح تو نے اپنی ضرورت سے زائد ( پانی دوسرے ضرورت مند کو دینے ) سے منع کیا تھا ، حالانکہ اس چیز کو تو نے پیدا نہیں کیا تھا ۔ ( صحیح بخاری:2369)
(۲) [[arabic: عَنِ ابْنِ عُمَرَأَنَّ رَسُولَ اللهِ قَالَ : لَا يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّثَوْبَهُ خُيَلَاءَ]]
ترجمہ : حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ ﷺ نے فرمایا: جو شخص تکبر سے کپڑا گھسیٹ کر چلے ،اللہ تعالیٰ اس کی طرف نظر ( رحمت ) نہیں فرمائے گا ، ( صحیح مسلم: 2085) نظر رحمت کی بابت اور بھی احادیث ہیں۔ اس سے معلوم ہوتا ہے کہ اللہ تعالیٰ اپنے بعض محبوب بندوں پر نظر رحمت فرماتا ہے لیکن اسے ناظر کہنا درست نہیں ہے۔
امام اعظم ابوحنیفہ رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: لَمْ يَزَلْ وَلَا يَزَالُ بِأَسْمَائِهِ وَصِفَاتِهِ النَّاتِيَةِ وَالْفِعْلِيةِ، أَمَّا الذَّاتِيَةُ فَالْحَيَاةُ وَالْقُدْرَةُ وَالْعِلْمُ وَالْكَلَامُ وَالسَّبْعُ وَالْبَصَرُ وَالْإِرَادَةُ]]
ترجمہ : ” وہ اپنے اسماء اور اپنی صفات ذاتیہ اور صفات فعلیہ کے ساتھ ہمیشہ موصوف رہا ہے اور ہمیشہ منتصف رہے گا اور صفات ذاتیہ یہ ہیں : حیات ، قدرت علم کلام ، سننا ، دیکھنا اور`
}, 
{ pageNumber: 37, 
  text:`اراده، (الفقہ الاکبر ص : 25-24)
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں :
ائمہ اربعہ اور دیگر متقدمین کے نزدیک اللہ تعالیٰ کی آنکھیں بھی ہیں اور اس کے ہاتھ بھی ہیں لیکن وہ ہماری طرح جسمانی اعضا نہیں ہیں، بلکہ مخلوقات اور ممکنات میں اس کی کوئی مثال نہیں ہے، قرآن مجید میں ہے: [[arabic: لَيْسَ كَمِثْلِهِ]] ترجمہ: اس کی مثل کوئی چیز نہیں ہے ، (الشوری: 11 ) ۔ قرآن مجید میں اللہ تعالی کے لیے جو ید ،عین اور ساق وغیرہ کے کلمات آئے ہیں ، ہم اُن پر ایمان لاتے ہیں ، اُن کی نفی نہیں کرتے اور نہ ان میں کوئی تاویل کرتے ہیں ، اس کے ہاتھ ، آنکھیں اور پنڈلی ہیں جیسے اس کی شان کے لائق ہیں لیکن ممکنات اور مخلوقات میں ان کی کوئی مثال نہیں ہے، وہ جسم اور جسمانی اعضاء سے مبر ا اور منز ہ اور پاک ہے، یہ ہمارے لیے متشابہات میں سے ہیں ، ( تبیان القرآن، جلد 11 ص: 584)
صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں :
حیات ، قدرت سننا ، دیکھنا ، کلام، علم اور ارادہ اُس کی صفات ذاتیہ ہیں ، مگر کان، آنکھ، زبان سے اُس کا کا سننا ، دیکھنا ، کلام کرنا نہیں کہ یہ سب اجسام ہیں اور اجسام سے وہ پاک ہے۔ ہر پست سے پست آواز کو سنتا ہے، ہر باریک سے باریک کو کہ خورد بین سے محسوس نہ ہو، وہ دیکھتا ہے ، بلکہ اُس کا دیکھنا اور سننا انہیں چیزوں پر منحصر نہیں ، ہر موجود کو دیکھتا ہے اور ہر موجود کو سنتا ہے ، (بہار شریعت ، جلد اول ص : 7 ) ۔
فتاوی فیض الرسول میں ہے:
اگر حاضر و ناظر به معنی شہید و بصیر اعتقاد رکھتے ہیں یعنی ہر موجود اللہ تعالیٰ کے سامنے ہے اور وہ ہر موجود کو دیکھتا ہے، تو یہ عقیدہ حق ہے ، مگر اس کی تعبیر حاضر و ناظر سے کرنا یعنی اللہ تعالی کے بارے میں حاضر و ناظر کا لفظ استعمال نہیں کرنا چاہیے لیکن اگر پھر بھی کوئی شخص اس لفظ کو اللہ تعالیٰ کے بارے میں بولے تو وہ کفر نہ ہوگا ، جیسا کہ درمختار مع شامی جلد سوم، ص : 307 میں ہے : [[arabic: يَا حَاضِرَ يَا نَاظِر لَيْسَ بِكُفْرٍ وَهُوَ أَعْلَمُ]] ، ( جلد اول ص : 3 ) ۔
`}, 
{ pageNumber: 38, 
  text:`[[heading: نماز کی تو ہین کفر ہے]]  

سوال:
میرے شوہر کی طبیعت ٹھیک نہیں رہتی ، اُن کے پیٹ کا نظام اکثر خراب رہتا ہے، جس کی وجہ سے اُنہیں ٹھیک طریقے سے نیند نہیں آتی اور چڑچڑاہٹ کا شکار ہو جاتے ہیں، اسی دوران اُن کے منہ سے عید الاضحیٰ سے دو یا تین دن پہلے یہ الفاظ نکل گئے : ”بھاڑ میں جائے عید کی نماز ، اگر میں سو جاؤں تو نہ اُٹھانا" لیکن پھر اُنہوں نے نماز بھی پڑھی اور اللہ تعالیٰ سے معافی بھی بہت مانگی ، اس بارے میں اُن کے لیے کیا حکم ہے وہ شادی شدہ اور بچوں والے ہیں، (ایک دینی بہن، کراچی)

جواب:
آپ کے شوہر نے نماز کے متعلق جو نازیبا کلمات کہے ہیں ، وہ کفریہ کلمات ہیں، کیونکہ نماز شعائر اسلام میں سے ہے اور شعائر اسلام کی توہین کفر ہے، سو ان پر واجب ہے کہ اُس سے توبہ کریں اور تجدید ایمان و تجدید نکاح بھی کریں ۔ تجدید ایمان یہ ہے کہ صدقِ دل کے ساتھ کلمہ طیبہ پڑھیں اور تجدید نکاح یہ ہے کہ دو گواہوں کی موجودگی میں نئے مہر کے ساتھ نیا نکاح کریں۔ نکاح ایجاب و قبول کا نام ہے اور اس کے لیے صرف دو گواہ کافی ہیں جو دونوں مرد ہوں یا ایک مرد اور دو عورتیں ہوں ، لوگوں کو اکٹھا کرنا ضروری نہیں ہے اور گھر کے افراد مثلاً : بالغ بیٹے اور بیٹیاں یا بھائی بہن بھی گواہ بن سکتے ہیں۔

[[heading: نبی کریم ﷺ کے راستے میں کوڑا پھینکنے والی عورت کا واقعہ]]

سوال:
واعظین و خطباء اپنے بیانات میں اکثر یہ بتاتے ہیں کہ رسول اللہ ﷺ کے راستے میں ایک عورت کوڑا پھینکتی تھی ، ایک دن اس نے کوڑا نہ پھینکا تو رسول اللہ ﷺ اس کے گھر تشریف لے گئے اور اس کے گھر کو صاف کیا ، پانی وغیرہ بھرا ، وہ عورت آپ ﷺ کے حسن اخلاق کو دیکھ کر مسلمان ہوگئی۔ اس واقعہ کی تحقیق مطلوب ہے، کسی کتاب میں ہے`
},

{ pageNumber: 39,
   text:`یا سنی سنائی بات ہے؟ ، (ضیاء احمد، ملتان روڈ ، لاہور ) ۔

جواب:
ہماری معلومات کے مطابق حدیث وسیرت کی مستند اور معتبر کتابوں میں ایسی کوئی روایت موجود نہیں ہے، یہ واقعہ ویسے ہی مشہور ہو گیا ہے، کسی بھی کتاب میں اس کی کوئی سند نہیں ملتی حتی کہ معروف مراجع و مصادر میں اس کا ذکر تک نہیں ملتا۔ بعض لوگ ایسی روایت امام اعظم ابو حنیفہ رحمۃ اللہ علیہ کے حوالے سے بھی بیان کرتے ہیں لیکن ہمیں اس کا بھی کوئی حوالہ نہیں ملا۔
ایک وسیع المطالعہ بزرگ، خلیفہ حضور مفتی اعظم ہند، شارح بخاری علامہ مفتی شریف الحق امجدی رحمۃ اللہ علیہ سے اس روایت کے بارے میں سوال ہوا ، اس کے جواب میں آپ نے لکھا: ” کوڑا کرکٹ ڈالنے کی روایت اس وقت یاد نہیں ہے (لہذا) اس کے بارے میں کچھ نہیں کہہ سکتا ، ( فتاوی شارح بخاری ، جلد 1 ، ص : 415)۔ ہر دور میں واعظین لوگوں کو ترغیب دینے کے لیے اس طرح کے واقعات وضع کرتے رہے ہیں ، اسی لیے محدثین کرام نے موضوعات پر کتابیں لکھی ہیں ۔ الحمد لله علی احسانہ رسول اللہ ﷺ کی سیرت طیبہ کے سچے اور مستند واقعات بہت ہیں، ہمیں انہی واقعات پر اکتفا کرنا چاہیے، جھوٹ یا خلاف واقعہ بات نیک نیتی سے بیان کی جائے یا بد نیتی سے دونوں صورتوں میں اس کا جواز نہیں بنتا۔
رسول اللہ ﷺ کا ارشاد ہے : ”[[arabic: مَنْ كَذَبَ عَلَى مُتَعَمِّد أَفَلِيَتَبَوَّا مَقْعَدَهُ مِنَ النَّارِ]]“
ترجمہ: جس شخص نے جان بوجھ کر میری طرف جھوٹی بات منسوب کی ، اُسے چاہیے کہ اپنا ٹھکانہ جہنم میں بنالے ، ( صحیح بخاری: 110 ، 6197، صحیح مسلم :4)۔ ایک اور حدیث پاک میں ہے: [[arabic: كَفَی بِالْمَرْءِ كَذِبَا أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ]]
ترجمہ: ” کسی آدمی کے جھوٹا ہونے کے لیے اتنی ہی بات کافی ہے کہ وہ ( تحقیق کیے بغیر ) ہر سنی سنائی بات لوگوں کے سامنے بیان کرتا پھرے، (صحیح مسلم :7)، یعنی محض سنی سنائی`
},
 { pageNumber: 40, 
  text:`بات کو تیقن کے ساتھ حق اور حقیقت کے طور پر بیان کرنا درست نہیں ہے، البتہ جس سے سنا ہے، اس کے حوالے سے بیان کرے تو اس پر جھوٹ کا اطلاق نہیں ہوگا ، اسی کو ہمارے ہاں اردو محاورے میں اس طرح تعبیر کرتے ہیں : ” دروغ بر گردن راوی“، یعنی اس کو صحیح ثابت کرنے کی ذمے داری راوی پر ہے، میں یہ ذمے داری اپنے سر نہیں لیتا۔
[[arabic: عَنْ جُنْدَبِ بْنِ عَبْدِ اللهِ قَالَ : قَالَ رَسُولُ اللَّهِ : مَنْ قَالَ فِي القُرْآنِ بِرَأْيِهِ فَأَصَابَ فَقَدْ أَخْطَا]]
ترجمہ: حضرت جندب بن عبد الله بیان کرتے ہیں : رسول اللہ ﷺ نے فرمایا: جس شخص نے قرآن مجید میں اپنی رائے سے صحیح بات بھی کہی تو اس نے خطا کی ، (سنن ترمذی: 2952) نوٹ: "جندب" کے لفظ کو دال کی زبر اور پیش کے ساتھ یعنی دونوں طرح پڑھنا درست ہے۔

[[heading: صحابی کی تعریف]]

سوال:
صحابی کسے کہتے ہیں، کیا جنات میں بھی صحابہ ہیں، کیا صحابیت کا شرف صرف بالغ افراد کو حاصل ہے یا اطفال اور غیر ممیز صبیان کی طرف بھی اس شرف کی نسبت کی گئی ہے، نیز آیا ملائکہ بھی نسبت صحابیت سے مشرف ہوئے ، اگر جواب اثبات میں ہے تو کیا اُن کی طرف آپ ﷺ کی بعثت ارسال تکلیفی ہے یا محض تشریعی ، اسی طرح دیگر مخلوقات کی طرف ارسال کی نوعیت کیا ہے، (ابو عمیر قاری محمد نوید اختر ، کراچی)  

جواب:
علامہ حافظ ابن حجر عسقلانی شافعی رحمۃ اللہ علیہ متوفی 852ھ صحابی کی تعریف میں لکھتے ہیں:
[[arabic: أَصَحُ مَا وَقَفْتُ عَلَيْهِ مِنْ ذَلِكَ أَنَّ الصَّحَابِيَ مَنْ لَقِيَ النَّبِيَّ مُؤْمِنًا بِهِ، وَمَاتَ عَلَى الإِسْلَامِ]]۔
ترجمہ: صحابی کی سب سے زیادہ صحیح تعریف جس سے میں واقف ہوا، یہ ہے : صحابی اس شخص
`},

{
  pageNumber: 41,
  text: `کو کہا جاتا ہے جس نے نبی ﷺ پرایمان رکھنے کی حالت میں آپ سے ملاقات کی اور اسلام پر اس کی وفات ہوئی ،خواہ درمیان میں (بدقسمتی سے)مرتد ہوگیا ،لیکن پھر اسلام قبول کرلیا ہو ، یہی تعریف زیادہ صحیح ہے، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ ، ج:1،ص: 158)‘‘۔
علامہ حافظ ابن حجر اپنی اس تعریف میں مذکور قیودات کی وضاحت کرتے ہوئے لکھتے ہیں:
(1) ’’[[arabic: فَيَدْخُلُ فِي "مَنْ لَقِيَهٗ" مَنْ طَالَتْ مُجَالَسَتُهٗ أَوْ قَصُرَتْ، وَمَنْ رَوٰى عَنْهُ أَوْ لَمْ يَرْوِ، وَمَنْ غَزَا مَعَهٗ أَوْ لَمْ يَغْزُ، وَمَنْ رَآهُ رُؤْيَةً وَلَمْ يُجَالِسْهُ، وَمَنْ لَمْ يَرَهٗ لِعَارِضٍ كَالعَمٰى]]‘‘۔
ترجمہ: ’’صحابی کی تعریف میں ’’نبی کریم ﷺ سے ملاقات‘‘ کی قید (عام ہے، لہٰذا اس قید کی رُو) سے ہر وہ شخص صحابی کی تعریف میں داخل ہوجاتا ہے جس نے نبی کریم ﷺ سے ملاقات کی ہو، خواہ اُس نے آپ ﷺ کی صحبت میں طویل عرصہ گزارا ہو یا تھوڑا، اُس نے آپ سے روایت کی ہو یا نہ کی ہو، آپ کے ساتھ غزوات میں شریک رہا ہو یا نہیں، یاصرف آپ ﷺ کو دیکھا ہو لیکن آپ کے ساتھ ہمنشی نہ کی ہو، یونہی وہ شخص بھی صحابی کی اِس تعریف میں داخل ہے جس نے آپ سے ملاقات کی ہو، لیکن کسی عارضے مثلاً نابینا ہونے کی وجہ سے آپ کو نہ دیکھ پایا ہو (یعنی ملاقات کے باوجود رویتِ بصری سے محروم رہا ہو، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
شرفِ صحابیت کے ثبوت کے لیے کتنی دیر کی صحبت کافی ہے ،اس کی وضاحت کرتے ہوئے علامہ یحییٰ بن شرف نووی لکھتے ہیں:
’’[[arabic: اُخْتُلِفَ فِی حَدِّ الصَّحَابِیِّ: فَالْمَعْرُوفُ عِنْدِ الْمُحَدِّثِینَ أَنَّہٗ کُلُّ مُسْلِمٍ رَاٰی رَسُوْلَ اللّٰہِ ﷺ، وَعَنْ أَصْحَابِ الْاُصُوْلِ أَوْ بَعْضِہِمْ أَنَّہٗ مَنْ طَالَتْ مُجَالَسَتُہٗ عَلٰی طَرِیْقِ التَّبَعِ، وَعَنْ سَعِیْدِ بْنِ الْمُسَیَّبِ: أَنَّہٗ لَا یُعَدُّ صَحَابِیًّا إِلَّا مَنْ أَقَامَ مَعَ رَسُولِ اللّٰہ ﷺسَنَۃً أَوْ سَنَتَیْنِ أَوْ غَزَا مَعَہٗ غَزْوَۃً أَوْ غَزْوَتَیْنِ، فَإِنْ صَحَّ عَنْہُ فَضَعِیْفٌ، فَإِنَّ مُقْتَضَاہٗ أَنْ لَا یُعَدَّ جَرِیْرٌ الْبَجَلِیُّ وَشِبْہُہٗ صَحَابِیًّا، وَلَا خِلَافَ أَنَّهُمْ صَحَابَةٌ]]‘‘۔`
},
{
  pageNumber: 42,
  text: `ترجمہ: ’’صحابی کی تعریف میں اختلاف ہے ،محدثین کے نزدیک معروف تعریف یہ ہے : ’’ہر وہ مسلمان جس نے رسول اللہ ﷺ کو دیکھا ،وہ صحابی ہے‘‘ اوربعض اصحاب الاصول کے نزدیک تعریف یہ ہے: ’’جس نے بہ طریق متابعت نبی ﷺ کی طویل مجلس حاصل کی ہو‘‘ اور سعید بن مسیب سے یہ تعریف منقول ہے : ’’صحابی صرف وہ مسلمان ہے جو آپ کے ساتھ ایک یا دوسال رہا ہو یا جس نے آپ کے ساتھ ایک یا دوغزوات میں شرکت کی ہو، یہ تعریف ضعیف ہے ،کیونکہ اس تعریف کی رو سے حضرت جریر بن عبداللہ البجلی اوران جیسے (حضرت وائل بن حجر رضی اللہ عنہ) صحابی نہیں رہیں گے ،حالانکہ ان کے صحابی ہونے میں کسی کااختلاف نہیں ہے، (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی: ج: 2، ص:667)‘‘۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: قَالَ عَلِیُّ بْنُ الْمَدِ یْنِیِّ: مَنْ صَحِبَ النَّبِیَّ ﷺ أَوْ رَاٰہٗ وَلَوْ سَاعَۃً مِنْ نَہَارٍ فَہُوَ مِنْ أَصْحَابِ النَّبِیِّ ﷺ]]‘‘۔
ترجمہ: ’’علی بن المَدینی نے کہا: ’’جو نبی ﷺ کی مجلس میں بیٹھا یا آپ کو دیکھا، خواہ یہ دن کی ایک ساعت میں ہو، تو وہ نبی ﷺ کے صحابی ہیں، (فتح الباری: ج: 7، ص:5 )‘‘۔
الغرض یہ کہ صحابیت کے ثبوت کے لیےآپ ﷺ سے ملاقات ضروری ہے،خواہ ملاقات طویل عرصے رہی ہو یا کچھ دیر کے لیے ، صحابی ہونے کے لیے نبی کریم ﷺ کے ساتھ طویل عرصے کی صحبت یا آپ کے ساتھ غزوات میں شرکت ضروری نہیں ۔
(2) صحابی کی تعریف میں مذکور دوسری قید ’’مُوْمِنًا‘‘ کی وضاحت کرتے ہوئےعلامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَخْرُجُ بِقَيْدِ الْإِيْمَانِ مَنْ لَقِيَهٗ كَافِرًا وَلَوْ أَسْلَمَ بَعْدَ ذٰلِكَ إِذَا لَمْ يَجْتَمِعْ بِهٖ مَرَّةً أُخْرىٰ]]‘‘۔`
},
{
  pageNumber: 43,
  text: `ترجمہ: ’’صحابی کی تعریف میں ایمان کی قید سے وہ شخص خارج ہوگیا جس نے کفرکی حالت میں آپ سے ملاقات کی ہو،خواہ اِس ملاقات کے بعدوہ اسلام لےآیاہو،بشرطیکہ وہ دوبارہ نبی کریم ﷺ کے ساتھ جمع نہ ہوا ہو، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج: 1، ص: 158)‘‘۔
علامہ جلال الدین سیوطی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنْ رَاٰہٗ كَافِرًا ثُمَّ أَسْلَمَ بَعْدَ مَوْتِہٖ كَرَسُوْلِ قَیْصَرَ فَلَا صُحْبَۃَ لَہٗ]]‘‘۔
ترجمہ: ’’اور جس شخص نے آپ ﷺکو کفر کی حالت میں دیکھا اور آپ کی وفات کے بعد اسلام لایا ، جیسے قیصر کا ایلچی،تواُنہیں صحابیت کا شرف حاصل نہیں ہے، (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘۔
بعض اہلِ علم حضرات نے صحابی ہونے کے لیے بلوغت کی شرط بھی عائد کی ہے،لیکن صحیح اور راجح قول یہ ہے کہ صحابی ہونے کے لیے بالغ ہونا ضروری نہیں ہے،چنانچہ علامہ زین الدین عراقی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَالصَّحِیْحُ أَنَّ الْبُلُوْغ لَیْسَ شَرْطًا فِی حَدِّ الصَّحَابِیِّ وإِلَّا لَخَرَجَ بِذٰلِکَ مَن اَجْمَعَ العُلَمَاءُ عَلٰی عَدِّہِم فِی الصَّحَابَۃِ کَعَبدِ االلّٰہِ بْنِ الزُّبَیْرِ وَالْحَسَنِ وَالْحُسَیْنِ رَضِیَ اللّٰہُ عَنْہُمْ]]‘‘۔
ترجمہ: ’’اور صحیح یہ ہے کہ صحابی کی تعریف میں بلوغ کی شرط نہیں،ورنہ جن شخصیات کی صحابیت پرعلماء کا اجماع ہے ،وہ صحابیت سے خارج ہوجائیں گے ،جیسے امام حسن اور امام حسین اور عبداللہ بن زبیر رضی اللہ عنہم، (اَلتَّقْیِیْد وَالْاِیْضَاح شَرح مُقَدَّمَہ اِبْنُ الصَّلَاح: ص295)‘‘۔
البتہ امام یحییٰ بن معین،امام ابوزرعہ،امام ابوحاتم،امام ابوداؤد اور علامہ ابن عبدالبر وغیرہ بعض محدثین نے صحابی ہونے کےلیے ’’سِنِّ تمییز‘‘ (اچھے برے میں فرق کی صلاحیت کی عمر کو پہنچنا، جوکہ کم ازکم چار برس ہے) کی شرط عائد کی ہے ،چنانچہ علامہ زین الدین عراقی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَأَمَّا التَّمْيِيْزُ فَظَاهِرُ كَلَامِهِمْ اِشْتِرَاطُهٗ كَمَا هُوَ مَوْجُوْدٌ فِي كَلامِ يَحْيَى بْنِ مَعِيْنٍ وَأَبِيْ زُرْعَةَ وَأَبِيْ حَاتَمٍ وَأَبي دَاوٗدَ وَابْنِ عَبْدِ الْبَرِّ وَغَيْرِهِمْ وَهُمْ جَمَاعَةٌ أُتِی بِهِمُ النَّبيَّ ﷺ وَهُمْ أَطْفَالٌ فَحَنَّكَهُمْ وَمَسَحَ وُجُوْهَهُمْ أَوْ تَفَلَ فِيْ أَفْوَاهِهِمْ فَلَمْ يَكْتُبُوْا لَهُمْ صُحْبَةً، كَحَمْدِ بْنِ حَاطِبِ بْنِ الْحَارِثِ وَعَبْدِ الرَّحْمٰنِ بْنِ عُثْمَانَ التَّيْمِىِّ وَمَحْمُوْدِ ابْنِ الرَّبِيْعِ]]`
},
{
  pageNumber: 44,
  text: `[[arabic: وَعُبَيْدِ اللهِ بْنِ مَعْمَرٍ وَعَبْدِ اللهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ وَعَبْدِ اللهِ بْنِ أَبِيْ طَلْحَةَ وَمُحَمَّدِ بْنِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَيَحْيَى بْنِ خَلَّادِ بْنِ رَافِعٍ الزُّرَقِىِّ وَمُحَمَّدِ بْنِ طَلْحَةَ ابْنِ عُبَيْدِ اللهِ وَعَبْدِ اللهِ بْنِ ثَعْلَبَةَ بْنِ صَعِيْرٍ وَعَبْدِ اللهِ بْنِ عَامِرِ بْنِ كَرِيْزٍ وَعَبْدِ الرَّحْمٰنِ ابْنِ عَبْدِ الْقَارِىِّ وَنَحْوِهِمْ]]‘‘۔
ترجمہ: ’’رہی (خیر وشر میں) تمیز کی صلاحیت تو بظاہر یہ شرط ہے،جیساکہ یہ شرط یحییٰ بن معین، ابوزرعہ، ابوحاتم، ابودائود ،ابن عبدالبروغیرہ کےکلام میں موجود ہے،ان حضرات نے غیرممیز بچےکوصحابی قرار نہیں دیا،اِس سے مراد وہ بچے ہیں جنہیں بچپن میں نبی ﷺ کے پاس لایا گیا، آپ نے انہیں گھٹی دی،ان کے چہروں کو (پیار سے )چھوایا ان کے منہ میں لعابِ دہنِ مبارک ڈالا، لیکن انہیں صحابہ میں شمار نہیں کیا گیاجیسے: حمد بن حاطب بن حارث، عبدالرحمٰن بن عثمان التیمی، محمود بن ربیع ،عبیداللہ بن معمر، عبداللہ بن حارث بن نوفل، عبداللہ بن ابی طلحہ، محمد بن ثابت بن قیس بن شماس، یحییٰ بن خلاد بن رافع الزرقی، محمد بن طلحہ بن عبیداللہ، عبداللہ بن ثَعلبہ بن صعیر، عبداللہ بن عامر بن کریز اور عبدالرحمن بن عبدالقاری اور اس طرح کے دوسرےبچے، (اَلتَّقْیِیْد وَالْاِیْضَاح،ص:292)‘‘۔
اس کے برعکس اکثر اہلِ علم کے نزدیک صحابی ہونے کے لیے سن تمییز کو پہنچنا شرط نہیں ہے ،چنانچہ علامہ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اِلَّا اَنَّہٗ ہَلْ یُشْتَرَطُ فِی الرَّائِیْ اَن یَّکُوْنَ بِحَیْثُ یُمَیِّزُ مَارَاٰہُ أَوْ یُکْتَفٰی بِمُجَرَّدِ حُصُولِ الرُّؤْیَۃِ مَحَلُّ نَظَر، وَعَمَلُ مَنْ صَنَّفَ فِی الصَّحَابَۃِ یَدُلُّ عَلَی الثَّانِی ،فَإِنَّہُمْ ذَکَرُوا مِثْلَ مُحَمَّدِ بْنِ أَبِی بَکْرٍ الصِّدِّیقِ ،وَإِنَّمَا وُلِدَ قَبْلَ وَفَاۃِ النَّبِیِّ ﷺ بِثَلَاثَۃِ أَشْہُرٍ وَأَیَّامٍ کَمَا ثَبَتَ فِی الصَّحِیْحِ أَنَّ أُمَّہٗ أَسْمَاءُ بِنْتُ عُمَیْسٍ وَلَدَتْہُ فِی حَجَّۃِ الْوَدَاعِ قَبْلَ أَنْ یَدْخُلُوْا مَکَّۃَ وَذٰلِکَ فِی أَوَاخِرِ ذِی الْقَعْدَۃِ سَنَۃَ عَشْرٍ مِنَ الْہِجْرَۃِ وَمَعَ ذٰلِکَ ،فَاَحَادِیثُ ہٰذَا الضَّرْبِ مَرَاسِیلُ]]‘‘۔
ترجمہ: ’’کیا نبی ﷺ کا دیدار کرنے والے کے لیے یہ شرط ہے کہ وہ جو دیکھے اس کی تمییز`
},
{
  pageNumber: 45,
  text: `کرسکتا ہو یا صرف دیکھنے پر اکتفا کیا جائے گا ،یہ محل نظر ہے اور جن علماء نے صحابہ کے حالات پر کتابیں لکھی ہیں ان کا عمل دوسرے پردلالت کرتا ہے، انہوں نے محمد بن ابوبکر صدیق کا ذکر صحابہ میں کیا ہے، حالانکہ وہ نبی ﷺ کی وفات سے تین ماہ کچھ دن قبل پیدا ہوئے تھے، یہ بات حدیث صحیح سے ثابت ہے کہ ان کی ماں اَسماء بنتِ عُمیس نے ان کو ۱۰ ہجری ماہ ذو القعدہ میں حجۃ الوداع کے موقع پر مکہ داخل ہونے سے پہلے جنا تھا ،باوجود اس شرف کے ان حضرات کی بیان کردہ احادیث مراسیل ہیں ، (فتح الباری:ج: 7،ص: 3)‘‘۔
نیز لکھتے ہیں:
’’[[arabic: مَن لَّمْ يُمَيِّزْ لَا تَصِحُّ نِسْبَةُ الرُّؤْيَةِ إِلَيْهِ، نَعَمْ يَصْدُقُ أَنَّ النَّبيَّ ﷺرَآهُ فَيَكُوْنُ صَحَابِيًّا مِنْ هٰذِهِ الْحَيْثِيَّةِ، وَمِنْ حَيْثُ الرِّوَايَةِ يَكُوْنُ تَابِعِيًّا]]‘‘۔
ترجمہ: ’’جو نبی کریم ﷺ کی حیات میں سن تمیز کو نہ پہنچا ہو، اُس کی طرف نبی کریم ﷺ کو دیکھنے کی نسبت کرنا صحیح نہیں ہے، ہاں یہ بات درست ہے کہ نبی کریم ﷺ نے اُسے دیکھا ہو ،پس وہ اِس حیثیت سے صحابی ہو گا اور روایت کے اعتبار سے وہ تابعی ہوگا‘‘۔
علامہ عبدالحی لکھنوی لکھتے ہیں:
’’[[arabic: وَالْمُرَجَّحُ ہُوَ دُخُولُہٗ فِیْہِمْ نَعَمْ حَدِیْثُہُمْ مُرْسَل لٰکِنَّہٗ مُرْسَلٌ مَقبُوْلٌ]]‘‘۔
ترجمہ: ’’ان کے صحابہ میں داخل ہونے کا قول راجح ہے ،ہاں ان کی روایت کردہ احادیث مرسل ،لیکن مرسل مقبول ہیں، (ظَفر الْاَمَانی فی مُخْتَصر الْجُرجَانی:307)‘‘۔
اسی طرح مجنون کا حکم ہےکہ وہ تبعاً صحابی قرار پائے گا ،وہ تمام اطفال جو عہد طفولیت میں نبی ﷺ کی ملاقات سے مشرف ہوئے، ان کا تبعاً مسلم ہونا ظاہر ہے کہ ان کے والدین مسلم بلکہ صحابہ تھے اور اگر کسی مجنون کو بھی نبی ﷺ سے ملاقات کا شرف حاصل ہوا تھا ،جس کے والدین دونوں یا ان میں سے ایک مسلمان ہو تو وہ بھی یقینا مسلم ہوا، لہٰذا مجنون اور اطفال دونوں ’’مُسْلِمًا‘‘ کی قید سے خارج نہیں ہوئے۔ 
(3) صحابی کی تعریف میں مذکور تیسری قید ’’بِہٖ‘‘ کی وضاحت کرتے ہوئےعلامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:`
},
{
  pageNumber: 46,
  text: `’’[[arabic: وَقَوْلُنَا بِہٖ يَخْرُجُ مَنْ لَقِيَهٗ مُؤْمِنًا بِغَيْرِهٖ، كَمَنْ لَقِيَهٗ مِنْ مُؤْمِنِي أَهْلِ الْكِتَابِ قَبْلَ الْبَعْثَةِ]]‘‘۔
ترجمہ: ’’خاص نبی کریم ﷺ پر ایمان لانے کی قید سے وہ تمام لوگ صحابی کی تعریف سے خارج ہوگئے، جنہوں نے (اعلان نبوت سے قبل ) دیگر انبیاءِ کرام پر ایمان رکھنے کی حالت میں نبی ﷺ سے ملاقات کی ہو(اور وہ آپ پر ایمان نہ لائے ہوں)، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
ایمان کی حالت میں نبی کریم ﷺ سے ملاقات کی قید سے وہ تمام اشخاص صحابی کی تعریف سے خارج ہوگئے جو نبی کریم ﷺ کےزمانے میں آپ پر ایمان لائے ،مگر آپ سے ملاقات کا شرف حاصل نہ کرسکے ،جیساکہ خیر التابعین حضرت اویس قرنی ،جو کہ اپنی والدہ کی خدمت میں منہمک ہونے کی وجہ سے نبی کریم ﷺ سے ملاقات نہ کرسکے، اِسی طرح حبشہ کے بادشاہ أصْحَمَہ نجاشی آپ ﷺپر ایمان لے آئے تھے ،مگر آپ سے ملاقات حاصل نہ ہوسکی۔
محدثین کرام نے یہ شرط بھی عائد کی نبی کریم ﷺ سے یہ ملاقات آپ کی حیاتِ دنیوی اور بیداری میں ہو ،لہٰذا جس شخص نے نبی کریم ﷺ کو آپ کے وصال کے بعد دفن سے پہلے دیکھا ،جیساکہ ابوذؤیب خویلد بن خالد ہذلی ،یا جسے آپ ﷺ کی دنیوی حیات میں یا آپ کے پردہ فرمانے کے بعد خواب میں ملاقات کا شرف حاصل ہوا ،تووہ صحابی نہیں کہلائے گا ، علامہ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں : 
’’[[arabic: وَہٰذَا کُلُّہٗ فِیْمَنْ رَاٰہُ وَہُوَ فِی قَیْدِ الْحَیَاۃِ الدُّنْیَوِیَّۃِ، أَمَّا مَنْ رَاٰہٗ بَعْدَ مَوْتِہٖ وَقَبْلَ دَفْنِہٖ، فَالرَّاجِحُ أَنَّہٗ لَیْسَ بِصَحَابِیٍّ وَإِلَّا لَعُدَّ مَنِ اتَّفَقَ أَنْ یَرٰی جَسَدَہُ الْمُکَرَّمَ وَہُوَ فِی قَبْرِہِ الْمُعَظَّمِ وَلَوْ فِی ھٰذِہِ الْاَعْصَارِ وَکَذلِٰکَ مَنْ کُشِفَ لَہٗ عَنْہُ مِنَ الْاَوْلِیَاءِ فَرَاٰہٗ کَذٰلِکَ عَلٰی طَرِیْقِ الْکَرَامَۃِ]]‘‘۔`
},
{
  pageNumber: 47,
  text: `ترجمہ: ’’اور یہ تمام صورتیں اُس شخص کے متعلق ہیں جس نے آپ کو حیات دنیوی میں دیکھا اور جس نے آپ کو وفات کے بعد اور دفن سے پہلے دیکھا ، تو راجح قول کے مطابق وہ صحابی نہیں ہے ،ورنہ اس کو بھی صحابی شمار کیا جائے گا جس کے بارے میں اتفاق ہو کہ اس نے آپ ﷺ کے جسد مکرم کو آپ کی قبر معظم میں دیکھا ، خواہ وہ اِسی زمانے میں ہو اور اسی طرح وہ اولیاء ِکرام جن کو کشف کی صورت میں آپ کی زیارت کرائی گئی ہو، اسی طرح کرامت کے طور پر آپ کی زیارت کرائی گئی ہو، (فتح الباری : ج:7،ص:6)‘‘۔ 
علامہ جلال الدین سیوطی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنْ رَاٰہٗ بَعْدَ مَوْتِہٖ ﷺ قَبْلَ الدَّفْنِ، وَقَدْ وَقَعَ ذٰلِکَ لِاَبِی ذُؤَیْبٍ خُوَیْلِدِ بْنِ خَالِدٍ الْہُذَلِیِّ، فَإِنَّہٗ لَا صُحْبَۃَ لَہٗ]]‘‘۔
ترجمہ: ’’اور جس شخص نے آپ کی وفات کے بعد دفن ہونے سے پہلے دیکھا ،جیسے ابوذؤیب خُویلد بن خالد ہذلی ،تو اُنہیں صحابیت کا شرف حاصل نہیں ہے ۔ (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘۔
اب یہاں یہ سوال پیدا ہوتا ہے کہ بعض ایسے اشخاص بھی پائے جاتے ہیں، جنہوں نے نبی کریم ﷺ کے اعلان نبوت سے قبل آپ سے ملاقات کی اورآپ کی بعثت ورسالت کی خبر دیتے ہوئےآپ پر ایمان بھی لائے، مثلاً :بحیراراہب وغیرہ ،تو آیا ایسے اشخاص صحابی کہلائیں گے یا نہیں،اس حوالے سے علامہ حافظ ابن حجر مضطرب نظر آتےہیں اور اُنہوں نے ایسے اشخاص کے صحابہ میں سے ہونے نہ ہونے کی کوئی تعیین نہیں کی ہے،چنانچہ وہ لکھتے ہیں:
’’[[arabic: وَهَلْ يَدْخُلُ مَنْ لَقِيَهُ مِنْهُمْ وَآمَنَ بِأَنَّهٗ سَيُبْعَثُ أَوْ َلا يَدْخُلُ؟ مَحَلُّ اِحْتِمَالٍ. وَمِنْ هَؤُلَاءِ بُحَيْرَا الرَّاهِبُ وَنَظَرَاؤُهٗ]]‘‘۔`
},
{
  pageNumber: 48,
  text: `ترجمہ: ’’جنہوں نے نبی کریم ﷺ سے ملاقات کی اور آپ کی متوقع بعثت پر ایمان لائے، آیا وہ صحابی کہلائیں گے یا نہیں، اس میں احتمال ہے، اس نوع سے بحیرا راہب اور اُن جیسے دیگر لوگ تعلق رکھتے ہیں، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘،یعنی علامہ حافظ ابن حجر نے قطعیت کے ساتھ ان کے صحابی ہونے کا قول نہیں کیا۔
جبکہ بعض محدثین نے اُن تمام اشخاص کو صحابہ میں داخل مانا ہے جنہوں نے نبی کریم ﷺ کے اعلان نبوت سے قبل ملت حنفیہ پر قائم رہتے ہوئے ایمان کی حالت میں آپ سے ملاقات کی، مثلاً زید بن عمرو بن نفیل یا آپ کی متوقع بعثت پر ایمان لائے، جیساکہ بحیرا راہب ،چنانچہ علامہ ابن عابدین شامی ’’شرح التحریر‘‘ کے حوالے سے لکھتے ہیں:
’’[[arabic: وَالصَّحَابِیُّ عِنْدَ الْمُحَدِّثِیْنَ وَبَعْضِ الْاُصُوْلِیِّیْنَ: مَنْ لَقِیَ النَّبِیَّ ﷺمُسْلِمًا وَمَاتَ عَلَی الْإِسْلَامِ أَوْ قَبْلَ النُّبُوَّۃِ وَمَاتَ قَبْلَہَا عَلَی الْحَنِیفِیَّۃِ کَزَیْدِ بْنِ عَمْرِو بْنِ نُفَیْلٍ]]‘‘۔
ترجمہ: ’’محدثین اور بعض اصولیین کے نزدیک صحابی وہ ہے ،جس نے اسلام کی حالت میں نبی ﷺ سے ملاقات کی اور اسلام پر وفات پائی یا ملاقات کا یہ شرف اعلان نبوت سے پہلے حاصل ہوا اور اعلان نبوت سے پہلے ملتِ ابراہیمی پر فوت ہوئے، جیسے زید بن عمروبن نفیل، (رَدُّ الْمُحْتَار عَلَی الدُّرِّ الْمُخْتَار:ج:1،ص: 13)‘‘۔
علامہ ابن عابدین شامی ،علامہ جلال الدین سیوطی کے حوالے سے لکھتے ہیں: 
’’[[arabic: قَالَ: وَہَلْ یُشْتَرَطُ لَقْیُہٗ فِیْ حَالِ النُّبُوَّۃِ أَوْ أَعَمُّ مِنْ ذٰلِکَ، حَتّٰی یَدْخُلَ مَنْ رَاٰہٗ قَبْلَہَا وَمَاتَ عَلَی الْحَنِیفِیَّۃِ، کَزَیْدِ بْنِ عَمْرِو بْنِ نُفَیْلٍ، وَقَدْ عَدَّہٗ ابْنُ مَنْدَۃ فِی الصَّحَابَۃِ، وَکَذَا لَوْ رَاٰہُ قَبْلَہَا، ثُمَّ أَدْرَکَ الْبَعْثَۃَ وَأَسْلَمَ وَلَمْ یَرَہٗ]]‘‘۔
ترجمہ: ’’کیا یہ ملاقات اعلان نبوت کے بعد شرط ہے یا یہ عام ہے (یعنی اعلان نبوت سے قبل کی ملاقات کو بھی شامل ہے)حتیٰ کہ اس میں وہ بھی داخل ہوجائیں جنہوں نے اعلان نبوت سے پہلے آپ ﷺ کو دیکھا اور ان کی موت دین حنیف پر ہوئی، جیسے زید بن عمرو بن نفیل وغیرہ ، ابن مندہ نے ان کو صحابہ میں شمار کیا ہے اور اسی طرح جس نے آپ کو اعلان نبوت سے پہلے دیکھا پھر بعثت کا زمانہ پایا اور اسلام قبول لیکن پھر آپ کونہیں دیکھا ‘‘۔`
},
{
  pageNumber: 49,
  text: `(رَدُّ الْمُحْتَار عَلَی الدُّرِّ الْمُخْتَار:ج۱ص 13)
حافظ ابن حجر صحابی کی تعریف میں ’’مُوْمِنًابِہٖ‘‘ کی مزید وضاحت کرتے ہوئےلکھتے ہیں:
’’[[arabic: يَدْخُلُ فِيْ قَوْلِنَا مُؤْمِنًابِہٖ كُلُّ مُكَلَّفٍ مِنَ الْجِنِّ وَالْإنْسِ]]‘‘۔
ترجمہ: ’’ہمارے اس قول ’’وہ نبی کریم ﷺ پر ایمان لانے والا ہو‘‘ میں جنّ وانس میں سے تمام مکلفین صحابی کی تعریف میں داخل ہوجاتے ہیں‘‘۔
(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ، ج:1،ص:158)
اورآپ ﷺ سے ملاقات کرنے والے فرشتوں پر صحابیت کے اطلاق کے حوالے سے لکھتے ہیں:
’’[[arabic: وَأَمَّا الْمَلَائِکَۃُ فَیُتَوَقَّفُ عَدُّہُمْ فِیْہِمْ عَلٰی ثُبُوْتِ بَعْثَتِہٖ إِلَیْہِمْ، فَإِنَّ فِیْہِ خِلَافًا بَیْنَ الْاُصُوْلِیِّینَ، حَتّٰی نَقَلَ بَعْضُہُمُ الْإِجْمَاعَ عَلٰی ثُبُوْتِہٖ وَعَکَسَ بَعْضُہُمْ]]‘‘۔
ترجمہ: ’’اور ملائکہ کو صحابہ میں شمار کرنااس پر موقوف ہے کہ آیاآپ ﷺ کی بعثت ان کی طرف بھی ہوئی ہے ، پس اس مسئلہ میں اصولیین کے درمیان اختلاف ہے، حتّٰی کہ بعض علماء نے اس کے ثبوت پر اجماع نقل کیا ہے اور بعض نے اس کے برعکس کہا ہے ‘‘۔
(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج:1،ص:158)
اس کی مزید تفصیل ووضاحت یہ ہے کہ اہلِ علم کا اس بارے میں اتفاق ہے کہ جنات بھی انسانوں کی طرح مکلف ہیں اور ان میں مومن اور منکر دونوں قسم کے افرادپائے جاتے ہیں، قرآنِ کریم میں اللہ تعالیٰ نےجنّات کےحوالے سےاُن کے قول کی حکایت کرتے ہوئےفرمایا: ’’[[arabic: وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَلِكَ كُنَّا طَرَائِقَ قِدَدًا]]‘‘۔
ترجمہ: ’’اوربے شک ہم میں سے بعض نیک ہیں اور بعض دوسری طرح کے ، یوں ہم مختلف راہوں پر گامزن ہیں، (الجنّ:11)‘‘۔
اِس بات پر بھی اہلِ علم متفق ہیں کہ جس طرح نبی کریم ﷺ کی بعثت ورسالت تمام انسانوں کے لیےہے،اِسی طرح آپ جنات بلکہ فرشتوں اور تمام مخلوقاتِ الٰہیہ کے بھی`
},
{
  pageNumber: 50,
  text: `رسول ہیں،اللہ تعالیٰ کا ارشادہے:
’’[[arabic: تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا]]‘‘۔
ترجمہ: ’’بہت ہی بابرکت ہے  وہ ذات،جس نے اپنے مکرّم بندے  پر قرآن نازل کیا تاکہ وہ تمام جہانوں کے لیے ڈرسنانے والے ہوں،(الفرقان:1)‘‘۔
نبی کریم ﷺ کا ارشاد ہے: ’’[[arabic: أُرْسِلْتُ اِلَی الْخَلْقِ کَا فَّۃً]]‘‘، ترجمہ: ’’مجھے تمام مخلوق کی جانب رسول بناکر بھیجا گیا ہے‘‘۔اس حدیث میں اگر چہ صرف ’’الْخَلْق‘‘ کاعموم ہی  انسان وجنات اور ملائکہ سمیت تمام مخلوقات کو شامل تھا،اس کے باوجودلفظِ ’’کَا فَّۃً‘‘ کا اضافہ کرکے اس بات کو واضح اورمستحکم کردیا گیا کہ لفظ ’’الْخَلْق‘‘ اپنے کامل عموم پرباقی ہے اور اِس سے کوئی مخلوق خارج نہیں ہے،حضرت عبداللہ بن عباس رضی اللہ عنہما ارشاد فرماتے ہیں:
’’[[arabic: قَالَ لِمُحَمَّدٍﷺ: وَمَاأَرْسَلْنَاكَ اِلَّا کَافَّۃً لِلنَّاسِ، فَاَرْسَلَہٗ اِلَی الْاِنْسِ وَالْجِنِّ]]‘‘۔
ترجمہ: ’’اللہ تعالیٰ نے محمد ﷺ کے متعلق فرمایا:ہم نے آپ کو تمام لوگوں کے لیے رسول بناکر بھیجا ہے ،پس اللہ تعالیٰ نے آپﷺ کو تمام انسان وجنات کے لیے رسول بنایا ہے،(المعجم الکبیر:11610)‘‘۔
لہٰذاوہ انسان وجنات جنہوں نے ایمان کی حالت میں نبی کریم ﷺ سے ملاقات کی،وہ آپ کے صحابہ میں داخل ہیں اور اُن کی جانب آپ ﷺ کی بعثت ورسالت ارسالِ تکلیفی ہےاور وہ شریعت کےفروعی احکام کے مکلف ہیں۔
شیخ ابو محمد علي بن احمد ابن حزم اُندلسی قرطبی متوفی 456؁ھ لکھتے ہیں: 
’’[[arabic: وَقَدْ نَصَّ اللَّهُ تَعَالٰی عَلَى أَنَّ نَفَرًا مِنْ الْجِنِّ آمَنُوا وَسَمِعُوا الْقُرْآنَ مِنْ رَسُولِ اللَّهِ ﷺفَهُمْ صَحَابَةٌ وَفُضَلَاءُ]]‘‘۔
ترجمہ: ’’اللہ تعالیٰ نےصراحت فرمائی ہے کہ جنات کاایک گروہ ایمان لایااور اُنہوں نے رسول اللہﷺ سے قرآن کریم کو سُنا،پس وہ صحابہ اور فضلاء ہیں‘‘۔
(اَلْمُحَلی بِالْآثَار: ج: 8،ص:432)`
},

{
  pageNumber: 51,
  text: `علامہ ابن حجر وعلامہ عینی کے شیخ حافظ زين الدين عبد الرحيم العراقی متوفی806؁ھ لکھتے ہیں:
’’[[arabic: اَلْجِنُّ مِنْ جُمْلَةِ الْمُكَلَّفِيْنَ الَّذِيْنَ شَمِلَتْهُمُ الرِّسَالَةُ وَالْبَعْثَةُ فَكَانَ ذِكْرُ مَنْ عُرِفَ اسْمُهٗ مِمَّنْ رَآهُ حَسَنًا]]‘‘۔
ترجمہ:’’جنات من جملہ مکلفین میں سے ہیں،جنہیں رسالت وبعثت شامل ہے،پس جنات میں جن کا نام معلوم ہواُنہیں صحابہ میں ذکر کرنا عمدہ ہے‘‘۔
(اَلتَّقْیِیْد وَالْاِیْضَاح، ص:295)
نبی کریمﷺ سے ملاقات کرنے والے فرشتوں کےحوالے سے عام اہلِ علم کا موقف یہ ہے وہ صحابہ میں داخل نہیں ہیں، جبکہ محققین اہلِ علم نےاُنہیں بھی صحابہ میں داخل مانا ہے،اس اختلاف کی بنیاد اس بات پر ہے کہ آیا نبی کریمﷺ کی بعثت ورسالت فرشتوں کے لیے ہوئی ہے یا نہیںاور آیا فرشتے احکام شریعت کے مکلف ہیںیا نہیں۔پس جو اہلِ علم حضرات فرشتوں کو غیر مکلّف اورنبی کریمﷺ کی بعثت ورسالت کوانسان وجنات اورفرشتوں کے لیےعام ماننے کے بجائےفقط انس وجن کے ساتھ خاص قرار دیتے ہیں ،اُس کے نزدیک فرشتے صحابہ میں داخل نہیں ہیں۔
چنانچہ علامہ فخر الدین رازی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: أَنَّهٗ لَمْ يَكُنْ مُرْسَلاً إِلَى الْمَلَائِكَةِ]]‘‘۔
ترجمہ:’’نبی کریمﷺ کو فرشتوں کی طرف رسول بناکر مبعوث نہیں کیاگیا،(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ:ج:1،ص:158،نَظْمُ الدُّرَرْ فِی تَنَاسُبِ الْآیَاتِ وَالسُّوَرْ: ج:7، ص:72)‘‘اور وہ اہلِ علم جو فرشتوں کو صحابہ میں داخل مانتے ہیں،اُن کے نزدیک آپ ﷺ کی رسالت انسان وجنات اور فرشتوں سمیت تمام مخلوقات الٰہیہ کو عام اور شامل ہے اور فرشتے بھی انسان وجنات کی طرح مکلف ہیں،البتہ فرشتوں کا مکلف ہونا انسان وجنات کی طرح نہیں بلکہ اُن کی اپنی شان کے مطابق ہے اور بعض اہل علم فرماتے ہیں کہ انسان وجنات کی طرف آپ کی بعثت ارسالِ تکلیفی کی نوع سے ہے کہ وہ احکامِ شریعت کے مکلف`
},
{
  pageNumber: 52,
  text: `ہیں اور فرشتوں کے لیے ارسالِ تشریفی ہے،کہ فرشتوں کی جانب آپ کو مبعوث کرکے فرشتوں کو صحابیت کے شرف سے مشرف کیا گیا ۔
علامہ احمد بن محمد صاوی مالکی رحمۃ اللہ علیہ متوفی1241 ؁ھ لکھتے ہیں:
’’[[arabic: رِسَالَتُہٗ عَامَّۃٌ لِلْاِنْسِ وَالْجِنِّ وَالْمَلَائِکَۃِ وَجَمِیْعِ الْخَلْقِ ،لٰکِنْ اِرْسَالُہٗ لِلْاِنْسِ وَالْجِنِّ اِرْسَالُ تَکْلِیْفٍ اِجْمَاعًا وَاِرْسَالُہٌ لِلْمَلَائِکَۃِ قِیْلَ اِرْسَالُ تَکْلِیْفٍ بِمَا یَلِیْقُ بِھْمْ، وَقِیْلَ اِرْسَالُ تَشْرِیْفٍ ،وَاِرْسَالُہٗ لِمَا عَدَاہُمْ مِنَ الْحَیْوَانَاتِ الْغَیْرِ الْعَاقِلَۃِ وَالْجَمَادَاتِ اِرْسَالُ تَشْرِیْفِ وَرَحْمَۃٍ]]‘‘۔
ترجمہ:’’نبی کریمﷺ کی رسالت انس وجن ،فرشتوں اور تما م مخلوق کو عام ہے،لیکن انسانوں وجنات کے لیے آپ کا ارسال اجماعًاارسالِ تکلیف ہےاور فرشتوں کے لیے آپ کےارسال کے متعلق کہا گیا ہے کہ وہ بھی ارسالِ تکلیف ہے اور فرشتے اپنے حال کے لائق مکلف ہیں اور کہا گیا ہے کہ اُن کی طرف آپ کا اِرسال، اِرسالِ تشریف ہے،اوران کے علاوہ دیگر غیر ذوی العقول حیوانات اور جمادات کے لیے آپ کا ارسال،ارسالِ تشریف ورحمت ہے، (حَاشِیَۃُ الصـَاوِیْ عَلَی الْجَلَالَیْن،ج:4،ص:77)‘‘۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: رَجَّحَ الشَّيْخُ تَقِيُّ الدِّيْنِ السُّبْكِيُّ أَنَّهٗ كَانَ مُرْسَلاً إِلَيْهِمْ]]‘‘۔
ترجمہ:’’شیخ تقی الدین سُبکی نے اس بات کو راجح قرار دیا ہے کہ نبی کریمﷺ کو فرشتوں کی جانب بھی مبعوث کیا گیا تھا،(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
علامہ فخر الدین رازی کے قول کا جواب دیتے ہوئے علامہ ابراهيم بن عمر البقاعي متوفی885؁ھ فرماتے ہیں:
’’امام رازی پر تعجب ہے کہ اُنہوں نے ایسی بات نقل کی ہے جو کہیں اور نہیں پائی جاتی اور اُن کایہ قول خود اُن کے اپنے دوسرے قول کے معارض ہے،چنانچہ اُنہوں نےاپنی تفسیر میں جہاں بنی آدم کے قابلِ احترام ہونے کی وجوہات تحریر کی ہیں، وہاں اُنہوں نے چوتھی وجہ یہ بیان کی ہے:`
},
{
  pageNumber: 53,
  text: `’’[[arabic: أَنَّهٗ جَعَلَ أَبَاهُمْ رَسُوْلاً إِلَى الْمَلَائِكَةِ،حَيْثُ قَالَ:أَنْبِئْهُمْ بِأَسْمَائِهِمْ،وَقَدْ تَقَرَّرَ أَنَّ كُلَّ كَرَامَةِ كَانَتْ لِنَبِيٍّ مِنَ الْأَنْبِيَاءِ فَلِنَبِيِّنَاﷺ مِثْلُهَا أَوْ أَعْظَمُ مِنْهَا]]‘‘۔
ترجمہ:’’اللہ تعالیٰ بنوآدم کے والد حضرت آدم علیہ السلام کو فرشتوں کے لیے رسول بنایا ہے، چنانچہ اللہ تعالیٰ نےفرمایا:اے آدم! تم ان چیزوںکےنام فرشتوں کو بتاؤ ۔اور یہ بات متحقق ہے کہ جو بھی کرامت وخصوصیت انبیاءِ کرام میں سے کسی نبی کو عطا کی گئی ہے تو اُسی کے مثل یا اُس سے بڑھ کر کرامت وخصوصیت ہمارے نبی ﷺ کو بھی دی گئی ہے‘‘۔
(نَظْمُ الدُّرَرْ فِی تَنَاسُبِ الْآیَاتِ وَالسُّوَرْ،ج:7،ص:ص72)
امام احمد رضا قادریقُدِّسَ سِرُّہُ الْعَزِیْز لکھتے ہیں:
’’علماء فرماتے ہیں : رسالت والاکا تمام جن وانس کو شامل ہونا اجماعی ہے اورمحققین کے نزدیک ملائکہ کو بھی شامل ، [[arabic: كَمَا حَقَّقْنَا ہُ بِتَوْفِیْقِ اللہِ تَعَالٰی فِی رِسَالَۃِ اِجْلُالُ جِبْرِیْلَ]]۔ بلکہ تحقیق یہ ہے کہ حجروشجر وارض وسماء وجبال وبحار تمام ماسوا اللہ اس کے احاطہ عامّہ ودائرۂ تامّہ میں داخل اورخود قرآن عظیم لفظ’’عَالَمِیْن‘‘ اور روایتِ صحیح مسلم میں لفظ ’’ خَلْق‘‘ وہ بھی مؤکد بکلمہ ِ’’کَا فَّۃً ‘‘ ، اس مطلب پر احسن الدلائل طبرانی معجم کبیر میں یعلیٰ بن مرہ رضی اللہ عنہ سے راوی ، حضور سید المرسلین ﷺ فرماتے ہیں :  ’’[[arabic: مَامِنْ شَیْئٍ اِلَّا یَعْلَمُ أَنِّیْ رَسُوْلُ اللہِ اِلَّا كَفَرَة الْجِنِّ وَالْاِنْسِ]]‘‘،ترجمہ:’’کوئی چیز نہیں جو مجھے رسول اللہ نہ جانتی ہو ، مگر بے ایمان جن وآدمی،(فتاویٰ رضویہ،ج:30،ص:134)‘‘۔
علامہ غلام جیلانی میرٹھی رحمۃ اللہ علیہ لکھتے ہیں:
’’بلکہ حق یہ ہے کہ فرشتوں کے حق میں آپ کا ارسال صرف ارسالِ تشریف نہیں ،ارسالِ تکلیف بھی ہے ،فروعِ شریعت کے ساتھ مکلف نہ ہونے سے یہ لازم نہیں آتا کہ وہ دائرہ تکلیف سے ہی خارج ہوجائیں،حتیٰ کہ آپ کی رسالت کے کسی باب میں محتاج نہ رہیں،بلکہ عرفان الٰہی کے مدارج طے کرنے میں جن وانس کی طرح فرشتوں کو بھی آپ کی رسالت`
},
{
  pageNumber: 54,
  text: `کی احتیاج ہے،(بشیر القاری ،ص125)‘‘ ۔
(4)علامہ حافظ ابن حجر صحابی کی تعریف میں مذکورقید ’’وَمَاتَ عَلَى الإِسْلاَمِ‘‘کی وضاحت کرتے ہوئے لکھتے ہیں:
’’[[arabic: وَخَرَجَ بِقَوْلِنَا وَمَاتَ عَلَى الإِسْلاَمِ مَنْ لَقِيَهٗ مُوْمِنًا بِهٖ ثُمَّ ارْتَدَّ، وَمَاتَ عَلٰى رِدَّتِهٖ]]‘‘۔یعنی وہ اشخاص صحابہ میں داخل نہیں ہیں ،جنہوں نے ایمان کی حالت میں آپﷺ سے ملاقات کی ،لیکن پھر مرتد ہوگئےاور اُن کی موت حالتِ ارتداد میں ہی ہوئی،جیساکہ عبداللہ بن جحش نےاپنی اہلیہ حضرت اُم حبیبہ کےہمراہ اسلام قبول کیا تھا اور حبشہ کی طرف ہجرت بھی کی تھی لیکن پھر وہ مرتدہوگیا اور نصرانیت پر اُس کی موت واقع ہوئی، اِسی نوع سے عبداللہ بن خطل،ربیعہ بن اُمیہ بن خلف بھی تعلق رکھتے ہیں،کہ یہ بھی اسلام لانے کے بعد مرتد ہوگئے تھے۔
رہے وہ اشخاص جو نبی کریمﷺ پر ایمان لانے کے بعد مرتد ہوگئے تھے ،لیکن اُنہوں نے پھر دوبارہ اسلام قبول کرلیا تھا اور اسلام پر ہی اُن کی وفات ہوئی تھی،تو آیا ایسے لوگ صحابہ کی جماعت میں شامل ہونگے یا نہیں،اس حوالے سے تفصیل ہے:
(الف)	اگر ارتداد اور تجدیدِ اسلام دونوں ہی نبی کریمﷺ کے زمانے میں ہو ،پس اگراُس نے نبی کریمﷺ سےملاقات کرلی ہو ،تو وہ بالاجماع صحابی ہیں،جیساکہ عبداللہ بن ابی سرح،علامہ سیوطی فرماتے ہیں:
’’[[arabic: أَمَّا مَنْ رَجَعَ إِلَی الْإِسْلَامِ فِی حَیَاتِہٖ كَعَبْدِ اللّٰهِ بْنِ أَبِي سَرْحٍ، فَلَا مَانِعَ مِنْ دُخُولِہٖ فِی الصُّحْبَۃِ]]‘‘۔
ترجمہ:’’رہا وہ شخص جس نے نبی کریمﷺ کی حیات میں اسلام کی طرف رجوع کرلیا تھا جیساکہ عبداللہ بن ابی سرح ہیں،تو اُن کے صحابہ میں داخل ہونے سے کوئی چیز مانع نہیں ہے،(تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘اور اگر نبی کریمﷺ سے ملاقات نہ کی ہو تو فقہ حنفیہ کےقاعدے کی رُو سے ایسا شخص صحابہ میں`
},
{
  pageNumber: 55,
  text: `داخل نہیں ہوگا،جبکہ جمہورمحدثین اسے بھی صحابہ میں داخل مانتے ہیں۔
(ب)	ارتداد وتجدیدِ ایمان دونوں نبی کریمﷺ کے وصال فرمانے کے بعد ہوں۔
(ج)	ارتداد نبی کریمﷺ کے زمانے میں ہو اور تجدید اسلام آپ ﷺ کے وصال کے بعد ہو ، جیساکہ اَشعث بن قیس دس ہجری میں اپنی قوم کے ہمراہ نبی کریم ﷺ کی خدمت میں حاضر ہوئے اور اسلام قبول کیا اور پھر نبی کریمﷺ کےوصال کے بعد مرتد ہوگئے اور پھر حضرت ابوبکر کے عہدِ خلافت میں اسلام قبول کرلیا ۔مؤخر الذکر صورتوں کے متعلق ایسے شخص کے صحابی ہونے پر اتفاق ہے ۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَلَوِ ارْتَدَّ ثُمَّ عَادَ إِلَى الْإِسْلَامِ لٰكِنْ لَمْ يَرَهٗ ثَانِيًا بَعْدَ عَوْدِهٖ فَالصَّحِيحُ أَنَّهٗ مَعْدُودٌ فِي الصَّحَابَةِ لِإِطْبَاقِ الْمُحَدِّثِينَ عَلَى عَدِّ الْاَشْعَثِ بْنِ قَيْسٍ وَنَحْوِهٖ مِمَّنْ وَقَعَ لَهٗ ذٰلِكَ وَإِخْرَاجِهِمْ أَحَادِيثَهُمْ فِي الْمَسَانِيدِ]]‘‘۔
ترجمہ:’’پس اگر وہ مرتد ہوگیا اور پھر اسلام کی طرف لوٹ آیا ،لیکن اسلام لانے کے بعد دوبارہ نبی کریمﷺ کو نہیں دیکھا تو صحیح بات یہ ہے کہ اُس کا بھی صحابہ میں شمار کیا جائے گا ، کیونکہ محدثین کا اَشعث بن قیس اور ان جیسے دیگر اشخاص کے صحابی ہونے پر اتفاق ہے ، جوکہ اسلام لانےکے بعد مرتد ہوگئے تھے اور پھر انہوں نے اسلام قبول کرلیا تھا اور اُنہوں نےمسانید میں ان کی احادیث کی تخریج کی ہے،(فتح الباری ،ج7ص4)‘‘۔
خلاصہ بحث یہ ہے :
(۱)	جس نے ایمان کی حالت میں نبی ﷺ سے ملاقات کی اور ان کی وفات ایمان پر ہوئی ،اگر خدانخواستہ درمیان میں مرتد ہوگیا ہو ،لیکن اللہ تعالیٰ کی توفیق سے توبہ کرکے پھر اسلام قبول کرلیا اور اسلام کی حالت میں وفات ہوئی،وہ صحابی ہے۔
(۲)	محدثین کرام کے نزدیک معروف تعریف یہ ہے کہ وہ خوش نصیب جس نے ایمان کی حالت میں رسول اللہ ﷺ کی زیارت کی ہو ،بعض اصولیّین نے اس میں یہ اضافہ کیا ہے`
},
{
  pageNumber: 56,
  text: `کہ متابعت کے ساتھ رسول اللہ ﷺ کے ساتھ طویل صحبت اختیار کی ہو،حضرت سعید بن مسیّب نے یہ اضافہ کیا ہے کہ ایک یادوبرس ایک یا دو غزوات میں آپ ﷺ کے ساتھ صحبت رہی ہو ،لیکن یہ ضعیف قول ہے،کیونکہ اس قول کی بنیادپر لازم آئے گا کہ حضرت جریر بن عبداللہ البجلی اور وائل بن حجر ایسے اصحاب صحابیت کی تعریف سےخارج ہو جائیں گے ، حالانکہ وہ بالاتفاق صحابی ہیں۔
(۳) رسول اللہ ﷺ کی رؤیت یا دیدار سے محض رؤیت عینی مراد نہیںہے ورنہ نابینا ہونے کے سبب حضرت عبداللہ ابن ام مکتوم ایسے حضرات صحابیت کی تعریف سے خارج ہوجائیں گے ،پس ان کے لیے محض ملاقات اور صحبت کافی ہوگی ،کیونکہ وہ رؤیت عینی کے مکلف ہی نہیں ہیںاور یہ بالاتفاق صحابی ہیں،جیسے عدم قدرت کے سبب گونگا شخص نماز میں قراءت لفظی کا مکلّف نہیں ہے ۔
(۴) وہ لوگ صحابی نہیں جنہوںنے کفر کی حالت میں آپ ﷺکی زیارت کی ،پھر آپ کے وصال مبارک کے بعد اسلام قبول کیا ،جیساکہ قیصرکاقاصد۔
(۵)	 جنات بھی انسانوں کی طرح مکلف ہیں اور ان میں مومن اور منکر دونوں قسم کے افراد ہیں ،لہٰذا ان میں سے جنہوں نے حیات ظاہری میں ایمان کی حالت میں آپ ﷺ کی زیارت کی ،وہ صحابی ہیں۔
(۶) 	اسی طرح ایسے بچے جنہوں نے شیرخوارگی یا بچپن کے لاشعوری دور میں آپ ﷺ کودیکھا اور ان کے شعوری دور سے پہلے آپﷺ نے وصال فرمالیا،آپﷺ نے بعض بچوں کو اپنے لعاب دہن مبارک میں چبائی ہوئی کھجور یا مٹھاس  ملاکر گھٹی دی ،یہ بچے تبعاً صحابہ میں شمار ہوتے ہیں،کیونکہ بچے اپنے آباء یا اختلاف دین کی صورت میںخیرالآباء کے تابع ہوتے ہیں،لیکن اگر یہ کوئی حدیث بیان کریںتو وہ مرفوع نہیں ہوگی ،بلکہ مرسلِ مقبول ہوگی۔
(۷)عہدرسالت ﷺ کے ایسے مجنو ن ،جن کے آباءدونوں یا کوئی ایک مسلمان`
},
{
  pageNumber: 57,
  text: `تھا،تبعاًمسلمان سمجھے جائیںگےاور ان کی طرف صحابیت کی نسبت کی جاسکے گی ۔
(۸)ملائکہ اگرچہ مکلّف نہیں ہیں ،لیکن اگر انہوںنے حیات ظاہری میں آپ کی زیارت کی ہے ،تو مختار قول کے مطابق وہ بھی صحابہ میں شمار ہوں گے ،امام النحو علامہ غلام جیلانی کی توجیہ کے مطابق وہ صحابی کہلائے جاسکتے ہیں ،اس پر یہ سوال وارد ہوتا ہے کہ ملائک تو معصوم ہیں ، انہیں نسبت صحابیت سے کیافیض متوقع ہوسکتا ہے،اس کی بابتعلامہ غلام جیلانی میرٹھی رحمہ اللہ تعالیٰ نے لکھا: ’’ان کے درجات بلند ہوسکتے ہیں‘‘۔
(۹)صحابیت کی نسبت کا تعلق صرف ذوی العقول سے ہوتا ہے ،غیرذوی العقول ،جیسے جمادات ،نباتات،حیوانات وغیرہ جن سے حیات ظاہری میں آپﷺ کو واسطہ پڑا ، آپ کی نسبت سے متبرک ہوںگے،لیکن ان کی طرف صحابیت کی نسبت نہیں کی جاسکے گی۔

[[heading: کیا ورقہ بن نوفل صحابی تھے]]
سوال:
حضرت ورقہ بن نوفل کی نبی کریم ﷺ سے ملاقات ثابت ہےاوربعض روایات میں ان کے ایمان اورتصدیق بالرسالت کا بھی ذکر ہے،تو سوال یہ ہے کہ کیاان کو بھی صحابیت کا شرف حاصل ہے، (نیازاحمد ، جہلم )۔
جواب: 
ورقہ بن نوفل بن اسد بن عبدالعزیٰ بن قُصَیّ القرشی الاسدی نبی کریم ﷺ کی زوجہ محترمہ ام المومنین حضرت خدیجۃ الکبریٰ رضی اللہ عنہا کےرشتے میں چچا زاد تھے ۔حضرت ورقہ بن نوفل ایمان لائے تھے یانہیں اور آیا وہ صحابی ہیں یا نہیں ،اس کے بارے میں متعدد اقوال ہیں:
علماء کے ایک گروہ کا یہ کہنا ہے کہ حضرت ورقہ، زید بن عمرو بن نفیل کی طرح دین حنیف اور ملت ابراہیمی کے پیروکار تھے اور بعض نے یہ کہا ہے کہ آپ نے نصرانیت کو اختیار کیا تھا اوروہ صحیح بخاری کی اس حدیث سے استدلال کرتے ہیں،جس میں ابتدائے وحی کے احوال بیان کیے گئے ہیںکہ جب حضرت خدیجہ رضی اللہ عنہا رسول اللہ ﷺ کو ورقہ بن نوفل کے پاس لے گئیں۔ اس میں یہ تصریح ہے کہ انہوں نے زمانہ جاہلیت میں بت پرستی سے متنفر ہوکرنصرانیت اختیار کی تھی اور ان کے پاس تورات کا علم تھا،اس بات میں کوئی شک نہیں کہ حضرت ورقہ مُوَحِّد تھے، بتوں کی عبادت سے متنفر تھے ، ملت ابراہیمی کے پیرو کار تھے اورانہوں نصرانیت کو اختیارکرلیا تھا ،لیکن ان کی وفات نصرانیت پر ہوئی یا اسلام پر اور آیا وہ`
},
{
  pageNumber: 58,
  text: `صحابی ہیںیا نہیں ، اس میں اختلاف ہے۔ حضرت عائشہ کی روایت کردہ حدیث میں ہےکہ حضرت ورقہ کی وفات نصرانیت پر ہوئی، لیکن یہ صحیح نہیں ہے، کیونکہ یہ حدیث عثمان بن عطا ءخراسانی کی سند سے روایت ہے اور علماء حدیث کے نزدیک عثمان ایک ضعیف راوی ہیں،علامہ ابن حجر لکھتے ہیں: اور ایک روایت میں جو یہ لفاظ آئے ہیں :’’[[arabic: فَمَاتَ وَرَقَۃُعَلٰی نَصرَانِیَّتِہٖ لٰکِن عُثمانَ ضَعِیْف]]‘‘۔
ترجمہ:’’پس ورقہ کا انتقال دین نصرانیت پر ہوا ،لیکن یہ روایت ضعیف ہے،کیونکہ یہ عثمان بن عطاء خراسانی کی روایت ہے اور انہیںمحدثین نے ضعیف قرار دیا ہے،(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ :ج:6،ص:476) ‘‘۔اس لیے یہ بات ثابت ہوگئی کہ ان کی وفات اسلام  پرہی ہوئی ہے اور اس کی تائید ابتدائے وحی والی حدیث سے بھی ہوتی ہے ، جس میں ہے کہ رسول اللہ ﷺ  کاواقعہ سن کر انہوں نے جواب دیا:
’’[[arabic: ہٰذَا النَّامُوْسُ الَّذِیْ نَزَّلَ اللَّہُ عَلٰی مُوْسٰی، یَا لَیْتَنِیْ فِیْہَا جَذَعًا، لَیْتَنِیْ أَکُوْنُ حَیًّا إِذْ یُخْرِجُکَ قَوْمُکَ]]‘‘۔
ترجمہ:’’یہ تو وہی ناموس (معزز راز داں فرشتہ) ہے ،جسے اللہ نے موسیٰ علیہ السلام پر وحی دے کر بھیجا تھا، کاش کہ جب اعلان نبوت کے موقع پر آپ کی قوم آپ کو وطن سے نکالے گی، میں جوان عمر ہوتا (اور آپ کی مدد کرتا)،(بخاری:3)‘‘۔
علامہ ابن حجر لکھتے ہیں:’’[[arabic: فَہٰذَا ظَاہِرُہٗ اَنَّہٗ اَقَرَّ بِنُبُوتِہٖ]]‘‘۔ترجمہ:’’اس کا ظاہری مفہوم یہی ہے کہ حضرت ورقہ نے آپ ﷺ کی نبوت کا اقرارکرلیا تھا‘‘۔`
},
{
  pageNumber: 59,
  text: `(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج:6،ص:675)
علامہ آجری اور علامہ بیہقی حدیث ذکر کرتے ہیں:
’’[[arabic: فَقَالَ لَہٗ وَرَقَۃُ: اَبْشِرْ، ثُمَّ اَبْشِرْ، فَاَنَا اَشہَدُ اَنَّکَ الَّذِیْ بَشّر بہٖ ابنُ مریم، وَإِنَّکَ عَلٰی مِثلِ نَامُوسِ مُوسٰی، وإنَّکَ نبَیٌّ مُرسَل، وَإِنَّکَ سَوفَ تُؤمَرُ بِالجِہَادِ بَعدَ یَومِکَ ہٰذَا، وَإِن یُّدرِکنِی ذٰلِکَ لاُجَاہِدَنّ مَعَکَ. فَلَمَّا ُتوُفِّیَ قَالَ رَسُولُ اللّٰہِ ﷺ: لَقَد رَاَیتُ الْقَسَّ فِی الْجَنَّۃِ عَلَیْہِ ثِیَابُ الْحَرِیْرِ،لِاَنَّہٗ آمَنَ بِی وَصَدَّقَنِی]]‘‘۔
ترجمہ:’’ورقہ نے جواب میں کہا:بشارت ہو ،پھر بشارت ہو، میں گواہی دیتا ہوں کہ آپ وہی نبی ہیں جس کی بشارت عیسیٰ بن مریم نے دی تھی اور آپ کی شریعت موسیٰ کی شریعت کی مانند ہوگی اور میں شہادت دیتا ہوں کہ آپ نَبِیِّ مُرسَل ہیں اور عنقریب ا ٓپ کوجہاد کا حکم دیا جائے گا ،اگر میں نے اس وقت کو پالیا تو میں آپ کے ساتھ مل کر جہاد کروںگا،جب وہ فوت ہوگئے، تو رسول اللہ ﷺ نے فرمایا:میں نے ورقہ کو جنت میںریشمی لباس میں دیکھا، کیونکہ وہ مجھ پر ایمان لائے تھے اور انہوں نے میری تصدیق کی تھی‘‘۔
(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج:6،ص:675)
علامہ بیہقی نے اس روایت کو منقطع قرار دیا ہے، لیکن جمہور علماء کے نزدیک انقطاع سے صحت اور حجیت میں کچھ خلل نہیں آتا،علامہ علی القاری لکھتے ہیں:
’’[[arabic: وَقَالَ أَبُو دَاوٗدَ:ہٰذَا مُرْسَل: أَيْ: نَوْعٌ مُرْسَلٌ وَہُوَ الْمُنْقَطِعُ لٰکِنَّ الْمُرْسَلَ حُجَّۃٌ عِنْدَنَا وَعِنْدَ الْجُمْہُورِ]]‘‘۔
اور ابودائود نے کہا: یہ حدیث مرسل یعنی منقطع ہے، جو مرسل کی قسم ہے، لیکن ہمارے اور جمہور علماء کے نزدیک مرسل حجت ہے،(مرقاۃ :ج:1،ص:368)‘‘اور ایک روایت میں جو ا لفاظ آئے ہیں :’’[[arabic: فَمَاتَ وَرَقَۃُ عَلٰی نَصْرَانِیَّتِہٖ لٰکِنْ عُثْمَانُ ضَعِیْف]]‘‘۔پس ورقہ کا انتقال دین نصرانیت پر ہوا ،لیکن یہ روایت ضعیف ہے کہ عثمان بن عطاء خراسانی اس کے`
},
{
  pageNumber: 60,
  text: `راوی ہیںجن کو علماء نے ضعیف قرار دیا ہے‘‘۔
(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ :ج:6،ص:476) 
حضرت ورقہ کے جنتی ہونے کے بارے میںکتب احادیث میں متعدد روایات موجود ہیں،جو ان کے مومن ہونے پر دلالت کرتی ہیں:
’’[[arabic: عَنْ عَائِشَۃَ، أَنَّ خَدِیْجَۃَ سَاَلَتْ رَسُوْلَ اللہِ ﷺعَنْ وَرَقَۃَ بْنِ نَوْفَلٍ، فَقَالَ:قَدْ رَأَیْتُہٗ فِی الْمَنَامِ، فَرَأَیْتُ عَلَیْہِ ثِیَابُ بَیَاضٍ، فَاَحْسِبُہٗ لَوْ کَانَ مِنْ أَہْلِ النَّارِ، لَمْ یَکُنْ عَلَیْہِ بَیَاضٌ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں :حضرت خدیجۃ الکبریٰ رضی اللہ عنہا نے حضرت ورقہ کے بارے میں نبی ﷺ سے پوچھا : تو آپ ﷺ نے فرمایا: میں نے ان کو خواب میں اس حال میں دیکھا کہ ان کے جسم پر سفید لباس تھا ،میرا گمان ہے (کہ وہ جنتی ہیں)اگر وہ اہل جہنم  میںسے ہوتے تو ان کے جسم پر سفید لباس نہ ہوتا ، (مسند احمد:24367 )‘‘۔
امام ابویعلیٰ روایت کرتے ہیں:
’’[[arabic: عَنْ جَابِرِ بْنِ عَبْدِ اللَّہِ: سُئِلَ عَنْ وَرَقَۃَ بْنِ نَوْفَلٍ، قَالَ: أَبْصَرْتُہٗ فِی بُطْنَانِ الْجَنَّۃِ عَلَیْہِ سُنْدُسٌ]]‘‘۔
ترجمہ:’’حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ ﷺ سے حضرت ورقہ کے بارے میں پوچھا گیا :تو آپﷺ نے فرمایا:میں نے ان کو جنت کےنشیب میں ریشمی لباس پہنے دیکھا،(مسند ابی یعلٰی:2047)‘‘۔
’’[[arabic: عَنْ عَائِشَۃَ رَضِیَ اللَّہُ عَنْہَا: أَنَّ النَّبِیَّ ﷺ قَالَ: لَا تَسُبُّوْا وَرَقَۃَ فَإِنِّی رَأَیْتُ لَہٗ جَنَّۃً أَوْ جَنَّتَیْنِ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں:نبی ﷺ نے فرمایا:ورقہ کو برا نہ کہو،کیونکہ میں نے ان کے لیے ایک جنت یا دو جنتیں دیکھی ہیں،(مستدرک للحاکم: 4211)‘‘۔
الغرض حضرت ورقہ کا ایمان ثابت ہے ،لیکن صحابی ہونے میں اختلاف ہے ا ور علماء کی`
},

{
  pageNumber: 61,
  text: `ایک جماعت کا موقف یہ ہے کہ حضرت ورقہ آپ ﷺ کی بعثت یعنی عَلانیہ دعوت سے پہلے وفات پاچکے تھے ،حدیث میں ہے:
[[arabic: فَقَالَ لَہٗ وَرَقَۃُ: ہٰذَا النَّامُوسُ الَّذِی نَزَّلَ اللّٰہُ عَلٰی مُوسٰی، یَا لَیْتَنِی فِیْہَا جَذَعًا، لَیْتَنِی أَکُوْنُ حَیًّا إِذْ یُخْرِجُکَ قَوْمُکَ، فَقَالَ رَسُوْلُ ﷺ: أَوَ مُخْرِجِیَّ ہُمْ، قَالَ: نَعَمْ، لَمْ یَاْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِہِ إِلَّا عُوْدِیَ، وَإِنْ یُدْرِکْنِی یَوْمُکَ أَنْصُرْکَ نَصْرًا مُؤَزَّرًا، ثُمَّ لَمْ یَنْشَبْ وَرَقَۃُ أَنْ تُوُفِّیَ، وَفَتَرَ الوَحْیُ]]
ترجمہ: ’’یہ تو وہی ناموس (معزز راز داں فرشتہ) ہے ،جسے اللہ نے موسیٰ علیہ السلام پر وحی دے کر بھیجا تھا، کاش میں آپ کی دعوت کے شروع ہونے پر جوان عمر ہوتا، کاش میں اس وقت تک زندہ رہتا جب کہ آپ کی قوم آپ کو اس شہر سے نکال دے گی،رسول اللہ ﷺنے یہ سن کر تعجب سے پوچھا : کیا وہ لوگ مجھ کو نکال دیں گے، ورقہ نے کہا:ہاں جو شخص بھی آپ کی طرح دعوت حق لے کر آیا ، اس کے عہد کے لوگوں نے اس سے عداوت کی ،اگر میں نے آپ کی دعوت کا زمانہ پایا ،تو میں پوری قوت سے آپ کی مدد کروں گا ، مگر پھرکچھ عرصہ بعد ورقہ وفات پاگئے اور وحی کا سلسلہ کچھ عرصے تک منقطع رہا ، (بخاری:3)‘‘۔
علامہ ابن حجر لکھتے ہیں:
[[arabic: فَہٰذَا ظَاہِرُہٗ اَنَّہٗ اَقَرَّ بِنُبُوَّتِہٖ، وَلٰکِنَّہٗ مَاتَ قَبْلَ اَنْ یَّدْعُوَرَسُوْلُ اللّٰہِ ﷺ النَّاسَ إِلَی الِإسلَامِ، فَیَکُوْنُ مِثْلَ بَحِیْرَاوَفِی إِثبَاتِ الصُّحْبَۃِ لَہٗ نَظَر]]
ترجمہ: ’’اس کا ظاہرمفہوم یہی ہے کہ انہوں نے نبوت کا اقرار کیا تھا، لیکن وہ رسول اللہ ﷺ کے لوگوں کودعو ت عام دینے سے پہلے وفات پا گئے ، تو وہ بَحیرا راہب کی طرح ہوگئے اور ان کی صحابیت کا ثبوت مَحَلِّ نظر ہے، (الاصابۃ:ج:6،ص: 475)‘‘۔
مومن یا مسلم اسی شخص کو کہتے ہیں، جس نے دعوت کے بعد اسلام قبول کیا ہو، حضرت ورقہ دعوت سے پہلے انتقال کرنے کے سبب جب مسلم نہیں ہوئے ،تو صحابی نہیں ہوسکتے کہ صحابی کی تعریف میں مسلم ہونے کی قید ہے ،ہا ں اہل فترت میں سے ہیں، جیسے بحیرا راہب`
},
{
  pageNumber: 62,
  text: `اور دَلَائِلُ النُّبُوَّۃ کی مذکورہ بالا روایت میں ان کے آپﷺ پر ایمان لانے اور تصدیق کا جو ذکر ہے ،اس میں یہ احتمال بھی ہے کہ وہ تصدیق دعوت سے پہلے کی ہو،لیکن حضرت ورقہ کی وفات کا سن اس بات پر دلالت کرتا ہے کہ وہ خفیہ دعوت کے بعد فوت ہوئے اور اس صورت میں آپ صحابی ہیں ، علامہ حلبی حضرت ورقہ کی سن وفات کے متعلق لکھتے ہیں :
[[arabic: فَفِی الْإِمْتَاعِ: اَنَّ وَرَقَۃَ مَاتَ فِی السَّنَۃِ الرَّابِعَۃِ مِنَ الْمَبعَثِ]]
ترجمہ: ’’اور ’’امتاع‘‘ میں ہے: حضرت ورقہ بعثت کے چوتھے سال وفات پاگئے تھے، (سِیْرَتُ الْحَلْبِیَۃ:ج:1 ،ص: 357 )‘‘۔ اس سے ثابت ہوا کہ حضرت ورقہ نے خفیہ دعوت کا زمانہ پایا تھا اور ان کی زندگی میں وحی کا نزول تین سال تک موقوف رہنے کے بعد جاری بھی ہوگیا تھا، علامہ حلبی لکھتے ہیں:
[[arabic: وَفِیْ کَلَامِ صَاحِبِ کِتَابِ الْخَمِیْسِ فِی الصَّحِیْحَیْنِ اَنَّ الْوَحْیَ تَتَابَعَ فیِ حَیَاۃِ وَرَقَۃَ وَاَنَّہٗ آمَنَ بِہٖ]]
ترجمہ: ’’اور کتاب الخمیس کے مصنف کے قول کے مطابق صحیحین میں ہے : ورقہ کی زندگی میں نزول وحی کا سلسلہ (انقطاع کے بعد) دوبار ہ شروع ہوگیا تھا اور وہ آپ ﷺ پر ایمان لائے تھے، (سِیْرَتُ الْحَلْبِیَۃ:ج:1،ص:359)‘‘۔
پس یہ بات ثابت ہوچکی ہے کہ آپ نے عَلانیہ دعوت کا زمانہ بھی پایا ہے، چناچہ علامہ ابن حجر لکھتے ہیں:
[[arabic: عَنْ عُرْوَۃَ بنِ الزُّبَیْرِ، قَالَ: کاَنَ بِلَال لِجَارِیَۃٍ مِنْ بَنِی جُمَح، وَکَانُوا یُعَذِّبُونَہٗ بِرَمضَاءِ مَکَّۃَ یَلْصِقُوْنَ ظَہْرَہٗ بِالرَّمْضَاءِ لِکَیْ یُشْرِکَ ،فَیَقُولُ: أَحَد، اَحَدْ، فَیَمُرُّ بِہٖ وَرَقَۃُ وَہُوَ عَلٰی تِلکَ الحَالِ، فَیَقُوْلُ: أََحَد أََحَد یَا بِلَالَ، وَاللّٰہِ لَئِنْ قَتَلتُمُوْہُ لاَتَّخذَِنَّہٗ حَنَّانًا، وَہٰذَا مُرسَل جَیِّد، یَدُلُّ عَلٰی اَنَّ وَرَقَۃَ عَاشَ إِلٰی اَن دَعَا النَّبِیُّ ﷺ إِلَی الْإسْلَامِ حَتّٰی اَسْلَمَ بِلَالٌ وَالْجَمْعُ بَینَ ہٰذَا وَبَیْنَ حَدِیْثِ عَائِشَۃ َأَن یُّحْمَلَ قَولُہٗ: وَلَمْ یَنْشَبْ وَرَقَۃُ اَن تُوُفِّیَ، اَیْ قَبْلَ اَن یَّشتَہِرَ الِإسلَامُ وَیُؤمَرَ النَّبِیُّ ﷺ بِالجِہَاد]]`
},
{
  pageNumber: 63,
  text: `ترجمہ: حضرت عروہ بن زبیر رضی اللہ عنہ بیان کرتے ہیں :حضرت بلال بنی جمح کے مظالم کا شکار تھے اور وہ انہیں مکہ کی شدید دھوپ میں گرم زمین پر لٹا کر اذیت دیتے تھے تاکہ وہ اسلام چھوڑ کر مشرک ہوجائیں، پس بلال ’’احد احد‘‘ کہتے تھے ، اس حال میں حضرت ورقہ کا ان کے پاس سے گزر ہوتا ، تو وہ کہتے: اے بلال ’’احد، احد‘‘ اور کفار سے کہتے: بخدا اگر تم نے ان کو قتل کردیا تو میں اس کی قبر کو برکت حاصل کرنے کی جگہ بنادوں گا اور یہ حدیث عمدہ مرسل ہے اور اس بات پر دلالت کرتی ہے کہ حضرت ورقہ نبی ﷺ کی اسلام کی طرف دعوت عام تک زندہ رہے ،حتی کہ بلال اسلام لائے اور اس حدیث اورحضرت عائشہ رضی اللہ عنہا کی حدیث میں تطبیق کی صورت یہ ہے : ’’حضرت ورقہ زیادہ عرصہ زندہ نہ رہے اور وفات پاگئے‘‘، اس قول کو اس پر محمول کریں گے کہ اسلام کے مشتہر ہونے اور جہاد کا حکم آنے سے پہلے وہ فوت ہوگئے، (اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج؛۶ ،ص۴۷۶)‘‘۔
اور حضرت بلال کو اذیت دینے کا عمل علانیہ دعوت کے بعد شروع ہوا تھا ،علامہ حلبی ان کی صحابیت کے بارے تصریح کرتے ہیں:
[[arabic: وَحَیْثُ أَدْرَکَ الرِّسَالَۃَ فَقَدْ أَسْلَمَ، وَحِیْنَئِذٍ یَکُوْنُ صَحَابِیًّا]]
ترجمہ: ’’اور جب دعوت عام کا زمانہ پایا تو مسلمان ہوئے اور جب اسلام ثابت ہوگیا تو اس صورت میں صحابی ہوگئے ،(سِیْرَتُ الْحَلْبِیَۃ:ج:1،ص:360 )‘‘۔
مندرجہ بالا تمام روایات کی روشنی میں خلاصہ کلام یہ ہے حضرت ورقہ بن نوفل کے بارے میں مختلف اقوال ہیں:
(۱) آپ کی وفات دین نصرانیت پر ہوئی ،لیکن یہ قول ضعیف ہے ۔
(۲) آپ کی وفات ایمان واسلام پر ہوئی اور آپ ﷺ کی دعوت عام سے پہلے ہوئی اور ان کے حسن عاقبت کی بشارات احادیث اور روایات میں موجود ہیں اور یہ قول یقیناً راجح ہےعلامہ ابن حجر نے صحابیت کے قول کے بارے میں کہا: یہ محل نظر ہے۔
(۳) انہوں نے دعوت عام کا ابتدائی دور پایا ہے،حضرت بلال کا واقعہ اس پر شاہد ہے،لہٰذا`
},
{
  pageNumber: 64,
  text: `وہ صحابی ہیں ،علامہ حلبی،علامہ طبری،علامہ بغوی اور ابن السکن اسی کے قائل ہیں شارح بخاری علامہ غلام جیلانی میرٹھی رحمہ اللہ تعالیٰ نے اسی کو راجح قرار دیا ہے۔علامہ غلام رسول سعیدی رحمہ اللہ تعالیٰ نے نعمۃ الباری فی شرح البخاری: ج:۱،ص:۱۳۷ میں تمام اقوال نقل کردیے ہیں لیکن صحابیت کے قول کو راجح قراردینے کی بابت کو ئی تصریح نہیں کی اور نہ اسے رد کیا ہے ،واللہ اعلم بالصواب۔ حاصل کلام یہ کہ جہاں کسی مسئلے کے بارے میں ایک سے زائد اقوال ہوں اور کسی ایک کو اختیار کرنے سے کوئی شرعی خرابی لازم نہ آئے، وہاں مسئلے کے تمام پہلوئوں کی نشاندہی کر کے کسی ایک قول کو قطعی اور حتمی قرار دینے کے بجائے اہلِ علم پر چھوڑ دینا چاہیے، کیونکہ کبھی مقابلہ حق اور باطل یا صحیح اور غلط میں ہوتا ہے اور کبھی بہ اور بہتر میں یا راجح اور مرجوح میں ہوتا ہے۔

[[heading: ملک الموت کا کیا نام ہے]]

سوال:
ملک الموت کاکیانام ہے؟،(منوراحمد ،ملیر کراچی)۔
جواب:
اللہ تعالیٰ کا ارشاد ہے:
[[arabic: قُلْ يَتَوَفّٰكُمْ مَّلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ ثُمَّ إِلَى رَبِّكُمْ تُرْجَعُونَ]]
ترجمہ: ’’آپ کہیے: تمہیں موت کا فرشتہ وفات دیتا ہے جو تم پر مقرر ہے ،پھر تم اپنے رب کی طرف لوٹائے جائو گے،(السجدہ:11)‘‘۔
علامہ ابن کثیر رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: وَاَمَّا مَلَکُ الْمَوْتِ فَلَیْسَ بِمُصَرَّحٍ بِاسْمِہٖ فِی الْقُرْاٰنِ وَلَا فِی الْاَحَادِیْثِ الصِّحَاحِ وَقَدْ جَاءَ تَسْمِیَتُہٗ فِی بَعْضِ الْاٰثَارِ بِعِزْرَائِیلَ]]
ترجمہ: ’’ملک الموت کا نام قرآن اور صحیح احادیث میں صراحت کے ساتھ بیان نہیں ہوا،البتہ بعض آثار میں اُن کا نام عزرائیل آیا ہے، (البدایہ والنہایہ، ج:1،ص:49)‘‘۔`
},
{
  pageNumber: 65,
  text: `السجدہ:11کی تفسیر میں مزید لکھتے ہیں:
[[arabic: وَقَدْ سُمِّیَ فِیْ بَعْضِ الْاٰثَارِ بِعِزْرَائِیْلَ وَہُوَ الْمَشْہُوْرُ، قَالَہٗ قَتَادَۃُ وَغَیْرُ وَاحِدٍ وَلَہٗ اَعْوَانٌ]]
ترجمہ: ’’بعض آثار میں اُن کا نام عزرائیل آیا ہے اور یہی مشہور ہے اور قتادہ اور کئی محدثین نے کہا:اُن کے مددگار (دیگر فرشتے) بھی ہوتے ہیں،(تفسیر ابن کثیر، ج: 6ص : 322)‘‘۔ حضرت عزرائیل کے تحت قبضِ ارواح کے شعبے سے اور بھی فرشتے وابستہ ہیں ۔
علامہ محمود آلوسی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: وَالَّذِیْ ذَہَبَ إِلَیْہِ الْجَمْہُوْرُ اَنَّ مَلَکُ الْمَوْتِ لِمَنْ یَّعْقِلُ وَمَا لَا یَعْقِلُ مِنَ الْحَیَوَانِ وَاحِدٌ وَہُوَ عِزْرَائِیْلُ وَمَعْنَاہُ عَبْدُ اللّٰہِ]]
ترجمہ: ’’جمہور کا قول یہ ہے کہ ذی عقل اور غیر ذی عقل جانداروں کے لیے ملک الموت ایک ہی ہیں اوروہ عزرائیل ہیں اور عزرائیل کے معنی ہیں: اللہ کا بندہ، (روح المعانی، ج:11،ص:124)‘‘۔
علامہ ابوعبداللہ محمد بن احمد قرطبی رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: قَالَ عَبْدُ الرَّحْمٰنِ بْنُ سَابِطٍ:تَدْبِیْرُ اَمْرِ الدُّنْیَا إِلٰی اَرْبَعَۃٍ، جِبْرِیْلَ وَمِیْکَائِیْلَ وَمَلَکِ الْمَوْتِ وَاسْمُہٗ عِزْرَائِیْلُ وَإِسْرَافِیْلَ، فَاَمَّا جِبْرِیْلُ فَمُوَکَّلٌ بِالرِّیَاحِ وَالْجُنُوْدِ، وَاَمَّا مِیْکَائِیْلُ فَمُوَکَّلٌ بِالْقَطْرِ وَالنَّبَاتِ، وَاَمَّا مَلَکُ الْمَوْتِ فَمُوَکَّلٌ بِقَبْضِ الْاَنْفُسِ فِی الْبَرِّ وَالْبَحْرِ، وَاَمَّا إِسْرَافِیلُ فَہُوَ یَنْزِلُ بِالْاَمْرِ عَلَیْہِمْ، وَلَیْسَ مِنَ الْمَلَائِکَۃِ اَقْرَبُ مِنْ إِسْرَافِیلَ، وَبَیْنَہٗ وَبَیْنَ الْعَرْشِ مَسِیْرَۃُ خَمْسِمِائَۃِ عَامٍ]]
ترجمہ: ’’عبدالرحمن بن سابط نے کہا: دنیا کے (تکوینی) امور کی تدبیر چار فرشتوں کے ذمے ہے ،(وہ ہیں:) جبریل، میکائیل اور ملک الموت اور اُن کا نام عزرائیل ہے اور اسرافیل علیہم السلام، جبریل ہوائوں اور لشکروں پر مقرر ہیں اور میکائیل بارش اور نباتات پر مقرر ہیں اور ملک الموت برّوبحر میں روحیں قبض کرنے پر مقرر ہیں اور اسرافیل ان فرشتوں پر (اللہ کا)`
},
{
  pageNumber: 66,
  text: `حکم لے کر نازل ہوتے ہیں اور ملائکہ میں سب سے زیادہ (عرش کے) قریب اسرافیل ہیں اور اُن کے اور عرش کے درمیان پانچ سو سال کا فاصلہ ہے۔
(تفسیر قرطبی ، ج:19، ص: 194)
مذکورہ بالا مفسرین کے کلام سے یہ بات ثابت ہوتی ہے کہ قرآن کریم و احادیث صحیحہ میں ملک الموت کا نام مذکور نہیں ہے، البتہ بعض آثار صحابہ و تابعین میں ملک الموت کا نام عزرائیل آیا ہے اور جمہور کے نزدیک یہی معروف و مشہور ہے۔`
},
 {
  pageNumber: 67,
  text:`[[heading: طہارت کے مسائل]]`
 }, 

 {
  pageNumber: 69,
  text: `[[heading: ٹھوس نجاست سے آلودہ خشک زمین کا حکم]]
سوال:
زمین پر ٹھوس نجاست لگ گئی، پھر وہ نجاست خشک ہو گئی، کیا اب اس پر تیمم کیا جا سکتا ہے، (حیدر علی)۔
جواب:
زمین پر کوئی ٹھوس نجاست گری، جیسے: انسان کا براز (پاخانہ)، جانور کی گوبر وغیرہ اور خشک ہو گئی، اگر وہ ٹھوس نجاست وہاں موجود ہے تو اس سے تیمم نہیں کر سکتے، کیونکہ وہ عین نجاست ہے، علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اَلْاَرْضُ إِذَا أَصَابَتْہَا النّجَاسَۃُ فَیَبِسَتْ وَذَہَبَ أَثرُہَا لَایَجُوْزُ التَّیَمَّمُ بِہَا، کَذَا فِیْ فَتَاوٰی قَاضِیْ خَان]]‘‘۔
ترجمہ: ’’زمین کو نجاست پہنچی اور خشک ہو گئی اور اس کا اثر زائل ہو گیا، (تب بھی) اس سے تیمم جائز نہیں ہے، ’’فتاویٰ قاضی خان‘‘ میں اسی طرح ہے، (فتاویٰ عالمگیری، ج: 1، ص: 26)‘‘۔ ایسی جگہ پر نماز ادا کر سکتے ہیں۔ اگر کسی انسان یا جانور نے پیشاب کیا اور سورج کی گرمی سے وہ زمین خشک ہو گئی ہو، تو اس پر نماز پڑھ سکتے ہیں، کیونکہ مائع (Liquid) کا ٹھوس وجود نہیں ہوتا اور وہ دھوپ کی حرارت سے بخارات بن کر اُڑ جاتا ہے۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’[[arabic: فَتَاوَى الْحُجَّةِ]]‘‘ میں ہے: کپڑے کو جسم رکھنے والی نجاست پہنچی اور خشک ہو گئی تو رگڑنے سے پاک ہو جاتا ہے، جس طرح موزہ پاک ہو جاتا ہے، ’’مضمرات‘‘ میں اسی طرح ہے۔ ایک مسئلہ یہ ہے: زمین خشک ہونے اور نجاست کا اثر زائل ہونے سے نماز کے لیے پاک ہو جاتی ہے، تیمم کے لیے نہیں، اس سے کوئی فرق نہیں پڑتا کہ دھوپ سے خشک ہوئی یا آگ سے یا ہوا اور سائے سے، ’’کافی‘‘ اور ’’البحر الرائق‘‘ میں اسی طرح ہے، (فتاویٰ عالمگیری، ج: 1، ص: 44)‘‘۔`
},
{
  pageNumber: 70,
  text: `[[heading: طہارت کا ایک مسئلہ]]
سوال:
کموڈ استعمال کرتے وقت پاکی کیسے حاصل کریں، نماز ہو جائے گی یا نہیں؟، (غلام مرتضیٰ، لاہور)۔
جواب:
استنجا کرنے کے لیے کموڈ استعمال کرنا درست ہے، کموڈ پر بیٹھتے وقت آدمی کے بدن کا جو حصہ کموڈ سے مس کرتا ہے، اگر اس پر ناپاک چھینٹے ہوں تو ٹشو پیپر یا کسی چیز سے اسے خشک کر لیں۔ کموڈ ایسے اجزا سے بنا ہوتا ہے جو مسام دار نہیں ہوتے اور اس میں پانی جذب نہیں ہوتا، اس لیے اگر اس پر بالفرض ناپاک قطرے ہوں تو ٹشو سے خشک کرنے سے وہ صاف ہو جاتا ہے۔ استنجا پانی سے کیا جا سکتا ہے، کیونکہ آج کل مسلم شاور دستیاب ہیں اور صفائی میں مبالغے اور احتیاط کے لیے ٹشو پیپر بھی استعمال کر سکتے ہیں۔ مسجد قبا والوں کے لیے قرآن کریم میں تعریفی کلمات آئے ہیں، فرمایا:
’’[[arabic: لَمَسْجِدٌ أَسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ اَحَقُّ أَنْ تَقُوْمَ فِيهِ فِيْهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا وَاللَّهُ يُحِبُّ الْمُطَاهِرِينَ]]‘‘۔
ترجمہ: ’’البتہ جس مسجد کی بنیاد پہلے روز سے ہی تقویٰ پر رکھی گئی ہے، وہ اس بات کی زیادہ حق دار ہے کہ آپ اس میں کھڑے ہوں، اس میں ایسے مرد ہیں جو خوب پاکیزہ ہونے کو پسند کرتے ہیں اور اللہ زیادہ پاکیزگی حاصل کرنے والوں کو پسند فرماتا ہے، (التوبہ: 108)‘‘۔
حضرت عویم بن ساعدہ رضی اللہ عنہ بیان کرتے ہیں: ’’[[arabic: اِنَّ النَّبِيَّ ﷺ أَتَاهُمْ فِي مَسْجِدِ قُبَاءَ فَقَالَ: إِنَّ اللَّهَ تَبَارَكَ وَتَعَالٰی قَدْ أَحْسَنَ عَلَيْكُمُ الثَّنَاءَ فِي الطُّهُورِ فِي قِصَّةِ مَسْجِدِكُمْ، فَمَا هٰذَا الطُّهُورُ الَّذِي تَطَّهَّرُونَ بِهٖ، قَالُوا: وَاللَّهِ يَا رَسُولَ اللَّهِ! مَا نَعْلَمُ شَيْئًا إِلَّا أَنَّهٗ كَانَ لَنَا جِيرَانٌ مِنَ الْيَهُودِ، فَكَانُوا يَغْسِلُونَ أَدْبَارَهُمْ مِنَ الْغَائِطِ فَغَسَلْنَا كَمَا]]`
},
{
  pageNumber: 71,
  text: `[[arabic: غَسَلُوا]]‘‘۔
ترجمہ: ’’رسول اللہ ﷺ نے اہل قبا سے فرمایا: میں نے اللہ تعالیٰ سے سنا کہ وہ تمہاری پاکیزگی حاصل کرنے کی تعریف فرماتا ہے، تم کس طرح پاکیزگی حاصل کرتے ہو، انہوں نے عرض کی: یا رسول اللہ! ہمیں اور کسی چیز کا پتا نہیں، لیکن ہم نے دیکھا کہ ہمارے یہودی پڑوسی براز سے فارغ ہونے کے بعد پانی سے استنجا کرتے ہیں، پس ہم بھی اس طرح کرتے ہیں، (مسند احمد: 15485)‘‘۔
(2) حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی ﷺ نے فرمایا: یہ آیت (التوبہ: 108) اہل قبا کے متعلق نازل ہوئی ہے، وہ پانی کے ساتھ استنجا کرتے تھے تو ان کے متعلق یہ آیت نازل ہوئی، (سنن ترمذی: 3100)‘‘۔

[[heading: وضو کے بارے میں ایک پیچیدہ مسئلہ]]
سوال:
میں نے سُنا ہے کہ پیشاب کی جگہ یعنی شرمگاہ سے گیس خارج ہوتی ہے اور وضو ٹوٹ جاتا ہے، اگر ایسا ہے تو میرے ساتھ یہ سلسلہ بہت زیادہ ہے اور نماز کی حالت میں بہت زیادہ ہوتا ہے، میرے لیے اس بارے میں کیا حکم ہے؟، (جاوید اقبال، لاہور)
جواب:
ریح کے خارج ہونے سے وضو فقط اُسی صورت میں ٹوٹتا ہے، جب وہ پچھلے مقام سے خارج ہو اور اس سے بھی وضو تب ٹوٹتا ہے جب اُس کے خارج ہونے کا یقین ہو، محض ظن و گمان کی وجہ سے وضو ختم نہیں ہوتا۔
حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا:
’’[[arabic: إِذَا کَانَ اَحَدُکُمْ فِی الْمَسْجِدِ فَوَجَدَ رِیْحًا بَیْنَ اَلْیَتَیْہِ فَلاَ یَخْرُجْ حَتّٰی یَسْمَعَ صَوْتًا اَوْ یَجِدَرِیحًا]]‘‘۔
ترجمہ: ’’جب تم میں سے کوئی مسجد میں ہو اور وہ اپنے پچھلے مقام سے ریح کا خارج ہونا`
},
{
  pageNumber: 72,
  text: `محسوس کرے تو وہ مسجد سے نہ نکلے یہاں تک کہ اس کی آواز سُن لے یا بد بو محسوس کرے، (صحیح مسلم: 362، سنن ترمذی: 75)‘‘۔
اِس حدیث میں جو فرمایا کہ جب تک ریح کے خارج ہونے کی آواز نہ سُن لی جائے یا بو محسوس نہ ہو جائے تو اس وقت تک مسجد سے نہ نکلا جائے، اس کا مطلب یہ نہیں ہے کہ ریح خارج ہونے کی صورت میں وضو کا ٹوٹنا اُس کی آواز سننے یا بُو کے پائے جانے سے مشروط ہے، بلکہ اس حدیث کا مطلب یہ ہے کہ نماز پڑھنے والے کو جب تک اپنے وضو ٹوٹنے کا یقین نہ ہو جائے، اُس وقت تک وہ مسجد سے نہ نکلے۔
امام ترمذی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وقَالَ ابْنُ الْمُبَارَكِ: إِذَا شَكَّ فِي الْحَدَثِ، فَإِنَّهٗ لاَ يَجِبُ عَلَيْهِ الْوُضُوْ ءُ حَتّٰى يَسْتَيْقِنَ اسْتِيقَانًا يَقْدِرُ أَنْ يَحْلِفَ عَلَيْهِ]]‘‘۔
’’عبداللہ بن مبارک نے کہا: اس پر وضو واجب نہیں ہے تاوقتیکہ اسے اس حد تک یقین ہو جائے کہ قسم کھا سکے، (سنن ترمذی، تحت حدیث: 75)‘‘۔
حضرت علی رضی اللہ عنہ بیان کرتے ہیں: نبی کریم ﷺ نے فرمایا: ’’[[arabic: إِذَا فَسَاَ اَحَدُکُمْ فَلْیَتَوَضَّاْ]]‘‘، ترجمہ: ’’جب تم میں سے کسی شخص کی ریح خارج ہو تو اُسے چاہئے کہ وہ وضو کر لے، (مسند احمد: 34)‘‘۔
شرمگاہ کے اگلے حصے سے ریح کے خارج ہونے کی وجہ سے وضو نہیں ٹوٹتا، چنانچہ علامہ ابن نجیم حنفی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: الرِّیْحُ الْخَارِجَۃُ مِنَ الذَّکَرِ وَفَرْجِ الْمَرْاَۃِ، فَإِنَّہَا لَا تَنْقُضُ الْوُضُوْ ءَ عَلَی الصَّحِیحِ]]‘‘
ترجمہ: ’’صحیح قول کے مطابق مرد کے عضوِ تناسل یا عورت کی شرمگاہ سے خارج ہونے والی ریح سے وضو نہیں ٹوٹتا، (البحر الرائق، جلد: 1، ص: 31)‘‘۔
فقہائے کرام نے ذکر کیا ہے کہ پچھلے مقامِ سے ریح خارج ہونے کی صورت میں وضو ٹوٹنے کی وجہ یہ نہیں کہ نفسِ ریح ناپاک و نجس ہے، کیونکہ اگر نفسِ ریح کو ناپاک اور نجس قرار دیا جائے`
},
{
  pageNumber: 73,
  text: `تو پھر شلوار کا ناپاک ہونا لازم آئے گا، حالانکہ اِس کا کوئی بھی قائل نہیں ہے، سو معلوم ہوا کہ نفسِ ریح نجس نہیں ہے، بلکہ اِس کی وجہ سے وضو اس لیے ٹوٹتا ہے کہ یہ نجاست اور گندگی کے مقام سے گزر کر آتی ہے۔ اور وہ ریح جو اگلے مقام سے خارج ہوتی ہے، یہ عام ریح ہے، اس کا تعلق کھانے کے فُضلات، آنت یا پچھلے مقام سے نکلنے والی ریح سے نہیں ہے، یہ محض اختلاج یعنی شرمگاہ کے عضلات اور پٹھوں کی حر کت کی وجہ سے ہوتا ہے، سو اِس لیے یہ ناقض وضو نہیں ہے۔
البتہ فقہائے کرام نے کہا ہے کہ بعض عورتیں مُفضاۃ ہوتی ہیں، یعنی اُن کے پیشاب اور پاخانے کا مقام یا پیشاب اور ہمبستری کا مقام مل کر ایک ہو جاتے ہیں، اُن کی بابت علامہ ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’پس اگر کسی عورت کی یہ حالت ہو تو جب اُسے اگلے مقام سے ریح نکلتی محسوس ہوئی ہو تو اُسے احتیاطاً وضو کر لینا چاہیے اور بعض فقہائے کرام نے اِس صورت میں وضو کو واجب قرار دیا ہے، چنانچہ امام محمد سے مروی ہے کہ ایسی عورت کے لئے اس صورت میں وضو کرنا واجب ہے اور اسی قول کو احتیاطاً امام ابو حفص نے بھی لیا ہے اور فتح القدیر میں اسی قول کو راجح قرار دیا گیا ہے کیونکہ ہوا اکثر پچھلے مقام سے خارج ہوتی ہے اور اس کے مقابلے میں اگلے راستے سے ہوا کا خروج نہ ہونے کے برابر ہے اور احتیاط بھی اسی میں ہے، لہٰذا غلبہ ظن یقین کے حکم میں ہوگا اور اس صورت میں وضو واجب ہوگا، (البحر الرائق، جلد 1، ص: 60)‘‘۔
بعض خواتین کی بڑی آنت میں زخم پیدا ہو جاتا ہے، جس کی وجہ سے دُبُر اور بڑی آنت کے درمیان شگاف پیدا ہو جاتا ہے اور اُس میں سے ریح شرمگاہ کی طرف سرایت کرتی ہے، سو اگر ایسی صورتحال ہے تو یہ پچھلے مقام سے خارج ہونے والی ریح کے حکم میں ہے، صرف اتنی بات ہے کہ یہ اپنے فطری مَخرج کے علاوہ سے خارج ہوئی ہے، اِس کے لیے ماہر امراضِ نسواں لیڈی ڈاکٹر سے چیک اپ کرا لیا جائے اور اللہ نہ کرے اگر ایسی ہی صورتحال ہے تو پھر اِس ریح کے خارج ہونے سے وضو ٹوٹ جائے گا۔`
},
{
  pageNumber: 75,
  text: `[[heading: نماز کے مسائل]]`
},
  {
    pageNumber: 77,
    text: `[[heading: نمازی کا اپنے سامنے سے گزرنے والے کو روکنے کا حکم]]
سوال:
جو نمازی کے آگے سے گزرے، اس کو کس طرح اور کون کون روک سکتا ہے، اس سے جہاد کس طرح ثابت ہے، کچھ لوگ کہتے ہیں کہ نمازی سامنے گزرنے والے پر اپنا ہاتھ بھی استعمال کر سکتا ہے، (سلمان لودھی )۔
جواب:
اگر نمازی کے سامنے سُترہ قائم نہیں اورکوئی شخص گزرنا چاہتاہے یا سُترہ ہے ،مگر وہ شخص نمازی اور سُترہ کے درمیان سے گزرنا چاہتاہے تو نمازی کو رخصت ہے کہ اُسے گزرنے سے روکے ،خواہ سبحان اللہ کہے یا (مغرب ،عشاء اور فجر میں) جہر سے قراء ت کرے  یا  ہاتھ یا سر یا آنکھ کے اشارے سے منع کرے، اس سے زیادہ کی اجازت نہیں مثلاً کپڑا پکڑ کر جھٹکنا یا مارنا ، اگر کوئی ایسا عمل کیا جو عمل کثیر میں شمار ہوتا ہے تو نماز جاتی رہی۔
امام بخاری رحمۃ اللہ علیہ نے اپنی صحیح میں ایک باب باندھا : ’’[[arabic: بَابٌ يَرُدُّ الْمُصَلِّي مَنْ مَّرَّ بَيْنَ يَدَيْهِ]]‘‘ (نمازی اپنے سامنے سے گزرنے والے کو ہٹائے) پھر اس باب کے تحت ایک تعلیق بیان فرمائی: ’’[[arabic: وَرَدَّ ابْنُ عُمَرَ فِي التَّشَهُدِ وَفِي الْكَعْبَةِ، وَقَالَ إِنْ أَبِي إِلَّا أَنْ تُقَاتِلَهُ فَقَاتِله]]‘‘ (اور حضرت عبداللہ بن عمر رضی اللہ عنہما نے کعبہ میں اپنی نماز کے تَشَہُّد میں سامنے سے گزرنے والے کو دورکیا اورفرمایا: اگر گزرنے والا بغیر لڑائی کے باز نہ آئے تو اس سے لڑو ، صحیح بخاری:کتاب الصلاۃ)‘‘۔
(1): ’’[[arabic: عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ: لَا تَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْكَ وَأَنْتَ تُصَلِّي، فَإِنْ أَبِي إِلَّا أَنْ تُقَاتِلَهُ فَقَاتِلْهُ]]‘‘۔
ترجمہ: ’’ حضرت نافع بیان کرتے ہیں : حضرت ابن عمر رضی اللہ عنہما نے فرمایا: جو شخص نماز میں تمہارے سامنے سے گزرے اس کو مت چھوڑو ،اگر وہ لڑائی کے بغیر بازنہ آئے تواس سے`
  },
  {
    pageNumber: 78,
    text: `لڑو ، (مُصنّف عبدالرزاق :2325)‘‘۔
(2) ’’[[arabic: عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ : مَرَرْتُ بَيْنَ يَدَيِ ابْنِ عُمَرَ، وَهُوَ فِي الصَّلَاةِ ، فَارْتَفَعَ مِنْ قُعُودِهِ، ثُمَّ دَفَعَ فِي صَدْرِی]]‘‘۔
ترجمہ: ’’عمروبن دینار بیان کرتے ہیں: میں حضرت ابن عمر رضی اللہ عنہما کے سامنے سے گزرا ، وہ نماز کے قعدے میں تھے ،وہ قعدےسے کھڑے ہوگئے ،پھر مجھے دھکا دیا، (مُصَنَّف ابن ابی شیبہ:2921)‘‘۔
(3) ’’[[arabic: حَدَّثَنَا أَبُو صَالِحِ السَّمَّانُ، قَالَ: رَأَيْتُ أَبَا سَعِيدِ الخُدْرِيَّ فِي يَوْمِ جُمُعَةٍ يُصَلِّي إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ، فَأَرَادَ شَابٌ مِنْ بَنِي أَبِي مُعَيْطَ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَدَفَعَ أَبُو سَعِيدٍ فِي صَدْرِهِ ، فَنَظَرَ الشَّابُ فَلَمْ يَجِدُ مَسَانًا إِلَّا بَيْنَ يَدَيْهِ، فَعَادَ لِيَجْتَانَ، فَدَفَعَهُ أَبُو سَعِيدٍ أَشَدَّ مِنَ الْأُولَى، فَنَالَ مِنْ أَبِي سَعِيدٍ، ثُمَّ دَخَلَ عَلَى مَرْوَانَ، فَشَكَا إِلَيْهِ مَا لَقِيَ مِنْ أَبِي سَعِيدٍ ، وَدَخَلَ أَبُو سَعِيدٍ خَلْفَهُ عَلَى مَرْوَانَ، فَقَالَ: مَا لَكَ وَلا بْنِ أَخِيكَ يَا أَبَا سَعِيدٍ ، قَالَ : سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ : إِذَا صَلَّى أَحَدُكُمْ إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ فَأَرَادَ أَحَدٌ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَلْيَدْفَعُهُ فَإِنْ أَبِي فَلْيُقَاتِلُهُ فَإِنَّهَا هُوَ شَيْطَانٌ]]‘‘۔
ترجمہ: ’’ا بوصالح السّمّان بیان کرتے ہیں :میں نے دیکھا حضرت ابوسعید خدری رضی اللہ عنہ جمعہ کے دن کسی چیز کو لوگوں سے سُترہ بناکر نماز پڑھ رہے تھے، بنوابی مُعَیط کے ایک نوجوان نے ان کے سامنے سے گزرنے کا ارادہ کیا تو حضرت ابوسعید نے اس کے سینے پر دھکا دیا ، اس نوجوان نے ادھر اُدھر دیکھا ،مگر اس نے حضرت ابوسعید کے سامنے کے علاوہ کوئی جگہ نہ پائی ،وہ دوبارہ ان کے سامنے سے گزرنے لگا ،حضرت ابوسعید نے اس کو پہلی بار سے زیادہ زور سے دھکا دیا ،اس نے حضرت ابوسعید سے تکلیف اٹھائی ،اس نے مروان کے پاس جاکرحضرت ابوسعید سے پہنچنے والی تکلیف کی شکایت کی ، حضرت ابوسعید بھی اس کے پیچھے پیچھے مروان کے پاس آئے ،مروان نے کہا: اے ابوسعید ! آپ کے اور آپ کے بھتیجے کے`
  },
  {
    pageNumber: 79,
    text: `درمیان کیا معاملہ ہوا؟،انہوں نے بیان کیا: میں نے نبی کریم ﷺ کو یہ فرماتے ہوئے سنا ہے: جب تم میں سے کوئی شخص کسی چیز کو لوگوں سے سُترہ بناکر نماز پڑھے ،پھرکوئی شخص اس کے سامنے سے گزرنے کا ارادہ کرے ،تووہ اس کو دفع کرے ،اگر وہ بازنہ آئے تواس سے لڑے کیونکہ وہی شخص شیطان ہے ،(صحیح بخاری:509)‘‘۔
علامہ ابوالحسن علی بن ابوبکر فرغانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَدْرَأُ الْمَارًا ذَا لَمْ يَكُنْ بَيْنَ يَدَيْهِ سُتْرَةٌ أَوْ مَرَّ بَيْنَهُ وَبَيْنَ السُّتْرَةِ لِقَوْلِهِ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ : ادْرَعُوا مَا اسْتَطَعْتُمْ وَيَدْرَأُ بِالْإِشَارَةِ كَمَا فَعَلَ رَسُولُ اللَّهِ ﷺ بِوَلَدَیْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا أَوْ يَدْفَعُ بِالتَّسْبِيحِ]]‘‘۔
ترجمہ: ’’جب نمازی کے سامنے سُترہ نہ ہو اورکوئی اس کے سامنے سے گزرے یا اس کے سامنے سُترہ ہو اورکوئی اس کے اور سُترے کے درمیان سے گزرے تونمازی اس کو منع کرے اور اس کو اشارے سے منع کرے جیساکہ رسول اللہ ﷺ نے حضرت اُمّ سلمہ رضی اللہ عنہا کے دو بچوں کے ساتھ کیایا سبحان اللہ پڑھ کر ان کو گزرنے سے منع کرے ، (ہدایہ ، جلد1،ص:274)‘‘۔ 
علامہ کمال الدین ابن ہمام رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَهُوَ مَا فِي أَبِي دَاوَدَاذَا صَلَّى أَحَدُكُمْ فَلْيَجْعَلُ تِلْقَاءَ وَجْهِهِ شَيْئًا، فَإِنْ لَمْ يَجِدُ فَلْيَنْصِبْ عَصَا وَإِنْ لَمْ يَكُنْ مَعَهُ عَصَا فَلْيَخُطَ خَطًا وَلَا يَضُرُّهُ مَا مَرَّ أَمَامَهُ، وَاخْتَارَ الْمُصَنِّفُ الْأُولَى وَالسُّنَّةُ أَولَى بِالاتِّبَاعِ]]‘‘۔
ترجمہ: ’’اور وہ جو ابوداؤد میں روایت ہے : ’’جب تم میں سے کوئی شخص نماز پڑھے ،تو اپنے سامنے کوئی چیز رکھ لے اوراگر اورکوئی چیز نہ ملے تو عصا رکھ لے ، وہ بھی نہ ہو تو خط کھینچ لے ، پھر آگے سے گزرنے والے کی پرواہ نہ کرے ‘‘،مُصنّف نے پہلے قول کو اختیار کیا ، حدیث کا اتباع کرنا اَولیٰ ہے ،(فتح القدیر ، جلد1،ص:418)‘‘۔
شیخ التفسیر والحدیث علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں: ’’یہ حدیث اگر چہ ضعیف اور`
  },
  {
    pageNumber: 80,
    text: `مضطرب ہے لیکن اس پر عمل کیاجاسکتاہے کیونکہ فضائل اعمال میں حدیث ضعیف معتبر ہوتی ہے ،(شرح صحیح مسلم،جلد1،ص:1324)‘‘۔
علامہ ابن نجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَدْرَؤُهُ إِنْ لَمْ يَكُنْ سُتْرَةٌ أَوْ مَرَّبَيْنَهُ وَبَيْنَهَا لِلْأَحَادِيثِ الْوَارِدَةِ وَهُوَ بِالْإِشَارَةِ بِالْيَدِ أَوْ بِالرَّأْسِ أَوْ بِالْعَيْنِ أَوْ بِالتَّسْبِيحِ، وَزَادَ الْوَلْوَالِحِنُ أَنَّهُ يَكُونُ بِرَفْعِ الصَّوْتِ بِقَرَاءَةِ الْقُرْآنِ وَيَنْبَغِي أَنْ يَكُونَ مَحَلُّهُ فِي الصَّلَاةِ الْجَهْرِيَّةِ فِيمَا يُجْهَرُ فِيْهِ مِنْهَا]]‘‘۔
ترجمہ: ’’فقہائے کرام نے کہا: نمازی کے سامنے سُترہ نہیں یا سُترہ ہے اور کوئی شخص نمازی اور سُترہ کے درمیان سے گزرنا چاہتاہے تو نمازی اس کو گزرنے سے روکے ،کیونکہ یہ حکم احادیث میں ہے: وہ ہاتھ کے اشارے سے روکے  یا  سرسے اشارہ کرکے روکے  یا آنکھوں کے اشارے سے روکے یا تسبیح(سبحان اللہ) پڑھے اور ’’ولوالجی ‘‘ نے یہ اضافہ کیاہے کہ آواز سے قرآن کی قراء ت کرے ،بہتریہ ہے کہ جہری(یعنی فجر، مغرب اور عشاء کی) نماز پڑھ رہا ہو تو اس میں (منفرد) اونچی آواز سے قراءت کرے  ،(البحرالرائق ، جلد2،ص:32)‘‘۔
علامہ بدرالدین عینی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’آیا نماز ی سے آگے گزرنے والے کو دفع کرنا واجب ہے یا مستحب، تو امام نووی نے کہا ہے: یہ امر مستحب ہے اور اس کی تاکید ہے اور میرے علم میں نہیں ہے کہ فقہائے کرام میں سے کسی نے اسے واجب قرار دیا ہے ،میں (عینی )کہتا ہوں:اہل ظاہر نے ظاہر حدیث پر عمل کرتے ہوئے اسے واجب قرار دیا ہے، ہوسکتا ہے امام نووی کو اس کا علم نہ ہو۔۔۔مزید لکھتے ہیں:
’’سامنے سے گزرنے والے کو اپنی جگہ سے آگے چل کر روکنااگرچہ جائز ہے ،لیکن بہتر ہے کہ اپنی جگہ پر کھڑے کھڑے روکے، کیونکہ نماز میں چلنے کا بگاڑ نمازی کے آگے سے گزرنے کے بگاڑ سے زیادہ ہے، لہٰذا اس کے لیے اتنا ہی دفع کرنا مباح ہے جتنا کہ وہ اپنی`
  },
  {
    pageNumber: 81,
    text: `جگہ کھڑے کھڑے کرسکے اور اگر گزرنے والا فاصلے پر ہے اور نمازی اپنی جگہ کھڑے کھڑے نہیں روک سکتا تو اشارے سے روکے یا سبحان اللہ کہے، دونوں طریقے اختیار نہ کرے،(عمدۃ القاری،ج:4،ص:426)‘‘۔
الغرض حدیثِ مبارک میں نمازی کے آگے سے گزرنے والے شخص کو روکنے کے لیے لڑنے کے الفاظ اس مسئلے کی شدت کو بیان کرنے کے لیے ہیں ،عملاً ایسا نہیں کرناچاہیے اور عملِ کثیر ویسے ہی مُفسدِ نماز ہے، البتہ اگر نمازی کے آگے سے گزرنے والا ہاتھ کی پہنچ میں ہے تو ایک ہاتھ بڑھا کر اسے روک سکتا ہے۔

[[heading: نمازِ جمعہ کے دونوں خطبوں کے درمیان ہاتھ اٹھاکر دعا مانگنا]]
سوال:
نمازِ جمعہ کے دونوں خطبوں کے درمیان ہاتھ اٹھا کر دعا مانگنا کیساہے ؟،(انعام الحق ، لاہور)۔
جواب:
احادیثِ مبارکہ میں جمعۃ المبارک کے دن قبولیتِ دعا کی ایک ساعت بتائی گئی ہے ، اس کے بارے میں روایات یہ ہیں:
(۱) ’’[[arabic: عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ ﷺ ذَكَرَ يَوْمَ الْجُمُعَةِ، فَقَالَ: فِيهِ سَاعَةٌ، يُوَافِقُهَا عَبْدُ مُسْلِمٌ ، وَهُوَ قَائِمٌ يُصَلِّي، يَسْأَلُ اللهَ تَعَالَى شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا]]‘‘۔
ترجمہ: ’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں :رسول اللہ ﷺ نے جمعہ کے دن کا ذکر کیااور فرمایا: اس میں ایک ایسی ساعت ہے کہ جومسلمان بندہ اس ساعت کو پالے اوروہ اس ساعت میں کھڑاہوانماز پڑھ رہاہو اوروہ اللہ تعالیٰ سے کسی چیز کا سوال کرے تو اللہ تعالیٰ اس کو وہ چیز عطافرمادیتاہے اور آپ نے ہاتھ کے اشارے سے بتایاکہ وہ ساعت بہت تھوڑی ہے ،(صحیح بخاری:935)‘‘۔`
  },
  {
    pageNumber: 82,
    text: `(۲) ’’[[arabic: عَنْ أَبِي مُوسَى الْأَشْعَرِي فِي سَاعَةِ الْجُمُعَةِ ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ : هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الْإِمَامُ إِلَى أَنْ تُقْضَى الصَّلَاةُ]]‘‘۔
ترجمہ: ’’حضرت ابوموسیٰ اشعری رضی اللہ عنہ جمعہ کے دن دعا کی قبولیت کی ساعت کے بارے میں بیان کرتے ہیں،میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا :یہ ساعت امام کے (منبر پر)بیٹھنے سے لے کر نماز کے اختتام تک ہے ،(صحیح مسلم: 853)‘‘۔
(۳) ’’[[arabic: عَنْ عَبْدِ اللَّهِ ابْنِ عُمَرَ يَقُولُ : سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ وَ الْإِمَامُ عَلَى الْمِنْبَرِ ، فَلَا صَلَاةَ وَلَا كَلَامَ ، حَتَّى يَفْرُغَ الْإِمَامُ]]‘‘۔
ترجمہ: ’’عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں : میں نے نبی ﷺ کو بیان کرتے ہوئے سنا: جب تم میں سے کوئی مسجد میں داخل ہو اور امام (خطبے کے لیے )منبر پر بیٹھ چکا ہے، تو نہ نماز پڑھی جائے اور نہ کلام کیا جائے ،یہاں تک کہ امام نماز سے فارغ ہوجائے(یعنی توجہ سے خطبہ سنا جائے)، (المعجم الکبیر للطبرانی:13708)‘‘۔ایک روایت بعدنماز عصر کی بھی ہے۔
(۴) ’’[[arabic: عَنْ أَبِي أُمَامَةَ قَالَ : إِنِّي لَأَرْجُو أَنْ تَكُونَ السَّاعَةُ الَّتِي فِي الْجُمُعَةِ إِحْدَى هَذِهِ السَّاعَاتِ إِذَا أَذَّنَ الْمُؤَذِّنُ أَوِ الْإِمَامُ عَلَى الْمِنْبَرِ أَوْ عِنْدَ الْإِقَامَةِ]]‘‘۔
ترجمہ: ’’حضرت ابواُمامہ رضی اللہ عنہ بیان کرتے ہیں: مجھے امید ہے کہ جمعہ کے دن (دعا کی قبولیت )کی ساعت ان تین میں سے ایک ہے: جب موذن اذان دے یاامام منبر پر ہویااقامت کے وقت ،(مصنف ابن ابی شیبہ:5466)‘‘۔
لہٰذا دوخطبوں کے درمیان امام دعا کرسکتا ہے اورمقتدی بھی دل میں یا آہستہ آواز میں دعا کرسکتے ہیں۔
امام ابن حجر ہیتمی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’قاضی عیاض نے کہا:دو خطبوں کے درمیان جلسے میں دعا مقبول ہے اورحاضرین کے لیے اس جلسے میں دعا میں مشغول رہنا سنت ہے ، کیونکہ یہ بات ثابت ہے کہ اس وقت دعا مقبول ہوتی ہے اور مقتدی آہستہ دعا کریں، کیونکہ اونچی آواز سے دعا کرنے میں`
  },
  {
    pageNumber: 83,
    text: `دوسروں کی توجہ بٹے گی اور آہستہ دعا کرنا افضل ہے، سوا اس کے کہ کوئی امر عارض ہو، (الفتاویٰ الفقہیۃ الکبریٰ  ، ج:1،ص:252)‘‘۔
شیخ محمد بن صالح ابن عثیمین لکھتے ہیں:
ترجمہ: ’’دو خطبوں کے درمیان دعا خیر اور مستحب ہے ،کیونکہ یہ قبولیتِ دعا کا وقت ہے ،پھر انہوں نے صحیح مسلم کی مندرجہ بالا حدیث کا حوالہ دیااور کہا: جہاں تک رفع یدین کا سوال ہے تو میرے نزدیک اس میں کوئی حرج نہیں ہے ،کیونکہ دعا کے آداب میں سے رفع یدین ہے، سو کوئی دعا کے وقت ہاتھ اٹھائے تو کوئی حرج نہیں ہے اور اگر نہ اٹھائے تو بھی حرج نہیں ہے ،دو خطبوں کے درمیان کوئی مخصوص دعا یا ذکر وارد نہیں ہے ،لیکن انسان اپنی پسندیدہ کوئی بھی دعا کرسکتا ہے ،کیونکہ حدیث کی رُو سے یہ دعا کی قبولیت کا وقت ہے ،(فتاویٰ نور علی الدرب،صلاۃ الجمعۃ)‘‘۔
نبی کریم ﷺ سے بطورِ خاص دو خطبوں کے درمیان ہاتھ اٹھاکر دعا کرنا ثابت نہیں ہے ،لیکن فی نفسہٖ دعا کے آداب میں یہ ہے کہ ہاتھ اٹھاکر دعا کرے ،ہتھیلی کا رُخ اوپر کی طرف ہواور دعا کے بعد ہاتھ چہرے پر پھیر لے،احادیثِ مبارکہ یہ ہیں:
(۱) عبداللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں:رسول اللہ ﷺ نے فرمایا:
’’[[arabic: سَلُوا اللَّهَ بِبُطُونِ أَكُقِكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا، فَإِذَا فَرَغْتُمْ، فَامْسَحُوا بِهَا وُجُوهَكُمْ]]‘‘۔
ترجمہ: ’’اپنی ہتھیلیوں کو پھیلاکر اللہ سے سوال کرو ،اپنے ہاتھوں کی پشت کو پھیلاکر سوال نہ کرو،پھر جب دعا سے فارغ ہوجائو تو اپنے ہاتھ اپنے چہرے پر مَل لو، (ابودائود:1485)۔
(2) ’’[[arabic: الْمَسْأَلَةُ أَنْ تَرْفَعَ يَدَيْكَ حَذْوَ مَنْكِبَيْكَ أَوْ نَحْوَهُمَا]]‘‘۔
ترجمہ: ’’حضرت ابن عباس رضی اللہ عنہما فرماتے ہیں:(اللہ تعالیٰ سے ) سوال کرنے کا طریقہ یہ ہے کہ تم اپنے ہاتھ کندھوں کے برابر یا( کم وبیش ) اٹھائو، (ابودائود:1489)‘‘۔
(3) ’’[[arabic: إِنَّ النَّبِيُّ ﷺ كَانَ إِذَا دَعَا فَرَفَعَ يَدَيْهِ ، مَسَحَ وَجْهَهُ بِيَدَيْهِ]]‘‘۔`
  },
  {
    pageNumber: 84,
    text: `ترجمہ: ’’سائب بن یزید اپنے والد سے بیان کرتے ہیں:نبی ﷺ جب دعا کرتے تو اپنے ہاتھ بلند کرتے اور اپنے ہاتھ اپنے چہرہ مبارک پر پھیر لیتے، (ابودائود:1492)‘‘۔
(4) ’’[[arabic: إِنَّ رَبَّكُمْ تَبَارَكَ وَتَعَالَى حَبِى كَرِيمٌ ، يَسْتَحْيِي مِنْ عَبْدِهِ إِذَا رَفَعَ يَدَيْهِ إِلَيْهِ ، أَنْ يَرُدَّهُمَا صِفْرًا]]‘‘۔
ترجمہ: ’’حضرت سلمان رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا: بے شک تمہارا رب تبارک وتعالیٰ بہت حیا فرمانے والا کریم ہے،جب اس کا بندہ اس کی طرف ہاتھ اٹھالے،تو وہ اپنے بندے سے حیا فرماتا ہے کہ اُس کے ہاتھ خالی لوٹادے، (ابودائود: 1488)‘‘۔
الغرض جمعے کے دن دو خطبوں کے درمیان امام کے لیے دعا بالاتفاق جائز ہے، فقہ حنفی میں امام ابویوسف اور امام محمد کے نزدیک دو خطبوں کے درمیان دعا مقتدی کے لیے بھی جائز ہے اور امام اعظم سے بھی ایک روایت جواز کی ہے ،لیکن مقتدی دل میں یا زبان سے آہستہ دعا کریں۔ مقتدی ہاتھ اٹھاکر دعا کا التزام نہ کریں تاکہ اسے جمعے کا شِعار نہ سمجھ لیا جائے ، کبھی ہاتھ اٹھاکر بھی دعا کرسکتے ہیں کہ اس کی ممانعت نہیں ہے اور ہاتھ اٹھانا آدابِ دعامیں سے ہے ۔
چنانچہ مفتی مصر شیخ محمد رشید رضا متوفّیٰ 1354ھ لکھتے ہیں:
ترجمہ: ’’دو خطبوں کے درمیان دعا کے لیے ہاتھ اٹھانااور بلند آواز سے دعا کرنا سنت سے ثابت نہیں ہے اوراگر یہ تاثر پیدا نہ ہو لوگ کسی دلیل کے بغیر اسے سنت سمجھ کر کر رہے ہیں،تو(اپنی اصل کے اعتبار سے )ہاتھ اٹھاکر دعا کرنے میں کوئی حرج بھی نہیں ہے ،آثار سے یہ ثابت ہے کہ جب امام منبر پر کلام کرے تو خاموش رہ کر سنا جائے اور اسی سبب ہم کہتے ہیں :’’جب امام خاموش ہو تو دعا میں حرج نہیں ہے، لیکن دعا آہستہ کرے تاکہ دوسروں کے لیے تکلیف (اور توجہ بٹنے )کا سبب نہ بنے اور سب لوگ ہاتھ بھی نہ اٹھائیں کہ لوگ اسے جمعے کا شِعار نہ سمجھ لیںاورجب امام دوسرے خطبے کے لیے اٹھے تو دعا موقوف کردیںاور خطبہ سنیں، (مجلّۃ المنار،ج:6،ص:792،)‘‘۔ اصل سے مراد یہ ہے کہ مطلقاً دعا میں ہاتھ اٹھانا سنت`
  },
  {
    pageNumber: 85,
    text: `سے ثابت ہے۔
امام اہلسنت امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْز سے جمعۃ المبارک کے دن دو خطبوں کے درمیان دعائوں کے بارے میں سوال ہوا کہ آیایہ مکروہِ تحریمی ہے یا تنزیہی یا جائزہے، ایک صاحب اسے بدعت اور حرام بتاتے ہیں ،آپ نے تفصیلی جواب لکھا،جس کا خلاصہ یہ ہے:
’’دو خطبوں کے درمیان امام کا دعا مانگنا بالاتفاق جائز ہے ،بلکہ خطبے کے درمیان بھی رسول اللہ ﷺ سے ہاتھ اٹھاکر بارش کے لیے دعا مانگنا صحیح احادیث سے ثابت ہے ۔فقہِ حنفی میں دو خطبوں کے درمیان مقتدی کے لیے دعا مانگنا صاحبین کے نزدیک بالاتفاق جائز ہے ، امام اعظم سے بھی ایک قول کے مطابق اس کا جواز ثابت ہے اور امام شافعی کے نزدیک بھی جائز ہے،تاہم آپ نے لکھا:’’یہ کوئی ایسا امر نہیں جس پر شدت اختیار کی جائے ،نرمی سے سمجھایا جائے ،اگر کوئی نہ مانے تو اس کی بنا پر فتنہ اٹھانا اور گروہ بندی کی حاجت نہیں ہے ، آپ نے اس موضوع پر ’’[[arabic: رِعَايَةُ الْمَذْهَبَينِ فِي الدُّعَاءِ بَيْنَ الْخُطَبَتَيْن]]‘‘ کے نام سے ایک مستقل رسالہ لکھا ہے، (فتاویٰ رضویہ، ج:8، ص: 397و477تا494، ملخصاً ، بتصرف)‘‘۔ 

[[heading: اِقامت کا مفصل ومدلل مسئلہ]]
سوال:
چند روز قبل ہماری مسجد کے امام صاحب نے مسئلہ بیان فرمایاکہ:’’ اِقامت نماز سے قبل پڑھی جاتی ہے ،بیٹھ کر سننا سنت ہے اور ’’حی علی الصلوۃ ‘‘پر کھڑا ہونا چاہیے ،اس سے قبل نمازی کا کھڑاہونا مکروہ عمل ہے ‘‘۔میں اس دن سے عجیب ذہنی کیفیت میں مبتلا ہوں ، اپنی67سالہ عمر میں اللہ اکبر کے ساتھ ہی کھڑاہواکرتاتھا ،اگر میرایہ عمل مکروہ ہے تو اس عرصہ میں اداکی گئی نمازوں کاکیاہوا۔حرمین شریفین کی حاضری نصیب ہوئی ،وہاں بھی اللہ اکبر کی صداکے ساتھ ہی صفیں بننا شروع ہوجاتی ہیں ۔کروڑوں مسلمانوں کو اللہ اکبر کے`
  },
  {
    pageNumber: 86,
    text: `ساتھ مساجد میں صف بندی کرتے ہوئے دیکھاہے ،ان کی نمازوں کا کیا ہوگا ۔مجھے امام صاحب کی علمی کمی یاان پر بالادستی مطلوب نہیں ،اپنے اعمال کی درستگی اور گزشتہ نمازوں کی فکر ہے کیونکہ میرے نزدیک مکروہ عمل کے آغاز کے ساتھ کسی عبادت کی قبولیت ممکن نہیں ہوسکتی ،(سرفراز احمد ،قیوم آباد ،کراچی )۔
جواب:
لوگوں کو یہ بتانے کے لیے کہ جماعت کھڑی ہونے والی ہے ،اِقامت کہی جاتی ہے ،یہ امرِمشروع ہے اور سنّت ِ مُتوارثہ ہے ،اس کے کلمات حدیث سے ثابت ہیں ،اسی کو ہمارے عرف میں ’’ تکبیر‘‘ بھی کہاجاتاہے اِقامت کی اصطلاح ’’[[arabic: قَدقَامَتِ الصَّلوٰۃُ]]‘‘ کے کلمے سے اور ’’تکبیر‘‘ کی اصطلاح ’’اللہ اکبر‘‘ سے مستفاد ہے۔ جماعت کے لیے اقامت کے وقت مقتدی کب کھڑے ہوں،اس کے بارے میں احادیث مبارکہ میں کوئی صریح حکم مذکورنہیں ہے، ماسوا صحیح مسلم کی اس حدیث کے کہ ـ’’[[arabic: لَاتَقُوْمُوْا حَتّٰی تَرَوْنِیْ]]‘‘ (جب تک تم مجھے دیکھ نہ لو،مت کھڑے ہو )۔دراصل رسول اللہ ﷺ کا معمول یہ تھاکہ آپ جماعت کھڑی ہونے کے وقت حجرۂ انور سے باہر تشریف لاتے اورحضرت بلال رضی اللہ عنہ کی نظریں حجرۂ انور کی طرف جمی رہتیں، جوں ہی آپ ﷺ نکلتے ،وہ اقامت شروع کردیتے تھے ، حدیث پاک میں ہے :
 ’’[[arabic: عَن أَبِي قَتَادَةَ ، قَالَ: قَالَ رَسُولَ الله ﷺ وَإِذَا أُقِيمَتِ الصَّلَاةُ فَلَا تَقُوْمُوا حَتَّى تَرَوْنِي]]‘‘ ۔
ترجمہ: ’’حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ ﷺ نے صحابہ سے فرمایا: جب نماز کے لیے اِقامت کہی جائے ،توجب تک تم مجھے دیکھ نہ لو ،مت کھڑے ہو،(صحیح مسلم:604)‘‘۔
اس حدیث کے تحت امام یحییٰ بن شرف نووی رحمۃ اللہ علیہ نے یہ روایات بیان کی ہیں:
’’[[arabic: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أُقِيمَتِ الصَّلَاةُ، فَقُمْنَا فَعَدَلْنَا الصُّفُوفَ قَبْلَ أَنْ يَخْرُجَ]]`
  },


{
  pageNumber: 73,
  text: ``
},
{
  pageNumber: 73,
  text: ``
},
{
  pageNumber: 73,
  text: ``
},
]
}
