// جلد یازدہم کا ڈیٹا
// window.bookVolumes میں خودکار رجسٹر ہو جائے گا
window.bookVolumes = window.bookVolumes || {};

window.bookVolumes[11] = {
  volume: 11,
  title: "جلد یازدہم",
  pages: [
    {
      pageNumber: 1,
      text:  `[[heading:  تفہیم المسائل یازدہم
      11]]`
      
    },
    {
      pageNumber: 16,
      text: `[[heading: عقائد کے مسائل]]`
    },
    {
    pageNumber: 17,
    text: `[[heading: عالمِ دین کا کہنا:ہم احمدی ہیں]]
سوال:
کیا فرماتے ہیں علمائے دین شرع متین مسئلہ ھٰذا میں کہ بکر کہتا ہے کہ احمدیہ ہم ہیں، کیونکہ رسول اللہ ﷺ کا نام مبارک احمد ہے، اس لیے احمدیہ ہم ہیں ،قادیانی احمدیہ نہیں ہیں۔ زید نے کہا: احمدیہ قادیانیوں اور مرزائیوں کو کہتے ہیں اور ہمارے عرف میں یہ بات مشہور ہے کہ اگر آپ احمدیہ کہلواتے ہو ،تو وہابی بھی کہلوالو ،کیونکہ وہاب اللہ عزوجل کا نام مبارک ہے۔دریافت طلب بات یہ ہے کہ دونوں میں کس کا قول راجح ہے اور بکر امامت بھی کرواتا ہے،(سائل:محمد امجد رضوی، لاہور)۔
جواب:
یہ بات درست ہے کہ قرآنِ کریم میں سید المرسلین ﷺ کے دو اسمائے گرامی مذکور ہیں :
(۱) احمد ،اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] وَاِذْ قَالَ عِیْسَی ابْنُ مَرْیَمَ یٰبَنِیْ اِسْرَآءِیْلَ اِنِّیْ رَسُوْلُ اللّٰہِ اِلَیْکُمْ مُّصَدِّقًا لِّمَا بَیْنَ یَدَیَّ مِنَ التَّوْرٰىۃِ وَ مُبَشِّرًۢا بِرَسُوْلٍ یَّاْتِیْ مِنْۢ بَعْدِی اسْمُہٗۤ اَحْمَدُ ۫ فَلَمَّا جَآءَہُمْ بِالْبَیِّنٰتِ قَالُوْا ہٰذَا سِحْرٌ مُّبِیْنٌ
ترجمہ:’’اور(یاد کرو)جب عیسیٰ بن مریم نے کہا: اے بنی اسرائیل! میں تمہاری طرف اللہ کا رسول ہوں، اپنے سے پہلی کتاب تورات کی تصدیق کرنے والا ہوں اوراُس( عظیم) رسول کی بشارت دینے والا ہوں ، جو میرے بعد آئے گا، اس کا نام احمد ہے ،پس جب وہ ان کے پاس واضح نشانیاں لے کر آئے تو(کافروں)نے کہا: یہ کھلا جادو ہے، (الصف:6)‘‘۔
(۲)محمد، اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] مُحَمَّدٌ رَّسُوْلُ اللّٰہِ
ترجمہ:’’ محمد اللہ کے رسول ہیں، (الفتح:29)‘‘۔
حدیث پاک میں ہے:’’قَالَ رَسُوْلُ اللّٰہِ ﷺ: أَنَا مُحَمَّدٌ وَأَحْمَدُ ‘‘۔`
  },
  {
    pageNumber: 18,
    text: `ترجمہ: ’’رسول اللہ ﷺ نے فرمایا: میں محمد اور احمد ہوں ،(صحیح البخاری:3532)‘‘۔
 محمد کے معنی ہیں:’’ جس کی بہت زیادہ تعریف کی گئی ہو‘‘ اور احمد کے معنی ہیں:’’بہت زیادہ تعریف کرنے والا ‘‘۔آپ ﷺ کا رب قرآنِ کریم کی آیاتِ مبارکہ میں آپ کی جا بجا تعریف فرماتا ہے اور آپ اپنے ربِ کریم کی تعریف فرماتے ہیں ،ملائکہ اورجنّ وانس میں سے اہلِ ایمان آپ کی تعریف میں رطب اللسان ہیں ۔
	پس نبی کریم ﷺ کے اَعلامِ مبارکہ کی طرف منسوب کر کے معنوی طور پر کوئی صاحبِ ایمان اپنے آپ کو احمدی یا محمدی کہہ سکتا ہے ، لیکن چونکہ ہمارے خطے میں منکرینِ ختمِ نبوت یعنی قادیانی طبقہ اپنے آپ کو ’’احمدی‘‘ کے نام سے متعارف کراتا ہے ، اس لیے احمدی کہنے سے گریز کرنا لازم ہے،سارے مخاطَبین اہلِ علم نہیں ہوتے ،کوئی یہ گمان بھی کرسکتا ہے کہ اس شخص کا تعلق منکرین ختمِ نبوت سے ہے اور کوئی اپنے آپ کو احمدی کہلانے والا قادیانی یہ کہہ سکتا ہے :’’ فلاں مولانا صاحب نے بتایا ہے کہ ہم احمدی ہیں ،تو میں اُن کی تقلید میں ایسا کر رہا ہوں‘‘، اس لیے عوام میں اپنے آپ کو بطورِ احمدی متعارف کرانے سے گریز کرنا چاہیے ، کیونکہ ہر بار اور ہر شخص کے سامنے آپ تقریر کر کے اس کی وضاحت نہیں کر پائیں گے۔حضرت علی کرم اللہ وجہہ الکریم کا قول ہے:
[[arabic]] إِیَّاکَ وَمَا یَسْبِقُ إِلَی الْعُقُوْلِ إِنْکَارُہٗ وَإِنْ کَانَ عِنْدَکَ اِعْتِذَارُہٗ
ترجمہ: ’’ایسی بات کرنے سے بچو جس کا عام لوگ فوراً رد کرنے پر آمادہ ہوجائیں ،اگرچہ آپ کے پاس اس بات کی کوئی (قابلِ قبول) توجیہ بھی ہو، (حاشیۃ الطحطاوی علی مراقی الفلاح، ج:1،ص:680)‘‘۔
علامہ اسماعیل بن محمد العجلونی لکھتے ہیں:
[[arabic]] مَنْ سَلَکَ مَسَالِکَ الظَّنِّ اُتُّھِمَ وَرَوَاہُ ’’الْخَرَائِطِیْ‘‘ فِیْ ’’مَکَارِمِ الْاَخْلَاقِ‘‘ مَرْفُوْعاً بِلَفْظِ: ’’مَنْ اَقَامَ نَفْسَہٗ مَقَامَ التُّھَمِ فَلَا یَلُوْمَنَّ مَنْ اَسَاءَالظَّنَّ بِہٖ‘‘
ترجمہ:’’ جو (بد)گمانوں کی راہوں پر چلے گا،وہ تہمت کا ہدف بنے گا`
  },

  {
    pageNumber: 19,
    text: `اور’’مکارمِ اخلاق‘‘ میں خرائطی نے ان الفاظ کے ساتھ مرفوعاً روایت کیا: ’’مَنْ أَقَامَ نَفْسَہٗ مَقَامَ التُّہَمِ فَلَا یَلُوْمَنَّ مَنْ أَسَاءَ الظَّنَّ بِہٖ‘‘۔
ترجمہ:’’ جو (بد)گمانوں کی راہوں پر چلے گا،وہ تہمت کا ہدف بنے گااور ’’مکارمِ اخلاق‘‘ میں خرائطی نے ان الفاظ کے ساتھ مرفوعاً روایت کیا: ’’جو مقامِ تہمت پر ٹھہرا، اُسے چاہیے کہ بدگمانی کرنے والوں کو ملامت نہ کرے،(کشف الخفاء ومزیل الالباس،الجزء الاول، ص:44)‘‘، یعنی اُس نے اپنے آپ کو ہدفِ ملامت بنانے کا موقع خود فراہم کیا۔ 
علامہ علی القاری نقل کرتے ہیں:
[[arabic]] مَنْ کَانَ یُؤْمِنُ بِاللّٰہِ وَالْیَوْمِ الآخِرِ فَلَا یَقِفَنَّ مَوَاقِفَ التُّھَمِ
ترجمہ:’’جو اللہ اور قیامت کے دن پر ایمان رکھتا ہے ،وہ تہمت کے مقامات پر نہ ٹھہرے، (مرقاۃ المفاتیح شرح مشکاۃ المصابیح،ج:3،ص:77)‘‘۔نیز مقاصدِ شریعہ میں ایک سَدُّ الذَرَائِع بھی ہے، یعنی جس بات سے کوئی خرابی پیدا ہوتی ہو، جواز کی گنجائش کے باوجود اس سے اجتناب بہتر ہے۔ لیکن اگر کوئی صحیح العقیدہ عالم اپنی تاویل اور توجیہ کے ساتھ اپنے آپ کو احمدی کہے تو اس پر کوئی فتویٰ لگانا درست نہیں ہے، تاہم ان کو احسن انداز میں سمجھایا جائے کہ حکمتِ دین کے تحت اور دفعِ مفاسد کے لیے انہیں اس شعار سے گریز کرنا چاہیے، ایسے عالم کی اقتدا میں نماز پڑھنے میں حرج نہیں ہے ،بشرطیکہ کوئی اور شرعی سبب مانع نہ ہو۔
[[heading: کیا ہر صحابی پر ایمان لانا ارکانِ ایمان میں داخل ہے]]
سوال:
	اسلامی عقائد وایمانیات کتنے ہیں، اللہ تعالیٰ پر ،اس کے ہر ایک فرشتے، ہر ایک کتاب، ہر ایک نبی، قیامت کے دن اور تقدیر پر ایمان لانے کے علاوہ آخری نبی رسول اللہ ﷺ کے ہر ایک صحابی پر ایمان لانا ارکان ایمان میں داخل ہے، سائل کا استفتاء ہر ایک صحابی کے صحابی ہونے پر ایمان رکھنے کے بارے میں نہیں ہے بلکہ ہر ایک صحابی پر ایمان لانے کے بارے میں ہے ، (مولانا خطیب الرحمن، یوکے)۔
جواب:
	اسلامی عقائد کا بیان قرآنِ کریم کی متفرق آیات میں موجود ہے ،ذیل میں ہم دو آیاتِ مبارکہ درج کر رہے ہیں:
(۱)
[[arabic]] لَیْسَ الْبِرَّ اَنْ تُوَلُّوْا وُجُوْہَکُمْ قِبَلَ`
  },
  {
    pageNumber: 20,
    text: `[[arabic: الْمَشْرِقِ وَ الْمَغْرِبِ وَ لٰکِنَّ الْبِرَّ مَنْ اٰمَنَ بِاللّٰہِ وَ الْیَوْمِ الْاٰخِرِ وَ الْمَلٰٓئِکَۃِ وَ الْکِتٰبِ وَ النَّبِیّٖنَ
ترجمہ:’’نیکی (کا مرتبۂ کمال) یہ نہیں کہ تم اپنا رُخ مشرق یا مغرب کی جانب پھیر دو ،ہاں ! (کامل)نیکی اُس شخص کی ہے جو اللہ ، قیامت کے دن ، فرشتوں ،(الہامی) کتابوں اور نبیوں پر ایمان لائے ]]،(البقرہ:177)‘‘۔
(۲)
[[arabic]] اٰمَنَ الرَّسُوْلُ بِمَاۤ اُنْزِلَ اِلَیْہِ مِنْ رَّبِّہٖ وَالْمُؤْمِنُوْنَ ۭ کُلٌّ اٰمَنَ بِاللّٰہِ وَمَلٰٓئِکَتِہٖ وَکُتُبِہٖ وَرُسُلِہٖ ۭ لَا نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْ رُّسُلِہٖ ۘ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا ۫ غُفْرَانَکَ رَبَّنَا وَاِلَیْکَ الْمَصِیْرُ
ترجمہ:’’رسول اُس (کلام) پر ایمان لائے جو اُن کی طرف اُن کے رب کی جانب سے نازل ہوا اورمومن (بھی ایمان لائے)، سب ایمان لائے اللہ پر، اُس کے فرشتوں پر، اُس کی کتابوں پر اور اس کے رسولوں پر (یہ کہتے ہوئے)ایمان لائے کہ ہم (ایمان لانے میں) اس کے رسولوں میں کوئی امتیاز نہیں برتتے اورانہوں نے کہا: ہم نے سنا اور ہم نے اطاعت کی ، اے ہمارے رب! ہم تجھ سے بخشش کے طلبگار ہیں اور (ہمیں)تیری ہی طرف لوٹنا ہے ،(البقرہ:285)‘‘۔
	سورۃ البقرہ: 4میں آخرت پر یقین رکھنے کا بھی ذکر ہے ۔موت کے برحق ہونے اور تقدیر کے بارے میں اللہ تعالیٰ نے فرمایا:
[[arabic]] اَیْنَ مَا تَکُوْنُوْا یُدْرِکْکُّمُ الْمَوْتُ وَلَوْ کُنْتُمْ فِیْ بُرُوْجٍ مُّشَیَّدَۃٍ ۭ وَاِنْ تُصِبْہُمْ حَسَنَۃٌ یَّقُوْلُوْا ہٰذِہٖ مِنْ عِنْدِ اللّٰہِ ۚ وَاِنْ تُصِبْہُمْ سَیِّئَۃٌ یَّقُوْلُوْا ہٰذِہٖ مِنْ عِنْدِکَ ۭ قُلْ کُلٌّ مِّنْ عِنْدِ اللّٰہِ ۣ فَمَالِ ہٰٓؤُلَاۗءِ الْقَوْمِ لَا یَکَادُوْنَ یَفْقَہُوْنَ حَدِیْثًا۔ مَآ اَصَابَکَ مِنْ حَسَنَۃٍ فَمِنَ اللّٰہِ ۣ وَمَآ اَصَابَکَ مِنْ سَیِّئَۃٍ فَمِنْ نَّفْسِکَ
ترجمہ:’’تم جہاں کہیں بھی ہو ،موت تم کو پا لے گی ،خواہ تم مضبوط قلعوں میں (محفوظ) ہو،اور اگر اُن کو کچھ اچھائی پہنچے تو کہتے ہیں : یہ اللہ کی جانب سے ہے اور(اے رسول!) اگر اُن کو کوئی برائی پہنچے توکہتے ہیں: یہ آپ کی طرف سے ہے ،آپ کہیے: ہر چیز اللہ کی طرف سے ہے ،تو ان لوگوں کو کیا ہوا کہ یہ کوئی بات سمجھ نہیں پاتے ،(اے مخاطب!)تم کو جو اچھائی پہنچتی ہے ،سو وہ اللہ کی طرف`
  },
  {
    pageNumber: 21,
    text: `سے ہے،اور تم کو جو کوئی برائی پہنچتی ہے ،یہ تمہاری ذات کی طرف سے ہے ،تو(اے مخاطب!) تم کو جو اچھائی پہنچتی ہے ،سو وہ اللہ کی طرف سے ہے اور تم کو جو برائی پہنچتی ہے ،تو وہ تمہاری ذات کے سبب ہے،(النساء:78-79)‘‘۔
	ہمارے ہاں جوابتدائی قاعدے یا نماز کی کتاب پڑھائی جاتی ہے ،اُن میں انہی مسلّمہ عقائد کوایمانِ مُجْمَل اور ایمان مُفصَّل کے عنوان سے بیان کیا گیا ہے ،یہ تو معلوم نہیں ہے کہ ابتدا میں اسے کن صاحبِ علم نے ان عنوانات سے مرتّب کیا ،لیکن یہ بہر حال قرآن وسنت سے ماخوذ ہیں اور معنوی طور پر بالکل درست ہیں ۔جن کتبِ الٰہی کے نام قرآنِ مجید میں صراحت کے ساتھ مذکور ہیں، اُن پر تعیین کے ساتھ ایمان لانا ضروری ہے اور باقی کتب سماوی پر اجمالی طور پر ایمان لانا ضروری ہے، قرآنِ کریم میں سورۃ الاعلیٰ میں صُحُفِ اِبْراھِیْمَ وَمُوْسیٰ ’’علیہما السلام ‘‘کا بھی اجمالاً تذکرہ کیا گیا ہے۔ اجمالی ایمان لانے کے معنی یہ ہیں کہ اللہ تعالیٰ نے جتنی کتابیں مختلف ادوار میں نازل فرمائیں ،وہ سب حق ہیں ۔ اسی طرح اللہ تعالیٰ نے فرمایا:
[[arabic]] وَ لَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِکَ مِنْہُمْ مَّنْ قَصَصْنَا عَلَیْکَ وَمِنْہُمْ مَّنْ لَّمْ نَقْصُصْ عَلَیْکَ
ترجمہ: ’’اور بے شک ہم نے (وقتاً فوقتاً )آپ سے پہلے بھی رسول بھیجے اور ہم نے بعض کے حالات آپ کے سامنے بیان کیے ہیں اور بعض کے حالات بیان نہیں کیے ، (المومن:78)‘‘۔ 
	سو جن انبیائے کرام اور رُسُلِ عظام کے اسمائے مبارکہ قرآنِ کریم اور احادیثِ مبارکہ میں تعیین کے ساتھ بیان کیے گئے ہیں ،اُن پر نام بنام اور تعیین کے ساتھ ایمان لانا ضروری ہے اور جن انبیائے کرام کے اسمائے مبارکہ قرآن وحدیث میں بیان نہیں ہوئے، اُن پر اجمالاً ایمان لانا ضروری ہے ۔بعض روایات کی رُو سے انبیائے کرام کی تعداد ایک لاکھ چوبیس ہزار (یا کم وبیش )، رُسلِ عظام کی تعداد تین سو تیرہ( یا کم وبیش ) اور الہامی کتابوں اور صحیفوںکی تعداد ایک سو دس (یا کم وبیش ) ہے،وَاللہُ تَعَالیٰ اَعْلَمُ بِالصَّوَاب۔ 
	اسی طرح ملائکہ میں سے بعض کے نام قرآنِ کریم میں مذکور ہیں ،جن میں چار ملائک کا تذکرہ`
  },
  {
    pageNumber: 22,
    text: `واضح طور پر آیا ہے،بعض کا حاملینِ عرش کے طور پر آیا،بعض کا ملائکۃ المقرّبین کے نام سے ذکر آیا ہے ،بعض کا کراماً کاتبین کے طور پر آیا ہے ،جہنم کے نگہبان فرشتے کا نام مالک بتایا گیا ہے وغیرہم۔اللہ تعالیٰ کے فرشتوں کی حقیقی اور قطعی تعداد قرآنِ کریم یا احادیثِ صحیحہ میں بیان نہیں فرمائی گئی، اس لیے اُن سب پر اجمالاً ایمان لانا ضروری ہے ۔
	ہر صحابی پر ایمان لانا ضروری نہیں ہے ،جن کی صحابیت احادیث وروایات سے ثابت ہو ،انہیں صحابیِ رسول ماننا لازم ہے اور ہوسکتا ہے کہ کئی ایسے صحابہ وصحابیات ہوں جن کے اسمائے گرامی احادیث وآثار میں مذکور نہیں ہیں ،اُنہیں اجمالی طور پر ماننا لازم ہے۔اگر ہم یہ کہیں کہ ہر صحابی پر ایمان لانا ضروری ہے ،توکسی صحابی کی صحابیت سے انکارپر کفر لازم آئے گا۔بعض صحابۂ کرام کی طرف قرآنِ کریم میں اشارات موجود ہیں ،بطورِ خاص حضرت ابوبکر صدیق رضی اللہ عنہ کا تذکرہ سفرِ ہجرت کے موقع پر غارِ ثور کے حوالے سے قرآن میں بیان فرمایا اور ’’صَاحِب‘‘کہہ کر اُن کا ذکر کیا گیا ہے اور اس پر امت کا اجماع ہے کہ اس کے مصداق وہی ہیں ،یہاں تک کہ اہلِ تشیّع بھی اس کا انکار نہیں کرسکتے ،کیونکہ غار میں آپ ﷺ اور حضرت ابوبکر صدیق رضی اللہ عنہ کے سوا کوئی اورتھا ہی نہیں  اور اس آیت میں چھ مرتبہ اُن کا ذکر ہوا ہے ۔
امام فخر الدین رازی التوبہ:40کی تفسیر میں حضرت ابوبکر صدیق ؄ کی فضیلت اور خصائص کی من جملہ وجوہ میں سے لکھتے ہیں:
’’اللہ تعالیٰ نے ابوبکر کا وصف بیان کیا کہ وہ رسول اللہ ﷺ کے صاحب ہیں اور یہ اُن کی کمالِ فضیلت پر دلالت کرتا ہے، حسین بن فضیل بَجَلی نے کہا: جو ابوبکر کی صحابیت کا انکار کرے ،وہ کافر ہے،کیونکہ امت کا اس پر اجماع ہے :’’ إِذْ يَقُولُ لِصاحِبِهٖ‘‘کا مصداق ابوبکرِ صدیق ہی ہیں اور یہ اس بات پر دلالت کرتا ہے کہ اللہ تعالیٰ نےاُن کا وصف ’’صاحِب‘‘بتایا‘‘۔

علامہ غلام رسول سعیدی  لکھتے ہیں:
’’اس آیت(التوبہ:40) میں اللہ تعالیٰ نے یہ تصریح فرمائی ہے کہ حضرت ابوبکر`
  },
  {
    pageNumber: 23,
    text: `نبی ﷺ کے صاحب ہیں اور یہ نصِ قطعی ہے،اس کا انکار کفر ہے اور تمام صحابہ میں صرف حضرت ابوبکر ؄کی صحابیت منصوص ہے اور آپ کے صحابی ہونے کا انکار کفر ہے،(تبیان القرآن، ج:5، ص:141)‘‘۔
امام احمد رضا قادری نے لکھا ہے:
’’یہ فقہائے کرام کے نزدیک ہے ، متکلمین یعنی ماہرینِ علم العقائد کے نزدیک کفر نہیں ہے، (جِدُّ الْمُمْتَار، ج:3،ص:42)‘‘۔
	سورۃ الاحزاب میں حضرت زید کا نام کے ساتھ ذکر ہوا، بعض دیگر اجلہّ صحابۂ کرام کو بھی بعض آیات کا مصداق قرار دیا گیا ہے ،مہاجرین وانصار ،اہلِ بدر واُحُد ،بیعتِ رضوان،  فتحِ مکہ ودیگر غزوات کے حوالے سے صحابۂ کرام کا ذکرمتعدد مقامات پر قرآنِ مجید میں ہے،چند آیاتِ مبارکہ  پیش کی جاتی ہیں:
(۱)
[[arabic]] لَقَدْ رَضِیَ اللّٰہُ عَنِ الْمُؤْمِنِیْنَ اِذْ یُبَایِعُوْنَکَ تَحْتَ الشَّجَرَۃِ فَعَلِمَ مَا فِیْ قُلُوْبِہِمْ فَاَنْزَلَ السَّکِیْنَۃَ عَلَیْہِمْ وَاَثَابَہُمْ فَتْحًا قَرِیْبًا
ترجمہ:’’بے شک اللہ ایمان والوں سے اس وقت راضی ہوگیا جب وہ درخت کے نیچےآپ سے بیعت کر رہے تھے، سو اللہ جانتا تھا جو کچھ ان کے دلوں میں ہے، پس اللہ نے ان کے دلوں پر طمانیت نازل فرمائی اور ان کو عنقریب آنے والی فتح کا انعام دیا، (الفتح:18)‘‘۔
(۲)
[[arabic]] وَالَّذِیْنَ اٰمَنُوْا وَہَاجَرُوْا وَجَاہَدُوْا فِیْ سَبِیْلِ اللّٰہِ وَالَّذِیْنَ اٰوَوْا وَّنَصَرُوْۤا اُولٰٓئِکَ ہُمُ الْمُؤْمِنُوْنَ حَقًّا ۭ لَہُمْ مَّغْفِرَۃٌ وَّرِزْقٌ کَرِیْمٌ۔ وَالَّذِیْنَ اٰمَنُوْا مِنْۢ بَعْدُ وَہَاجَرُوْا وَجَاہَدُوْا مَعَکُمْ فَاُولٰٓئِکَ مِنْکُمْ ۭ وَاُولُوا الْاَرْحَامِ بَعْضُہُمْ اَوْلٰی بِبَعْضٍ فِیْ کِتٰبِ اللّٰہِ ۭ اِنَّ اللّٰہَ بِکُلِّ شَیْءٍ عَلِیْمٌ
ترجمہ:’’اور جولوگ ایمان لائے اور انہوں نے ہجرت کی اور اللہ کی راہ میں جہاد کیا اور جن لوگوں نے (مہاجرین کو)جگہ دی اور ان کی نصرت کی، یہی لوگ برحق مومن ہیں، ان کے`
  },
  {
    pageNumber: 24,
    text: `لیے بخشش ہے اورعزت والی روزی ہے اور جولوگ بعد میں ایمان لائے اورہجرت کی اورتمہارے ساتھ جہاد کیا، سووہ بھی تم میں سے ہیں اور اللہ کی کتاب میں قرابت دار(بہ طور وراثت) ایک دوسرے کے زیادہ حق دار ہیں ،بے شک اللہ ہر چیز کوخوب جاننے والا ہے‘‘،(الانفال:74-75)‘‘۔
(۳)
[[arabic]] لَا یَسْتَوِیْ مِنْکُمْ مَّنْ اَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقٰتَلَ ۭ اُولٰٓئِکَ اَعْظَمُ دَرَجَۃً مِّنَ الَّذِیْنَ اَنْفَقُوْا مِنْۢ بَعْدُ وَقٰتَلُوْا ۭ وَکُلًّا وَّعَدَ اللّٰہُ الْحُسْنٰی ۭ وَاللّٰہُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ
ترجمہ:’’(اے مسلمانو!) تم میں سے کوئی بھی ان کے برابر نہیں ہوسکتا جنہوں نے فتح ( مکہ) سے پہلے (اللہ کی راہ میں)خرچ کیا اور (کافروں سے)قتال کیا، ان کا (ان مسلمانوں سے) بہت بڑادرجہ ہے جنہوں نے بعد میں (اللہ کی راہ میں) خرچ کیا اور(کافروں سے) قتال کیا، اللہ نے ان سب سے اچھے انجام کا وعدہ فرمایا ہے اور اللہ تمہارے تمام کاموں کی خوب خبر رکھنے والا ہے،(الحدید:10)‘‘۔
(۴)
[[arabic]] وَالسّٰبِقُوْنَ الْاَوَّلُوْنَ مِنَ الْمُہٰجِرِیْنَ وَالْاَنْصَارِ وَالَّذِیْنَ اتَّبَعُوْہُمْ بِاِحْسَانٍ رَّضِیَ اللّٰہُ عَنْہُمْ وَرَضُوْا عَنْہُ وَاَعَدَّ لَہُمْ جَنّٰتٍ تَجْرِیْ تَحْتَہَا الْاَنْہٰرُ خٰلِدِیْنَ فِیْہَاۤ اَبَدًا ۭ ذٰلِکَ الْفَوْزُ الْعَظِیْمُ
ترجمہ:’’اور مہاجرین اور انصار میں سے (نیکی میں)سبقت کرنے والے اور سب سے پہلے ایمان لانے والے اور جن مسلمانوں نے نیکی میں ان کا اتباع کیا، اللہ ان سے راضی ہوگیا اور وہ اللہ سے راضی ہوگئے اور اللہ نے ان کے لیے ایسی جنتیں تیار کی ہیں جن کے نیچے دریا بہتے ہیں ،وہ ان میں ہمیشہ ہمیشہ رہیں گے ،یہی بہت بڑی کامیابی ہے، (التوبہ:100)‘‘۔
(۵)
[[arabic]] مُحَمَّدٌ رَّسُوْلُ اللّٰہِ ۭ وَالَّذِیْنَ مَعَہٗۤ اَشِدَّآءُ عَلَی الْکُفَّارِ رُحَمَآءُ بَیْنَہُمْ تَرٰىہُمْ رُکَّعًا سُجَّدًا یَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰہِ وَرِضْوَانًا ۫ سِیْمَاہُمْ فِیْ وُجُوْہِہِمْ مِّنْ اَثَرِ السُّجُوْدِ`
  },
  {
    pageNumber: 25,
    text: `ذٰلِکَ مَثَلُہُمْ فِی التَّوْرٰىۃِ ۚۖ وَمَثَلُہُمْ فِی الْاِنْجِیْلِ کَزَرْعٍ اَخْرَجَ شَطْاَہٗ فَاٰزَرَہٗ فَاسْتَغْلَظَ فَاسْتَوٰی عَلٰی سُوْقِہٖ یُعْجِبُ الزُّرَّاعَ لِیَغِیْظَ بِہِمُ الْکُفَّارَ ۭ وَعَدَ اللّٰہُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ مِنْہُمْ مَّغْفِرَۃً وَّاَجْرًا عَظِیْمًا
ترجمہ:’’ محمد اللہ کے رسول ہیں، جو ان کے اصحاب ہیں کفار پر بہت سخت ہیں ،آپس میں نرم دل ہیں، (اے مخاطب!) تو ان کو رکوع کرتے ہوئے ،سجدہ کرتے ہوئے دیکھے گا، وہ اللہ کا فضل اور اس کی رضاچاہتے ہیں، ان کی نشانی  ان کے چہروں پرسجدوں کے نشان (انوار)ہیں، ان کی یہ صفت تورات میں ہے اور انجیل میں ان کی صفت یہ ہے:جیسے ایک کھیتی ہو، اس نے اپنی کونپل نکالی، پھر اس نے طاقت پکڑی، پھر وہ دبیز ہوئی ، پھر وہ اپنے تنے پر سیدھی کھڑی ہوگئی ،کاشت کاروں کو بھلی لگتی ہے تاکہ ان کی وجہ سے کافروں کے دل جلیں، ان میں سے جو لوگ ایمان لائے اور انہوں نے نیک عمل کیے ،اللہ نے ان سے بخشش اور اجرِ عظیم کا وعدہ فرمایا ہے، (الفتح:29)‘‘۔
	لیکن یہ ذکر عمومی اعتبار سے ہے ،ہر صحابی کا ذکر شخصی طورنہیں ہے،اس لیے ان میں سے ہر ایک کی صحابیت کاشخصی طور پر اعتقاد رکھنا ضروریاتِ دین میں سے نہیں ہے،لیکن جملہ انبیائے کرام علیہم السلام کی طرح اجمالی اعتقاد یقیناً ہے۔الغرض صحابہ کرام کے عمومی فضائل قرآنِ کریم میں مذکور ہیں،اُن پر سبّ وشتم اور تبرّا کرنے والا ضالّ ،مُضلّ اور مبتدع ہے ۔
[[heading: اسمِ جلالت کی ہیئت میں پنجتن پاک کے نام لکھنا]]
سوال:
	کیا فرماتے ہیں علمائے کرام اس مسئلہ کے بارے میں کہ ہماری مسجد کی تعمیر نو ہوئی ہے اور اس کے محراب میں شیشہ کا کام ہوا ہے ،محراب کی چھت میں کاریگر نے فن خطاطی سے اسمائے پنجتن پاک کو اس طرح ڈھالا ہے کہ بداھۃً اسم اللہ عزوجل معلوم ہوتا ہے اور غور وفکرکے بعداسمائے مبارکہ پنجتن پاک ۔ ایک مفتی صاحب  نے کہا کہ یہ ان غالی شیعوں سے تشابہ ہے جو حضرت علی ؄ یا پنج تن پاک کو ہی اللہ مانتے ہیں اوراس میں تَشَبـُہْ فیِ التَّوْحِیْد ہے، یہ صحیح نہیں ہے ۔دوسرے مفتی صاحب کا کہنا ہے کہ یہ اظہار محبت اہل بیت کا بہترین انداز ہے اور دیو بندیوں وھابیوں کو چڑانے کا خوبصورت مرقعہ ہے ،اب آپ حضرات کو اس تبحر علمی کا واسطہ جو اللہ نے آپ کو عطا فرمایا ہے ہما ری رہنمائی کریں اورمفصل اور مدلل فتوی عنایت کریں ،(سائل:حافظ محمد رمضان مصطفائی ،ٹنڈو محمد خان ، سندھ )۔`
  },
  {
    pageNumber: 26,
    text: `جواب:
	پنجتن پاک کے اسمائے مبارکہ کواس انداز میں لکھنا کہ اسمِ جلالت اللہ کی ہیئت نظر آئے، اگر اس بنا ء پر ہو کہ اَلْعِیَاذُ بِاللّٰہ !اللہ تبارک وتعالیٰ ان پانچ مقدس ہستیوں میں حلول کیے ہوئے ہے، جیسا کہ بعض غالی رافضیوں کا عقیدہ ہے کہ اللہ تعالیٰ حضرت علی میں حلول کیے ہوئے ہے ،تو یہ صریح کفر ہے ۔اللہ رب العزت،کسی مخلوق میں،خواہ اس کا مرتبہ کتنا ہی عظیم تر کیوں نہ ہو، حلول کرنے سے پاک اور منزہ ہے اوراللہ تعالیٰ جسم ،جسمانیات ، اُن کے متعلقات اور تقاضوں سے قطعی طور پرپاک اور مبرّا ہے۔
	قرآن پا ک میں اللہ تبارک و تعالیٰ نے عیسائیوں کے اسی عقیدے کو بیان کرتے ہوئے ارشاد فرمایا:
(۱)
[[arabic]] وَاِذْ قَالَ اللّٰہُ یٰعِیْسَی ابْنَ مَرْیَمَ ءَاَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُوْنِیْ وَاُمِّیَ اِلٰہَیْنِ مِنْ دُوْنِ اللّٰہِ ۭ قَالَ سُبْحٰنَکَ مَا یَکُوْنُ لِیْۤ اَنْ اَقُوْلَ مَا لَیْسَ لِیْ بِحَقٍّ ۭ اِنْ کُنْتُ قُلْتُہٗ فَقَدْ عَلِمْتَہٗ ۭ تَعْلَمُ مَا فِیْ نَفْسِیْ وَلَاۤ اَعْلَمُ مَا فِیْ نَفْسِکَ ۭ اِنَّکَ اَنْتَ عَلَّامُ الْغُیُوْبِ
ترجمہ:’’اور(یاد کرو)جب اللہ فرمائے گا: اے عیسیٰ بن مریم! کیا تو نے لوگوں سے کہا تھا: مجھے اور میری ماں کواللہ کے سوا دومعبود مان لو ،وہ  عرض کریں گے:تو(شریک سے)پاک ہے، میری یہ مجال نہیں تھی کہ میں وہ بات کہتا جس کا مجھے کوئی حق نہیں، اگر(بفرضِ محال)میں نے یہ بات کہی ہوتی تو ضرورتو اُسے جانتا،تو ہر وہ بات جانتا ہے جو میرے دل میں ہےاور میں ہر وہ بات نہیں جانتا جو تیرے علم میں ہے ،بے شک تو ہی سب غیبوں کا جاننے والاہے، (المائدہ: 116)‘‘۔
(2)
[[arabic]] لَقَدْ کَفَرَ الَّذِیْنَ قَالُوْۤا اِنَّ اللّٰہَ ثَالِثُ ثَلٰثَۃٍ
ترجمہ:’’بیشک وہ لوگ کافر ہوگئے جنہوں نے کہا: بلاشبہ اللہ تین میں سے تیسرا ہے ، (المائدہ: 73)‘‘۔
اس آیت کی تفسیر میںصدرالافاضل علامہ سید محمد نعیم الدین مراد آبادی فرماتے ہیں:`
  },
  {
    pageNumber: 27,
    text: `’’یہ قول نصارٰی کے فرقہ مرقوسیہ و نسطوریہ کا ہے ۔ اکثر مفسِّرین کا قول ہے کہ اس سے ان کی مراد یہ تھی کہ اللہ اور مریم اور عیسٰی تینوں اِلٰہ ہیں اوراِلٰہ ہونا ان سب میں مشترک ہے ۔ متکلِّمین فرماتے ہیں: نصارٰی کہتے ہیں کہ باپ ، بیٹا ، روح القدس یہ تینوں ایک اِلٰہ ہیں ‘‘۔
امام فخر الدین رازی تفسیر کبیر میں اس آیت کے تحت لکھتے ہیں:
[[arabic]] اِنَّ الْمُتَکَلِّمِیْنَ حَکَوْا عَنِ النَّصَارٰی اَنَّھُمْ یَقُوْلُوْنَ:جَوْھَرٌوَاحِدٌ ،ثَلَاثَۃُ اَقَانِیْم:اَبٌ ، وَاِبْنٌ،وَرُوْحُ الْقُدُسِ،وَھٰذِہِ الثَّلَاثَۃُ اِلٰہٌ وَاحِدٌ ، کَمَااَنَّ الشَّمْسَ اِسْمٌ یَتَنَاوَلُ الْقُرْصَ وَالشُّعَاعَ وَالْحَرَارَۃَ ،وَعَنَوْابِالْاَبِ الذَّاتَ، وَبِالْاِبْنِ الْکَلِمَۃَ ، وَبِا لرُّوْحِ  الْحَیَاۃَ ، وَاَثْبَتُوا الذَّاتَ وَالْکَلِمَۃَ وَالْحَیَاۃَ ، وَقَالُوْا::اِنَّ الْکَلِمَۃَ الَّتِیْ ھِیَ کَلَامُ اللّٰہِ اخْتَلَطَتْ بِجَسَدِعِیْسٰی اِخْتِلَاطَ الْمَاءِ بِا لْخَمْرِ ، وَاِخْتِلَا طَ الْمَاءِ بِا للَّبَنِ ، وَزَعَمُوْا اَنَّ الْاَبَ اِلٰہٌ وَالْاِبْنَ اِلٰہٌ وَالرُّوْحَ اِلٰہٌ وَالْکُلُّ اِلٰہٌ وَاحِدٌ ،وَاعْلَمْ اَنَّ ھٰذَا مَعْلُوْمُ الْبُطْلَانِ بِبَدِیْھَۃِ الْعَقْلِ، فَاِنَّ الثَّلَاثَۃَ لَا تَکُوْنُ وَاحِدًا، وَالْوَاحِدَ لَا یَکُوْنُ ثَلَاثَۃً ، وَلَا یُرٰی فِی الدُّنْیَامَقَالَۃٌ اَشَدُّ فَسَادًا وَاَظْہَرُ  بُطْلَانًا مِّنْ مَّقَالَۃِ النَّصَارٰی
ترجمہ:’’ متکلمین نے نصاری کے حوالے سے بیان کیاہے :(الوہیت )ایک جوہر ہے اور(اس کی) تین اقنوم (یعنی اصلیں)ہیں : باپ ، بیٹا ، اور روح القدس ، اور یہ تینوں (بحیثیت مجموعی )ایک خدا ہیں، جیسے سورج قُرص ، شعاع اور حرارت تینوں پرمشتمل ہے اور انہوں نے باپ سے ذات ،بیٹے سے کلمہ اور روح القدس سے حیات مراد لی ہے۔ انہوں نے ذات ، کلمہ اور حیات کو ثابت کیا اور کہا: کلمہ اللہ کا کلام ہے جو حضرت عیسیٰ کے جسم میں حلول کر گیا ، جیسے پانی شراب یا دودھ میںمل جاتا ہے اور انہوں نے گمان کیا: باپ(بھی) خدا ہے ، بیٹا (بھی)خداہے اور روح(بھی) خدا ہے اوراس کے باوجود سب ایک ہی خدا ہیں ۔اور جان لو کہ نصاریٰ کا یہ عقیدہ بداہۃًباطل ہے (یعنی اس کے بطلان کو سمجھنے کے لیے کسی غوروفکر کی ضرورت نہیں ہے) ، کیونکہ تین ایک نہیں ہوتا اور ایک تین نہیںہوتے اور نصاریٰ کے اس قول سے زیادہ فاسد اور واضح طور پرباطل بات دنیا میں اور کوئی نہیں ہے‘‘۔
محدث اعظم پاکستان علامہ غلام رسول سعیدی لکھتے ہیں:`
  },
  {
    pageNumber: 28,
    text: `’’نصاریٰ میں سے ایک فرقہ یعقوبیہ ہے ،جس کا عقیدہ ہے کہ مسیح ابن مریم ہی اللہ ہے ، وہ کہتے ہیں : اللہ تین اقانیم (اصلوں )سے مرکب ہے : باپ ، بیٹا اور روح القدس۔ باپ اللہ ہے، بیٹا مسیح ہے اور باپ (اللہ)بیٹے ( مسیح)میں حلول کر کے اسکے ساتھ متحدہوگیا اور روح القدس بن گیا اور ان میں سے ہر ایک دوسرے کا عین ہے۔ ان کے اس قول کا خلاصہ یہ ہے کہ مسیح ہی اللہ ہے ، حالانکہ حضرت عیسی علیہ السلام نے پیدا ہوتے ہی جو کلمہ سب سے پہلے کہا ، وہ یہ تھا:’’میں اللہ کا بندہ ہوں‘‘۔
( تبیان القرآن،ج:3،ص:260،فرید بک اسٹال ،لاہور)
	الغرض عیسائیوں کے مذکورہ باطل عقیدے کی طرح بعض غالی روافض بھی پنجتن پاک بالخصوص حضرت علی ؄ میں اللہ تعالی ٰ کا حلول مانتے ہیں جو کہ صریح کفر ہے ، پس اسمائے پنجتن پاک کو اس طرح لکھنے میں اس کفریہ عقیدے کا ایہام پایا جا رہا ہے اور کسی کفریہ معنی کا ایہام ہی اس بات کے ممنوع ہونے کے لیے کافی ہے ،اگرچہ اس کی کوئی صحیح تاویل بھی موجود ہو ۔رہی یہ توجیہ کہ پنجتن پاک کا نام عقیدت ومحبت کے اظہار کے لیے لکھا جاتا ہے، تو اُس کے لیے ایسا پیرایہ اختیار کرنا چاہیے کہ جس میں اس طرح کا نہ کوئی ایہام اور اشتباہ پیدا ہواور نہ ہی لوگوں کو انگشت نمائی کا موقع ملے۔
علامہ ابن عابدین شامی لکھتے ہیں:
[[arabic]] اَنَّ مُجَرَّدَ اِیْھَامِ الْمَعْنَی الْمُحَالِ کَافٍ فِی الْمَنْعِ عَنِ التَّلَفُّظِ بِھٰذَا الْکَلَامِ وَاِنِ احْتَمَلَ مَعْنًی صَحِیْحاً
ترجمہ:’’عبارت سے محض محال معنی کا وہم پیدا ہونا ہی ایسے کلام کو منع کرنے کے لیے کافی ہے ،خواہ (کسی کے نزدیک)وہ صحیح معنی کا احتمال بھی رکھتاہو‘‘۔
(رد المحتار: ج: 9، ص:625)
	الغرض پنجتن پاک کا نام اسمِ جلالت کی ہیئت میں لکھنا کبھی بھی مسلمانوں کا شِعار نہیں رہا اور ہمیں کوئی ایسا انداز اختیار کرنے سے احتراز کرنا چاہیے جو مسلمانوں میں کسی بھی درجے میں افتراق وانتشار کا باعث بنے اور اس سے دینِ حق اسلام اور مسلکِ حق اہلسنت وجماعت کو کوئی فائدہ بھی حاصل نہ ہو۔خصوصاً اس پر فتن دور میں دینی مصلحت وحکمت کے تحت اس طرح کے اندازِ تحریر سے اجتناب لازم ہے ،حدیث پا ک میں ہے:`
  },
  {
    pageNumber: 29,
    text: `(1)
[[arabic]] عَنْ أَبِی أَیُّوبِ الْأَنْصَارِیِّ رَضِیَ اللّٰہُ عَنْہُ ،قَالَ::قَالَ رَسُوْلُ اللّٰہِ ﷺ:إِذَا صَلَّیْتَ فَصَلِّ صَلَاۃَ مُوَدِّعٍ وَلَا تَتَحَدَّثَنَّ بِکَلَامٍ تَعْتَذِرُ مِنْہُ غَدًا، قَالَ أَبُو بَکْرٍ: وَقَالَ بَعْضُ الْحُکَمَاءِ::إِیَّاکَ وَمَا یُعْتَذَرُ مِنْہُ، وَمَا یُسْتَحْیَا مِنْ ذِکْرِہٖ، فَإِنَّمَا یُعْتَذَرُ مِنَ الذَّنْبِ، وَیُسْتَحْیَا مِنَ الْقَبِیحِ
ترجمہ:’’حضرت ابوایوب انصاری ؄ بیان کرتے ہیں :رسول اللہ ﷺ نے فرمایا: ’’جب تم نماز پڑھو (تو اس انہماک سے پڑھو کہ گویا یہ تمہاری زندگی کی )آخری نماز ہے اور ہر ایسی بات سے بچو جس پر بعد میں تمہیںعذر خواہی کرنی پڑے، ابوبکر نے کہا: کسی دانا کا قول ہے :ہر اُس چیز سے بچو ،جس سے عذر خواہی کرنی پڑے اور اس کے ذکر سے حیا آئے، کیونکہ گناہ پر عذر خواہی کرنی پڑتی ہے اور قبیح بات (بیان کرنے )سے حیاآتی ہے،(مکارم الاخلاق للخرائطی:484)‘‘۔
(2):
[[arabic]] عَنْ أَبِی الْحَوْرَاءِ السَّعْدِیِّ قَالَ::قُلْتُ:لِلْحَسَنِ بْنِ عَلِیٍّ رَضِیَ اللّٰہُ عَنْہُمَا :مَاحَفِظْتَ مِنْ رَسُوْلِ اللّٰہِ ﷺ،قَالَ::حَفِظْتُ مِنْ رَّسُوْلِ اللّٰہِ ﷺ:دَعْ مَا یَرِیْبُکَ إِلٰی مَالاَ یَرِیْبُکَ، فَإِنَّ الصِّدْقَ طُمَأْنِیْنَۃٌ وَإِنَّ الْکَذِبَ رِیْبَۃٌ
ترجمہ:’’ابوحوراء بیان کرتے ہیں: میں نے حسن بن علی سے کہا: آپ نے رسول اللہ ﷺ سے (سب سے مفید بات )کون سی یاد رکھی ہے ؟، انہوں نے کہا: میں نے رسول اللہ ﷺ سے (اہم بات یہ )یاد کر رکھی ہے :’’جو چیز تمہیں شک میں ڈالے،اسے چھوڑ دواوراس کے بجائے اس بات کو اختیارکرو جو تمہیں شک میں نہ ڈالے (یعنی اس کی صحت واضح ہو)،کیونکہ سچائی میں طمانیتِ قلب ہے اور جھوٹ میں بے اطمینانی ہے،(سنن ترمذی:2518)‘‘۔
	البتہ ہمارے لیے حکم یہ ہے کہ ہم مسلمانوں کے بارے میں حسن ظن سے کام لیںاور جب تک`
  },
  {
    pageNumber: 30,
    text: `کسی کے کفریہ عقیدے کا قطعی اور صریح ثبوت ہمارے علم میں نہ ہو، ہم ان پر کفرکا حکم لگانے سے اجتناب کریں،اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] یٰۤاَیُّہَا الَّذِیْنَ اٰمَنُوا اجْتَنِبُوْا کَثِیْرًا مِّنَ الظَّنِّ ۣ اِنَّ بَعْضَ الظَّنِّ اِثْمٌ
ترجمہ:اے ایمان والو! بہت گمانوں سے بچو، بے شک بعض گمان گناہ ہوتے ہیں، (الحجرات: 12)‘‘۔حدیث پاک میں ہے :
[[arabic]] إِیَّاکُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَکْذَبُ الحَدِیْثِ
ترجمہ:’’بدگمانی سے بچو ، پس بے شک بدگمانی سب سے جھوٹی بات ہے،(صحیح البخاری: 5143)‘‘۔
	اگر کوئی یہ فاسد استدلال کرے کہ مخلوق میں اللہ کے حلول کا تصورقرآنِ کریم میں موجود ہے ،چنانچہ  فرمایا:
[[arabic]] فَلَمَّا قَضٰی مُوْسَی الْاَجَلَ وَسَارَ بِاَہْلِہٖۤ اٰنَسَ مِنْ جَانِبِ الطُّوْرِ نَارًا ۫ قَالَ لِاَہْلِہِ امْکُثُوْۤا اِنِّیْۤ اٰنَسْتُ نَارًا لَّعَلِّیْۤ اٰتِیْکُمْ مِّنْہَا بِخَبَرٍ اَوْ جَذْوَۃٍ مِّنَ النَّارِ لَعَلَّکُمْ تَصْطَلُوْنَ۔ فَلَمَّاۤ اَتٰىہَا نُوْدِیَ مِنْ شَاطِیِٔ الْوَادِ الْاَیْمَنِ فِی الْبُقْعَۃِ الْمُبٰرَکَۃِ مِنَ الشَّجَرَۃِ اَنْ یّٰمُوْسٰۤی اِنِّیْۤ اَنَا اللّٰہُ رَبُّ الْعٰلَمِیْنَ
ترجمہ: پس جب موسیٰ نے اپنی مدت پوری کرلی اور اپنی اہلیہ کو لے کر (مصرکی جانب )چلے تو انہوں نے طور کی طرف سے ایک آگ دیکھی ،اپنی اہلیہ کو فرمایا: تم یہیں ٹھہرو، میں نے آگ دیکھی ہے ،شاید میں وہاں سے کوئی خبر لائوں یا آگ کا کوئی شعلہ لائوں تاکہ تم تپش حاصل کرو، پھر جب موسیٰ آگ کے پاس حاضر ہوئے تومیدان کے دائیں کنارے سے برکت والے مقام میں ایک درخت سے پکارا گیا :اے موسیٰ!بے شک میں ہی اللہ رب العالمین ہوں، (القصص:29-30)‘‘۔
	اس سے یہ کہیں ثابت نہیں ہوتا کہ العیاذ باللہ تعالیٰ!اللہ تعالیٰ نے درخت میں حلول کرلیا تھا،اللہ تعالیٰ کی ذات اس سے برتر اور پاک ہے ،ہاں !وہ اس بات پر قادر ہے کہ کہیں سے بھی اُس کی جانب سے ندا آئے،اُس کی ذات کی طرح اس کی صوت (آواز)`
  },
  {
pageNumber: 31,
text:` بھی جسم اور جسمانی تقاضوں اور مادی عوارض سے پاک ہے۔ ہو سکتا ہے کوئی اس حدیث مبارک کا بھی حوالہ دے: [[arabic: عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ : إِنَّ اللَّهَ قَالَ : مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَى عَبْدِى بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَى بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَبْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لأُعْطِيَنَّهُ ، وَلَبِنِ اسْتَعَاذَنَ لَاعِيُنَنَّهُ، وَمَا تَرَدَّدْتُ عَنْ شَيْءٍ أَنَا فَاعِلُهُ تَرَدُّدِى عَنْ نَفْسِ الْمُؤْمِنِ ، يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ]] ترجمہ: حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ نے فرمایا: جس شخص نے میرے کسی ولی سے عداوت رکھی تو میں اس سے اعلانِ جنگ کرتا ہوں اور میری محبوب ترین چیز جس سے میرا بندہ میرا تقرب حاصل کرتا ہے، وہ عبادات ہیں جو میں نے اس پر فرض کی ہیں اور میرا بندہ نوافل کے ذریعے مسلسل میرا قرب حاصل کرتا رہتا ہے حتی کہ میں اس سے محبت کرتا ہوں، پس جب میں اس سے محبت کرتا ہوں تو میں اس کے کان ہو جاتا ہوں جن سے وہ سنتا ہے اور میں اس کی وہ آنکھ ہو جاتا ہوں جس سے وہ دیکھتا ہے اور میں اس کے وہ ہاتھ ہو جاتا ہوں جن سے وہ پکڑتا ہے اور اس کے وہ پیر ہو جاتا ہوں جن سے وہ چلتا ہے اور اگر وہ مجھ سے سوال کرے تو میں ضرور اس کو عطا کرتا ہوں اور اگر وہ میری پناہ میں آنا چاہے تو میں ضرور اُسے پناہ دیتا ہوں اور میں کسی کام میں جس کو میں کرنے والا ہوں ، ایسا تردد نہیں کرتا جیسا تردد میں مومن کی روح کو قبض کرنے میں کرتا ہوں کہ وہ موت کو نا پسند کرتا ہے اور میں اُسے رنجیدہ کرنے کو نا پسند کرتا ہوں۔ (صحیح البخاری : 6502) حاشا وکلا ! یہاں تردد سے یہ مراد نہیں ہے کہ اللہ فیصلہ نہیں کر پاتا، جیسا کہ بعض اوقات بندے کو تردد لاحق ہوتا ہے، بلکہ یہاں مراد یہ ہے کہ اللہ اُس کی اجل میں تاخیر فرما دیتا ہے اور
`},
{
pageNumber: 32,
text:` مہلت دیتا ہے، اس کو تقدیر معلق کہتے ہیں ، قرآن کریم کی یہ آیت مبارکہ : ”[[arabic: وَلَنْ يُؤَخِّرَ اللهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا]]“، ترجمہ: اور جب کسی شخص کی اجل (موت کا مقررہ وقت ) آجائے تو اللہ اسے ہرگز مہلت نہیں دے گا، (المنافقون: 11) ۔ یہ آیت تقدیر مبرم کے بارے میں ہے اور تقدیر مبرم یقینا نہیں ٹلتی ، بلکہ نافذ ہو کر رہتی ہے۔ اس حدیث کے تحت کسی نے بھی یہ قول نہیں کیا کہ معاذ اللہ ! اللہ تعالیٰ بندے میں حلول فرمالیتا ہے، بلکہ محدثین کرام نے اس کی توجیہات کی ہیں، علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں : اللہ تعالیٰ بندے کے کان اور آنکھیں ہو جاتا ہے، اس کی کیا توجیہ ہے، عام طور پر شارحین اور علماء نے یہ کہا ہے کہ بندہ اپنے کانوں سے وہی سنتا ہے جس کے سننے کا اللہ تعالیٰ نے حکم دیا ہے اور اپنی آنکھوں سے وہی دیکھتا ہے جس کے دیکھنے کا اللہ تعالیٰ نے حکم دیا ہے تو بندے کا سننا ، اللہ کا سننا اور بندے کا دیکھنا اللہ کا دیکھنا ہوتا ہے، اس لیے فرمایا: میں اس کے کان ہو جاتا ہوں اور اس کی آنکھیں ہو جاتا ہوں لیکن اس پر یہ اعتراض ہے کہ کوئی بندہ اس وقت تک اللہ تعالیٰ کا محبوب نہیں بنے گا جب تک کہ اس کا سننا، اس کا دیکھنا، اس کا تصرف کرنا اور اس کا چلنا اللہ تعالیٰ کے احکام کے مطابق نہ ہو اور جب اللہ تعالیٰ اس کو اپنا محبوب بنالے گا تو پھر اللہ اس کے کان ہو جاتا ہے اور اس کی آنکھیں ہو جاتا ہے کا معنی یہ نہیں ہو سکتا، اس حدیث کی بہترین توجیہ امام رازی رحمۃ اللہ علیہ نے کی ہے، وہ فرماتے ہیں: بندہ جب عبادات پر دوام کرتا ہے تو وہ اس مقام پر پہنچ جاتا ہے جس کے متعلق اللہ تعالیٰ نے فرمایا: میں اس کی آنکھ ہو جاتا ہوں اور اس کے کان ہو جاتا ہوں، پس جب اللہ کا نور جلال اس کے کان ہو جاتا ہے تو وہ قریب اور دور سے سن لیتا ہے اور جب اس کا نور جلال اس کی آنکھ ہو جاتا ہے تو وہ قریب اور بعید کو دیکھ لیتا ہے اور جب اس کا نور اس کے ہاتھ ہو جاتا ہے تو وہ مشکل اور آسان چیزوں پر اور قریب اور بعید کی چیزوں کے تصرف پر قادر ہو جاتا ہے۔
`},
{
pageNumber: 33,
text: `خلاصہ یہ ہےکہ اللہ کا ولی فرائض پر دوام اور نوافل پر پابندی کرنے سے اس مقام پر پہنچ جاتا ہے کہ وہ اللہ تعالیٰ کی صفات کا مظہر ہو جاتا ہے، لیکن بندہ، بندہ ہی رہتا ہے خدا نہیں ہو جاتا ، جیسے آئینے میں کسی چیز کا عکس ہوتو آئینہ وہ چیز نہیں بن جاتا، اس کی صورت کا مظہر ہو جاتا ہے، بلاتشبیہ تمثیل جب بندہ کامل کی اپنی صفات فنا ہو جاتی ہیں تو وہ اللہ تعالی کی صفات کا مظہر ہو جاتا ہے، ( تبیان القرآن، ج: 5، ص: 418)۔

[[heading: اللہ تعالیٰ کو حاضر و ناظر کہنا]]

سوال:
اللہ تعالیٰ کو حاضر ناظر کہنا درست ہے؟ ، ( حافظ محمد جمشید ہاشمی، کوٹ ادو)۔

جواب:
اللہ تعالیٰ کے اسمائے صفات توقیفی ہیں، تو قیفی سے مراد یہ ہے کہ یہ نقل و سماع پر موقوف ہیں، یعنی جو قرآن وحدیث میں آئے ہیں کسی نے اپنی عقل سے مقرر نہیں کیے۔ پس حاضر و ناظر اللہ تعالیٰ کے اسمائے تو قیفیہ میں سے نہیں ہے، ان کے بعض معانی شان الوہیت کے منافی ہیں ، اس لیے اللہ تعالیٰ کو حاضر و ناظر نہیں کہنا چاہیے لیکن اگر کسی نے تاویل کر کے حاضر کو جاننے والے اور ناظر کو دیکھنے والے کے معنی میں کہا تو اس کی تکفیر نہیں کی جائے گی۔
تنویر الابصار مع الدر المختار میں ہے : ”[[arabic: وَيَا حَاضِرُ يَا نَاظِرُ لَيْسَ بِكُفْرٍ]]“۔
ترجمہ : اور یا حاضر یا ناظر کہنا کفر نہیں ہے۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: فَإِنَّ الْحُضُورَ بِمَعْنَى الْعِلْمِ شَائِعٌ : مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَالنَّظَرُ بِمَعْنَى الرُّؤْيَةِ : أَلَمْ يَعْلَمُ بِأَنَّ اللهَ يَرَى ، فَالْمَعْنَى : يَا عَالِمُ مَنْ يَرَى ، بَرَانِيَّةٌ]]
ترجمہ : ” کیونکہ حضور علم کے معنی میں اور نظر رویت کے معنی میں شائع اور معروف ہے اور یہ قرآن کریم کی ان آیات سے مستفاد ہیں : [[arabic: مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ]]
`}, 
{ pageNumber: 34,
   text:`ترجمہ: ” جہاں تین آدمی سرگوشی کریں ، (وہاں) چوتھا اللہ اُن کے ساتھ ہے، (المجادلہ:7)
[[arabic: أَلَمْ يَعْلَمُ بِأَنَّ الله يرى]] ، ترجمہ:” کیا اس نے یہ نہ جانا کہ بے شک اللہ (سب کچھ) دیکھ رہا ہے، (العلق : 14) ، پس [[arabic: يَا حَاضِرُ يَا نَاظِرُ]] کا معنیٰ ہوا : اے جاننے والے ، اے دیکھنے والے!، بحوالہ بزازیة، ( رد المحتار على الدر المختار ، جلد 13 ص: 126، دمشق)۔
قرآن کریم میں اللہ تعالیٰ کے لیے شہید و بصیر کے کلمات آئے ہیں :
(1) [[arabic: وَاللَّهُ عَلَى كُلِّ شَيْ شَهِيدٌ]]۔
ترجمہ: اور اللہ ہر چیز پر نگہبان ہے، (البروج:9)۔
(۲) [[arabic: إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ]]
ترجمہ: بے شک وہی بہت سننے والا، بہت دیکھنے والا ہے، (الاسراء:1)۔
(۳) [[arabic: وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ]]
ترجمہ : ” اور جو کچھ یہ کر رہے ہیں، اس کو اللہ خوب دیکھنے والا ہے، (البقرہ:96)۔
الغرض اللہ کے لیے رویت کے معنی میں ناظر اور بصیر کے کلمات استعمال کرنا قرآن کریم سے ثابت ہیں لیکن ہم کہیں گے: ہمارا ان کے حق ہونے پر ایمان ہے، اللہ تعالیٰ جسم اور جسمانی اعضا سے پاک ہے ، ان کلمات کے معنی اور مراد ہم اللہ تعالیٰ کے علم پر تفویض کرتے ہیں اور اس کے مصداق کے تعین کے ہم مکلف نہیں ہیں۔
حاضرکا معنی عربی کی مشہور لغت المنجد اور مختار الصحاح میں یہ ہیں : نزدیکی، صحن، حاضر ہونے کی جگہ، جو چیز کھلم کھلا بے حجاب آنکھوں کے سامنے ہو اور ناظر کے معنی مختار الصحاح میں آنکھ کے ڈھیلے کی سیاہی“ کے ہیں، جبکہ نظر کے معنی ہیں : ” کسی امر میں تفکر و تدبر کرنا اور آنکھ سے کسی چیز میں تامل کرنا ہیں ۔ لغوی معنی کے اعتبار سے ان دونوں لفظوں کے معانی سے اللہ تعالیٰ کی ذات پاک ہے، بغیر تاویل کے اللہ تعالیٰ کے لیے ان الفاظ کو نہیں بولا جا سکتا ، کیونکہ اللہ تعالیٰ کے اسماء مبارکہ توقیفی، یعنی نقل و 
سماع پر موقوف
`}, 

{ pageNumber: 35,
   text:`ہیں اور اسماء حسنی میں یہ دونوں کلمات (حاضر و ناظر ) بطور اسم یا صفت شامل نہیں ہیں ، قرآن وحدیث میں اللہ تعالیٰ کے لیے نہ یہ الفاظ آئے ہیں اور نہ صحابہ کرام، تابعین وائمہ مجتہدین نے استعمال کیے ہیں ۔ اسی طرح اللہ تعالیٰ کے اسمائے صفات میں مُعلِّم ، تونہیں آیا لیکن اللہ تعالیٰ کے تعلیم فرمانے کے بارے میں آیات آئی ہیں :
(1) [[arabic: الرَّحْمَنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنْسَانَ عَلَّمَهُ الْبَيَانَ]]
ترجمہ : ” رحمن نے قرآن سکھایا ، انسان کو پیدا کیا (اور) اسے اظہار کی صلاحیت سکھائی ، (الرحمن : 4-1) میں اللہ تعالیٰ کے لیے تعلیم دینے کا کلمہ آیا ہے۔
(۲) [[arabic: وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا]]
ترجمہ: اور اس نے آدم کو سب مسمیات (چیزوں) کے نام سکھائے، (البقرہ:31)۔
(۳) [[arabic: وَ عَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا]]۔
ترجمہ: اور جو کچھ آپ نہیں جانتے تھے، وہ آپ کو سکھایا اور آپ پر اللہ کا بڑا فضل ہے، (النساء : 113)۔
اسی طرح قرآن کریم میں بعض طبقات کے لیے اللہ تعالیٰ کی نظرِ رحمت سے محرومی کا ذکر ہے:
(1) [[arabic: إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا أُولَئِكَ لَا خَلَاقَ لَهُمْ فِي الْآخِرَةِ وَلَا يُكَلِّمُهُمُ اللهُ وَلَا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيِّمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ اليم]] ۔ (آل عمران : 77)
ترجمہ: بے شک جو لوگ اللہ کے عہد اور اپنی قسموں کے عوض تھوڑی سی قیمت لے لیتے ہیں ، ان لوگوں کے لیے آخرت میں کوئی حصہ نہیں ہے اور نہ آخرت میں اللہ تعالیٰ ان سے کوئی کلام کرے گا اور نہ قیامت کے دن ان کی طرف نظر (رحمت) فرمائے گا اور نہ ان کو پاکیزہ کرے گا اور ان کے لیے درد ناک عذاب ہے۔
حدیث پاک میں ہے:
[[arabic: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ عَنِ النَّبِيِّ قَالَ : ثَلَاثَةٌ لا يُكَلِّمُهُمُ اللَّهُ يَوْمَ القِيَامَةِ]]
`}, { pageNumber: 36,
   text:`[[arabic: وَلَا يَنْظُرُ إِلَيْهِمْ : رَجُلٌ حَلَفَ عَلَى سِلْعَةٍ لَقَدْ أُعْطَى بِهَا أَكْثَرَ مِمَّا أُعْطَى وَهُوَ كَاذِبٌ ، وَرَجُلٌ حَلَفَ عَلَى يَمِينِ كَاذِبَةٍ بَعْدَ العَصْرِ ، لِيَقْتَطِعَ بِهَا مَالَ رَجُلٍ مُسْلِمٍ، وَرَجُلٌ مَنَعَ فَضْلَ مَاءٍ فَيَقُولُ اللهُ الْيَوْمَ أَمْنَعُكَ فَضْلِي كَمَا مَنَعْتَ فَضْلَ مَا لَمْ تَعْمَلُ يَدَاكَ]]
ترجمہ : حضرت ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی ﷺ نے فرمایا: اللہ تعالیٰ تین آدمیوں سے قیامت کے دن کلام نہیں فرمائے گا اور نہ اُن کی طرف نظر (رحمت) فرمائے گا: ایک وہ شخص جس نے قسم کھائی کہ اسے اس سودے کی قیمت اس سے زیادہ دی جا رہی تھی جتنی اب دی جارہی ہے اور وہ اس قسم میں جھوٹا تھا، دوسرا وہ شخص جس نے عصر کے بعد جھوٹی قسم پر حلف اٹھایا تا کہ اس قسم کے ذریعہ کسی مسلمان شخص کا مال لے لے، تیسرا وہ شخص جس نے اپنی ضرورت سے زائد پانی سے کسی کو منع کیا، اللہ تعالیٰ اس سے فرمائے گا : آج میں تجھے اپنے فضل سے اسی طرح محروم کر دوں گا ، جس طرح تو نے اپنی ضرورت سے زائد ( پانی دوسرے ضرورت مند کو دینے ) سے منع کیا تھا ، حالانکہ اس چیز کو تو نے پیدا نہیں کیا تھا ۔ ( صحیح بخاری:2369)
(۲) [[arabic: عَنِ ابْنِ عُمَرَأَنَّ رَسُولَ اللهِ قَالَ : لَا يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّثَوْبَهُ خُيَلَاءَ]]
ترجمہ : حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ ﷺ نے فرمایا: جو شخص تکبر سے کپڑا گھسیٹ کر چلے ،اللہ تعالیٰ اس کی طرف نظر ( رحمت ) نہیں فرمائے گا ، ( صحیح مسلم: 2085) نظر رحمت کی بابت اور بھی احادیث ہیں۔ اس سے معلوم ہوتا ہے کہ اللہ تعالیٰ اپنے بعض محبوب بندوں پر نظر رحمت فرماتا ہے لیکن اسے ناظر کہنا درست نہیں ہے۔
امام اعظم ابوحنیفہ رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: لَمْ يَزَلْ وَلَا يَزَالُ بِأَسْمَائِهِ وَصِفَاتِهِ النَّاتِيَةِ وَالْفِعْلِيةِ، أَمَّا الذَّاتِيَةُ فَالْحَيَاةُ وَالْقُدْرَةُ وَالْعِلْمُ وَالْكَلَامُ وَالسَّبْعُ وَالْبَصَرُ وَالْإِرَادَةُ]]
ترجمہ : ” وہ اپنے اسماء اور اپنی صفات ذاتیہ اور صفات فعلیہ کے ساتھ ہمیشہ موصوف رہا ہے اور ہمیشہ منتصف رہے گا اور صفات ذاتیہ یہ ہیں : حیات ، قدرت علم کلام ، سننا ، دیکھنا اور`
}, 
{ pageNumber: 37, 
  text:`اراده، (الفقہ الاکبر ص : 25-24)
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں :
ائمہ اربعہ اور دیگر متقدمین کے نزدیک اللہ تعالیٰ کی آنکھیں بھی ہیں اور اس کے ہاتھ بھی ہیں لیکن وہ ہماری طرح جسمانی اعضا نہیں ہیں، بلکہ مخلوقات اور ممکنات میں اس کی کوئی مثال نہیں ہے، قرآن مجید میں ہے: [[arabic: لَيْسَ كَمِثْلِهِ]] ترجمہ: اس کی مثل کوئی چیز نہیں ہے ، (الشوری: 11 ) ۔ قرآن مجید میں اللہ تعالی کے لیے جو ید ،عین اور ساق وغیرہ کے کلمات آئے ہیں ، ہم اُن پر ایمان لاتے ہیں ، اُن کی نفی نہیں کرتے اور نہ ان میں کوئی تاویل کرتے ہیں ، اس کے ہاتھ ، آنکھیں اور پنڈلی ہیں جیسے اس کی شان کے لائق ہیں لیکن ممکنات اور مخلوقات میں ان کی کوئی مثال نہیں ہے، وہ جسم اور جسمانی اعضاء سے مبر ا اور منز ہ اور پاک ہے، یہ ہمارے لیے متشابہات میں سے ہیں ، ( تبیان القرآن، جلد 11 ص: 584)
صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں :
حیات ، قدرت سننا ، دیکھنا ، کلام، علم اور ارادہ اُس کی صفات ذاتیہ ہیں ، مگر کان، آنکھ، زبان سے اُس کا کا سننا ، دیکھنا ، کلام کرنا نہیں کہ یہ سب اجسام ہیں اور اجسام سے وہ پاک ہے۔ ہر پست سے پست آواز کو سنتا ہے، ہر باریک سے باریک کو کہ خورد بین سے محسوس نہ ہو، وہ دیکھتا ہے ، بلکہ اُس کا دیکھنا اور سننا انہیں چیزوں پر منحصر نہیں ، ہر موجود کو دیکھتا ہے اور ہر موجود کو سنتا ہے ، (بہار شریعت ، جلد اول ص : 7 ) ۔
فتاوی فیض الرسول میں ہے:
اگر حاضر و ناظر به معنی شہید و بصیر اعتقاد رکھتے ہیں یعنی ہر موجود اللہ تعالیٰ کے سامنے ہے اور وہ ہر موجود کو دیکھتا ہے، تو یہ عقیدہ حق ہے ، مگر اس کی تعبیر حاضر و ناظر سے کرنا یعنی اللہ تعالی کے بارے میں حاضر و ناظر کا لفظ استعمال نہیں کرنا چاہیے لیکن اگر پھر بھی کوئی شخص اس لفظ کو اللہ تعالیٰ کے بارے میں بولے تو وہ کفر نہ ہوگا ، جیسا کہ درمختار مع شامی جلد سوم، ص : 307 میں ہے : [[arabic: يَا حَاضِرَ يَا نَاظِر لَيْسَ بِكُفْرٍ وَهُوَ أَعْلَمُ]] ، ( جلد اول ص : 3 ) ۔
`}, 
{ pageNumber: 38, 
  text:`[[heading: نماز کی تو ہین کفر ہے]]  

سوال:
میرے شوہر کی طبیعت ٹھیک نہیں رہتی ، اُن کے پیٹ کا نظام اکثر خراب رہتا ہے، جس کی وجہ سے اُنہیں ٹھیک طریقے سے نیند نہیں آتی اور چڑچڑاہٹ کا شکار ہو جاتے ہیں، اسی دوران اُن کے منہ سے عید الاضحیٰ سے دو یا تین دن پہلے یہ الفاظ نکل گئے : ”بھاڑ میں جائے عید کی نماز ، اگر میں سو جاؤں تو نہ اُٹھانا" لیکن پھر اُنہوں نے نماز بھی پڑھی اور اللہ تعالیٰ سے معافی بھی بہت مانگی ، اس بارے میں اُن کے لیے کیا حکم ہے وہ شادی شدہ اور بچوں والے ہیں، (ایک دینی بہن، کراچی)

جواب:
آپ کے شوہر نے نماز کے متعلق جو نازیبا کلمات کہے ہیں ، وہ کفریہ کلمات ہیں، کیونکہ نماز شعائر اسلام میں سے ہے اور شعائر اسلام کی توہین کفر ہے، سو ان پر واجب ہے کہ اُس سے توبہ کریں اور تجدید ایمان و تجدید نکاح بھی کریں ۔ تجدید ایمان یہ ہے کہ صدقِ دل کے ساتھ کلمہ طیبہ پڑھیں اور تجدید نکاح یہ ہے کہ دو گواہوں کی موجودگی میں نئے مہر کے ساتھ نیا نکاح کریں۔ نکاح ایجاب و قبول کا نام ہے اور اس کے لیے صرف دو گواہ کافی ہیں جو دونوں مرد ہوں یا ایک مرد اور دو عورتیں ہوں ، لوگوں کو اکٹھا کرنا ضروری نہیں ہے اور گھر کے افراد مثلاً : بالغ بیٹے اور بیٹیاں یا بھائی بہن بھی گواہ بن سکتے ہیں۔

[[heading: نبی کریم ﷺ کے راستے میں کوڑا پھینکنے والی عورت کا واقعہ]]

سوال:
واعظین و خطباء اپنے بیانات میں اکثر یہ بتاتے ہیں کہ رسول اللہ ﷺ کے راستے میں ایک عورت کوڑا پھینکتی تھی ، ایک دن اس نے کوڑا نہ پھینکا تو رسول اللہ ﷺ اس کے گھر تشریف لے گئے اور اس کے گھر کو صاف کیا ، پانی وغیرہ بھرا ، وہ عورت آپ ﷺ کے حسن اخلاق کو دیکھ کر مسلمان ہوگئی۔ اس واقعہ کی تحقیق مطلوب ہے، کسی کتاب میں ہے`
},

{ pageNumber: 39,
   text:`یا سنی سنائی بات ہے؟ ، (ضیاء احمد، ملتان روڈ ، لاہور ) ۔

جواب:
ہماری معلومات کے مطابق حدیث وسیرت کی مستند اور معتبر کتابوں میں ایسی کوئی روایت موجود نہیں ہے، یہ واقعہ ویسے ہی مشہور ہو گیا ہے، کسی بھی کتاب میں اس کی کوئی سند نہیں ملتی حتی کہ معروف مراجع و مصادر میں اس کا ذکر تک نہیں ملتا۔ بعض لوگ ایسی روایت امام اعظم ابو حنیفہ رحمۃ اللہ علیہ کے حوالے سے بھی بیان کرتے ہیں لیکن ہمیں اس کا بھی کوئی حوالہ نہیں ملا۔
ایک وسیع المطالعہ بزرگ، خلیفہ حضور مفتی اعظم ہند، شارح بخاری علامہ مفتی شریف الحق امجدی رحمۃ اللہ علیہ سے اس روایت کے بارے میں سوال ہوا ، اس کے جواب میں آپ نے لکھا: ” کوڑا کرکٹ ڈالنے کی روایت اس وقت یاد نہیں ہے (لہذا) اس کے بارے میں کچھ نہیں کہہ سکتا ، ( فتاوی شارح بخاری ، جلد 1 ، ص : 415)۔ ہر دور میں واعظین لوگوں کو ترغیب دینے کے لیے اس طرح کے واقعات وضع کرتے رہے ہیں ، اسی لیے محدثین کرام نے موضوعات پر کتابیں لکھی ہیں ۔ الحمد لله علی احسانہ رسول اللہ ﷺ کی سیرت طیبہ کے سچے اور مستند واقعات بہت ہیں، ہمیں انہی واقعات پر اکتفا کرنا چاہیے، جھوٹ یا خلاف واقعہ بات نیک نیتی سے بیان کی جائے یا بد نیتی سے دونوں صورتوں میں اس کا جواز نہیں بنتا۔
رسول اللہ ﷺ کا ارشاد ہے : ”[[arabic: مَنْ كَذَبَ عَلَى مُتَعَمِّد أَفَلِيَتَبَوَّا مَقْعَدَهُ مِنَ النَّارِ]]“
ترجمہ: جس شخص نے جان بوجھ کر میری طرف جھوٹی بات منسوب کی ، اُسے چاہیے کہ اپنا ٹھکانہ جہنم میں بنالے ، ( صحیح بخاری: 110 ، 6197، صحیح مسلم :4)۔ ایک اور حدیث پاک میں ہے: [[arabic: كَفَی بِالْمَرْءِ كَذِبَا أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ]]
ترجمہ: ” کسی آدمی کے جھوٹا ہونے کے لیے اتنی ہی بات کافی ہے کہ وہ ( تحقیق کیے بغیر ) ہر سنی سنائی بات لوگوں کے سامنے بیان کرتا پھرے، (صحیح مسلم :7)، یعنی محض سنی سنائی`
},
 { pageNumber: 40, 
  text:`بات کو تیقن کے ساتھ حق اور حقیقت کے طور پر بیان کرنا درست نہیں ہے، البتہ جس سے سنا ہے، اس کے حوالے سے بیان کرے تو اس پر جھوٹ کا اطلاق نہیں ہوگا ، اسی کو ہمارے ہاں اردو محاورے میں اس طرح تعبیر کرتے ہیں : ” دروغ بر گردن راوی“، یعنی اس کو صحیح ثابت کرنے کی ذمے داری راوی پر ہے، میں یہ ذمے داری اپنے سر نہیں لیتا۔
[[arabic: عَنْ جُنْدَبِ بْنِ عَبْدِ اللهِ قَالَ : قَالَ رَسُولُ اللَّهِ : مَنْ قَالَ فِي القُرْآنِ بِرَأْيِهِ فَأَصَابَ فَقَدْ أَخْطَا]]
ترجمہ: حضرت جندب بن عبد الله بیان کرتے ہیں : رسول اللہ ﷺ نے فرمایا: جس شخص نے قرآن مجید میں اپنی رائے سے صحیح بات بھی کہی تو اس نے خطا کی ، (سنن ترمذی: 2952) نوٹ: "جندب" کے لفظ کو دال کی زبر اور پیش کے ساتھ یعنی دونوں طرح پڑھنا درست ہے۔

[[heading: صحابی کی تعریف]]

سوال:
صحابی کسے کہتے ہیں، کیا جنات میں بھی صحابہ ہیں، کیا صحابیت کا شرف صرف بالغ افراد کو حاصل ہے یا اطفال اور غیر ممیز صبیان کی طرف بھی اس شرف کی نسبت کی گئی ہے، نیز آیا ملائکہ بھی نسبت صحابیت سے مشرف ہوئے ، اگر جواب اثبات میں ہے تو کیا اُن کی طرف آپ ﷺ کی بعثت ارسال تکلیفی ہے یا محض تشریعی ، اسی طرح دیگر مخلوقات کی طرف ارسال کی نوعیت کیا ہے، (ابو عمیر قاری محمد نوید اختر ، کراچی)  

جواب:
علامہ حافظ ابن حجر عسقلانی شافعی رحمۃ اللہ علیہ متوفی 852ھ صحابی کی تعریف میں لکھتے ہیں:
[[arabic: أَصَحُ مَا وَقَفْتُ عَلَيْهِ مِنْ ذَلِكَ أَنَّ الصَّحَابِيَ مَنْ لَقِيَ النَّبِيَّ مُؤْمِنًا بِهِ، وَمَاتَ عَلَى الإِسْلَامِ]]۔
ترجمہ: صحابی کی سب سے زیادہ صحیح تعریف جس سے میں واقف ہوا، یہ ہے : صحابی اس شخص
`},

{
  pageNumber: 41,
  text: `کو کہا جاتا ہے جس نے نبی ﷺ پرایمان رکھنے کی حالت میں آپ سے ملاقات کی اور اسلام پر اس کی وفات ہوئی ،خواہ درمیان میں (بدقسمتی سے)مرتد ہوگیا ،لیکن پھر اسلام قبول کرلیا ہو ، یہی تعریف زیادہ صحیح ہے، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ ، ج:1،ص: 158)‘‘۔
علامہ حافظ ابن حجر اپنی اس تعریف میں مذکور قیودات کی وضاحت کرتے ہوئے لکھتے ہیں:
(1) ’’[[arabic: فَيَدْخُلُ فِي "مَنْ لَقِيَهٗ" مَنْ طَالَتْ مُجَالَسَتُهٗ أَوْ قَصُرَتْ، وَمَنْ رَوٰى عَنْهُ أَوْ لَمْ يَرْوِ، وَمَنْ غَزَا مَعَهٗ أَوْ لَمْ يَغْزُ، وَمَنْ رَآهُ رُؤْيَةً وَلَمْ يُجَالِسْهُ، وَمَنْ لَمْ يَرَهٗ لِعَارِضٍ كَالعَمٰى]]‘‘۔
ترجمہ: ’’صحابی کی تعریف میں ’’نبی کریم ﷺ سے ملاقات‘‘ کی قید (عام ہے، لہٰذا اس قید کی رُو) سے ہر وہ شخص صحابی کی تعریف میں داخل ہوجاتا ہے جس نے نبی کریم ﷺ سے ملاقات کی ہو، خواہ اُس نے آپ ﷺ کی صحبت میں طویل عرصہ گزارا ہو یا تھوڑا، اُس نے آپ سے روایت کی ہو یا نہ کی ہو، آپ کے ساتھ غزوات میں شریک رہا ہو یا نہیں، یاصرف آپ ﷺ کو دیکھا ہو لیکن آپ کے ساتھ ہمنشی نہ کی ہو، یونہی وہ شخص بھی صحابی کی اِس تعریف میں داخل ہے جس نے آپ سے ملاقات کی ہو، لیکن کسی عارضے مثلاً نابینا ہونے کی وجہ سے آپ کو نہ دیکھ پایا ہو (یعنی ملاقات کے باوجود رویتِ بصری سے محروم رہا ہو، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
شرفِ صحابیت کے ثبوت کے لیے کتنی دیر کی صحبت کافی ہے ،اس کی وضاحت کرتے ہوئے علامہ یحییٰ بن شرف نووی لکھتے ہیں:
’’[[arabic: اُخْتُلِفَ فِی حَدِّ الصَّحَابِیِّ: فَالْمَعْرُوفُ عِنْدِ الْمُحَدِّثِینَ أَنَّہٗ کُلُّ مُسْلِمٍ رَاٰی رَسُوْلَ اللّٰہِ ﷺ، وَعَنْ أَصْحَابِ الْاُصُوْلِ أَوْ بَعْضِہِمْ أَنَّہٗ مَنْ طَالَتْ مُجَالَسَتُہٗ عَلٰی طَرِیْقِ التَّبَعِ، وَعَنْ سَعِیْدِ بْنِ الْمُسَیَّبِ: أَنَّہٗ لَا یُعَدُّ صَحَابِیًّا إِلَّا مَنْ أَقَامَ مَعَ رَسُولِ اللّٰہ ﷺسَنَۃً أَوْ سَنَتَیْنِ أَوْ غَزَا مَعَہٗ غَزْوَۃً أَوْ غَزْوَتَیْنِ، فَإِنْ صَحَّ عَنْہُ فَضَعِیْفٌ، فَإِنَّ مُقْتَضَاہٗ أَنْ لَا یُعَدَّ جَرِیْرٌ الْبَجَلِیُّ وَشِبْہُہٗ صَحَابِیًّا، وَلَا خِلَافَ أَنَّهُمْ صَحَابَةٌ]]‘‘۔`
},
{
  pageNumber: 42,
  text: `ترجمہ: ’’صحابی کی تعریف میں اختلاف ہے ،محدثین کے نزدیک معروف تعریف یہ ہے : ’’ہر وہ مسلمان جس نے رسول اللہ ﷺ کو دیکھا ،وہ صحابی ہے‘‘ اوربعض اصحاب الاصول کے نزدیک تعریف یہ ہے: ’’جس نے بہ طریق متابعت نبی ﷺ کی طویل مجلس حاصل کی ہو‘‘ اور سعید بن مسیب سے یہ تعریف منقول ہے : ’’صحابی صرف وہ مسلمان ہے جو آپ کے ساتھ ایک یا دوسال رہا ہو یا جس نے آپ کے ساتھ ایک یا دوغزوات میں شرکت کی ہو، یہ تعریف ضعیف ہے ،کیونکہ اس تعریف کی رو سے حضرت جریر بن عبداللہ البجلی اوران جیسے (حضرت وائل بن حجر رضی اللہ عنہ) صحابی نہیں رہیں گے ،حالانکہ ان کے صحابی ہونے میں کسی کااختلاف نہیں ہے، (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی: ج: 2، ص:667)‘‘۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: قَالَ عَلِیُّ بْنُ الْمَدِ یْنِیِّ: مَنْ صَحِبَ النَّبِیَّ ﷺ أَوْ رَاٰہٗ وَلَوْ سَاعَۃً مِنْ نَہَارٍ فَہُوَ مِنْ أَصْحَابِ النَّبِیِّ ﷺ]]‘‘۔
ترجمہ: ’’علی بن المَدینی نے کہا: ’’جو نبی ﷺ کی مجلس میں بیٹھا یا آپ کو دیکھا، خواہ یہ دن کی ایک ساعت میں ہو، تو وہ نبی ﷺ کے صحابی ہیں، (فتح الباری: ج: 7، ص:5 )‘‘۔
الغرض یہ کہ صحابیت کے ثبوت کے لیےآپ ﷺ سے ملاقات ضروری ہے،خواہ ملاقات طویل عرصے رہی ہو یا کچھ دیر کے لیے ، صحابی ہونے کے لیے نبی کریم ﷺ کے ساتھ طویل عرصے کی صحبت یا آپ کے ساتھ غزوات میں شرکت ضروری نہیں ۔
(2) صحابی کی تعریف میں مذکور دوسری قید ’’مُوْمِنًا‘‘ کی وضاحت کرتے ہوئےعلامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَخْرُجُ بِقَيْدِ الْإِيْمَانِ مَنْ لَقِيَهٗ كَافِرًا وَلَوْ أَسْلَمَ بَعْدَ ذٰلِكَ إِذَا لَمْ يَجْتَمِعْ بِهٖ مَرَّةً أُخْرىٰ]]‘‘۔`
},
{
  pageNumber: 43,
  text: `ترجمہ: ’’صحابی کی تعریف میں ایمان کی قید سے وہ شخص خارج ہوگیا جس نے کفرکی حالت میں آپ سے ملاقات کی ہو،خواہ اِس ملاقات کے بعدوہ اسلام لےآیاہو،بشرطیکہ وہ دوبارہ نبی کریم ﷺ کے ساتھ جمع نہ ہوا ہو، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج: 1، ص: 158)‘‘۔
علامہ جلال الدین سیوطی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنْ رَاٰہٗ كَافِرًا ثُمَّ أَسْلَمَ بَعْدَ مَوْتِہٖ كَرَسُوْلِ قَیْصَرَ فَلَا صُحْبَۃَ لَہٗ]]‘‘۔
ترجمہ: ’’اور جس شخص نے آپ ﷺکو کفر کی حالت میں دیکھا اور آپ کی وفات کے بعد اسلام لایا ، جیسے قیصر کا ایلچی،تواُنہیں صحابیت کا شرف حاصل نہیں ہے، (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘۔
بعض اہلِ علم حضرات نے صحابی ہونے کے لیے بلوغت کی شرط بھی عائد کی ہے،لیکن صحیح اور راجح قول یہ ہے کہ صحابی ہونے کے لیے بالغ ہونا ضروری نہیں ہے،چنانچہ علامہ زین الدین عراقی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَالصَّحِیْحُ أَنَّ الْبُلُوْغ لَیْسَ شَرْطًا فِی حَدِّ الصَّحَابِیِّ وإِلَّا لَخَرَجَ بِذٰلِکَ مَن اَجْمَعَ العُلَمَاءُ عَلٰی عَدِّہِم فِی الصَّحَابَۃِ کَعَبدِ االلّٰہِ بْنِ الزُّبَیْرِ وَالْحَسَنِ وَالْحُسَیْنِ رَضِیَ اللّٰہُ عَنْہُمْ]]‘‘۔
ترجمہ: ’’اور صحیح یہ ہے کہ صحابی کی تعریف میں بلوغ کی شرط نہیں،ورنہ جن شخصیات کی صحابیت پرعلماء کا اجماع ہے ،وہ صحابیت سے خارج ہوجائیں گے ،جیسے امام حسن اور امام حسین اور عبداللہ بن زبیر رضی اللہ عنہم، (اَلتَّقْیِیْد وَالْاِیْضَاح شَرح مُقَدَّمَہ اِبْنُ الصَّلَاح: ص295)‘‘۔
البتہ امام یحییٰ بن معین،امام ابوزرعہ،امام ابوحاتم،امام ابوداؤد اور علامہ ابن عبدالبر وغیرہ بعض محدثین نے صحابی ہونے کےلیے ’’سِنِّ تمییز‘‘ (اچھے برے میں فرق کی صلاحیت کی عمر کو پہنچنا، جوکہ کم ازکم چار برس ہے) کی شرط عائد کی ہے ،چنانچہ علامہ زین الدین عراقی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَأَمَّا التَّمْيِيْزُ فَظَاهِرُ كَلَامِهِمْ اِشْتِرَاطُهٗ كَمَا هُوَ مَوْجُوْدٌ فِي كَلامِ يَحْيَى بْنِ مَعِيْنٍ وَأَبِيْ زُرْعَةَ وَأَبِيْ حَاتَمٍ وَأَبي دَاوٗدَ وَابْنِ عَبْدِ الْبَرِّ وَغَيْرِهِمْ وَهُمْ جَمَاعَةٌ أُتِی بِهِمُ النَّبيَّ ﷺ وَهُمْ أَطْفَالٌ فَحَنَّكَهُمْ وَمَسَحَ وُجُوْهَهُمْ أَوْ تَفَلَ فِيْ أَفْوَاهِهِمْ فَلَمْ يَكْتُبُوْا لَهُمْ صُحْبَةً، كَحَمْدِ بْنِ حَاطِبِ بْنِ الْحَارِثِ وَعَبْدِ الرَّحْمٰنِ بْنِ عُثْمَانَ التَّيْمِىِّ وَمَحْمُوْدِ ابْنِ الرَّبِيْعِ]]`
},
{
  pageNumber: 44,
  text: `[[arabic: وَعُبَيْدِ اللهِ بْنِ مَعْمَرٍ وَعَبْدِ اللهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ وَعَبْدِ اللهِ بْنِ أَبِيْ طَلْحَةَ وَمُحَمَّدِ بْنِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَيَحْيَى بْنِ خَلَّادِ بْنِ رَافِعٍ الزُّرَقِىِّ وَمُحَمَّدِ بْنِ طَلْحَةَ ابْنِ عُبَيْدِ اللهِ وَعَبْدِ اللهِ بْنِ ثَعْلَبَةَ بْنِ صَعِيْرٍ وَعَبْدِ اللهِ بْنِ عَامِرِ بْنِ كَرِيْزٍ وَعَبْدِ الرَّحْمٰنِ ابْنِ عَبْدِ الْقَارِىِّ وَنَحْوِهِمْ]]‘‘۔
ترجمہ: ’’رہی (خیر وشر میں) تمیز کی صلاحیت تو بظاہر یہ شرط ہے،جیساکہ یہ شرط یحییٰ بن معین، ابوزرعہ، ابوحاتم، ابودائود ،ابن عبدالبروغیرہ کےکلام میں موجود ہے،ان حضرات نے غیرممیز بچےکوصحابی قرار نہیں دیا،اِس سے مراد وہ بچے ہیں جنہیں بچپن میں نبی ﷺ کے پاس لایا گیا، آپ نے انہیں گھٹی دی،ان کے چہروں کو (پیار سے )چھوایا ان کے منہ میں لعابِ دہنِ مبارک ڈالا، لیکن انہیں صحابہ میں شمار نہیں کیا گیاجیسے: حمد بن حاطب بن حارث، عبدالرحمٰن بن عثمان التیمی، محمود بن ربیع ،عبیداللہ بن معمر، عبداللہ بن حارث بن نوفل، عبداللہ بن ابی طلحہ، محمد بن ثابت بن قیس بن شماس، یحییٰ بن خلاد بن رافع الزرقی، محمد بن طلحہ بن عبیداللہ، عبداللہ بن ثَعلبہ بن صعیر، عبداللہ بن عامر بن کریز اور عبدالرحمن بن عبدالقاری اور اس طرح کے دوسرےبچے، (اَلتَّقْیِیْد وَالْاِیْضَاح،ص:292)‘‘۔
اس کے برعکس اکثر اہلِ علم کے نزدیک صحابی ہونے کے لیے سن تمییز کو پہنچنا شرط نہیں ہے ،چنانچہ علامہ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اِلَّا اَنَّہٗ ہَلْ یُشْتَرَطُ فِی الرَّائِیْ اَن یَّکُوْنَ بِحَیْثُ یُمَیِّزُ مَارَاٰہُ أَوْ یُکْتَفٰی بِمُجَرَّدِ حُصُولِ الرُّؤْیَۃِ مَحَلُّ نَظَر، وَعَمَلُ مَنْ صَنَّفَ فِی الصَّحَابَۃِ یَدُلُّ عَلَی الثَّانِی ،فَإِنَّہُمْ ذَکَرُوا مِثْلَ مُحَمَّدِ بْنِ أَبِی بَکْرٍ الصِّدِّیقِ ،وَإِنَّمَا وُلِدَ قَبْلَ وَفَاۃِ النَّبِیِّ ﷺ بِثَلَاثَۃِ أَشْہُرٍ وَأَیَّامٍ کَمَا ثَبَتَ فِی الصَّحِیْحِ أَنَّ أُمَّہٗ أَسْمَاءُ بِنْتُ عُمَیْسٍ وَلَدَتْہُ فِی حَجَّۃِ الْوَدَاعِ قَبْلَ أَنْ یَدْخُلُوْا مَکَّۃَ وَذٰلِکَ فِی أَوَاخِرِ ذِی الْقَعْدَۃِ سَنَۃَ عَشْرٍ مِنَ الْہِجْرَۃِ وَمَعَ ذٰلِکَ ،فَاَحَادِیثُ ہٰذَا الضَّرْبِ مَرَاسِیلُ]]‘‘۔
ترجمہ: ’’کیا نبی ﷺ کا دیدار کرنے والے کے لیے یہ شرط ہے کہ وہ جو دیکھے اس کی تمییز`
},
{
  pageNumber: 45,
  text: `کرسکتا ہو یا صرف دیکھنے پر اکتفا کیا جائے گا ،یہ محل نظر ہے اور جن علماء نے صحابہ کے حالات پر کتابیں لکھی ہیں ان کا عمل دوسرے پردلالت کرتا ہے، انہوں نے محمد بن ابوبکر صدیق کا ذکر صحابہ میں کیا ہے، حالانکہ وہ نبی ﷺ کی وفات سے تین ماہ کچھ دن قبل پیدا ہوئے تھے، یہ بات حدیث صحیح سے ثابت ہے کہ ان کی ماں اَسماء بنتِ عُمیس نے ان کو ۱۰ ہجری ماہ ذو القعدہ میں حجۃ الوداع کے موقع پر مکہ داخل ہونے سے پہلے جنا تھا ،باوجود اس شرف کے ان حضرات کی بیان کردہ احادیث مراسیل ہیں ، (فتح الباری:ج: 7،ص: 3)‘‘۔
نیز لکھتے ہیں:
’’[[arabic: مَن لَّمْ يُمَيِّزْ لَا تَصِحُّ نِسْبَةُ الرُّؤْيَةِ إِلَيْهِ، نَعَمْ يَصْدُقُ أَنَّ النَّبيَّ ﷺرَآهُ فَيَكُوْنُ صَحَابِيًّا مِنْ هٰذِهِ الْحَيْثِيَّةِ، وَمِنْ حَيْثُ الرِّوَايَةِ يَكُوْنُ تَابِعِيًّا]]‘‘۔
ترجمہ: ’’جو نبی کریم ﷺ کی حیات میں سن تمیز کو نہ پہنچا ہو، اُس کی طرف نبی کریم ﷺ کو دیکھنے کی نسبت کرنا صحیح نہیں ہے، ہاں یہ بات درست ہے کہ نبی کریم ﷺ نے اُسے دیکھا ہو ،پس وہ اِس حیثیت سے صحابی ہو گا اور روایت کے اعتبار سے وہ تابعی ہوگا‘‘۔
علامہ عبدالحی لکھنوی لکھتے ہیں:
’’[[arabic: وَالْمُرَجَّحُ ہُوَ دُخُولُہٗ فِیْہِمْ نَعَمْ حَدِیْثُہُمْ مُرْسَل لٰکِنَّہٗ مُرْسَلٌ مَقبُوْلٌ]]‘‘۔
ترجمہ: ’’ان کے صحابہ میں داخل ہونے کا قول راجح ہے ،ہاں ان کی روایت کردہ احادیث مرسل ،لیکن مرسل مقبول ہیں، (ظَفر الْاَمَانی فی مُخْتَصر الْجُرجَانی:307)‘‘۔
اسی طرح مجنون کا حکم ہےکہ وہ تبعاً صحابی قرار پائے گا ،وہ تمام اطفال جو عہد طفولیت میں نبی ﷺ کی ملاقات سے مشرف ہوئے، ان کا تبعاً مسلم ہونا ظاہر ہے کہ ان کے والدین مسلم بلکہ صحابہ تھے اور اگر کسی مجنون کو بھی نبی ﷺ سے ملاقات کا شرف حاصل ہوا تھا ،جس کے والدین دونوں یا ان میں سے ایک مسلمان ہو تو وہ بھی یقینا مسلم ہوا، لہٰذا مجنون اور اطفال دونوں ’’مُسْلِمًا‘‘ کی قید سے خارج نہیں ہوئے۔ 
(3) صحابی کی تعریف میں مذکور تیسری قید ’’بِہٖ‘‘ کی وضاحت کرتے ہوئےعلامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:`
},
{
  pageNumber: 46,
  text: `’’[[arabic: وَقَوْلُنَا بِہٖ يَخْرُجُ مَنْ لَقِيَهٗ مُؤْمِنًا بِغَيْرِهٖ، كَمَنْ لَقِيَهٗ مِنْ مُؤْمِنِي أَهْلِ الْكِتَابِ قَبْلَ الْبَعْثَةِ]]‘‘۔
ترجمہ: ’’خاص نبی کریم ﷺ پر ایمان لانے کی قید سے وہ تمام لوگ صحابی کی تعریف سے خارج ہوگئے، جنہوں نے (اعلان نبوت سے قبل ) دیگر انبیاءِ کرام پر ایمان رکھنے کی حالت میں نبی ﷺ سے ملاقات کی ہو(اور وہ آپ پر ایمان نہ لائے ہوں)، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
ایمان کی حالت میں نبی کریم ﷺ سے ملاقات کی قید سے وہ تمام اشخاص صحابی کی تعریف سے خارج ہوگئے جو نبی کریم ﷺ کےزمانے میں آپ پر ایمان لائے ،مگر آپ سے ملاقات کا شرف حاصل نہ کرسکے ،جیساکہ خیر التابعین حضرت اویس قرنی ،جو کہ اپنی والدہ کی خدمت میں منہمک ہونے کی وجہ سے نبی کریم ﷺ سے ملاقات نہ کرسکے، اِسی طرح حبشہ کے بادشاہ أصْحَمَہ نجاشی آپ ﷺپر ایمان لے آئے تھے ،مگر آپ سے ملاقات حاصل نہ ہوسکی۔
محدثین کرام نے یہ شرط بھی عائد کی نبی کریم ﷺ سے یہ ملاقات آپ کی حیاتِ دنیوی اور بیداری میں ہو ،لہٰذا جس شخص نے نبی کریم ﷺ کو آپ کے وصال کے بعد دفن سے پہلے دیکھا ،جیساکہ ابوذؤیب خویلد بن خالد ہذلی ،یا جسے آپ ﷺ کی دنیوی حیات میں یا آپ کے پردہ فرمانے کے بعد خواب میں ملاقات کا شرف حاصل ہوا ،تووہ صحابی نہیں کہلائے گا ، علامہ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں : 
’’[[arabic: وَہٰذَا کُلُّہٗ فِیْمَنْ رَاٰہُ وَہُوَ فِی قَیْدِ الْحَیَاۃِ الدُّنْیَوِیَّۃِ، أَمَّا مَنْ رَاٰہٗ بَعْدَ مَوْتِہٖ وَقَبْلَ دَفْنِہٖ، فَالرَّاجِحُ أَنَّہٗ لَیْسَ بِصَحَابِیٍّ وَإِلَّا لَعُدَّ مَنِ اتَّفَقَ أَنْ یَرٰی جَسَدَہُ الْمُکَرَّمَ وَہُوَ فِی قَبْرِہِ الْمُعَظَّمِ وَلَوْ فِی ھٰذِہِ الْاَعْصَارِ وَکَذلِٰکَ مَنْ کُشِفَ لَہٗ عَنْہُ مِنَ الْاَوْلِیَاءِ فَرَاٰہٗ کَذٰلِکَ عَلٰی طَرِیْقِ الْکَرَامَۃِ]]‘‘۔`
},
{
  pageNumber: 47,
  text: `ترجمہ: ’’اور یہ تمام صورتیں اُس شخص کے متعلق ہیں جس نے آپ کو حیات دنیوی میں دیکھا اور جس نے آپ کو وفات کے بعد اور دفن سے پہلے دیکھا ، تو راجح قول کے مطابق وہ صحابی نہیں ہے ،ورنہ اس کو بھی صحابی شمار کیا جائے گا جس کے بارے میں اتفاق ہو کہ اس نے آپ ﷺ کے جسد مکرم کو آپ کی قبر معظم میں دیکھا ، خواہ وہ اِسی زمانے میں ہو اور اسی طرح وہ اولیاء ِکرام جن کو کشف کی صورت میں آپ کی زیارت کرائی گئی ہو، اسی طرح کرامت کے طور پر آپ کی زیارت کرائی گئی ہو، (فتح الباری : ج:7،ص:6)‘‘۔ 
علامہ جلال الدین سیوطی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنْ رَاٰہٗ بَعْدَ مَوْتِہٖ ﷺ قَبْلَ الدَّفْنِ، وَقَدْ وَقَعَ ذٰلِکَ لِاَبِی ذُؤَیْبٍ خُوَیْلِدِ بْنِ خَالِدٍ الْہُذَلِیِّ، فَإِنَّہٗ لَا صُحْبَۃَ لَہٗ]]‘‘۔
ترجمہ: ’’اور جس شخص نے آپ کی وفات کے بعد دفن ہونے سے پہلے دیکھا ،جیسے ابوذؤیب خُویلد بن خالد ہذلی ،تو اُنہیں صحابیت کا شرف حاصل نہیں ہے ۔ (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘۔
اب یہاں یہ سوال پیدا ہوتا ہے کہ بعض ایسے اشخاص بھی پائے جاتے ہیں، جنہوں نے نبی کریم ﷺ کے اعلان نبوت سے قبل آپ سے ملاقات کی اورآپ کی بعثت ورسالت کی خبر دیتے ہوئےآپ پر ایمان بھی لائے، مثلاً :بحیراراہب وغیرہ ،تو آیا ایسے اشخاص صحابی کہلائیں گے یا نہیں،اس حوالے سے علامہ حافظ ابن حجر مضطرب نظر آتےہیں اور اُنہوں نے ایسے اشخاص کے صحابہ میں سے ہونے نہ ہونے کی کوئی تعیین نہیں کی ہے،چنانچہ وہ لکھتے ہیں:
’’[[arabic: وَهَلْ يَدْخُلُ مَنْ لَقِيَهُ مِنْهُمْ وَآمَنَ بِأَنَّهٗ سَيُبْعَثُ أَوْ َلا يَدْخُلُ؟ مَحَلُّ اِحْتِمَالٍ. وَمِنْ هَؤُلَاءِ بُحَيْرَا الرَّاهِبُ وَنَظَرَاؤُهٗ]]‘‘۔`
},
{
  pageNumber: 48,
  text: `ترجمہ: ’’جنہوں نے نبی کریم ﷺ سے ملاقات کی اور آپ کی متوقع بعثت پر ایمان لائے، آیا وہ صحابی کہلائیں گے یا نہیں، اس میں احتمال ہے، اس نوع سے بحیرا راہب اور اُن جیسے دیگر لوگ تعلق رکھتے ہیں، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘،یعنی علامہ حافظ ابن حجر نے قطعیت کے ساتھ ان کے صحابی ہونے کا قول نہیں کیا۔
جبکہ بعض محدثین نے اُن تمام اشخاص کو صحابہ میں داخل مانا ہے جنہوں نے نبی کریم ﷺ کے اعلان نبوت سے قبل ملت حنفیہ پر قائم رہتے ہوئے ایمان کی حالت میں آپ سے ملاقات کی، مثلاً زید بن عمرو بن نفیل یا آپ کی متوقع بعثت پر ایمان لائے، جیساکہ بحیرا راہب ،چنانچہ علامہ ابن عابدین شامی ’’شرح التحریر‘‘ کے حوالے سے لکھتے ہیں:
’’[[arabic: وَالصَّحَابِیُّ عِنْدَ الْمُحَدِّثِیْنَ وَبَعْضِ الْاُصُوْلِیِّیْنَ: مَنْ لَقِیَ النَّبِیَّ ﷺمُسْلِمًا وَمَاتَ عَلَی الْإِسْلَامِ أَوْ قَبْلَ النُّبُوَّۃِ وَمَاتَ قَبْلَہَا عَلَی الْحَنِیفِیَّۃِ کَزَیْدِ بْنِ عَمْرِو بْنِ نُفَیْلٍ]]‘‘۔
ترجمہ: ’’محدثین اور بعض اصولیین کے نزدیک صحابی وہ ہے ،جس نے اسلام کی حالت میں نبی ﷺ سے ملاقات کی اور اسلام پر وفات پائی یا ملاقات کا یہ شرف اعلان نبوت سے پہلے حاصل ہوا اور اعلان نبوت سے پہلے ملتِ ابراہیمی پر فوت ہوئے، جیسے زید بن عمروبن نفیل، (رَدُّ الْمُحْتَار عَلَی الدُّرِّ الْمُخْتَار:ج:1،ص: 13)‘‘۔
علامہ ابن عابدین شامی ،علامہ جلال الدین سیوطی کے حوالے سے لکھتے ہیں: 
’’[[arabic: قَالَ: وَہَلْ یُشْتَرَطُ لَقْیُہٗ فِیْ حَالِ النُّبُوَّۃِ أَوْ أَعَمُّ مِنْ ذٰلِکَ، حَتّٰی یَدْخُلَ مَنْ رَاٰہٗ قَبْلَہَا وَمَاتَ عَلَی الْحَنِیفِیَّۃِ، کَزَیْدِ بْنِ عَمْرِو بْنِ نُفَیْلٍ، وَقَدْ عَدَّہٗ ابْنُ مَنْدَۃ فِی الصَّحَابَۃِ، وَکَذَا لَوْ رَاٰہُ قَبْلَہَا، ثُمَّ أَدْرَکَ الْبَعْثَۃَ وَأَسْلَمَ وَلَمْ یَرَہٗ]]‘‘۔
ترجمہ: ’’کیا یہ ملاقات اعلان نبوت کے بعد شرط ہے یا یہ عام ہے (یعنی اعلان نبوت سے قبل کی ملاقات کو بھی شامل ہے)حتیٰ کہ اس میں وہ بھی داخل ہوجائیں جنہوں نے اعلان نبوت سے پہلے آپ ﷺ کو دیکھا اور ان کی موت دین حنیف پر ہوئی، جیسے زید بن عمرو بن نفیل وغیرہ ، ابن مندہ نے ان کو صحابہ میں شمار کیا ہے اور اسی طرح جس نے آپ کو اعلان نبوت سے پہلے دیکھا پھر بعثت کا زمانہ پایا اور اسلام قبول لیکن پھر آپ کونہیں دیکھا ‘‘۔`
},
{
  pageNumber: 49,
  text: `(رَدُّ الْمُحْتَار عَلَی الدُّرِّ الْمُخْتَار:ج۱ص 13)
حافظ ابن حجر صحابی کی تعریف میں ’’مُوْمِنًابِہٖ‘‘ کی مزید وضاحت کرتے ہوئےلکھتے ہیں:
’’[[arabic: يَدْخُلُ فِيْ قَوْلِنَا مُؤْمِنًابِہٖ كُلُّ مُكَلَّفٍ مِنَ الْجِنِّ وَالْإنْسِ]]‘‘۔
ترجمہ: ’’ہمارے اس قول ’’وہ نبی کریم ﷺ پر ایمان لانے والا ہو‘‘ میں جنّ وانس میں سے تمام مکلفین صحابی کی تعریف میں داخل ہوجاتے ہیں‘‘۔
(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ، ج:1،ص:158)
اورآپ ﷺ سے ملاقات کرنے والے فرشتوں پر صحابیت کے اطلاق کے حوالے سے لکھتے ہیں:
’’[[arabic: وَأَمَّا الْمَلَائِکَۃُ فَیُتَوَقَّفُ عَدُّہُمْ فِیْہِمْ عَلٰی ثُبُوْتِ بَعْثَتِہٖ إِلَیْہِمْ، فَإِنَّ فِیْہِ خِلَافًا بَیْنَ الْاُصُوْلِیِّینَ، حَتّٰی نَقَلَ بَعْضُہُمُ الْإِجْمَاعَ عَلٰی ثُبُوْتِہٖ وَعَکَسَ بَعْضُہُمْ]]‘‘۔
ترجمہ: ’’اور ملائکہ کو صحابہ میں شمار کرنااس پر موقوف ہے کہ آیاآپ ﷺ کی بعثت ان کی طرف بھی ہوئی ہے ، پس اس مسئلہ میں اصولیین کے درمیان اختلاف ہے، حتّٰی کہ بعض علماء نے اس کے ثبوت پر اجماع نقل کیا ہے اور بعض نے اس کے برعکس کہا ہے ‘‘۔
(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج:1،ص:158)
اس کی مزید تفصیل ووضاحت یہ ہے کہ اہلِ علم کا اس بارے میں اتفاق ہے کہ جنات بھی انسانوں کی طرح مکلف ہیں اور ان میں مومن اور منکر دونوں قسم کے افرادپائے جاتے ہیں، قرآنِ کریم میں اللہ تعالیٰ نےجنّات کےحوالے سےاُن کے قول کی حکایت کرتے ہوئےفرمایا: ’’[[arabic: وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَلِكَ كُنَّا طَرَائِقَ قِدَدًا]]‘‘۔
ترجمہ: ’’اوربے شک ہم میں سے بعض نیک ہیں اور بعض دوسری طرح کے ، یوں ہم مختلف راہوں پر گامزن ہیں، (الجنّ:11)‘‘۔
اِس بات پر بھی اہلِ علم متفق ہیں کہ جس طرح نبی کریم ﷺ کی بعثت ورسالت تمام انسانوں کے لیےہے،اِسی طرح آپ جنات بلکہ فرشتوں اور تمام مخلوقاتِ الٰہیہ کے بھی`
},
{
  pageNumber: 50,
  text: `رسول ہیں،اللہ تعالیٰ کا ارشادہے:
’’[[arabic: تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا]]‘‘۔
ترجمہ: ’’بہت ہی بابرکت ہے  وہ ذات،جس نے اپنے مکرّم بندے  پر قرآن نازل کیا تاکہ وہ تمام جہانوں کے لیے ڈرسنانے والے ہوں،(الفرقان:1)‘‘۔
نبی کریم ﷺ کا ارشاد ہے: ’’[[arabic: أُرْسِلْتُ اِلَی الْخَلْقِ کَا فَّۃً]]‘‘، ترجمہ: ’’مجھے تمام مخلوق کی جانب رسول بناکر بھیجا گیا ہے‘‘۔اس حدیث میں اگر چہ صرف ’’الْخَلْق‘‘ کاعموم ہی  انسان وجنات اور ملائکہ سمیت تمام مخلوقات کو شامل تھا،اس کے باوجودلفظِ ’’کَا فَّۃً‘‘ کا اضافہ کرکے اس بات کو واضح اورمستحکم کردیا گیا کہ لفظ ’’الْخَلْق‘‘ اپنے کامل عموم پرباقی ہے اور اِس سے کوئی مخلوق خارج نہیں ہے،حضرت عبداللہ بن عباس رضی اللہ عنہما ارشاد فرماتے ہیں:
’’[[arabic: قَالَ لِمُحَمَّدٍﷺ: وَمَاأَرْسَلْنَاكَ اِلَّا کَافَّۃً لِلنَّاسِ، فَاَرْسَلَہٗ اِلَی الْاِنْسِ وَالْجِنِّ]]‘‘۔
ترجمہ: ’’اللہ تعالیٰ نے محمد ﷺ کے متعلق فرمایا:ہم نے آپ کو تمام لوگوں کے لیے رسول بناکر بھیجا ہے ،پس اللہ تعالیٰ نے آپﷺ کو تمام انسان وجنات کے لیے رسول بنایا ہے،(المعجم الکبیر:11610)‘‘۔
لہٰذاوہ انسان وجنات جنہوں نے ایمان کی حالت میں نبی کریم ﷺ سے ملاقات کی،وہ آپ کے صحابہ میں داخل ہیں اور اُن کی جانب آپ ﷺ کی بعثت ورسالت ارسالِ تکلیفی ہےاور وہ شریعت کےفروعی احکام کے مکلف ہیں۔
شیخ ابو محمد علي بن احمد ابن حزم اُندلسی قرطبی متوفی 456؁ھ لکھتے ہیں: 
’’[[arabic: وَقَدْ نَصَّ اللَّهُ تَعَالٰی عَلَى أَنَّ نَفَرًا مِنْ الْجِنِّ آمَنُوا وَسَمِعُوا الْقُرْآنَ مِنْ رَسُولِ اللَّهِ ﷺفَهُمْ صَحَابَةٌ وَفُضَلَاءُ]]‘‘۔
ترجمہ: ’’اللہ تعالیٰ نےصراحت فرمائی ہے کہ جنات کاایک گروہ ایمان لایااور اُنہوں نے رسول اللہﷺ سے قرآن کریم کو سُنا،پس وہ صحابہ اور فضلاء ہیں‘‘۔
(اَلْمُحَلی بِالْآثَار: ج: 8،ص:432)`
},

{
  pageNumber: 51,
  text: `علامہ ابن حجر وعلامہ عینی کے شیخ حافظ زين الدين عبد الرحيم العراقی متوفی806؁ھ لکھتے ہیں:
’’[[arabic: اَلْجِنُّ مِنْ جُمْلَةِ الْمُكَلَّفِيْنَ الَّذِيْنَ شَمِلَتْهُمُ الرِّسَالَةُ وَالْبَعْثَةُ فَكَانَ ذِكْرُ مَنْ عُرِفَ اسْمُهٗ مِمَّنْ رَآهُ حَسَنًا]]‘‘۔
ترجمہ:’’جنات من جملہ مکلفین میں سے ہیں،جنہیں رسالت وبعثت شامل ہے،پس جنات میں جن کا نام معلوم ہواُنہیں صحابہ میں ذکر کرنا عمدہ ہے‘‘۔
(اَلتَّقْیِیْد وَالْاِیْضَاح، ص:295)
نبی کریمﷺ سے ملاقات کرنے والے فرشتوں کےحوالے سے عام اہلِ علم کا موقف یہ ہے وہ صحابہ میں داخل نہیں ہیں، جبکہ محققین اہلِ علم نےاُنہیں بھی صحابہ میں داخل مانا ہے،اس اختلاف کی بنیاد اس بات پر ہے کہ آیا نبی کریمﷺ کی بعثت ورسالت فرشتوں کے لیے ہوئی ہے یا نہیںاور آیا فرشتے احکام شریعت کے مکلف ہیںیا نہیں۔پس جو اہلِ علم حضرات فرشتوں کو غیر مکلّف اورنبی کریمﷺ کی بعثت ورسالت کوانسان وجنات اورفرشتوں کے لیےعام ماننے کے بجائےفقط انس وجن کے ساتھ خاص قرار دیتے ہیں ،اُس کے نزدیک فرشتے صحابہ میں داخل نہیں ہیں۔
چنانچہ علامہ فخر الدین رازی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: أَنَّهٗ لَمْ يَكُنْ مُرْسَلاً إِلَى الْمَلَائِكَةِ]]‘‘۔
ترجمہ:’’نبی کریمﷺ کو فرشتوں کی طرف رسول بناکر مبعوث نہیں کیاگیا،(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ:ج:1،ص:158،نَظْمُ الدُّرَرْ فِی تَنَاسُبِ الْآیَاتِ وَالسُّوَرْ: ج:7، ص:72)‘‘اور وہ اہلِ علم جو فرشتوں کو صحابہ میں داخل مانتے ہیں،اُن کے نزدیک آپ ﷺ کی رسالت انسان وجنات اور فرشتوں سمیت تمام مخلوقات الٰہیہ کو عام اور شامل ہے اور فرشتے بھی انسان وجنات کی طرح مکلف ہیں،البتہ فرشتوں کا مکلف ہونا انسان وجنات کی طرح نہیں بلکہ اُن کی اپنی شان کے مطابق ہے اور بعض اہل علم فرماتے ہیں کہ انسان وجنات کی طرف آپ کی بعثت ارسالِ تکلیفی کی نوع سے ہے کہ وہ احکامِ شریعت کے مکلف`
},
{
  pageNumber: 52,
  text: `ہیں اور فرشتوں کے لیے ارسالِ تشریفی ہے،کہ فرشتوں کی جانب آپ کو مبعوث کرکے فرشتوں کو صحابیت کے شرف سے مشرف کیا گیا ۔
علامہ احمد بن محمد صاوی مالکی رحمۃ اللہ علیہ متوفی1241 ؁ھ لکھتے ہیں:
’’[[arabic: رِسَالَتُہٗ عَامَّۃٌ لِلْاِنْسِ وَالْجِنِّ وَالْمَلَائِکَۃِ وَجَمِیْعِ الْخَلْقِ ،لٰکِنْ اِرْسَالُہٗ لِلْاِنْسِ وَالْجِنِّ اِرْسَالُ تَکْلِیْفٍ اِجْمَاعًا وَاِرْسَالُہٌ لِلْمَلَائِکَۃِ قِیْلَ اِرْسَالُ تَکْلِیْفٍ بِمَا یَلِیْقُ بِھْمْ، وَقِیْلَ اِرْسَالُ تَشْرِیْفٍ ،وَاِرْسَالُہٗ لِمَا عَدَاہُمْ مِنَ الْحَیْوَانَاتِ الْغَیْرِ الْعَاقِلَۃِ وَالْجَمَادَاتِ اِرْسَالُ تَشْرِیْفِ وَرَحْمَۃٍ]]‘‘۔
ترجمہ:’’نبی کریمﷺ کی رسالت انس وجن ،فرشتوں اور تما م مخلوق کو عام ہے،لیکن انسانوں وجنات کے لیے آپ کا ارسال اجماعًاارسالِ تکلیف ہےاور فرشتوں کے لیے آپ کےارسال کے متعلق کہا گیا ہے کہ وہ بھی ارسالِ تکلیف ہے اور فرشتے اپنے حال کے لائق مکلف ہیں اور کہا گیا ہے کہ اُن کی طرف آپ کا اِرسال، اِرسالِ تشریف ہے،اوران کے علاوہ دیگر غیر ذوی العقول حیوانات اور جمادات کے لیے آپ کا ارسال،ارسالِ تشریف ورحمت ہے، (حَاشِیَۃُ الصـَاوِیْ عَلَی الْجَلَالَیْن،ج:4،ص:77)‘‘۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: رَجَّحَ الشَّيْخُ تَقِيُّ الدِّيْنِ السُّبْكِيُّ أَنَّهٗ كَانَ مُرْسَلاً إِلَيْهِمْ]]‘‘۔
ترجمہ:’’شیخ تقی الدین سُبکی نے اس بات کو راجح قرار دیا ہے کہ نبی کریمﷺ کو فرشتوں کی جانب بھی مبعوث کیا گیا تھا،(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
علامہ فخر الدین رازی کے قول کا جواب دیتے ہوئے علامہ ابراهيم بن عمر البقاعي متوفی885؁ھ فرماتے ہیں:
’’امام رازی پر تعجب ہے کہ اُنہوں نے ایسی بات نقل کی ہے جو کہیں اور نہیں پائی جاتی اور اُن کایہ قول خود اُن کے اپنے دوسرے قول کے معارض ہے،چنانچہ اُنہوں نےاپنی تفسیر میں جہاں بنی آدم کے قابلِ احترام ہونے کی وجوہات تحریر کی ہیں، وہاں اُنہوں نے چوتھی وجہ یہ بیان کی ہے:`
},
{
  pageNumber: 53,
  text: `’’[[arabic: أَنَّهٗ جَعَلَ أَبَاهُمْ رَسُوْلاً إِلَى الْمَلَائِكَةِ،حَيْثُ قَالَ:أَنْبِئْهُمْ بِأَسْمَائِهِمْ،وَقَدْ تَقَرَّرَ أَنَّ كُلَّ كَرَامَةِ كَانَتْ لِنَبِيٍّ مِنَ الْأَنْبِيَاءِ فَلِنَبِيِّنَاﷺ مِثْلُهَا أَوْ أَعْظَمُ مِنْهَا]]‘‘۔
ترجمہ:’’اللہ تعالیٰ بنوآدم کے والد حضرت آدم علیہ السلام کو فرشتوں کے لیے رسول بنایا ہے، چنانچہ اللہ تعالیٰ نےفرمایا:اے آدم! تم ان چیزوںکےنام فرشتوں کو بتاؤ ۔اور یہ بات متحقق ہے کہ جو بھی کرامت وخصوصیت انبیاءِ کرام میں سے کسی نبی کو عطا کی گئی ہے تو اُسی کے مثل یا اُس سے بڑھ کر کرامت وخصوصیت ہمارے نبی ﷺ کو بھی دی گئی ہے‘‘۔
(نَظْمُ الدُّرَرْ فِی تَنَاسُبِ الْآیَاتِ وَالسُّوَرْ،ج:7،ص:ص72)
امام احمد رضا قادریقُدِّسَ سِرُّہُ الْعَزِیْز لکھتے ہیں:
’’علماء فرماتے ہیں : رسالت والاکا تمام جن وانس کو شامل ہونا اجماعی ہے اورمحققین کے نزدیک ملائکہ کو بھی شامل ، [[arabic: كَمَا حَقَّقْنَا ہُ بِتَوْفِیْقِ اللہِ تَعَالٰی فِی رِسَالَۃِ اِجْلُالُ جِبْرِیْلَ]]۔ بلکہ تحقیق یہ ہے کہ حجروشجر وارض وسماء وجبال وبحار تمام ماسوا اللہ اس کے احاطہ عامّہ ودائرۂ تامّہ میں داخل اورخود قرآن عظیم لفظ’’عَالَمِیْن‘‘ اور روایتِ صحیح مسلم میں لفظ ’’ خَلْق‘‘ وہ بھی مؤکد بکلمہ ِ’’کَا فَّۃً ‘‘ ، اس مطلب پر احسن الدلائل طبرانی معجم کبیر میں یعلیٰ بن مرہ رضی اللہ عنہ سے راوی ، حضور سید المرسلین ﷺ فرماتے ہیں :  ’’[[arabic: مَامِنْ شَیْئٍ اِلَّا یَعْلَمُ أَنِّیْ رَسُوْلُ اللہِ اِلَّا كَفَرَة الْجِنِّ وَالْاِنْسِ]]‘‘،ترجمہ:’’کوئی چیز نہیں جو مجھے رسول اللہ نہ جانتی ہو ، مگر بے ایمان جن وآدمی،(فتاویٰ رضویہ،ج:30،ص:134)‘‘۔
علامہ غلام جیلانی میرٹھی رحمۃ اللہ علیہ لکھتے ہیں:
’’بلکہ حق یہ ہے کہ فرشتوں کے حق میں آپ کا ارسال صرف ارسالِ تشریف نہیں ،ارسالِ تکلیف بھی ہے ،فروعِ شریعت کے ساتھ مکلف نہ ہونے سے یہ لازم نہیں آتا کہ وہ دائرہ تکلیف سے ہی خارج ہوجائیں،حتیٰ کہ آپ کی رسالت کے کسی باب میں محتاج نہ رہیں،بلکہ عرفان الٰہی کے مدارج طے کرنے میں جن وانس کی طرح فرشتوں کو بھی آپ کی رسالت`
},
{
  pageNumber: 54,
  text: `کی احتیاج ہے،(بشیر القاری ،ص125)‘‘ ۔
(4)علامہ حافظ ابن حجر صحابی کی تعریف میں مذکورقید ’’وَمَاتَ عَلَى الإِسْلاَمِ‘‘کی وضاحت کرتے ہوئے لکھتے ہیں:
’’[[arabic: وَخَرَجَ بِقَوْلِنَا وَمَاتَ عَلَى الإِسْلاَمِ مَنْ لَقِيَهٗ مُوْمِنًا بِهٖ ثُمَّ ارْتَدَّ، وَمَاتَ عَلٰى رِدَّتِهٖ]]‘‘۔یعنی وہ اشخاص صحابہ میں داخل نہیں ہیں ،جنہوں نے ایمان کی حالت میں آپﷺ سے ملاقات کی ،لیکن پھر مرتد ہوگئےاور اُن کی موت حالتِ ارتداد میں ہی ہوئی،جیساکہ عبداللہ بن جحش نےاپنی اہلیہ حضرت اُم حبیبہ کےہمراہ اسلام قبول کیا تھا اور حبشہ کی طرف ہجرت بھی کی تھی لیکن پھر وہ مرتدہوگیا اور نصرانیت پر اُس کی موت واقع ہوئی، اِسی نوع سے عبداللہ بن خطل،ربیعہ بن اُمیہ بن خلف بھی تعلق رکھتے ہیں،کہ یہ بھی اسلام لانے کے بعد مرتد ہوگئے تھے۔
رہے وہ اشخاص جو نبی کریمﷺ پر ایمان لانے کے بعد مرتد ہوگئے تھے ،لیکن اُنہوں نے پھر دوبارہ اسلام قبول کرلیا تھا اور اسلام پر ہی اُن کی وفات ہوئی تھی،تو آیا ایسے لوگ صحابہ کی جماعت میں شامل ہونگے یا نہیں،اس حوالے سے تفصیل ہے:
(الف)	اگر ارتداد اور تجدیدِ اسلام دونوں ہی نبی کریمﷺ کے زمانے میں ہو ،پس اگراُس نے نبی کریمﷺ سےملاقات کرلی ہو ،تو وہ بالاجماع صحابی ہیں،جیساکہ عبداللہ بن ابی سرح،علامہ سیوطی فرماتے ہیں:
’’[[arabic: أَمَّا مَنْ رَجَعَ إِلَی الْإِسْلَامِ فِی حَیَاتِہٖ كَعَبْدِ اللّٰهِ بْنِ أَبِي سَرْحٍ، فَلَا مَانِعَ مِنْ دُخُولِہٖ فِی الصُّحْبَۃِ]]‘‘۔
ترجمہ:’’رہا وہ شخص جس نے نبی کریمﷺ کی حیات میں اسلام کی طرف رجوع کرلیا تھا جیساکہ عبداللہ بن ابی سرح ہیں،تو اُن کے صحابہ میں داخل ہونے سے کوئی چیز مانع نہیں ہے،(تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘اور اگر نبی کریمﷺ سے ملاقات نہ کی ہو تو فقہ حنفیہ کےقاعدے کی رُو سے ایسا شخص صحابہ میں`
},
{
  pageNumber: 55,
  text: `داخل نہیں ہوگا،جبکہ جمہورمحدثین اسے بھی صحابہ میں داخل مانتے ہیں۔
(ب)	ارتداد وتجدیدِ ایمان دونوں نبی کریمﷺ کے وصال فرمانے کے بعد ہوں۔
(ج)	ارتداد نبی کریمﷺ کے زمانے میں ہو اور تجدید اسلام آپ ﷺ کے وصال کے بعد ہو ، جیساکہ اَشعث بن قیس دس ہجری میں اپنی قوم کے ہمراہ نبی کریم ﷺ کی خدمت میں حاضر ہوئے اور اسلام قبول کیا اور پھر نبی کریمﷺ کےوصال کے بعد مرتد ہوگئے اور پھر حضرت ابوبکر کے عہدِ خلافت میں اسلام قبول کرلیا ۔مؤخر الذکر صورتوں کے متعلق ایسے شخص کے صحابی ہونے پر اتفاق ہے ۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَلَوِ ارْتَدَّ ثُمَّ عَادَ إِلَى الْإِسْلَامِ لٰكِنْ لَمْ يَرَهٗ ثَانِيًا بَعْدَ عَوْدِهٖ فَالصَّحِيحُ أَنَّهٗ مَعْدُودٌ فِي الصَّحَابَةِ لِإِطْبَاقِ الْمُحَدِّثِينَ عَلَى عَدِّ الْاَشْعَثِ بْنِ قَيْسٍ وَنَحْوِهٖ مِمَّنْ وَقَعَ لَهٗ ذٰلِكَ وَإِخْرَاجِهِمْ أَحَادِيثَهُمْ فِي الْمَسَانِيدِ]]‘‘۔
ترجمہ:’’پس اگر وہ مرتد ہوگیا اور پھر اسلام کی طرف لوٹ آیا ،لیکن اسلام لانے کے بعد دوبارہ نبی کریمﷺ کو نہیں دیکھا تو صحیح بات یہ ہے کہ اُس کا بھی صحابہ میں شمار کیا جائے گا ، کیونکہ محدثین کا اَشعث بن قیس اور ان جیسے دیگر اشخاص کے صحابی ہونے پر اتفاق ہے ، جوکہ اسلام لانےکے بعد مرتد ہوگئے تھے اور پھر انہوں نے اسلام قبول کرلیا تھا اور اُنہوں نےمسانید میں ان کی احادیث کی تخریج کی ہے،(فتح الباری ،ج7ص4)‘‘۔
خلاصہ بحث یہ ہے :
(۱)	جس نے ایمان کی حالت میں نبی ﷺ سے ملاقات کی اور ان کی وفات ایمان پر ہوئی ،اگر خدانخواستہ درمیان میں مرتد ہوگیا ہو ،لیکن اللہ تعالیٰ کی توفیق سے توبہ کرکے پھر اسلام قبول کرلیا اور اسلام کی حالت میں وفات ہوئی،وہ صحابی ہے۔
(۲)	محدثین کرام کے نزدیک معروف تعریف یہ ہے کہ وہ خوش نصیب جس نے ایمان کی حالت میں رسول اللہ ﷺ کی زیارت کی ہو ،بعض اصولیّین نے اس میں یہ اضافہ کیا ہے`
},
{
  pageNumber: 56,
  text: `کہ متابعت کے ساتھ رسول اللہ ﷺ کے ساتھ طویل صحبت اختیار کی ہو،حضرت سعید بن مسیّب نے یہ اضافہ کیا ہے کہ ایک یادوبرس ایک یا دو غزوات میں آپ ﷺ کے ساتھ صحبت رہی ہو ،لیکن یہ ضعیف قول ہے،کیونکہ اس قول کی بنیادپر لازم آئے گا کہ حضرت جریر بن عبداللہ البجلی اور وائل بن حجر ایسے اصحاب صحابیت کی تعریف سےخارج ہو جائیں گے ، حالانکہ وہ بالاتفاق صحابی ہیں۔
(۳) رسول اللہ ﷺ کی رؤیت یا دیدار سے محض رؤیت عینی مراد نہیںہے ورنہ نابینا ہونے کے سبب حضرت عبداللہ ابن ام مکتوم ایسے حضرات صحابیت کی تعریف سے خارج ہوجائیں گے ،پس ان کے لیے محض ملاقات اور صحبت کافی ہوگی ،کیونکہ وہ رؤیت عینی کے مکلف ہی نہیں ہیںاور یہ بالاتفاق صحابی ہیں،جیسے عدم قدرت کے سبب گونگا شخص نماز میں قراءت لفظی کا مکلّف نہیں ہے ۔
(۴) وہ لوگ صحابی نہیں جنہوںنے کفر کی حالت میں آپ ﷺکی زیارت کی ،پھر آپ کے وصال مبارک کے بعد اسلام قبول کیا ،جیساکہ قیصرکاقاصد۔
(۵)	 جنات بھی انسانوں کی طرح مکلف ہیں اور ان میں مومن اور منکر دونوں قسم کے افراد ہیں ،لہٰذا ان میں سے جنہوں نے حیات ظاہری میں ایمان کی حالت میں آپ ﷺ کی زیارت کی ،وہ صحابی ہیں۔
(۶) 	اسی طرح ایسے بچے جنہوں نے شیرخوارگی یا بچپن کے لاشعوری دور میں آپ ﷺ کودیکھا اور ان کے شعوری دور سے پہلے آپﷺ نے وصال فرمالیا،آپﷺ نے بعض بچوں کو اپنے لعاب دہن مبارک میں چبائی ہوئی کھجور یا مٹھاس  ملاکر گھٹی دی ،یہ بچے تبعاً صحابہ میں شمار ہوتے ہیں،کیونکہ بچے اپنے آباء یا اختلاف دین کی صورت میںخیرالآباء کے تابع ہوتے ہیں،لیکن اگر یہ کوئی حدیث بیان کریںتو وہ مرفوع نہیں ہوگی ،بلکہ مرسلِ مقبول ہوگی۔
(۷)عہدرسالت ﷺ کے ایسے مجنو ن ،جن کے آباءدونوں یا کوئی ایک مسلمان`
},
{
  pageNumber: 57,
  text: `تھا،تبعاًمسلمان سمجھے جائیںگےاور ان کی طرف صحابیت کی نسبت کی جاسکے گی ۔
(۸)ملائکہ اگرچہ مکلّف نہیں ہیں ،لیکن اگر انہوںنے حیات ظاہری میں آپ کی زیارت کی ہے ،تو مختار قول کے مطابق وہ بھی صحابہ میں شمار ہوں گے ،امام النحو علامہ غلام جیلانی کی توجیہ کے مطابق وہ صحابی کہلائے جاسکتے ہیں ،اس پر یہ سوال وارد ہوتا ہے کہ ملائک تو معصوم ہیں ، انہیں نسبت صحابیت سے کیافیض متوقع ہوسکتا ہے،اس کی بابتعلامہ غلام جیلانی میرٹھی رحمہ اللہ تعالیٰ نے لکھا: ’’ان کے درجات بلند ہوسکتے ہیں‘‘۔
(۹)صحابیت کی نسبت کا تعلق صرف ذوی العقول سے ہوتا ہے ،غیرذوی العقول ،جیسے جمادات ،نباتات،حیوانات وغیرہ جن سے حیات ظاہری میں آپﷺ کو واسطہ پڑا ، آپ کی نسبت سے متبرک ہوںگے،لیکن ان کی طرف صحابیت کی نسبت نہیں کی جاسکے گی۔

[[heading: کیا ورقہ بن نوفل صحابی تھے]]
سوال:
حضرت ورقہ بن نوفل کی نبی کریم ﷺ سے ملاقات ثابت ہےاوربعض روایات میں ان کے ایمان اورتصدیق بالرسالت کا بھی ذکر ہے،تو سوال یہ ہے کہ کیاان کو بھی صحابیت کا شرف حاصل ہے، (نیازاحمد ، جہلم )۔
جواب: 
ورقہ بن نوفل بن اسد بن عبدالعزیٰ بن قُصَیّ القرشی الاسدی نبی کریم ﷺ کی زوجہ محترمہ ام المومنین حضرت خدیجۃ الکبریٰ رضی اللہ عنہا کےرشتے میں چچا زاد تھے ۔حضرت ورقہ بن نوفل ایمان لائے تھے یانہیں اور آیا وہ صحابی ہیں یا نہیں ،اس کے بارے میں متعدد اقوال ہیں:
علماء کے ایک گروہ کا یہ کہنا ہے کہ حضرت ورقہ، زید بن عمرو بن نفیل کی طرح دین حنیف اور ملت ابراہیمی کے پیروکار تھے اور بعض نے یہ کہا ہے کہ آپ نے نصرانیت کو اختیار کیا تھا اوروہ صحیح بخاری کی اس حدیث سے استدلال کرتے ہیں،جس میں ابتدائے وحی کے احوال بیان کیے گئے ہیںکہ جب حضرت خدیجہ رضی اللہ عنہا رسول اللہ ﷺ کو ورقہ بن نوفل کے پاس لے گئیں۔ اس میں یہ تصریح ہے کہ انہوں نے زمانہ جاہلیت میں بت پرستی سے متنفر ہوکرنصرانیت اختیار کی تھی اور ان کے پاس تورات کا علم تھا،اس بات میں کوئی شک نہیں کہ حضرت ورقہ مُوَحِّد تھے، بتوں کی عبادت سے متنفر تھے ، ملت ابراہیمی کے پیرو کار تھے اورانہوں نصرانیت کو اختیارکرلیا تھا ،لیکن ان کی وفات نصرانیت پر ہوئی یا اسلام پر اور آیا وہ`
},
{
  pageNumber: 58,
  text: `صحابی ہیںیا نہیں ، اس میں اختلاف ہے۔ حضرت عائشہ کی روایت کردہ حدیث میں ہےکہ حضرت ورقہ کی وفات نصرانیت پر ہوئی، لیکن یہ صحیح نہیں ہے، کیونکہ یہ حدیث عثمان بن عطا ءخراسانی کی سند سے روایت ہے اور علماء حدیث کے نزدیک عثمان ایک ضعیف راوی ہیں،علامہ ابن حجر لکھتے ہیں: اور ایک روایت میں جو یہ لفاظ آئے ہیں :’’[[arabic: فَمَاتَ وَرَقَۃُعَلٰی نَصرَانِیَّتِہٖ لٰکِن عُثمانَ ضَعِیْف]]‘‘۔
ترجمہ:’’پس ورقہ کا انتقال دین نصرانیت پر ہوا ،لیکن یہ روایت ضعیف ہے،کیونکہ یہ عثمان بن عطاء خراسانی کی روایت ہے اور انہیںمحدثین نے ضعیف قرار دیا ہے،(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ :ج:6،ص:476) ‘‘۔اس لیے یہ بات ثابت ہوگئی کہ ان کی وفات اسلام  پرہی ہوئی ہے اور اس کی تائید ابتدائے وحی والی حدیث سے بھی ہوتی ہے ، جس میں ہے کہ رسول اللہ ﷺ  کاواقعہ سن کر انہوں نے جواب دیا:
’’[[arabic: ہٰذَا النَّامُوْسُ الَّذِیْ نَزَّلَ اللَّہُ عَلٰی مُوْسٰی، یَا لَیْتَنِیْ فِیْہَا جَذَعًا، لَیْتَنِیْ أَکُوْنُ حَیًّا إِذْ یُخْرِجُکَ قَوْمُکَ]]‘‘۔
ترجمہ:’’یہ تو وہی ناموس (معزز راز داں فرشتہ) ہے ،جسے اللہ نے موسیٰ علیہ السلام پر وحی دے کر بھیجا تھا، کاش کہ جب اعلان نبوت کے موقع پر آپ کی قوم آپ کو وطن سے نکالے گی، میں جوان عمر ہوتا (اور آپ کی مدد کرتا)،(بخاری:3)‘‘۔
علامہ ابن حجر لکھتے ہیں:’’[[arabic: فَہٰذَا ظَاہِرُہٗ اَنَّہٗ اَقَرَّ بِنُبُوتِہٖ]]‘‘۔ترجمہ:’’اس کا ظاہری مفہوم یہی ہے کہ حضرت ورقہ نے آپ ﷺ کی نبوت کا اقرارکرلیا تھا‘‘۔`
},
{
  pageNumber: 59,
  text: `(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج:6،ص:675)
علامہ آجری اور علامہ بیہقی حدیث ذکر کرتے ہیں:
’’[[arabic: فَقَالَ لَہٗ وَرَقَۃُ: اَبْشِرْ، ثُمَّ اَبْشِرْ، فَاَنَا اَشہَدُ اَنَّکَ الَّذِیْ بَشّر بہٖ ابنُ مریم، وَإِنَّکَ عَلٰی مِثلِ نَامُوسِ مُوسٰی، وإنَّکَ نبَیٌّ مُرسَل، وَإِنَّکَ سَوفَ تُؤمَرُ بِالجِہَادِ بَعدَ یَومِکَ ہٰذَا، وَإِن یُّدرِکنِی ذٰلِکَ لاُجَاہِدَنّ مَعَکَ. فَلَمَّا ُتوُفِّیَ قَالَ رَسُولُ اللّٰہِ ﷺ: لَقَد رَاَیتُ الْقَسَّ فِی الْجَنَّۃِ عَلَیْہِ ثِیَابُ الْحَرِیْرِ،لِاَنَّہٗ آمَنَ بِی وَصَدَّقَنِی]]‘‘۔
ترجمہ:’’ورقہ نے جواب میں کہا:بشارت ہو ،پھر بشارت ہو، میں گواہی دیتا ہوں کہ آپ وہی نبی ہیں جس کی بشارت عیسیٰ بن مریم نے دی تھی اور آپ کی شریعت موسیٰ کی شریعت کی مانند ہوگی اور میں شہادت دیتا ہوں کہ آپ نَبِیِّ مُرسَل ہیں اور عنقریب ا ٓپ کوجہاد کا حکم دیا جائے گا ،اگر میں نے اس وقت کو پالیا تو میں آپ کے ساتھ مل کر جہاد کروںگا،جب وہ فوت ہوگئے، تو رسول اللہ ﷺ نے فرمایا:میں نے ورقہ کو جنت میںریشمی لباس میں دیکھا، کیونکہ وہ مجھ پر ایمان لائے تھے اور انہوں نے میری تصدیق کی تھی‘‘۔
(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج:6،ص:675)
علامہ بیہقی نے اس روایت کو منقطع قرار دیا ہے، لیکن جمہور علماء کے نزدیک انقطاع سے صحت اور حجیت میں کچھ خلل نہیں آتا،علامہ علی القاری لکھتے ہیں:
’’[[arabic: وَقَالَ أَبُو دَاوٗدَ:ہٰذَا مُرْسَل: أَيْ: نَوْعٌ مُرْسَلٌ وَہُوَ الْمُنْقَطِعُ لٰکِنَّ الْمُرْسَلَ حُجَّۃٌ عِنْدَنَا وَعِنْدَ الْجُمْہُورِ]]‘‘۔
اور ابودائود نے کہا: یہ حدیث مرسل یعنی منقطع ہے، جو مرسل کی قسم ہے، لیکن ہمارے اور جمہور علماء کے نزدیک مرسل حجت ہے،(مرقاۃ :ج:1،ص:368)‘‘اور ایک روایت میں جو ا لفاظ آئے ہیں :’’[[arabic: فَمَاتَ وَرَقَۃُ عَلٰی نَصْرَانِیَّتِہٖ لٰکِنْ عُثْمَانُ ضَعِیْف]]‘‘۔پس ورقہ کا انتقال دین نصرانیت پر ہوا ،لیکن یہ روایت ضعیف ہے کہ عثمان بن عطاء خراسانی اس کے`
},
{
  pageNumber: 60,
  text: `راوی ہیںجن کو علماء نے ضعیف قرار دیا ہے‘‘۔
(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ :ج:6،ص:476) 
حضرت ورقہ کے جنتی ہونے کے بارے میںکتب احادیث میں متعدد روایات موجود ہیں،جو ان کے مومن ہونے پر دلالت کرتی ہیں:
’’[[arabic: عَنْ عَائِشَۃَ، أَنَّ خَدِیْجَۃَ سَاَلَتْ رَسُوْلَ اللہِ ﷺعَنْ وَرَقَۃَ بْنِ نَوْفَلٍ، فَقَالَ:قَدْ رَأَیْتُہٗ فِی الْمَنَامِ، فَرَأَیْتُ عَلَیْہِ ثِیَابُ بَیَاضٍ، فَاَحْسِبُہٗ لَوْ کَانَ مِنْ أَہْلِ النَّارِ، لَمْ یَکُنْ عَلَیْہِ بَیَاضٌ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں :حضرت خدیجۃ الکبریٰ رضی اللہ عنہا نے حضرت ورقہ کے بارے میں نبی ﷺ سے پوچھا : تو آپ ﷺ نے فرمایا: میں نے ان کو خواب میں اس حال میں دیکھا کہ ان کے جسم پر سفید لباس تھا ،میرا گمان ہے (کہ وہ جنتی ہیں)اگر وہ اہل جہنم  میںسے ہوتے تو ان کے جسم پر سفید لباس نہ ہوتا ، (مسند احمد:24367 )‘‘۔
امام ابویعلیٰ روایت کرتے ہیں:
’’[[arabic: عَنْ جَابِرِ بْنِ عَبْدِ اللَّہِ: سُئِلَ عَنْ وَرَقَۃَ بْنِ نَوْفَلٍ، قَالَ: أَبْصَرْتُہٗ فِی بُطْنَانِ الْجَنَّۃِ عَلَیْہِ سُنْدُسٌ]]‘‘۔
ترجمہ:’’حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ ﷺ سے حضرت ورقہ کے بارے میں پوچھا گیا :تو آپﷺ نے فرمایا:میں نے ان کو جنت کےنشیب میں ریشمی لباس پہنے دیکھا،(مسند ابی یعلٰی:2047)‘‘۔
’’[[arabic: عَنْ عَائِشَۃَ رَضِیَ اللَّہُ عَنْہَا: أَنَّ النَّبِیَّ ﷺ قَالَ: لَا تَسُبُّوْا وَرَقَۃَ فَإِنِّی رَأَیْتُ لَہٗ جَنَّۃً أَوْ جَنَّتَیْنِ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں:نبی ﷺ نے فرمایا:ورقہ کو برا نہ کہو،کیونکہ میں نے ان کے لیے ایک جنت یا دو جنتیں دیکھی ہیں،(مستدرک للحاکم: 4211)‘‘۔
الغرض حضرت ورقہ کا ایمان ثابت ہے ،لیکن صحابی ہونے میں اختلاف ہے ا ور علماء کی`
},

{
  pageNumber: 61,
  text: `ایک جماعت کا موقف یہ ہے کہ حضرت ورقہ آپ ﷺ کی بعثت یعنی عَلانیہ دعوت سے پہلے وفات پاچکے تھے ،حدیث میں ہے:
[[arabic: فَقَالَ لَہٗ وَرَقَۃُ: ہٰذَا النَّامُوسُ الَّذِی نَزَّلَ اللّٰہُ عَلٰی مُوسٰی، یَا لَیْتَنِی فِیْہَا جَذَعًا، لَیْتَنِی أَکُوْنُ حَیًّا إِذْ یُخْرِجُکَ قَوْمُکَ، فَقَالَ رَسُوْلُ ﷺ: أَوَ مُخْرِجِیَّ ہُمْ، قَالَ: نَعَمْ، لَمْ یَاْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِہِ إِلَّا عُوْدِیَ، وَإِنْ یُدْرِکْنِی یَوْمُکَ أَنْصُرْکَ نَصْرًا مُؤَزَّرًا، ثُمَّ لَمْ یَنْشَبْ وَرَقَۃُ أَنْ تُوُفِّیَ، وَفَتَرَ الوَحْیُ]]
ترجمہ: ’’یہ تو وہی ناموس (معزز راز داں فرشتہ) ہے ،جسے اللہ نے موسیٰ علیہ السلام پر وحی دے کر بھیجا تھا، کاش میں آپ کی دعوت کے شروع ہونے پر جوان عمر ہوتا، کاش میں اس وقت تک زندہ رہتا جب کہ آپ کی قوم آپ کو اس شہر سے نکال دے گی،رسول اللہ ﷺنے یہ سن کر تعجب سے پوچھا : کیا وہ لوگ مجھ کو نکال دیں گے، ورقہ نے کہا:ہاں جو شخص بھی آپ کی طرح دعوت حق لے کر آیا ، اس کے عہد کے لوگوں نے اس سے عداوت کی ،اگر میں نے آپ کی دعوت کا زمانہ پایا ،تو میں پوری قوت سے آپ کی مدد کروں گا ، مگر پھرکچھ عرصہ بعد ورقہ وفات پاگئے اور وحی کا سلسلہ کچھ عرصے تک منقطع رہا ، (بخاری:3)‘‘۔
علامہ ابن حجر لکھتے ہیں:
[[arabic: فَہٰذَا ظَاہِرُہٗ اَنَّہٗ اَقَرَّ بِنُبُوَّتِہٖ، وَلٰکِنَّہٗ مَاتَ قَبْلَ اَنْ یَّدْعُوَرَسُوْلُ اللّٰہِ ﷺ النَّاسَ إِلَی الِإسلَامِ، فَیَکُوْنُ مِثْلَ بَحِیْرَاوَفِی إِثبَاتِ الصُّحْبَۃِ لَہٗ نَظَر]]
ترجمہ: ’’اس کا ظاہرمفہوم یہی ہے کہ انہوں نے نبوت کا اقرار کیا تھا، لیکن وہ رسول اللہ ﷺ کے لوگوں کودعو ت عام دینے سے پہلے وفات پا گئے ، تو وہ بَحیرا راہب کی طرح ہوگئے اور ان کی صحابیت کا ثبوت مَحَلِّ نظر ہے، (الاصابۃ:ج:6،ص: 475)‘‘۔
مومن یا مسلم اسی شخص کو کہتے ہیں، جس نے دعوت کے بعد اسلام قبول کیا ہو، حضرت ورقہ دعوت سے پہلے انتقال کرنے کے سبب جب مسلم نہیں ہوئے ،تو صحابی نہیں ہوسکتے کہ صحابی کی تعریف میں مسلم ہونے کی قید ہے ،ہا ں اہل فترت میں سے ہیں، جیسے بحیرا راہب`
},
{
  pageNumber: 62,
  text: `اور دَلَائِلُ النُّبُوَّۃ کی مذکورہ بالا روایت میں ان کے آپﷺ پر ایمان لانے اور تصدیق کا جو ذکر ہے ،اس میں یہ احتمال بھی ہے کہ وہ تصدیق دعوت سے پہلے کی ہو،لیکن حضرت ورقہ کی وفات کا سن اس بات پر دلالت کرتا ہے کہ وہ خفیہ دعوت کے بعد فوت ہوئے اور اس صورت میں آپ صحابی ہیں ، علامہ حلبی حضرت ورقہ کی سن وفات کے متعلق لکھتے ہیں :
[[arabic: فَفِی الْإِمْتَاعِ: اَنَّ وَرَقَۃَ مَاتَ فِی السَّنَۃِ الرَّابِعَۃِ مِنَ الْمَبعَثِ]]
ترجمہ: ’’اور ’’امتاع‘‘ میں ہے: حضرت ورقہ بعثت کے چوتھے سال وفات پاگئے تھے، (سِیْرَتُ الْحَلْبِیَۃ:ج:1 ،ص: 357 )‘‘۔ اس سے ثابت ہوا کہ حضرت ورقہ نے خفیہ دعوت کا زمانہ پایا تھا اور ان کی زندگی میں وحی کا نزول تین سال تک موقوف رہنے کے بعد جاری بھی ہوگیا تھا، علامہ حلبی لکھتے ہیں:
[[arabic: وَفِیْ کَلَامِ صَاحِبِ کِتَابِ الْخَمِیْسِ فِی الصَّحِیْحَیْنِ اَنَّ الْوَحْیَ تَتَابَعَ فیِ حَیَاۃِ وَرَقَۃَ وَاَنَّہٗ آمَنَ بِہٖ]]
ترجمہ: ’’اور کتاب الخمیس کے مصنف کے قول کے مطابق صحیحین میں ہے : ورقہ کی زندگی میں نزول وحی کا سلسلہ (انقطاع کے بعد) دوبار ہ شروع ہوگیا تھا اور وہ آپ ﷺ پر ایمان لائے تھے، (سِیْرَتُ الْحَلْبِیَۃ:ج:1،ص:359)‘‘۔
پس یہ بات ثابت ہوچکی ہے کہ آپ نے عَلانیہ دعوت کا زمانہ بھی پایا ہے، چناچہ علامہ ابن حجر لکھتے ہیں:
[[arabic: عَنْ عُرْوَۃَ بنِ الزُّبَیْرِ، قَالَ: کاَنَ بِلَال لِجَارِیَۃٍ مِنْ بَنِی جُمَح، وَکَانُوا یُعَذِّبُونَہٗ بِرَمضَاءِ مَکَّۃَ یَلْصِقُوْنَ ظَہْرَہٗ بِالرَّمْضَاءِ لِکَیْ یُشْرِکَ ،فَیَقُولُ: أَحَد، اَحَدْ، فَیَمُرُّ بِہٖ وَرَقَۃُ وَہُوَ عَلٰی تِلکَ الحَالِ، فَیَقُوْلُ: أََحَد أََحَد یَا بِلَالَ، وَاللّٰہِ لَئِنْ قَتَلتُمُوْہُ لاَتَّخذَِنَّہٗ حَنَّانًا، وَہٰذَا مُرسَل جَیِّد، یَدُلُّ عَلٰی اَنَّ وَرَقَۃَ عَاشَ إِلٰی اَن دَعَا النَّبِیُّ ﷺ إِلَی الْإسْلَامِ حَتّٰی اَسْلَمَ بِلَالٌ وَالْجَمْعُ بَینَ ہٰذَا وَبَیْنَ حَدِیْثِ عَائِشَۃ َأَن یُّحْمَلَ قَولُہٗ: وَلَمْ یَنْشَبْ وَرَقَۃُ اَن تُوُفِّیَ، اَیْ قَبْلَ اَن یَّشتَہِرَ الِإسلَامُ وَیُؤمَرَ النَّبِیُّ ﷺ بِالجِہَاد]]`
},
{
  pageNumber: 63,
  text: `ترجمہ: حضرت عروہ بن زبیر رضی اللہ عنہ بیان کرتے ہیں :حضرت بلال بنی جمح کے مظالم کا شکار تھے اور وہ انہیں مکہ کی شدید دھوپ میں گرم زمین پر لٹا کر اذیت دیتے تھے تاکہ وہ اسلام چھوڑ کر مشرک ہوجائیں، پس بلال ’’احد احد‘‘ کہتے تھے ، اس حال میں حضرت ورقہ کا ان کے پاس سے گزر ہوتا ، تو وہ کہتے: اے بلال ’’احد، احد‘‘ اور کفار سے کہتے: بخدا اگر تم نے ان کو قتل کردیا تو میں اس کی قبر کو برکت حاصل کرنے کی جگہ بنادوں گا اور یہ حدیث عمدہ مرسل ہے اور اس بات پر دلالت کرتی ہے کہ حضرت ورقہ نبی ﷺ کی اسلام کی طرف دعوت عام تک زندہ رہے ،حتی کہ بلال اسلام لائے اور اس حدیث اورحضرت عائشہ رضی اللہ عنہا کی حدیث میں تطبیق کی صورت یہ ہے : ’’حضرت ورقہ زیادہ عرصہ زندہ نہ رہے اور وفات پاگئے‘‘، اس قول کو اس پر محمول کریں گے کہ اسلام کے مشتہر ہونے اور جہاد کا حکم آنے سے پہلے وہ فوت ہوگئے، (اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج؛۶ ،ص۴۷۶)‘‘۔
اور حضرت بلال کو اذیت دینے کا عمل علانیہ دعوت کے بعد شروع ہوا تھا ،علامہ حلبی ان کی صحابیت کے بارے تصریح کرتے ہیں:
[[arabic: وَحَیْثُ أَدْرَکَ الرِّسَالَۃَ فَقَدْ أَسْلَمَ، وَحِیْنَئِذٍ یَکُوْنُ صَحَابِیًّا]]
ترجمہ: ’’اور جب دعوت عام کا زمانہ پایا تو مسلمان ہوئے اور جب اسلام ثابت ہوگیا تو اس صورت میں صحابی ہوگئے ،(سِیْرَتُ الْحَلْبِیَۃ:ج:1،ص:360 )‘‘۔
مندرجہ بالا تمام روایات کی روشنی میں خلاصہ کلام یہ ہے حضرت ورقہ بن نوفل کے بارے میں مختلف اقوال ہیں:
(۱) آپ کی وفات دین نصرانیت پر ہوئی ،لیکن یہ قول ضعیف ہے ۔
(۲) آپ کی وفات ایمان واسلام پر ہوئی اور آپ ﷺ کی دعوت عام سے پہلے ہوئی اور ان کے حسن عاقبت کی بشارات احادیث اور روایات میں موجود ہیں اور یہ قول یقیناً راجح ہےعلامہ ابن حجر نے صحابیت کے قول کے بارے میں کہا: یہ محل نظر ہے۔
(۳) انہوں نے دعوت عام کا ابتدائی دور پایا ہے،حضرت بلال کا واقعہ اس پر شاہد ہے،لہٰذا`
},
{
  pageNumber: 64,
  text: `وہ صحابی ہیں ،علامہ حلبی،علامہ طبری،علامہ بغوی اور ابن السکن اسی کے قائل ہیں شارح بخاری علامہ غلام جیلانی میرٹھی رحمہ اللہ تعالیٰ نے اسی کو راجح قرار دیا ہے۔علامہ غلام رسول سعیدی رحمہ اللہ تعالیٰ نے نعمۃ الباری فی شرح البخاری: ج:۱،ص:۱۳۷ میں تمام اقوال نقل کردیے ہیں لیکن صحابیت کے قول کو راجح قراردینے کی بابت کو ئی تصریح نہیں کی اور نہ اسے رد کیا ہے ،واللہ اعلم بالصواب۔ حاصل کلام یہ کہ جہاں کسی مسئلے کے بارے میں ایک سے زائد اقوال ہوں اور کسی ایک کو اختیار کرنے سے کوئی شرعی خرابی لازم نہ آئے، وہاں مسئلے کے تمام پہلوئوں کی نشاندہی کر کے کسی ایک قول کو قطعی اور حتمی قرار دینے کے بجائے اہلِ علم پر چھوڑ دینا چاہیے، کیونکہ کبھی مقابلہ حق اور باطل یا صحیح اور غلط میں ہوتا ہے اور کبھی بہ اور بہتر میں یا راجح اور مرجوح میں ہوتا ہے۔

[[heading: ملک الموت کا کیا نام ہے]]

سوال:
ملک الموت کاکیانام ہے؟،(منوراحمد ،ملیر کراچی)۔
جواب:
اللہ تعالیٰ کا ارشاد ہے:
[[arabic: قُلْ يَتَوَفّٰكُمْ مَّلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ ثُمَّ إِلَى رَبِّكُمْ تُرْجَعُونَ]]
ترجمہ: ’’آپ کہیے: تمہیں موت کا فرشتہ وفات دیتا ہے جو تم پر مقرر ہے ،پھر تم اپنے رب کی طرف لوٹائے جائو گے،(السجدہ:11)‘‘۔
علامہ ابن کثیر رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: وَاَمَّا مَلَکُ الْمَوْتِ فَلَیْسَ بِمُصَرَّحٍ بِاسْمِہٖ فِی الْقُرْاٰنِ وَلَا فِی الْاَحَادِیْثِ الصِّحَاحِ وَقَدْ جَاءَ تَسْمِیَتُہٗ فِی بَعْضِ الْاٰثَارِ بِعِزْرَائِیلَ]]
ترجمہ: ’’ملک الموت کا نام قرآن اور صحیح احادیث میں صراحت کے ساتھ بیان نہیں ہوا،البتہ بعض آثار میں اُن کا نام عزرائیل آیا ہے، (البدایہ والنہایہ، ج:1،ص:49)‘‘۔`
},
{
  pageNumber: 65,
  text: `السجدہ:11کی تفسیر میں مزید لکھتے ہیں:
[[arabic: وَقَدْ سُمِّیَ فِیْ بَعْضِ الْاٰثَارِ بِعِزْرَائِیْلَ وَہُوَ الْمَشْہُوْرُ، قَالَہٗ قَتَادَۃُ وَغَیْرُ وَاحِدٍ وَلَہٗ اَعْوَانٌ]]
ترجمہ: ’’بعض آثار میں اُن کا نام عزرائیل آیا ہے اور یہی مشہور ہے اور قتادہ اور کئی محدثین نے کہا:اُن کے مددگار (دیگر فرشتے) بھی ہوتے ہیں،(تفسیر ابن کثیر، ج: 6ص : 322)‘‘۔ حضرت عزرائیل کے تحت قبضِ ارواح کے شعبے سے اور بھی فرشتے وابستہ ہیں ۔
علامہ محمود آلوسی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: وَالَّذِیْ ذَہَبَ إِلَیْہِ الْجَمْہُوْرُ اَنَّ مَلَکُ الْمَوْتِ لِمَنْ یَّعْقِلُ وَمَا لَا یَعْقِلُ مِنَ الْحَیَوَانِ وَاحِدٌ وَہُوَ عِزْرَائِیْلُ وَمَعْنَاہُ عَبْدُ اللّٰہِ]]
ترجمہ: ’’جمہور کا قول یہ ہے کہ ذی عقل اور غیر ذی عقل جانداروں کے لیے ملک الموت ایک ہی ہیں اوروہ عزرائیل ہیں اور عزرائیل کے معنی ہیں: اللہ کا بندہ، (روح المعانی، ج:11،ص:124)‘‘۔
علامہ ابوعبداللہ محمد بن احمد قرطبی رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: قَالَ عَبْدُ الرَّحْمٰنِ بْنُ سَابِطٍ:تَدْبِیْرُ اَمْرِ الدُّنْیَا إِلٰی اَرْبَعَۃٍ، جِبْرِیْلَ وَمِیْکَائِیْلَ وَمَلَکِ الْمَوْتِ وَاسْمُہٗ عِزْرَائِیْلُ وَإِسْرَافِیْلَ، فَاَمَّا جِبْرِیْلُ فَمُوَکَّلٌ بِالرِّیَاحِ وَالْجُنُوْدِ، وَاَمَّا مِیْکَائِیْلُ فَمُوَکَّلٌ بِالْقَطْرِ وَالنَّبَاتِ، وَاَمَّا مَلَکُ الْمَوْتِ فَمُوَکَّلٌ بِقَبْضِ الْاَنْفُسِ فِی الْبَرِّ وَالْبَحْرِ، وَاَمَّا إِسْرَافِیلُ فَہُوَ یَنْزِلُ بِالْاَمْرِ عَلَیْہِمْ، وَلَیْسَ مِنَ الْمَلَائِکَۃِ اَقْرَبُ مِنْ إِسْرَافِیلَ، وَبَیْنَہٗ وَبَیْنَ الْعَرْشِ مَسِیْرَۃُ خَمْسِمِائَۃِ عَامٍ]]
ترجمہ: ’’عبدالرحمن بن سابط نے کہا: دنیا کے (تکوینی) امور کی تدبیر چار فرشتوں کے ذمے ہے ،(وہ ہیں:) جبریل، میکائیل اور ملک الموت اور اُن کا نام عزرائیل ہے اور اسرافیل علیہم السلام، جبریل ہوائوں اور لشکروں پر مقرر ہیں اور میکائیل بارش اور نباتات پر مقرر ہیں اور ملک الموت برّوبحر میں روحیں قبض کرنے پر مقرر ہیں اور اسرافیل ان فرشتوں پر (اللہ کا)`
},
{
  pageNumber: 66,
  text: `حکم لے کر نازل ہوتے ہیں اور ملائکہ میں سب سے زیادہ (عرش کے) قریب اسرافیل ہیں اور اُن کے اور عرش کے درمیان پانچ سو سال کا فاصلہ ہے۔
(تفسیر قرطبی ، ج:19، ص: 194)
مذکورہ بالا مفسرین کے کلام سے یہ بات ثابت ہوتی ہے کہ قرآن کریم و احادیث صحیحہ میں ملک الموت کا نام مذکور نہیں ہے، البتہ بعض آثار صحابہ و تابعین میں ملک الموت کا نام عزرائیل آیا ہے اور جمہور کے نزدیک یہی معروف و مشہور ہے۔`
},
 {
  pageNumber: 67,
  text:`[[heading: طہارت کے مسائل]]`
 }, 

 {
  pageNumber: 69,
  text: `[[heading: ٹھوس نجاست سے آلودہ خشک زمین کا حکم]]
سوال:
زمین پر ٹھوس نجاست لگ گئی، پھر وہ نجاست خشک ہو گئی، کیا اب اس پر تیمم کیا جا سکتا ہے، (حیدر علی)۔
جواب:
زمین پر کوئی ٹھوس نجاست گری، جیسے: انسان کا براز (پاخانہ)، جانور کی گوبر وغیرہ اور خشک ہو گئی، اگر وہ ٹھوس نجاست وہاں موجود ہے تو اس سے تیمم نہیں کر سکتے، کیونکہ وہ عین نجاست ہے، علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اَلْاَرْضُ إِذَا أَصَابَتْہَا النّجَاسَۃُ فَیَبِسَتْ وَذَہَبَ أَثرُہَا لَایَجُوْزُ التَّیَمَّمُ بِہَا، کَذَا فِیْ فَتَاوٰی قَاضِیْ خَان]]‘‘۔
ترجمہ: ’’زمین کو نجاست پہنچی اور خشک ہو گئی اور اس کا اثر زائل ہو گیا، (تب بھی) اس سے تیمم جائز نہیں ہے، ’’فتاویٰ قاضی خان‘‘ میں اسی طرح ہے، (فتاویٰ عالمگیری، ج: 1، ص: 26)‘‘۔ ایسی جگہ پر نماز ادا کر سکتے ہیں۔ اگر کسی انسان یا جانور نے پیشاب کیا اور سورج کی گرمی سے وہ زمین خشک ہو گئی ہو، تو اس پر نماز پڑھ سکتے ہیں، کیونکہ مائع (Liquid) کا ٹھوس وجود نہیں ہوتا اور وہ دھوپ کی حرارت سے بخارات بن کر اُڑ جاتا ہے۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’[[arabic: فَتَاوَى الْحُجَّةِ]]‘‘ میں ہے: کپڑے کو جسم رکھنے والی نجاست پہنچی اور خشک ہو گئی تو رگڑنے سے پاک ہو جاتا ہے، جس طرح موزہ پاک ہو جاتا ہے، ’’مضمرات‘‘ میں اسی طرح ہے۔ ایک مسئلہ یہ ہے: زمین خشک ہونے اور نجاست کا اثر زائل ہونے سے نماز کے لیے پاک ہو جاتی ہے، تیمم کے لیے نہیں، اس سے کوئی فرق نہیں پڑتا کہ دھوپ سے خشک ہوئی یا آگ سے یا ہوا اور سائے سے، ’’کافی‘‘ اور ’’البحر الرائق‘‘ میں اسی طرح ہے، (فتاویٰ عالمگیری، ج: 1، ص: 44)‘‘۔`
},
{
  pageNumber: 70,
  text: `[[heading: طہارت کا ایک مسئلہ]]
سوال:
کموڈ استعمال کرتے وقت پاکی کیسے حاصل کریں، نماز ہو جائے گی یا نہیں؟، (غلام مرتضیٰ، لاہور)۔
جواب:
استنجا کرنے کے لیے کموڈ استعمال کرنا درست ہے، کموڈ پر بیٹھتے وقت آدمی کے بدن کا جو حصہ کموڈ سے مس کرتا ہے، اگر اس پر ناپاک چھینٹے ہوں تو ٹشو پیپر یا کسی چیز سے اسے خشک کر لیں۔ کموڈ ایسے اجزا سے بنا ہوتا ہے جو مسام دار نہیں ہوتے اور اس میں پانی جذب نہیں ہوتا، اس لیے اگر اس پر بالفرض ناپاک قطرے ہوں تو ٹشو سے خشک کرنے سے وہ صاف ہو جاتا ہے۔ استنجا پانی سے کیا جا سکتا ہے، کیونکہ آج کل مسلم شاور دستیاب ہیں اور صفائی میں مبالغے اور احتیاط کے لیے ٹشو پیپر بھی استعمال کر سکتے ہیں۔ مسجد قبا والوں کے لیے قرآن کریم میں تعریفی کلمات آئے ہیں، فرمایا:
’’[[arabic: لَمَسْجِدٌ أَسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ اَحَقُّ أَنْ تَقُوْمَ فِيهِ فِيْهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا وَاللَّهُ يُحِبُّ الْمُطَاهِرِينَ]]‘‘۔
ترجمہ: ’’البتہ جس مسجد کی بنیاد پہلے روز سے ہی تقویٰ پر رکھی گئی ہے، وہ اس بات کی زیادہ حق دار ہے کہ آپ اس میں کھڑے ہوں، اس میں ایسے مرد ہیں جو خوب پاکیزہ ہونے کو پسند کرتے ہیں اور اللہ زیادہ پاکیزگی حاصل کرنے والوں کو پسند فرماتا ہے، (التوبہ: 108)‘‘۔
حضرت عویم بن ساعدہ رضی اللہ عنہ بیان کرتے ہیں: ’’[[arabic: اِنَّ النَّبِيَّ ﷺ أَتَاهُمْ فِي مَسْجِدِ قُبَاءَ فَقَالَ: إِنَّ اللَّهَ تَبَارَكَ وَتَعَالٰی قَدْ أَحْسَنَ عَلَيْكُمُ الثَّنَاءَ فِي الطُّهُورِ فِي قِصَّةِ مَسْجِدِكُمْ، فَمَا هٰذَا الطُّهُورُ الَّذِي تَطَّهَّرُونَ بِهٖ، قَالُوا: وَاللَّهِ يَا رَسُولَ اللَّهِ! مَا نَعْلَمُ شَيْئًا إِلَّا أَنَّهٗ كَانَ لَنَا جِيرَانٌ مِنَ الْيَهُودِ، فَكَانُوا يَغْسِلُونَ أَدْبَارَهُمْ مِنَ الْغَائِطِ فَغَسَلْنَا كَمَا]]`
},
{
  pageNumber: 71,
  text: `[[arabic: غَسَلُوا]]‘‘۔
ترجمہ: ’’رسول اللہ ﷺ نے اہل قبا سے فرمایا: میں نے اللہ تعالیٰ سے سنا کہ وہ تمہاری پاکیزگی حاصل کرنے کی تعریف فرماتا ہے، تم کس طرح پاکیزگی حاصل کرتے ہو، انہوں نے عرض کی: یا رسول اللہ! ہمیں اور کسی چیز کا پتا نہیں، لیکن ہم نے دیکھا کہ ہمارے یہودی پڑوسی براز سے فارغ ہونے کے بعد پانی سے استنجا کرتے ہیں، پس ہم بھی اس طرح کرتے ہیں، (مسند احمد: 15485)‘‘۔
(2) حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی ﷺ نے فرمایا: یہ آیت (التوبہ: 108) اہل قبا کے متعلق نازل ہوئی ہے، وہ پانی کے ساتھ استنجا کرتے تھے تو ان کے متعلق یہ آیت نازل ہوئی، (سنن ترمذی: 3100)‘‘۔

[[heading: وضو کے بارے میں ایک پیچیدہ مسئلہ]]
سوال:
میں نے سُنا ہے کہ پیشاب کی جگہ یعنی شرمگاہ سے گیس خارج ہوتی ہے اور وضو ٹوٹ جاتا ہے، اگر ایسا ہے تو میرے ساتھ یہ سلسلہ بہت زیادہ ہے اور نماز کی حالت میں بہت زیادہ ہوتا ہے، میرے لیے اس بارے میں کیا حکم ہے؟، (جاوید اقبال، لاہور)
جواب:
ریح کے خارج ہونے سے وضو فقط اُسی صورت میں ٹوٹتا ہے، جب وہ پچھلے مقام سے خارج ہو اور اس سے بھی وضو تب ٹوٹتا ہے جب اُس کے خارج ہونے کا یقین ہو، محض ظن و گمان کی وجہ سے وضو ختم نہیں ہوتا۔
حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا:
’’[[arabic: إِذَا کَانَ اَحَدُکُمْ فِی الْمَسْجِدِ فَوَجَدَ رِیْحًا بَیْنَ اَلْیَتَیْہِ فَلاَ یَخْرُجْ حَتّٰی یَسْمَعَ صَوْتًا اَوْ یَجِدَرِیحًا]]‘‘۔
ترجمہ: ’’جب تم میں سے کوئی مسجد میں ہو اور وہ اپنے پچھلے مقام سے ریح کا خارج ہونا`
},
{
  pageNumber: 72,
  text: `محسوس کرے تو وہ مسجد سے نہ نکلے یہاں تک کہ اس کی آواز سُن لے یا بد بو محسوس کرے، (صحیح مسلم: 362، سنن ترمذی: 75)‘‘۔
اِس حدیث میں جو فرمایا کہ جب تک ریح کے خارج ہونے کی آواز نہ سُن لی جائے یا بو محسوس نہ ہو جائے تو اس وقت تک مسجد سے نہ نکلا جائے، اس کا مطلب یہ نہیں ہے کہ ریح خارج ہونے کی صورت میں وضو کا ٹوٹنا اُس کی آواز سننے یا بُو کے پائے جانے سے مشروط ہے، بلکہ اس حدیث کا مطلب یہ ہے کہ نماز پڑھنے والے کو جب تک اپنے وضو ٹوٹنے کا یقین نہ ہو جائے، اُس وقت تک وہ مسجد سے نہ نکلے۔
امام ترمذی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وقَالَ ابْنُ الْمُبَارَكِ: إِذَا شَكَّ فِي الْحَدَثِ، فَإِنَّهٗ لاَ يَجِبُ عَلَيْهِ الْوُضُوْ ءُ حَتّٰى يَسْتَيْقِنَ اسْتِيقَانًا يَقْدِرُ أَنْ يَحْلِفَ عَلَيْهِ]]‘‘۔
’’عبداللہ بن مبارک نے کہا: اس پر وضو واجب نہیں ہے تاوقتیکہ اسے اس حد تک یقین ہو جائے کہ قسم کھا سکے، (سنن ترمذی، تحت حدیث: 75)‘‘۔
حضرت علی رضی اللہ عنہ بیان کرتے ہیں: نبی کریم ﷺ نے فرمایا: ’’[[arabic: إِذَا فَسَاَ اَحَدُکُمْ فَلْیَتَوَضَّاْ]]‘‘، ترجمہ: ’’جب تم میں سے کسی شخص کی ریح خارج ہو تو اُسے چاہئے کہ وہ وضو کر لے، (مسند احمد: 34)‘‘۔
شرمگاہ کے اگلے حصے سے ریح کے خارج ہونے کی وجہ سے وضو نہیں ٹوٹتا، چنانچہ علامہ ابن نجیم حنفی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: الرِّیْحُ الْخَارِجَۃُ مِنَ الذَّکَرِ وَفَرْجِ الْمَرْاَۃِ، فَإِنَّہَا لَا تَنْقُضُ الْوُضُوْ ءَ عَلَی الصَّحِیحِ]]‘‘
ترجمہ: ’’صحیح قول کے مطابق مرد کے عضوِ تناسل یا عورت کی شرمگاہ سے خارج ہونے والی ریح سے وضو نہیں ٹوٹتا، (البحر الرائق، جلد: 1، ص: 31)‘‘۔
فقہائے کرام نے ذکر کیا ہے کہ پچھلے مقامِ سے ریح خارج ہونے کی صورت میں وضو ٹوٹنے کی وجہ یہ نہیں کہ نفسِ ریح ناپاک و نجس ہے، کیونکہ اگر نفسِ ریح کو ناپاک اور نجس قرار دیا جائے`
},
{
  pageNumber: 73,
  text: `تو پھر شلوار کا ناپاک ہونا لازم آئے گا، حالانکہ اِس کا کوئی بھی قائل نہیں ہے، سو معلوم ہوا کہ نفسِ ریح نجس نہیں ہے، بلکہ اِس کی وجہ سے وضو اس لیے ٹوٹتا ہے کہ یہ نجاست اور گندگی کے مقام سے گزر کر آتی ہے۔ اور وہ ریح جو اگلے مقام سے خارج ہوتی ہے، یہ عام ریح ہے، اس کا تعلق کھانے کے فُضلات، آنت یا پچھلے مقام سے نکلنے والی ریح سے نہیں ہے، یہ محض اختلاج یعنی شرمگاہ کے عضلات اور پٹھوں کی حر کت کی وجہ سے ہوتا ہے، سو اِس لیے یہ ناقض وضو نہیں ہے۔
البتہ فقہائے کرام نے کہا ہے کہ بعض عورتیں مُفضاۃ ہوتی ہیں، یعنی اُن کے پیشاب اور پاخانے کا مقام یا پیشاب اور ہمبستری کا مقام مل کر ایک ہو جاتے ہیں، اُن کی بابت علامہ ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’پس اگر کسی عورت کی یہ حالت ہو تو جب اُسے اگلے مقام سے ریح نکلتی محسوس ہوئی ہو تو اُسے احتیاطاً وضو کر لینا چاہیے اور بعض فقہائے کرام نے اِس صورت میں وضو کو واجب قرار دیا ہے، چنانچہ امام محمد سے مروی ہے کہ ایسی عورت کے لئے اس صورت میں وضو کرنا واجب ہے اور اسی قول کو احتیاطاً امام ابو حفص نے بھی لیا ہے اور فتح القدیر میں اسی قول کو راجح قرار دیا گیا ہے کیونکہ ہوا اکثر پچھلے مقام سے خارج ہوتی ہے اور اس کے مقابلے میں اگلے راستے سے ہوا کا خروج نہ ہونے کے برابر ہے اور احتیاط بھی اسی میں ہے، لہٰذا غلبہ ظن یقین کے حکم میں ہوگا اور اس صورت میں وضو واجب ہوگا، (البحر الرائق، جلد 1، ص: 60)‘‘۔
بعض خواتین کی بڑی آنت میں زخم پیدا ہو جاتا ہے، جس کی وجہ سے دُبُر اور بڑی آنت کے درمیان شگاف پیدا ہو جاتا ہے اور اُس میں سے ریح شرمگاہ کی طرف سرایت کرتی ہے، سو اگر ایسی صورتحال ہے تو یہ پچھلے مقام سے خارج ہونے والی ریح کے حکم میں ہے، صرف اتنی بات ہے کہ یہ اپنے فطری مَخرج کے علاوہ سے خارج ہوئی ہے، اِس کے لیے ماہر امراضِ نسواں لیڈی ڈاکٹر سے چیک اپ کرا لیا جائے اور اللہ نہ کرے اگر ایسی ہی صورتحال ہے تو پھر اِس ریح کے خارج ہونے سے وضو ٹوٹ جائے گا۔`
},
{
  pageNumber: 75,
  text: `[[heading: نماز کے مسائل]]`
},
  {
    pageNumber: 77,
    text: `[[heading: نمازی کا اپنے سامنے سے گزرنے والے کو روکنے کا حکم]]
سوال:
جو نمازی کے آگے سے گزرے، اس کو کس طرح اور کون کون روک سکتا ہے، اس سے جہاد کس طرح ثابت ہے، کچھ لوگ کہتے ہیں کہ نمازی سامنے گزرنے والے پر اپنا ہاتھ بھی استعمال کر سکتا ہے، (سلمان لودھی )۔
جواب:
اگر نمازی کے سامنے سُترہ قائم نہیں اورکوئی شخص گزرنا چاہتاہے یا سُترہ ہے ،مگر وہ شخص نمازی اور سُترہ کے درمیان سے گزرنا چاہتاہے تو نمازی کو رخصت ہے کہ اُسے گزرنے سے روکے ،خواہ سبحان اللہ کہے یا (مغرب ،عشاء اور فجر میں) جہر سے قراء ت کرے  یا  ہاتھ یا سر یا آنکھ کے اشارے سے منع کرے، اس سے زیادہ کی اجازت نہیں مثلاً کپڑا پکڑ کر جھٹکنا یا مارنا ، اگر کوئی ایسا عمل کیا جو عمل کثیر میں شمار ہوتا ہے تو نماز جاتی رہی۔
امام بخاری رحمۃ اللہ علیہ نے اپنی صحیح میں ایک باب باندھا : ’’[[arabic: بَابٌ يَرُدُّ الْمُصَلِّي مَنْ مَّرَّ بَيْنَ يَدَيْهِ]]‘‘ (نمازی اپنے سامنے سے گزرنے والے کو ہٹائے) پھر اس باب کے تحت ایک تعلیق بیان فرمائی: ’’[[arabic: وَرَدَّ ابْنُ عُمَرَ فِي التَّشَهُدِ وَفِي الْكَعْبَةِ، وَقَالَ إِنْ أَبِي إِلَّا أَنْ تُقَاتِلَهُ فَقَاتِله]]‘‘ (اور حضرت عبداللہ بن عمر رضی اللہ عنہما نے کعبہ میں اپنی نماز کے تَشَہُّد میں سامنے سے گزرنے والے کو دورکیا اورفرمایا: اگر گزرنے والا بغیر لڑائی کے باز نہ آئے تو اس سے لڑو ، صحیح بخاری:کتاب الصلاۃ)‘‘۔
(1): ’’[[arabic: عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ: لَا تَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْكَ وَأَنْتَ تُصَلِّي، فَإِنْ أَبِي إِلَّا أَنْ تُقَاتِلَهُ فَقَاتِلْهُ]]‘‘۔
ترجمہ: ’’ حضرت نافع بیان کرتے ہیں : حضرت ابن عمر رضی اللہ عنہما نے فرمایا: جو شخص نماز میں تمہارے سامنے سے گزرے اس کو مت چھوڑو ،اگر وہ لڑائی کے بغیر بازنہ آئے تواس سے`
  },
  {
    pageNumber: 78,
    text: `لڑو ، (مُصنّف عبدالرزاق :2325)‘‘۔
(2) ’’[[arabic: عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ : مَرَرْتُ بَيْنَ يَدَيِ ابْنِ عُمَرَ، وَهُوَ فِي الصَّلَاةِ ، فَارْتَفَعَ مِنْ قُعُودِهِ، ثُمَّ دَفَعَ فِي صَدْرِی]]‘‘۔
ترجمہ: ’’عمروبن دینار بیان کرتے ہیں: میں حضرت ابن عمر رضی اللہ عنہما کے سامنے سے گزرا ، وہ نماز کے قعدے میں تھے ،وہ قعدےسے کھڑے ہوگئے ،پھر مجھے دھکا دیا، (مُصَنَّف ابن ابی شیبہ:2921)‘‘۔
(3) ’’[[arabic: حَدَّثَنَا أَبُو صَالِحِ السَّمَّانُ، قَالَ: رَأَيْتُ أَبَا سَعِيدِ الخُدْرِيَّ فِي يَوْمِ جُمُعَةٍ يُصَلِّي إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ، فَأَرَادَ شَابٌ مِنْ بَنِي أَبِي مُعَيْطَ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَدَفَعَ أَبُو سَعِيدٍ فِي صَدْرِهِ ، فَنَظَرَ الشَّابُ فَلَمْ يَجِدُ مَسَانًا إِلَّا بَيْنَ يَدَيْهِ، فَعَادَ لِيَجْتَانَ، فَدَفَعَهُ أَبُو سَعِيدٍ أَشَدَّ مِنَ الْأُولَى، فَنَالَ مِنْ أَبِي سَعِيدٍ، ثُمَّ دَخَلَ عَلَى مَرْوَانَ، فَشَكَا إِلَيْهِ مَا لَقِيَ مِنْ أَبِي سَعِيدٍ ، وَدَخَلَ أَبُو سَعِيدٍ خَلْفَهُ عَلَى مَرْوَانَ، فَقَالَ: مَا لَكَ وَلا بْنِ أَخِيكَ يَا أَبَا سَعِيدٍ ، قَالَ : سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ : إِذَا صَلَّى أَحَدُكُمْ إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ فَأَرَادَ أَحَدٌ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَلْيَدْفَعُهُ فَإِنْ أَبِي فَلْيُقَاتِلُهُ فَإِنَّهَا هُوَ شَيْطَانٌ]]‘‘۔
ترجمہ: ’’ا بوصالح السّمّان بیان کرتے ہیں :میں نے دیکھا حضرت ابوسعید خدری رضی اللہ عنہ جمعہ کے دن کسی چیز کو لوگوں سے سُترہ بناکر نماز پڑھ رہے تھے، بنوابی مُعَیط کے ایک نوجوان نے ان کے سامنے سے گزرنے کا ارادہ کیا تو حضرت ابوسعید نے اس کے سینے پر دھکا دیا ، اس نوجوان نے ادھر اُدھر دیکھا ،مگر اس نے حضرت ابوسعید کے سامنے کے علاوہ کوئی جگہ نہ پائی ،وہ دوبارہ ان کے سامنے سے گزرنے لگا ،حضرت ابوسعید نے اس کو پہلی بار سے زیادہ زور سے دھکا دیا ،اس نے حضرت ابوسعید سے تکلیف اٹھائی ،اس نے مروان کے پاس جاکرحضرت ابوسعید سے پہنچنے والی تکلیف کی شکایت کی ، حضرت ابوسعید بھی اس کے پیچھے پیچھے مروان کے پاس آئے ،مروان نے کہا: اے ابوسعید ! آپ کے اور آپ کے بھتیجے کے`
  },
  {
    pageNumber: 79,
    text: `درمیان کیا معاملہ ہوا؟،انہوں نے بیان کیا: میں نے نبی کریم ﷺ کو یہ فرماتے ہوئے سنا ہے: جب تم میں سے کوئی شخص کسی چیز کو لوگوں سے سُترہ بناکر نماز پڑھے ،پھرکوئی شخص اس کے سامنے سے گزرنے کا ارادہ کرے ،تووہ اس کو دفع کرے ،اگر وہ بازنہ آئے تواس سے لڑے کیونکہ وہی شخص شیطان ہے ،(صحیح بخاری:509)‘‘۔
علامہ ابوالحسن علی بن ابوبکر فرغانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَدْرَأُ الْمَارًا ذَا لَمْ يَكُنْ بَيْنَ يَدَيْهِ سُتْرَةٌ أَوْ مَرَّ بَيْنَهُ وَبَيْنَ السُّتْرَةِ لِقَوْلِهِ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ : ادْرَعُوا مَا اسْتَطَعْتُمْ وَيَدْرَأُ بِالْإِشَارَةِ كَمَا فَعَلَ رَسُولُ اللَّهِ ﷺ بِوَلَدَیْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا أَوْ يَدْفَعُ بِالتَّسْبِيحِ]]‘‘۔
ترجمہ: ’’جب نمازی کے سامنے سُترہ نہ ہو اورکوئی اس کے سامنے سے گزرے یا اس کے سامنے سُترہ ہو اورکوئی اس کے اور سُترے کے درمیان سے گزرے تونمازی اس کو منع کرے اور اس کو اشارے سے منع کرے جیساکہ رسول اللہ ﷺ نے حضرت اُمّ سلمہ رضی اللہ عنہا کے دو بچوں کے ساتھ کیایا سبحان اللہ پڑھ کر ان کو گزرنے سے منع کرے ، (ہدایہ ، جلد1،ص:274)‘‘۔ 
علامہ کمال الدین ابن ہمام رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَهُوَ مَا فِي أَبِي دَاوَدَاذَا صَلَّى أَحَدُكُمْ فَلْيَجْعَلُ تِلْقَاءَ وَجْهِهِ شَيْئًا، فَإِنْ لَمْ يَجِدُ فَلْيَنْصِبْ عَصَا وَإِنْ لَمْ يَكُنْ مَعَهُ عَصَا فَلْيَخُطَ خَطًا وَلَا يَضُرُّهُ مَا مَرَّ أَمَامَهُ، وَاخْتَارَ الْمُصَنِّفُ الْأُولَى وَالسُّنَّةُ أَولَى بِالاتِّبَاعِ]]‘‘۔
ترجمہ: ’’اور وہ جو ابوداؤد میں روایت ہے : ’’جب تم میں سے کوئی شخص نماز پڑھے ،تو اپنے سامنے کوئی چیز رکھ لے اوراگر اورکوئی چیز نہ ملے تو عصا رکھ لے ، وہ بھی نہ ہو تو خط کھینچ لے ، پھر آگے سے گزرنے والے کی پرواہ نہ کرے ‘‘،مُصنّف نے پہلے قول کو اختیار کیا ، حدیث کا اتباع کرنا اَولیٰ ہے ،(فتح القدیر ، جلد1،ص:418)‘‘۔
شیخ التفسیر والحدیث علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں: ’’یہ حدیث اگر چہ ضعیف اور`
  },
  {
    pageNumber: 80,
    text: `مضطرب ہے لیکن اس پر عمل کیاجاسکتاہے کیونکہ فضائل اعمال میں حدیث ضعیف معتبر ہوتی ہے ،(شرح صحیح مسلم،جلد1،ص:1324)‘‘۔
علامہ ابن نجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَدْرَؤُهُ إِنْ لَمْ يَكُنْ سُتْرَةٌ أَوْ مَرَّبَيْنَهُ وَبَيْنَهَا لِلْأَحَادِيثِ الْوَارِدَةِ وَهُوَ بِالْإِشَارَةِ بِالْيَدِ أَوْ بِالرَّأْسِ أَوْ بِالْعَيْنِ أَوْ بِالتَّسْبِيحِ، وَزَادَ الْوَلْوَالِحِنُ أَنَّهُ يَكُونُ بِرَفْعِ الصَّوْتِ بِقَرَاءَةِ الْقُرْآنِ وَيَنْبَغِي أَنْ يَكُونَ مَحَلُّهُ فِي الصَّلَاةِ الْجَهْرِيَّةِ فِيمَا يُجْهَرُ فِيْهِ مِنْهَا]]‘‘۔
ترجمہ: ’’فقہائے کرام نے کہا: نمازی کے سامنے سُترہ نہیں یا سُترہ ہے اور کوئی شخص نمازی اور سُترہ کے درمیان سے گزرنا چاہتاہے تو نمازی اس کو گزرنے سے روکے ،کیونکہ یہ حکم احادیث میں ہے: وہ ہاتھ کے اشارے سے روکے  یا  سرسے اشارہ کرکے روکے  یا آنکھوں کے اشارے سے روکے یا تسبیح(سبحان اللہ) پڑھے اور ’’ولوالجی ‘‘ نے یہ اضافہ کیاہے کہ آواز سے قرآن کی قراء ت کرے ،بہتریہ ہے کہ جہری(یعنی فجر، مغرب اور عشاء کی) نماز پڑھ رہا ہو تو اس میں (منفرد) اونچی آواز سے قراءت کرے  ،(البحرالرائق ، جلد2،ص:32)‘‘۔
علامہ بدرالدین عینی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’آیا نماز ی سے آگے گزرنے والے کو دفع کرنا واجب ہے یا مستحب، تو امام نووی نے کہا ہے: یہ امر مستحب ہے اور اس کی تاکید ہے اور میرے علم میں نہیں ہے کہ فقہائے کرام میں سے کسی نے اسے واجب قرار دیا ہے ،میں (عینی )کہتا ہوں:اہل ظاہر نے ظاہر حدیث پر عمل کرتے ہوئے اسے واجب قرار دیا ہے، ہوسکتا ہے امام نووی کو اس کا علم نہ ہو۔۔۔مزید لکھتے ہیں:
’’سامنے سے گزرنے والے کو اپنی جگہ سے آگے چل کر روکنااگرچہ جائز ہے ،لیکن بہتر ہے کہ اپنی جگہ پر کھڑے کھڑے روکے، کیونکہ نماز میں چلنے کا بگاڑ نمازی کے آگے سے گزرنے کے بگاڑ سے زیادہ ہے، لہٰذا اس کے لیے اتنا ہی دفع کرنا مباح ہے جتنا کہ وہ اپنی`
  },
  {
    pageNumber: 81,
    text: `جگہ کھڑے کھڑے کرسکے اور اگر گزرنے والا فاصلے پر ہے اور نمازی اپنی جگہ کھڑے کھڑے نہیں روک سکتا تو اشارے سے روکے یا سبحان اللہ کہے، دونوں طریقے اختیار نہ کرے،(عمدۃ القاری،ج:4،ص:426)‘‘۔
الغرض حدیثِ مبارک میں نمازی کے آگے سے گزرنے والے شخص کو روکنے کے لیے لڑنے کے الفاظ اس مسئلے کی شدت کو بیان کرنے کے لیے ہیں ،عملاً ایسا نہیں کرناچاہیے اور عملِ کثیر ویسے ہی مُفسدِ نماز ہے، البتہ اگر نمازی کے آگے سے گزرنے والا ہاتھ کی پہنچ میں ہے تو ایک ہاتھ بڑھا کر اسے روک سکتا ہے۔

[[heading: نمازِ جمعہ کے دونوں خطبوں کے درمیان ہاتھ اٹھاکر دعا مانگنا]]
سوال:
نمازِ جمعہ کے دونوں خطبوں کے درمیان ہاتھ اٹھا کر دعا مانگنا کیساہے ؟،(انعام الحق ، لاہور)۔
جواب:
احادیثِ مبارکہ میں جمعۃ المبارک کے دن قبولیتِ دعا کی ایک ساعت بتائی گئی ہے ، اس کے بارے میں روایات یہ ہیں:
(۱) ’’[[arabic: عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ ﷺ ذَكَرَ يَوْمَ الْجُمُعَةِ، فَقَالَ: فِيهِ سَاعَةٌ، يُوَافِقُهَا عَبْدُ مُسْلِمٌ ، وَهُوَ قَائِمٌ يُصَلِّي، يَسْأَلُ اللهَ تَعَالَى شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا]]‘‘۔
ترجمہ: ’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں :رسول اللہ ﷺ نے جمعہ کے دن کا ذکر کیااور فرمایا: اس میں ایک ایسی ساعت ہے کہ جومسلمان بندہ اس ساعت کو پالے اوروہ اس ساعت میں کھڑاہوانماز پڑھ رہاہو اوروہ اللہ تعالیٰ سے کسی چیز کا سوال کرے تو اللہ تعالیٰ اس کو وہ چیز عطافرمادیتاہے اور آپ نے ہاتھ کے اشارے سے بتایاکہ وہ ساعت بہت تھوڑی ہے ،(صحیح بخاری:935)‘‘۔`
  },
  {
    pageNumber: 82,
    text: `(۲) ’’[[arabic: عَنْ أَبِي مُوسَى الْأَشْعَرِي فِي سَاعَةِ الْجُمُعَةِ ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ : هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الْإِمَامُ إِلَى أَنْ تُقْضَى الصَّلَاةُ]]‘‘۔
ترجمہ: ’’حضرت ابوموسیٰ اشعری رضی اللہ عنہ جمعہ کے دن دعا کی قبولیت کی ساعت کے بارے میں بیان کرتے ہیں،میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا :یہ ساعت امام کے (منبر پر)بیٹھنے سے لے کر نماز کے اختتام تک ہے ،(صحیح مسلم: 853)‘‘۔
(۳) ’’[[arabic: عَنْ عَبْدِ اللَّهِ ابْنِ عُمَرَ يَقُولُ : سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ وَ الْإِمَامُ عَلَى الْمِنْبَرِ ، فَلَا صَلَاةَ وَلَا كَلَامَ ، حَتَّى يَفْرُغَ الْإِمَامُ]]‘‘۔
ترجمہ: ’’عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں : میں نے نبی ﷺ کو بیان کرتے ہوئے سنا: جب تم میں سے کوئی مسجد میں داخل ہو اور امام (خطبے کے لیے )منبر پر بیٹھ چکا ہے، تو نہ نماز پڑھی جائے اور نہ کلام کیا جائے ،یہاں تک کہ امام نماز سے فارغ ہوجائے(یعنی توجہ سے خطبہ سنا جائے)، (المعجم الکبیر للطبرانی:13708)‘‘۔ایک روایت بعدنماز عصر کی بھی ہے۔
(۴) ’’[[arabic: عَنْ أَبِي أُمَامَةَ قَالَ : إِنِّي لَأَرْجُو أَنْ تَكُونَ السَّاعَةُ الَّتِي فِي الْجُمُعَةِ إِحْدَى هَذِهِ السَّاعَاتِ إِذَا أَذَّنَ الْمُؤَذِّنُ أَوِ الْإِمَامُ عَلَى الْمِنْبَرِ أَوْ عِنْدَ الْإِقَامَةِ]]‘‘۔
ترجمہ: ’’حضرت ابواُمامہ رضی اللہ عنہ بیان کرتے ہیں: مجھے امید ہے کہ جمعہ کے دن (دعا کی قبولیت )کی ساعت ان تین میں سے ایک ہے: جب موذن اذان دے یاامام منبر پر ہویااقامت کے وقت ،(مصنف ابن ابی شیبہ:5466)‘‘۔
لہٰذا دوخطبوں کے درمیان امام دعا کرسکتا ہے اورمقتدی بھی دل میں یا آہستہ آواز میں دعا کرسکتے ہیں۔
امام ابن حجر ہیتمی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’قاضی عیاض نے کہا:دو خطبوں کے درمیان جلسے میں دعا مقبول ہے اورحاضرین کے لیے اس جلسے میں دعا میں مشغول رہنا سنت ہے ، کیونکہ یہ بات ثابت ہے کہ اس وقت دعا مقبول ہوتی ہے اور مقتدی آہستہ دعا کریں، کیونکہ اونچی آواز سے دعا کرنے میں`
  },
  {
    pageNumber: 83,
    text: `دوسروں کی توجہ بٹے گی اور آہستہ دعا کرنا افضل ہے، سوا اس کے کہ کوئی امر عارض ہو، (الفتاویٰ الفقہیۃ الکبریٰ  ، ج:1،ص:252)‘‘۔
شیخ محمد بن صالح ابن عثیمین لکھتے ہیں:
ترجمہ: ’’دو خطبوں کے درمیان دعا خیر اور مستحب ہے ،کیونکہ یہ قبولیتِ دعا کا وقت ہے ،پھر انہوں نے صحیح مسلم کی مندرجہ بالا حدیث کا حوالہ دیااور کہا: جہاں تک رفع یدین کا سوال ہے تو میرے نزدیک اس میں کوئی حرج نہیں ہے ،کیونکہ دعا کے آداب میں سے رفع یدین ہے، سو کوئی دعا کے وقت ہاتھ اٹھائے تو کوئی حرج نہیں ہے اور اگر نہ اٹھائے تو بھی حرج نہیں ہے ،دو خطبوں کے درمیان کوئی مخصوص دعا یا ذکر وارد نہیں ہے ،لیکن انسان اپنی پسندیدہ کوئی بھی دعا کرسکتا ہے ،کیونکہ حدیث کی رُو سے یہ دعا کی قبولیت کا وقت ہے ،(فتاویٰ نور علی الدرب،صلاۃ الجمعۃ)‘‘۔
نبی کریم ﷺ سے بطورِ خاص دو خطبوں کے درمیان ہاتھ اٹھاکر دعا کرنا ثابت نہیں ہے ،لیکن فی نفسہٖ دعا کے آداب میں یہ ہے کہ ہاتھ اٹھاکر دعا کرے ،ہتھیلی کا رُخ اوپر کی طرف ہواور دعا کے بعد ہاتھ چہرے پر پھیر لے،احادیثِ مبارکہ یہ ہیں:
(۱) عبداللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں:رسول اللہ ﷺ نے فرمایا:
’’[[arabic: سَلُوا اللَّهَ بِبُطُونِ أَكُقِكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا، فَإِذَا فَرَغْتُمْ، فَامْسَحُوا بِهَا وُجُوهَكُمْ]]‘‘۔
ترجمہ: ’’اپنی ہتھیلیوں کو پھیلاکر اللہ سے سوال کرو ،اپنے ہاتھوں کی پشت کو پھیلاکر سوال نہ کرو،پھر جب دعا سے فارغ ہوجائو تو اپنے ہاتھ اپنے چہرے پر مَل لو، (ابودائود:1485)۔
(2) ’’[[arabic: الْمَسْأَلَةُ أَنْ تَرْفَعَ يَدَيْكَ حَذْوَ مَنْكِبَيْكَ أَوْ نَحْوَهُمَا]]‘‘۔
ترجمہ: ’’حضرت ابن عباس رضی اللہ عنہما فرماتے ہیں:(اللہ تعالیٰ سے ) سوال کرنے کا طریقہ یہ ہے کہ تم اپنے ہاتھ کندھوں کے برابر یا( کم وبیش ) اٹھائو، (ابودائود:1489)‘‘۔
(3) ’’[[arabic: إِنَّ النَّبِيُّ ﷺ كَانَ إِذَا دَعَا فَرَفَعَ يَدَيْهِ ، مَسَحَ وَجْهَهُ بِيَدَيْهِ]]‘‘۔`
  },
  {
    pageNumber: 84,
    text: `ترجمہ: ’’سائب بن یزید اپنے والد سے بیان کرتے ہیں:نبی ﷺ جب دعا کرتے تو اپنے ہاتھ بلند کرتے اور اپنے ہاتھ اپنے چہرہ مبارک پر پھیر لیتے، (ابودائود:1492)‘‘۔
(4) ’’[[arabic: إِنَّ رَبَّكُمْ تَبَارَكَ وَتَعَالَى حَبِى كَرِيمٌ ، يَسْتَحْيِي مِنْ عَبْدِهِ إِذَا رَفَعَ يَدَيْهِ إِلَيْهِ ، أَنْ يَرُدَّهُمَا صِفْرًا]]‘‘۔
ترجمہ: ’’حضرت سلمان رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا: بے شک تمہارا رب تبارک وتعالیٰ بہت حیا فرمانے والا کریم ہے،جب اس کا بندہ اس کی طرف ہاتھ اٹھالے،تو وہ اپنے بندے سے حیا فرماتا ہے کہ اُس کے ہاتھ خالی لوٹادے، (ابودائود: 1488)‘‘۔
الغرض جمعے کے دن دو خطبوں کے درمیان امام کے لیے دعا بالاتفاق جائز ہے، فقہ حنفی میں امام ابویوسف اور امام محمد کے نزدیک دو خطبوں کے درمیان دعا مقتدی کے لیے بھی جائز ہے اور امام اعظم سے بھی ایک روایت جواز کی ہے ،لیکن مقتدی دل میں یا زبان سے آہستہ دعا کریں۔ مقتدی ہاتھ اٹھاکر دعا کا التزام نہ کریں تاکہ اسے جمعے کا شِعار نہ سمجھ لیا جائے ، کبھی ہاتھ اٹھاکر بھی دعا کرسکتے ہیں کہ اس کی ممانعت نہیں ہے اور ہاتھ اٹھانا آدابِ دعامیں سے ہے ۔
چنانچہ مفتی مصر شیخ محمد رشید رضا متوفّیٰ 1354ھ لکھتے ہیں:
ترجمہ: ’’دو خطبوں کے درمیان دعا کے لیے ہاتھ اٹھانااور بلند آواز سے دعا کرنا سنت سے ثابت نہیں ہے اوراگر یہ تاثر پیدا نہ ہو لوگ کسی دلیل کے بغیر اسے سنت سمجھ کر کر رہے ہیں،تو(اپنی اصل کے اعتبار سے )ہاتھ اٹھاکر دعا کرنے میں کوئی حرج بھی نہیں ہے ،آثار سے یہ ثابت ہے کہ جب امام منبر پر کلام کرے تو خاموش رہ کر سنا جائے اور اسی سبب ہم کہتے ہیں :’’جب امام خاموش ہو تو دعا میں حرج نہیں ہے، لیکن دعا آہستہ کرے تاکہ دوسروں کے لیے تکلیف (اور توجہ بٹنے )کا سبب نہ بنے اور سب لوگ ہاتھ بھی نہ اٹھائیں کہ لوگ اسے جمعے کا شِعار نہ سمجھ لیںاورجب امام دوسرے خطبے کے لیے اٹھے تو دعا موقوف کردیںاور خطبہ سنیں، (مجلّۃ المنار،ج:6،ص:792،)‘‘۔ اصل سے مراد یہ ہے کہ مطلقاً دعا میں ہاتھ اٹھانا سنت`
  },
  {
    pageNumber: 85,
    text: `سے ثابت ہے۔
امام اہلسنت امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْز سے جمعۃ المبارک کے دن دو خطبوں کے درمیان دعائوں کے بارے میں سوال ہوا کہ آیایہ مکروہِ تحریمی ہے یا تنزیہی یا جائزہے، ایک صاحب اسے بدعت اور حرام بتاتے ہیں ،آپ نے تفصیلی جواب لکھا،جس کا خلاصہ یہ ہے:
’’دو خطبوں کے درمیان امام کا دعا مانگنا بالاتفاق جائز ہے ،بلکہ خطبے کے درمیان بھی رسول اللہ ﷺ سے ہاتھ اٹھاکر بارش کے لیے دعا مانگنا صحیح احادیث سے ثابت ہے ۔فقہِ حنفی میں دو خطبوں کے درمیان مقتدی کے لیے دعا مانگنا صاحبین کے نزدیک بالاتفاق جائز ہے ، امام اعظم سے بھی ایک قول کے مطابق اس کا جواز ثابت ہے اور امام شافعی کے نزدیک بھی جائز ہے،تاہم آپ نے لکھا:’’یہ کوئی ایسا امر نہیں جس پر شدت اختیار کی جائے ،نرمی سے سمجھایا جائے ،اگر کوئی نہ مانے تو اس کی بنا پر فتنہ اٹھانا اور گروہ بندی کی حاجت نہیں ہے ، آپ نے اس موضوع پر ’’[[arabic: رِعَايَةُ الْمَذْهَبَينِ فِي الدُّعَاءِ بَيْنَ الْخُطَبَتَيْن]]‘‘ کے نام سے ایک مستقل رسالہ لکھا ہے، (فتاویٰ رضویہ، ج:8، ص: 397و477تا494، ملخصاً ، بتصرف)‘‘۔ 

[[heading: اِقامت کا مفصل ومدلل مسئلہ]]
سوال:
چند روز قبل ہماری مسجد کے امام صاحب نے مسئلہ بیان فرمایاکہ:’’ اِقامت نماز سے قبل پڑھی جاتی ہے ،بیٹھ کر سننا سنت ہے اور ’’حی علی الصلوۃ ‘‘پر کھڑا ہونا چاہیے ،اس سے قبل نمازی کا کھڑاہونا مکروہ عمل ہے ‘‘۔میں اس دن سے عجیب ذہنی کیفیت میں مبتلا ہوں ، اپنی67سالہ عمر میں اللہ اکبر کے ساتھ ہی کھڑاہواکرتاتھا ،اگر میرایہ عمل مکروہ ہے تو اس عرصہ میں اداکی گئی نمازوں کاکیاہوا۔حرمین شریفین کی حاضری نصیب ہوئی ،وہاں بھی اللہ اکبر کی صداکے ساتھ ہی صفیں بننا شروع ہوجاتی ہیں ۔کروڑوں مسلمانوں کو اللہ اکبر کے`
  },
  {
    pageNumber: 86,
    text: `ساتھ مساجد میں صف بندی کرتے ہوئے دیکھاہے ،ان کی نمازوں کا کیا ہوگا ۔مجھے امام صاحب کی علمی کمی یاان پر بالادستی مطلوب نہیں ،اپنے اعمال کی درستگی اور گزشتہ نمازوں کی فکر ہے کیونکہ میرے نزدیک مکروہ عمل کے آغاز کے ساتھ کسی عبادت کی قبولیت ممکن نہیں ہوسکتی ،(سرفراز احمد ،قیوم آباد ،کراچی )۔
جواب:
لوگوں کو یہ بتانے کے لیے کہ جماعت کھڑی ہونے والی ہے ،اِقامت کہی جاتی ہے ،یہ امرِمشروع ہے اور سنّت ِ مُتوارثہ ہے ،اس کے کلمات حدیث سے ثابت ہیں ،اسی کو ہمارے عرف میں ’’ تکبیر‘‘ بھی کہاجاتاہے اِقامت کی اصطلاح ’’[[arabic: قَدقَامَتِ الصَّلوٰۃُ]]‘‘ کے کلمے سے اور ’’تکبیر‘‘ کی اصطلاح ’’اللہ اکبر‘‘ سے مستفاد ہے۔ جماعت کے لیے اقامت کے وقت مقتدی کب کھڑے ہوں،اس کے بارے میں احادیث مبارکہ میں کوئی صریح حکم مذکورنہیں ہے، ماسوا صحیح مسلم کی اس حدیث کے کہ ـ’’[[arabic: لَاتَقُوْمُوْا حَتّٰی تَرَوْنِیْ]]‘‘ (جب تک تم مجھے دیکھ نہ لو،مت کھڑے ہو )۔دراصل رسول اللہ ﷺ کا معمول یہ تھاکہ آپ جماعت کھڑی ہونے کے وقت حجرۂ انور سے باہر تشریف لاتے اورحضرت بلال رضی اللہ عنہ کی نظریں حجرۂ انور کی طرف جمی رہتیں، جوں ہی آپ ﷺ نکلتے ،وہ اقامت شروع کردیتے تھے ، حدیث پاک میں ہے :
 ’’[[arabic: عَن أَبِي قَتَادَةَ ، قَالَ: قَالَ رَسُولَ الله ﷺ وَإِذَا أُقِيمَتِ الصَّلَاةُ فَلَا تَقُوْمُوا حَتَّى تَرَوْنِي]]‘‘ ۔
ترجمہ: ’’حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ ﷺ نے صحابہ سے فرمایا: جب نماز کے لیے اِقامت کہی جائے ،توجب تک تم مجھے دیکھ نہ لو ،مت کھڑے ہو،(صحیح مسلم:604)‘‘۔
اس حدیث کے تحت امام یحییٰ بن شرف نووی رحمۃ اللہ علیہ نے یہ روایات بیان کی ہیں:
’’[[arabic: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أُقِيمَتِ الصَّلَاةُ، فَقُمْنَا فَعَدَلْنَا الصُّفُوفَ قَبْلَ أَنْ يَخْرُجَ]]`
  },

  {
  pageNumber: 87,
  text: `[[arabic: إِلَيْنَا رَسُولُ اللَّهِ وَفِي رِوَايَةِ : أَنَّ الصَّلَاةَ كَانَتْ تُقَامُ لِرَسُولِ اللَّهِ ﷺ فَيَأْخُذُ النَّاسُ مَصَافَهُمْ قَبْلَ أَنْ يَقُومَ النَّبِيُّ مَقَامَةَ وَفِي رِوَايَةِ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اللَّهُ عَنْهُ : كَانَ بِلَالٌ رَضِيَ اللَّهُ عَنْهُ يُؤَذِّنُ إِذَا دَحَضَتْ وَلَا يُقِيمُ حَتَّى يَخْرُجَ النَّبِيُّ فَإِذَا خَرَجَ أَقَامَ الصَّلَاةَ حِينَ يَرَاهُ]]
ترجمہ: ابو ہریرہ رضی اللہ عنہ کی ایک روایت میں ہے: ’’نماز کے لیے اقامت کہی گئی، تو رسول الله ﷺ کے اپنے حجرۂ انور سے) نکلنے سے پہلے ہم کھڑے ہوئے اور ہم نے صفیں درست کیں۔ اور ایک روایت میں ہے : رسول اللہ ﷺ کے لیے اقامت کہی جاتی ، تو نبی علیہ السلام کے کھڑے ہونے سے پہلے لوگ صفیں درست کرنے لگ جاتے‘‘۔
(۲) جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں : جب سورج ڈھل جاتا تو بلال اذان دیتے اور رسول اللہ ﷺ کے نکلنے سے پہلے اقامت نہ کہتے ، پس جب آپ ﷺ نکلتے تو انہیں دیکھ کر اقامت کہتے۔
اس کی شرح میں علامہ نووی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: قَالَ الْقَاضِي عِيَاضٌ رَحِمَهُ اللهُ تَعَالَى : يُجْمَعُ بَيْنَ مُخْتَلَفِ هُذِهِ الْأَحَادِيثِ بِأَنَّ بِلَالًا رَضِيَ اللهُ عَنْهُ كَانَ يُرَاقِبُ خُرُوجَ النَّبِيِّ ﷺ مِنْ حَيْثُ لَا يَرَاهُ غَيْرُهُ أَوْ إِلَّا الْقَلِيلُ فَعِنْدَ أَوَّلِ خُرُوجِهِ يُقِيمُ وَلَا يَقُوْمُ النَّاسُ حَتَّى يَرَوْهُ ، ثُمَّ لَا يَقُومُ مَقَامَهُ حَتَّى يَعْدِلُوا الصُّفُوفَ، وَقَوْلُهُ فِي رِوَايَةِ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ فَيَأْخُذُ النَّاسُ مَصَافَهُمْ قَبْلَ خُرُوجِهِ لَعَلَّهُ كَانَ مَرَّةً أَوْ مَرَّتَيْنِ وَنَحْوَهُمَا لِبَيَانِ الْجَوَازِ أَوْ لِعُذْرٍ وَلَعَلَّ قَوْلَهُ : فَلَا تَقُومُوا حَتَّى تَرَوُنِي كَانَ بَعْدَ ذَلِكَ ، قَالَ الْعُلَمَاءُ: وَالنَّهَى عَنِ الْقِيَامِ قَبْلَ أَنْ يَرَهُهُ لِئَلَّا يَطُولَ عَلَيْهِمُ الْقِيَامُ وَلِأَنَّهُ قَدْ يَعْرِضُ لَهُ عَارِضٌ فَيَتَأَخَرُ بِسَبَبِهِ ، وَاخْتَلَفَ الْعُلَمَاءُ مِنَ السَّلَفِ فَمَنْ بَعْدَهُمْ مَتَّى يَقُومُ النَّاسُ لِلصَّلَاةِ وَمَتَى يُكَبِّرُ الْإِمَامُ، فَيَذْهَبُ الشَّافِعِي رَحِمَهُ اللهُ تَعَالَى وَطَائِفَةِ أَنَّهُ يُسْتَحَبُّ أَنْ لَا يَقُومَ أَحَدٌ حَتَّى يَفْرُغَ الْمُؤَدِّنُ مِنَ الْإِقَامَةِ، وَنَقَلَ الْقَاضِي عِيَاضٌ عَنْ مَالِكٍ رَحِمَهُ اللهُ تَعَالَى وَعَامَّةِ الْعُلَمَاءِ : أَنَّهُ]]`
},
{
  pageNumber: 88,
  text: `[[arabic: يُسْتَحَبُّ أَنْ يَقُوْمُوا إِذَا أَخَذَ الْمُؤَذِّنُ فِي الْإِقَامَةِ وَكَانَ أَنَسٌ رَحِمَهُ اللَّهُ تَعَالَى يَقُوْمُ إِذَا قَالَ الْمُؤَذِّنُ : قَدْ قَامَتِ الصَّلَاةُ ، وَبِهِ قَالَ أَحْمَدُ رَحِمَهُ اللهُ تَعَالَى، وَقَالَ أَبُو حَنِيفَةً رَضِيَ اللَّهُ عَنْهُ: الْكُوفِيُّوْنَ يَقُوْمُوْنَ فِي الصَّفَ إِذَا قَالَ : حَى عَلَى الصَّلَاةِ فَإِذَا قَالَ: قَدْ قَامَتِ الصَّلَاةُ ، كَبَّرَ الْإِمَامُ ، وَقَالَ جُمْهُورُ الْعُلَمَاءِ مِنَ السَّلَفِ وَالْخَلَفِ لَا يُكَبِّرُ الْإِمَامُ حَتَّى يَفْرُغَ الْمُؤَذِّنُ مِنَ الْإِقَامَةِ ، فَقَوْلُهُ : قُمْنَا فَعَدَلْنَا الصُّفُوفَ ، إِشَارَةٌ إِلَى أَنَّ هَذِهِ سُنَةٌ مَعْهُودَةٌ عِنْدَهُمْ وَقَدْ أَجْمَعَ الْعُلَمَاءُ عَلَى اسْتِحْبَابِ تَعْدِيْلِ الصُّفُوفِ وَالتَّرَاضِ فِيهَا ، وَقَدْ سَبَقَ بَيَانُهُ فِي بَابِهِ ، فَقَوْلُهُ فَأَنَّى رَسُولُ اللَّهِ ﷺ حَتَّى إِذَا قَامَ فِي مُصَلَّاهُ قَبْلَ أَنْ يُكَفِّرَ ذَكَرَ فَانْصَرَفَ وَقَالَ لَنَا: مَكَانَكُمْ فَلَمْ نَزَلْ قِيَامًا تَنْتَظِرُهُ حَتَّى خَرَجَ إِلَيْنَا وَقَدِ اغْتَسَلَ]]
ترجمہ: قاضی عیاض رحمۃ اللہ علیہ کہتے ہیں : ان احادیث میں تطبیق کی صورت یہ ہے کہ بلال رضی اللہ عنہ ایسی جگہ سے رسول اللہ ﷺ کو دیکھ رہے ہوتے ، جہاں سے اور صحابہ نہ دیکھ پاتے یا بہت کم لوگ دیکھ پاتے ، پس حضرت بلال آپ ﷺ کو نکلتے ہوئے دیکھتے ہی اقامت شروع کر دیتے اور لوگ (عام نمازی) جب آپ ﷺ کو خود نہ دیکھتے کھڑے نہ ہوتے ، پھر جب تک صحابہ صفیں برابر نہ کر لیتے ، آپ مصلائے امامت پر نہ کھڑے ہوتے اور ابو ہریرہ رضی اللہ عنہ کی ایک روایت میں ہے : آپ ﷺ کے نکلنے سے پہلے لوگ صفیں بنانے لگ جاتے ، شاید یہ ایک دو یا چند بار بیان جواز کے لیے یا کسی عذر کے سبب ہوا ہو گا (کہ آپ ﷺ تاخیر سے نکلے) اور شاید اسی کے بعد ہی آپ ﷺ نے فرمایا ہوگا : ’’جب تک مجھے (خود) نہ دیکھ لو، مت کھڑے ہوا کرو‘‘۔ علماء نے کہا: آپ ﷺ کو دیکھنے سے پہلے کھڑے ہونے سے روکنے کا سبب شاید یہ ہوگا کہ ان کا قیام طویل نہ ہو جائے، کیونکہ آپ ﷺ کبھی کوئی حاجت در پیش ہونے کے سبب نکلنے میں تاخیر فرما دیتے ۔ سواس باعث علمائے سلف اور ان کے بعد والوں میں اختلاف رائے ہوا کہ لوگ نماز کے لیے کب کھڑے ہوں اور امام تکبیر تحریمہ کب کہے۔ امام شافعی رحمۃ اللہ علیہ اور بعض علماء کا مذہب یہ ہے کہ مؤذن کے اقامت ختم ہونے سے پہلے لوگ کھڑے نہ ہوں ۔ اور قاضی عیاض نے امام مالک رحمۃ اللہ علیہ اور عام علماء سے روایت کیا : جب مؤذن اقامت شروع کرے تو مستحب یہ ہے کہ لوگ کھڑے ہو جائیں اور حضرت انس رضی اللہ عنہ اس وقت کھڑے ہوا کرتے تھے جب موذن ’’قَدْ قَامَتِ الصَّلوة‘‘ کہتا اور امام احمد رحمۃ اللہ علیہ نے بھی یہی کہا ہے۔ امام ابو حنیفہ رحمۃ اللہ علیہ اور علمائے کوفہ نے کہا : اور جب مؤذن ’’حَيَّ عَلَی الصَّلاة‘‘ کہے، تو لوگ کھڑے ہوں اور جب وه ’’قَدْ قَامَتِ الصَّلوٰۃ‘‘ کہے، تو امام تکبیر تحریمہ کہے، اور سلف سے لے کر خلف تک جمہور علماء نے کہا ہے: مؤذن کے اقامت سے فارغ ہونے تک امام تکبیر تحریمہ نہ کہے حضرت ابوہریرہ رضی اللہ عنہ کا یہ قول : "ہم کھڑے ہوئے اور صفیں برابر کیں"، یہ اس طرف اشارہ ہے کہ ان کے ہاں یہ طریقہ رائج تھا۔ اور تمام علماء کے نزدیک صفیں برابر کرنا اور مل کر کھڑا ہونا مستحب ہے اور صحیح مسلم : 605 میں ہے : ابو ہریرہ کا یہ قول : ’’پھر رسول اللہ ﷺ اقامت کے بعد امامت کی جگہ تشریف لے آئے ، پھر آپ کچھ یاد آنے پر چلے گئے، اور ہم سے فرمایا: ’’اپنی جگہ کھڑے رہو‘‘، پھر ہم قیام کی حالت میں انتظار کرتے رہے، یہاں تک کہ آپ غسل فرما کر تشریف لے آئے ، ( صحیح مسلم بشرح النووی، جلد 5 ، ص: 88-87)۔ اس سے معلوم ہوا کہ ضرورت کے وقت اقامت کے بعد تکبیر تحریمہ کے لیے معمولی تاخیر کی جاسکتی ہے، پس اگر امام محسوس کرے کہ صفیں درست نہیں ہوئیں ، تو وہ چند ثانیے یا ایک دو منٹ تاخیر بھی کر سکتا ہے۔`
},
{
  pageNumber: 89,
  text: `علامه ابن قدامہ حنبلی متوفی 620ھ لکھتے ہیں:
[[arabic: وَيُسْتَحَبُّ أَنْ يَقُومَ إِلَى الصَّلَاةِ عِنْدَ قَوْلِ الْمُؤذِّنِ قَدْ قَامَتِ الصَّلَاةِ، وَبِهُذَا قَالَ مَالِكَ، قَالَ ابْنُ الْمُندر عَلى هُذَا أَهْلُ الْحَرمَينِ ، وَقَالَ الشَّافِعِي: يَقُومُ إِذَا فَرَغَ الْمُؤَذِّنَ مِنَ الْإِقَامَةِ]]
ترجمہ: اور مستحب یہ ہے کہ نماز کے لیے مؤذن کے قول ’’قَدْ قَامَتِ الصَّلَاة‘‘ پر کھڑا ہوا جائے اور امام مالک نے بھی یہی کیا ، ابن المنذر نے کہا: اسی پر اہل حرمین کا تعامل ہے اور امام شافعی نے کہا: مؤذن کے اقامت سے فارغ ہونے کے بعد کھڑا ہوگا‘‘۔
مزید لکھتے ہیں :
[[arabic: وَانَّمَا قُلْنَا أَنَّهُ يَقُومُ عِنْدَ قَوْلِهِ : قَدْ قَامَتِ الصَّلَاةُ، لِأَنَّ هُذَا خَبَرٌ بِمَعْنَى الْأَمْرِ وَ مَقْصُودُهُ الْأَعْلامُ ، لِيَقُومُوا ، فَيُسْتَحَبُّ الْمُبَادَرَةُ إِلَى الْقِيَامِ امْتِثَالاً لِلْأَمْرِ، وَتَحْصِيلاً لِلْمَقْصُودِ، وَلَا يُكَبِّرُ حَتَّى فَرَغَ الْمُؤَذِّنُ ، لأَنَّ النَّبِيَّ إِنَّمَا كَانَ يُكَبِّرُ بَعْدَ فَرَانِهِ]]
ترجمہ : یہ جو ہم نے کہا: وہ ’’قَدْ قَامَتِ الصَّلاۃ‘‘ کہتے وقت کھڑا ہوگا، تو یہ اس لیے کہ یہ خبر حکم کے معنی میں ہے اور اس کا مقصد اعلام ( بتانا ) ہے تا کہ لوگ کھڑے ہوں ، تو امر کی تعمیل اور مقصد کے حصول کے لیے کھڑے ہونے میں جلدی کرنا مستحب ہے، اور امام اُس وقت تک تکبیر تحریمہ نہ کہے، جب تک مؤذن اقامت سے فارغ نہ ہو جائے ، اس لیے کہ نبی ﷺ بھی مؤذن کے فارغ ہونے کے بعد تکبیر کہا کرتے تھے۔
(المغنی، جلد 2 ، ص : 6 ، قاہرہ )
ڈاکٹر وھبہ الزحیلی لکھتے ہیں:
[[arabic: لَا يَقُوْمُ الْمُصَلُّونَ لِلصَّلَاةِ عِنْدَ الْإِقَامَةِ حَتَّى يَقُوْمَ الْإِمَامُ أَوْ يَقْبُلَ لِقَولِهِ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ وَإِذَا أُقِيمَتِ الصَّلَاةُ فَلَا تَقُوْمُوا حَتَّى تَرَوُنِي ، وَأَمَّا تَعْيِينُ وَقتِ قِيَامِ الْمُؤْتَمِينَ إلَى الصَّلَاةِ فَقَالَ الْمَالِكِيَّةُ : يَجُوزُ لِلْمُصَلِّي الْقِيَامُ حَالَ الْإِقَامَةِ أَوْ أَوَّلَهَا أَوْ بَعْدَهَا، فَلَا يُطْلَبُ لَهُ تَعْيِينُ حَالٍ ، بَل بِقَدْرِ الطَّاقَةِ لِلنَّاسِ، فَمِنْهُم الثَّقِيلُ وَالْخَفِيفُ، وَقَالَ الْحَنَفِيَّةُ: يَقُوْمُ عِنْدَ حَى عَلَى الْفَلَاحِ وَبَعْدَ قِيَامِ الْإِمَامِ، وَقَالَ الشَّافِعِيَّةُ: يُسْتَحَبُّ أَن يَقُوْمَ الْمُصَلِّي بَعدَ انْتِهَاءِ الْإِقَامَةِ إِذَا كَانَ الْإِمَامُ مَعَ الْمُصَلِّينَ فِي الْمَسْجِدِ، وَكَانَ يَقْدِرُ عَلَى الْقِيَامِ بِسُرْعَةِ، بِحَيْثُ يُدْرِكُ فَضِيلَةَ تَكْبِيرَةِ الْأَحْرَامِ، وَالأقَامَ قَبْلَ ذَلِكَ بِحَيْثُ يُدْرِكُهَا]]
ترجمہ: لوگ اقامت کے وقت نماز کے لیے نہ کھڑے ہوں ، یہاں تک کہ امام کھڑا ہو جائے یا آگے بڑھے، کیونکہ آپ ﷺ نے فرمایا: ” جب نماز کے لیے اقامت کہی جائے`
},
{
  pageNumber: 90,
  text: `تو جب تک تم (خود) مجھے دیکھ نہ لو مت کھڑے ہو‘‘ ۔ جہاں تک مقتدیوں کا جماعت کے لیے کھڑے ہونے کے وقت کی تعین کامعاملہ ہے تو مالکیہ نے کہا نمازی کے لیے اقامت کے دوران یا اس سے پہلے یا اس کے بعد تمام صورتوں میں کھڑا ہونا جائز ہے، کسی خاص مرحلے پر کھڑا ہونے کی تعیین کا مطالبہ نہ کیا جائے، بلکہ لوگ اپنے حسب حال کھڑے ہو سکتے ہیں، کیونکہ کوئی بھاری (جسامت والا) ہوتا ہے اور کوئی ہلکا ۔ احناف نے کہا: حَيَّ عَلَى الْفَلَاحِ پر اور امام کے کھڑے ہونے کے بعد کھڑے ہوں اور شافعیہ کا قول یہ ہے کہ جب امام نمازیوں کے ساتھ مسجد میں موجود ہو تو نمازی اقامت کے ختم ہونے پر کھڑے ہوں، نمازی فوری کھڑے ہونے پر قدرت رکھتا ہے، تو وہ تکبیر تحریمہ کی فضیلت کو پالے گا اور اگر ایسا نہیں ہے تو وہ پہلے سے کھڑا ہو جائے تا کہ اس فضیلت کو پالے،
( الفقه الاسلامي وأدلته ، ب جلد 1 ، ص : 719 ، دمشق )
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: إِذَا دَخَلَ الرَّجُلُ عِنْدَ الْإِقَامَةِ يُكْرَهُ لَهُ الْانْتِظَارُ قَائِمًا وَلِكِنْ يَقْعُدُ ، ثُمَّ يَقُوْمُ إِذَا بَلَغَ الْمُؤذِّنُ قَوْلَهُ حَيَّ عَلَى الْفَلَاحِ كَذَا فِي المُضْمَرَاتِ]]
ترجمہ: جب کوئی شخص اقامت کے وقت مسجد میں داخل ہو، تو اُسے کھڑے ہو کر انتظار کرنا مکروہ ہے، بلکہ بیٹھ جائے ، جب مؤذن ’’حَيَّ عَلَى الْفَلَاحِ‘‘ پر پہنچے ، تو کھڑا ہو، جیسا کہ مضمرات میں ہے، ( فتاوی عالمگیری، جلد 1، ص:57)۔
صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں :
آج کل اکثر جگہ رواج پڑ گیا ہے کہ وقت اقامت سب لوگ کھڑے رہتے ہیں بلکہ اکثر جگہ تو یہاں تک ہے کہ جب تک امام مصلے پر کھڑا نہ ہو، اُس وقت تک تکبیر نہیں کہی جاتی، یہ خلاف سنت ہے، (بہار شریعت ، جلد اول، ص: 471)۔
امام احمد رضا قادری قُدِّسَ سِرُّهُ الْعَزِیز سے سوال کیا گیا : ” زید دعوی کرتا ہے کہ جب تک سب مقتدی کھڑے نہ ہو لیں اور صف سیدھی نہ ہو اور امام اپنی جانماز پر کھڑا نہ ہو، تب تک`
},
{
  pageNumber: 91,
  text: `اقامت نہ کہی جائے۔ اور عمر و دعوی کرتا ہے کہ مقتدی اور امام کو پہلے ہی سے کھڑا ہوتا ضروری نہیں بلکہ جب اقامت کہتے ہوئے مؤذن حَيَّ عَلَی الْفَلَاحِ تک پہنچ جائے ، اس وقت امام و مقتدی کھڑے ہو جائیں اور جس وقت قَدْ قَامَتِ الصَّلَاةُ“ کہے، تب امام تکبیر کہے ، اب ان دونوں میں کون حق پر ہے؟ ۔ آپ نے جواب میں لکھا: ” عمر وحق پر ہے، کھڑے ہو کر تکبیر سننا مکروہ ہے، یہاں تک کہ علماء حکم فرماتے ہیں کہ جو شخص مسجد میں آیا اور تکبیر ہو رہی ہے، وہ اس کے تمام تک کھڑا نہ رہے، بلکہ بیٹھ جائے ، یہاں تک کہ مکبر حی علی الفلاح تک پہنچے ، اس وقت کھڑا ہو ، وقایہ میں ہے: [[arabic: يَقُوْمُ الْإِمَامُ وَالْقَوْمُ عِنْدَ حَيَّ عَلَى الصَّلَاةُ وَيَشْرَعُ عِنْدَ قَدْ قَامَتِ الصَّلَاةُ]] - ترجمہ: امام اور نمازی "حَيَّ عَلَى الصَّلَاةِ“ پر کھڑے ہوں اور قَدْ قَامَتِ الصَّلاةُ‘ کے الفاظ پر امام نماز شروع کر دے۔
محیط و ” ہندیہ میں ہے:
[[arabic: يَقُومُ الْإِمَامُ وَالْقَوْمُ إِذَا قَالَ الْمُؤَذِّنُ : حَى عَلَى الْفَلَاحِ عِنْدَ عُلَمَائِنَا الثَّلَثَةِ، هُوَ الصَّحِيحُ]]
ترجمہ : ہمارے تینوں ائمہ کے نزدیک جب اقامت کہنے والا حَى عَلَی الْفَلَاحِ “ کہے، تو اُس وقت امام اور تمام نمازی کھڑے ہوں اور یہی صحیح ہے۔
جامع المضمرات و عالمگیری و الدر المحتار میں ہے:
[[arabic: إِذَا دَخَلَ الرَّجُلُ عِنْدَ الْإِقَامَةِ يُكْرَهُ لَهُ الْانْتِظَارُ قَائِمًا وَلِكِنْ يَقْعُدُ ثُمَّ يَقُوْمُ إِذَا بَلَغَ الْمُؤَذِّنُ قَوْلَهُ حَيَّ عَلَى الْفَلَاحِ]] “ ترجمہ : ” جب کوئی نمازی تکبیر کے وقت آئے تو وہ بیٹھ جائے کیونکہ کھڑے ہو کر انتظار کرنا مکروہ ہے پھر جب مؤذن حَيَّ عَلَی الْفَلَاح  کہے تو اس وقت کھڑا ہو۔
اسی طرح بہت کتب میں ہے:
[[arabic: أقُولُ : وَلَا تَعَارُضَ عِنْدِي بَيْنَ قَوْلِ الْوِقَايَةِ وَأَتْبَاعِهَا يَقُوْمُوْنَ عِنْدَ حَى عَلَى الصَّلَاةِ وَالْمُحِيطِ وَالْمُضْمَرَاتِ وَمَنْ مَّعَهُمَا عِنْدَ حَى عَلَى الْفَلَاحِ فَإِنَّا إِذَا حَمَلْنَا]]`
},
{
  pageNumber: 92,
  text: `[[arabic: الأول عَلَى الانْتِهَاءِ وَالْأَخَرَ عَلَى الابْتَدَاءِ اتَّحَدَ الْقَوْلَانِ ، أَى يَقُومُونَ حِينَ يَتِمُّ الْمُؤَذِّنُ حَيَّ عَلَى الصَّلَاةِ وَيَأْتِي عَلَى الْفَلَاحِ وَهُذَا مَا يُعْطِيْهِ قَوْلُ الْمُضْمَرَاتِ يَقُوْمُ إِذَا بَلَغَ الْمُوَقِّنُ حَيَّ عَلَى الْفَلَاحِ وَلَعَلَّ هُذَا أَوْلَى مِمَّانِي مَجْمَعُ الْأَنْهُرُ مِنْ قَوْلِهِ وَفِي الْوَقَايَةِ وَيَقُوْمُ الْإِمَامُ وَالْقَوْمُ عِنْدَ حَيَّ عَلَى الصَّلَاةِ أَيْ قُبَيْلَهُ]]
ترجمہ: میں کہتا ہوں : صاحب وقایہ اور اُن کے متبعین کے اس قول کہ مقتدی مؤذن کے ’’حَيَّ عَلَى الصَّلَاةِ‘‘ کہنے پر کھڑے ہوں اور صاحب محیط و مضمرات اور ان کی جماعت کے اس قول کہ مقتدی مؤذن کے ’’حَى عَلَى الفلاح‘‘ کہنے پر کھڑے ہوں ، میں میرے نزدیک کوئی تعارض نہیں ہے، اس لیے کہ جب ہم پہلے قول کو انتہا اور دوسرے کو ابتدا پر محمول کریں تو دونوں قولوں میں اتحاد حاصل ہو جاتا ہے یعنی جب مؤذن ’’حَيَّ عَلَی الصَّلاة‘‘ پورا کر کے ”حَ عَلَی الْفَلَاح‘‘ کہے ، تو کھڑے ہوں اور اس کی تائید ” مضمرات کے ان الفاظ سے ہوتی ہے : اس وقت کھڑا ہو، جب مؤذن ’’حَى عَلَی الْفَلَاح‘‘ پر پہنچے اور یہ اس سے بہتر ہے ، جو مَجَمَعُ الأَنْهُرُ میں ان کا قول ہے : ” وقایہ میں ہے : امام اور نمازی ”حَ عَلَی الصَّلاةَ“ کے وقت یعنی اس سے تھوڑا سا پہلے کھڑے ہوں۔
یہ اس صورت میں ہے کہ امام بھی تکبیر کے وقت مسجد میں ہو، اور اگر وہ حاضر نہیں ہے، مؤذن جب تک اُسے آتا نہ دیکھے تکبیر نہ کہے، نہ اُس وقت تک کوئی کھڑا ہو لقولہ : [[arabic: لَا تَقُومُوا حَتَّى تَرَوْنِي]] ( کیونکہ نبی اکرم ﷺ کا ارشاد گرامی ہے : تم نہ کھڑے ہوا کرو، یہاں تک کہ مجھے دیکھ لو)، پھر جب امام آئے اور تکبیر شروع ہو، اس وقت دو صورتیں ہیں: (۱) اگر امام صفوں کی طرف سے داخل مسجد ہو تو جس صف سے گزرتا جائے ، وہی صف کھڑی ہوتی جائے ، (۲) اور اگر سامنے سے آئے تو اُسے دیکھتے ہی سب کھڑے ہو جائیں اور اگر خود امام ہی تکبیر کہے تو جب تک پوری تکبیر سے فارغ نہ ہولے مقتدی اصلاً کھڑے نہ ہوں ، بلکہ اگر اس نے تکبیر مسجد سے باہر کہی تو فراغ پر بھی کھڑے نہ ہوں جب وہ مسجد میں قدم رکھے اس وقت قیام کریں ، ہندیہ میں اس عبارت کے بعد مذکور ہے:`
},
{
  pageNumber: 93,
  text: `[[arabic: فَأَمَّا إِذَا كَانَ الْإِمَامُ خَارِجَ الْمَسْجِدِ، فَإِنْ دَخَلَ الْمَسْجِدَ مِنْ قِبَلِ الصُّفُوفِ فَكُلَّمَا جَاوَزَ صَفًا، قَامَ ذَلِكَ الصَّفُ وَإِلَيْهِ مَالَ شَمْسُ الْأَئِمَّةِ الْحُلْوَانِ وَالسَّهَاخُسِقُ وَشَيْخُ الْإِسْلَامِ خَوَاهَرْ زَادَه، وَإِنْ كَانَ الْإِمَامُ دَخَلَ الْمَسْجِدَ مِنْ قُدَّامِهِم يَقُوْمُونَ كَمَا رَأَوا الْإِمَامَ وَإِنْ كَانَ الْمُؤَذِّنُ وَالْإِمَامُ وَاحِدًا ، فَإِنْ أَقَامَ فِي الْمَسْجِدِ فَالْقَوْمُ لَا يَقُوْمُونَ مَا لَمْ يَفْرَغْ عَنِ الْإِقَامَةِ ، وَإِنْ أَقَامَ خَارِجَ الْمَسْجِدِ فَمَشَايِخُنَا اتَّفَقُوا عَلَى أَنَّهُمْ لَا يَقُومُونَ مَا لَمْ يَدْخُلِ الْإِمَامُ الْمَسْجِدَ وَيُكَبِّرُ الْإِمَامُ قُبَيْلَ قَولِهِ قَدْ قَامَتِ الصَّلَاةُ ، قَالَ الشَّيْخُ الإِمَامِ شَمسُ الْآئِيَّةِ الْحُلَوَانِ وَهُوَ الصَّحِيحُ هُكَذَا فِي الْمُحِيطِ]]
ترجمہ: پس جب امام مسجد سے باہر ہو، سو اگر وہ صفوں کی جانب سے مسجد میں میں داخل ہو، تو جس صف سے وہ گزرے، وہ صف کھڑی ہو جائے ، شمس الائمہ حلوانی، امام سرخسی اور شیخ الاسلام خواهر زادہ اسی طرف گئے ہیں اور اگر امام اُن کے سامنے سے مسجد میں داخل ہو، تو اسے دیکھتے ہی تمام مقتدی کھڑے ہو جائیں ، اگر مؤذن اور امام ایک ہی ہے، پس اگر اُس نے مسجد کے اندر ہی تکبیر کہی تو قوم اس وقت تک کھڑی نہ ہو ، جب تک وہ تکبیر سے فارغ نہ ہو جائے اور اگر اس نے خارج از مسجد تکبیر کہی ، تو ہمارے تمام مشائخ اس پر متفق ہیں کہ لوگ اس وقت تک کھڑے نہ ہوں، جب تک امام مسجد میں داخل نہ ہو اور امام ’’قَدْ قَامَتِ الصَّلَاةُ" سے تھوڑا پہلے تکبیر تحریمہ کہے، امام شمس الائمہ حلوانی کہتے ہیں کہ یہی صحیح ہے، محیط میں اسی طرح ہے، ( فتاوی رضویہ، جلد 5 ، ص: 379 تا 382)۔
ایک اور سوال ہوا: ” تکبیر کے شروع ہونے کے وقت امام و مقتدی کو کھڑا رہنا چاہیے یا بیٹھ جانا چاہیے اور بیٹھ جانے میں کیا فضیلت ہے اور کھڑا رہنے میں کیا نقصان ہے؟“۔
الجواب : امام کے لیے اس میں کوئی خاص حکم نہیں ، مقتدیوں کو حکم ہے کہ تکبیر بیٹھ کر سنیں، ’’حَى عَلَى الْفَلَاحِ‘‘ پر کھڑے ہوں، کھڑے کھڑے تکبیر سننا مکروہ ہے، یہاں تک کہ عالمگیری میں فرمایا: اگر کوئی شخص ایسے وقت میں مسجد میں آئے کہ تکبیر ہورہی ہو، فوراً بیٹھ جائے اور حَى عَلَی الْفَلَاحِ پر کھڑا ہو اور اس میں راز مکبر کے اس قول ’’قَدْ قَامَتِ الصَّلَاةُ“ کی مطابقت ہے کہ ادھر اُس نے ”حَ عَلَی الْفَلَامِ“ کہا : آؤ مراد پانے کو،`
},
{
  pageNumber: 94,
  text: `اُدھر جماعت کھڑی ہوئی ، اُس نے کہا: ” قَدْ قَامَتِ الصَّلَاةُ ، جماعت قائم ہوگئی ، والله تعالیٰ اعلم ، (فتاوی رضویہ، جلد 5 ، ص: 421)۔
الغرض جب جماعت کے لیے اقامت کہی جارہی ہو تو مقتدی اس وقت کھڑے ہوں، جب مؤذن ’’حَى عَلَی الْفَلَاح‘‘ کہے، یہ مستحب ہے اور آداب اقامت وصلوٰۃ میں سے ہے۔ شروع ہی سے کھڑے ہو کر اقامت سننے کو ہمارے اکابر فقہائے کرام نے مکروہ کہا ہے اور اس سے مراد مکروہ تنزیہی ہے۔ فقہ حنفی میں یہ مسئلہ مختلف فیہ نہیں ہے، نہ یہ دیو بندی بریلوی خلافیات کا مسئلہ ہے، لہذا اسے مساجد میں فساد کا ذریعہ نہ بنایا جائے ۔ اگر اکثریت کھڑی ہو گئی ہے تو ایک یا چند آدمیوں کے بیٹھے رہنے سے صفوں میں خلل واقع ہوگا اور جہاں اکثریت بیٹھی رہتی ہے، وہاں ایک یا چند آدمیوں کو اپنا نفر داور پارسائی ظاہر کرنے کے لیے کھڑا نہیں ہونا چاہیے ، یہ خالص فقہی مسئلہ ہے اور اس میں انا پرستی کو دخل نہیں ہونا چاہیے۔ آپ پریشان نہ ہوں ، آپ کی گزشتہ نمازیں صحیح ادا ہو گئیں اور امام کا موقف بھی درست ہے۔ مستحبات اور اولیٰ و افضل کاموں پر عمل کرنا باعث اجر ہے لیکن اُن کے ترک پر کوئی مواخذہ نہیں ہے۔ جہاں تک اقامت کے وقت حرمین طیبین کے معمولات کا تعلق ہے، اُن کا تعلق فقہ حنبلی سے ہے اور فقہ حنبلی میں جو کتاب ماخذ کا درجہ رکھتی ہے، وہ المغنی لابن قدامہ ہے اور اس کا حوالہ آچکا ہے کہ جب مؤذن قَدْ قَامَتِ الصَّلاة کہے ، تو مقتدی اس وقت کھڑے ہوں اور ائمہ اربعہ میں سے فقط امام مالک کا قول یہ ہے کہ مقتدیوں کا اقامت کے شروع میں کھڑا ہونا مستحب ہے ممکن ہے وہ اس مسئلے میں امام مالک کے قول پر عمل کرتے ہوں۔ اقوال ائمہ چار ہیں:
(۱) مقتدی اقامت کے شروع میں کھڑے ہوں (امام مالک) (۲) قَدْ قَامَتِ الصَّلَاةُ کے کلمے پر کھڑے ہوں (امام احمد بن حنبل ) (۳) اقامت کے ختم پر کھڑے ہوں (امام شافعی) (۴) ”حَى عَلَى الفلاح پر کھڑے ہوں (امام اعظم ابوحنیفہ ) ۔ ان میں سے کسی بھی قول پر عمل کرنے سے نماز کی صحت پر کوئی اثر نہیں پڑتا ، اختلافات افضلیت میں ہے اور احناف کے نزدیک ’’حَیَّ عَلَی الصَّلاةِ“ پر کھڑا ہونا افضل ہے اور شروع میں کھڑا ہونا مکروہ تنزیہی ہے۔
یہاں تک لکھا جا چکا تھا کہ ایک صاحب نے فتاویٰ نوریہ کے حوالے سے فقیہ العصر علامہ نور اللہ بصیر پوری رحمۃ اللہ علیہ کے مندرجہ ذیل فتوے کی طرف متوجہ کیا، آپ سے سوال ہوا: ایسا نمازی جو اقامت نماز کے دوران مسجد میں آیا جب کہ امام بھی آچکا ہو تو کیا اس کا بیٹھ جانا ضروری ہے کہ حی علی الفلاح پر کھڑا ہو، کیونکہ اس وقت قیام مستحب ہے جو قعود پر موقوف ہے، حالانکہ مستحب کا موقوف علیہ بھی مستحب ہوتا ہے، (استفتی: محمد اجمل نوری عفی عنہ )۔ آپ نے جواب میں لکھا:
حضور پر نور سید عالم ﷺ نے حکم دیا ہے کہ جب کوئی تمہارا مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت نماز ادا کرے اور یوں بھی آیا کہ دو رکعتوں کے پڑھنے تک نہ بیٹھے (متفق علیہ ) ۔ اس حکم کی بنا پر ہمارے ائمہ کرام اور جمہور کے نزدیک نماز تحیۃ المسجد مستحب مؤکد ہے، بلکہ ہمارے مشائخ کرام نے یہ تصریح بھی فرمائی کہ سنت ہے جو کسی بھی سنت یا فرض نماز سے بھی ادا ہو جاتی ہے، جس سے پہلے بیٹھنا تاکیدی مستحب بلکہ سنت کا خلاف اور غیر اولی ہے، لہذا ایسا داخل ہونے والا جس کے متعلق سوال ہے ، اداء نماز سے قبل نہ بیٹھے اور چونکہ امام حاضر ہے ، لہذا حدیث لا تَقُومُوا حَتَّى تَرَوْنِی کا تقاضا بھی نہیں کہ قیام نہ کرے۔ رہا سائل کا استدلال کہ ہمارے نزدیک حی علی الفلاح پر قیام مستحب ہے جو قعود پر موقوف ہے، لہذا قعود بھی مستحب ہوا، تو یہ محض باطل ہے، کیونکہ یہ قیام مستحب تو مقدمہ ہے اسی قیام کا جو بحکم قُومُوا لِلَّهِ قَانِتِین نماز فرض میں فرض ہے، حالانکہ منفرد یا امام و مقتدی پر فرض نماز سے قبل قعود قطعا فرض نہیں بلکہ منفرد کے لیے تو کسی نے مستحب تک بھی نہیں کہا تو معلوم ہوا کہ قیام قعود پر موقوف نہیں ورنہ قعود بھی قیام کی طرح فرض ہوتا ، وَلَمْ يَقُلْ بِهِ أَحَدٌ اور یہیں سے واضح ہوا کہ مضمرات شرح قدوری میں مولانا صوفی یوسف بن عمر کا دوری کا ایسے داخل مسجد`
},
{
  pageNumber: 95,
  text: `کے لیے قعود کا حکم دینا اور قیام مکروہ بتانا بے دلیل ہے اور صحیح نہیں، اس میں حضور پر نور روحی فداء محمد مصطفی ﷺ کے حکم مذکور کی صریح خلاف ورزی ہے جو ہمارے کسی بھی امام کا قول ہرگز ہرگز نہیں ہو سکتا، لہذا مقبول نہیں اور ہندیہ اور دُرّ وغیرہ کا مضمرات سے نقل کرنا بھی صحیح نہیں بنا سکتا کہ غیر صحیح نقل کر دینے سے صحیح نہیں بن جاتا۔
تعجب ہے کہ امام کی موجودگی کی صورت میں تکبیر سے پہلے حاضرین کے لیے قیام عند الفلاح ہمارے ائمہ کرام کے نزدیک مستحب تو ہے مگر مستحب کا خلاف دلیل خاص کے بغیر مکروہ نہیں بن سکتا ، کما صرح به الشامی وغیرہ تو وقت پر آنے والے کے لیے کیوں مکروہ ہوا ؟ اس مبارک اور صحیح حدیث کو بکثرت ائمہ دین نے اپنی اپنی مبارک تصنیف میں باسانید معتبره متصله روایت فرمایا ہے ، چنانچہ موطا امام مالک ص ۱۴۶ ( طبع اصبح )، موطا امام محمد ص ۱۱۹ (یوسفی) مسند امام احمد ، ج ۵، ص: ۲۹۵ ، ۲۹۶، ۳۰۳ صحیح بخاری ص: ۶۳ باسنادین صحیح مسلم ج ا ص ۲۴۸  سنن ابی داؤد ص ۶۷ (مجیدی) باسنادین ترمذی ج اص ۷۳ (اصح)، ابن ماجه ص: ۷۲ (اصح ) ، شرح السنہ ج: ۲، ص: ۳۶۵ وغیر ہا میں بکلمات متقاربہ ہے: [[arabic: وَالنَّظْمُ مِنَ الْبُخَارِيِّ وَغَيْرِهِ عَنْ أَبِي قَتَادَةَ السُّلَّمِي أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكُمْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ]] ، مصنف عبدالرزاق، ج: ص: ۴۲۸، بخاری ، ج : اص: ۱۵۶، مسلم، ج:۱ ص: ۲۴۸، میں بایں کلمات متقاربہ بھی ہے : [[arabic: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلَا يَجْلِسُ حَتَّى يُصَلِّي رَكْعَتَيْنِ]]، اور ابن ماجہ ص: ۷۲ میں حضرت ابی ہریرہ رضی اللہ عنہ کی حدیث مرفوع میں بھی یہی کلمات مبارکہ ہیں، [[arabic: وَاللّٰهُ وَرَسُولُهُ أَعْلَمُ جَلَّ جَلَالُ رَبِّي وَحْدَةً وَصَلَّى اللَّهُ عَلَى حَبِيبِهِ الَّذِي لَا نَبِي بَعْدَهُ]]
چنانچہ اس سلسلے میں درج ذیل گزارش ہے :
حضرت مفتی نور اللہ بصیر پوری رحمۃ اللہ علیہ کے فتوے کو پڑھنے کے بعد آپ پر آشکار ہوگا انہوں نے چند سوالات اٹھائے ہیں: (۱) اگر بیٹھ کر اقامت سننا اور حی علی الصلوة پر کھڑے`
},
{
  pageNumber: 96,
  text: `ہونا مستحب ہے، تو منوعات میں مستحب کا مقابل” خلاف اولیٰ ہے۔ انہوں نے لکھا: سب سے پہلے جامع المضمرات والمشكلات“ کے مصنف امام یوسف بن عمر بن یوسف الکادوری نے یہ مسئلہ لکھا ہے اور اس کے بعد سب نے اُس کی پیروی کی اور نقل کرتے چلے گئے ، اس کی علت پر توجہ نہیں دی۔ علامہ نور اللہ بصیر پوری کے بقول اُن سے سہو ہوا اور باقی نے آنکھیں بند کر کے اُن کا اتباع کیا، لہذا کھڑے ہو کر اقامت سنے کو مکر وہ کہنا درست نہیں ہے، زیادہ سے زیادہ خلاف اولیٰ کہہ سکتے ہیں۔
چنانچہ علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: الْحَاصِلُ أَنَّ السُّنَّةَ إِنْ كَانَتْ مُؤَكَّدَةً قَوِيَّةٌ لَا يَبْعُدُ كَوْنُ تَرْكِهَا مَكْرُوهَا تَحْرِيمًا ، وَإِنْ كَانَتْ غَيْرَ مُؤَكَدَةٍ فَتَرْكُهَا مَكْرُوا تَنْزِيهَا وَأَمَّا الْمُسْتَحَبُّ أَوِ الْمَنْدُوبُ فَيَنْبَغِي أَنْ يُكْرَة تركه أَصْلًا، لِقَوْلِهِمْ يُسْتَحَبُّ يَوْمَ الْأَضْحَى أَنْ لَا يَأْكُلَ أَوَّلًا إِلَّا مِنْ أُضْحِيَّتِهِ، وَلَوْ أَكَلَ مِنْ غَيْرِهَا لَمْ يُكْرَهُ ، فَلَمْ يَلْزَمُ مِنْ تَرْكِ الْمُسْتَحَبِّ ثُبُوْتُ الْكَرَاهَةِ إِلَّا أَنَّهُ يُشْكِلُ عَلَيْهِ قَوْلُهُمُ الْمَكْرُوهُ تَنْزِيْهَا مَرْجِعُهُ إِلَى خِلَافِ الْأَولَى ، وَلَا شَكَ أَنَّ تَرْكَ الْمُسْتَحَبِّ خِلَافُ الأولى]]
ترجمہ : ” حاصل یہ ہے کہ سنت اگر قوت کے ساتھ مؤکدہ ہو، تو بعید نہیں کہ اس کا ترک مکروہ تحریمی ہو اور اگر غیر مؤکدہ ہے تو اس کا ترک مکروہ تنزیہی ہو اور رہا مستحب یا مندوب تو چاہیے کہ اس کا ترک اصلا مکروہ ہو، کیونکہ فقہائے کرام نے فرمایا: یوم الاضحیٰ کو مستحب یہ ہے کہ نماز عید سے پہلے نہ کھائے اور قربانی کے گوشت سے کھائے اور اگر قربانی کے گوشت کے علاوہ کوئی اور چیز کھائی تو مکروہ نہیں ہے، سو ترک مستحب سے کراہت کا ثابت ہونا لازم نہیں آتا ، سوائے اس کے کہ اس پر فقہائے کرام کے اس قول پر اشکال ہوتا ہے کہ مکروہ تنزیہی کا مرجع (یعنی مال ) ” خلاف اولیٰ ہے اور اس میں کوئی شک نہیں کہ مستحب کا ترک کرنا خلاف اولیٰ ہے، (رد المحتار علی الدر المختار، ج:2 ، ص: 367)۔ اس عبارت کا مستفاد یہ ہے کہ اصولی اعتبار سے تو ترک مستحب کو خلاف اولیٰ کہنا چاہیے لیکن چونکہ مکروہ تنزیہی کا`
},

{
  pageNumber: 97,
  text: `کے لیے قعود کا حکم دینا اور قیام مکروہ بتانا بے دلیل ہے اور صحیح نہیں، اس میں حضور پر نور روحی فداء محمد مصطفی ﷺ کے حکم مذکور کی صریح خلاف ورزی ہے جو ہمارے کسی بھی امام کا قول ہرگز ہرگز نہیں ہو سکتا، لہذا مقبول نہیں اور ہندیہ اور دُرّ وغیرہ کا مضمرات سے نقل کرنا بھی صحیح نہیں بنا سکتا کہ غیر صحیح نقل کر دینے سے صحیح نہیں بن جاتا۔
تعجب ہے کہ امام کی موجودگی کی صورت میں تکبیر سے پہلے حاضرین کے لیے قیام عند الفلاح ہمارے ائمہ کرام کے نزدیک مستحب تو ہے مگر مستحب کا خلاف دلیل خاص کے بغیر مکروہ نہیں بن سکتا ، کما صرح به الشامی وغیرہ تو وقت پر آنے والے کے لیے کیوں مکروہ ہوا ؟ اس مبارک اور صحیح حدیث کو بکثرت ائمہ دین نے اپنی اپنی مبارک تصنیف میں باسانید معتبره متصله روایت فرمایا ہے ، چنانچہ موطا امام مالک ص ۱۴۶ ( طبع اصبح )، موطا امام محمد ص ۱۱۹ (یوسفی) مسند امام احمد ، ج ۵، ص: ۲۹۵ ، ۲۹۶، ۳۰۳ صحیح بخاری ص: ۶۳ باسنادین صحیح مسلم ج ا ص ۲۴۸  سنن ابی داؤد ص ۶۷ (مجیدی) باسنادین ترمذی ج اص ۷۳ (اصح)، ابن ماجه ص: ۷۲ (اصح ) ، شرح السنہ ج: ۲، ص: ۳۶۵ وغیر ہا میں بکلمات متقاربہ ہے: [[arabic: وَالنَّظْمُ مِنَ الْبُخَارِيِّ وَغَيْرِهِ عَنْ أَبِي قَتَادَةَ السُّلَّمِي أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكُمْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ]] ، مصنف عبدالرزاق، ج: ص: ۴۲۸، بخاری ، ج : اص: ۱۵۶، مسلم، ج:۱ ص: ۲۴۸، میں بایں کلمات متقاربہ بھی ہے : [[arabic: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلَا يَجْلِسُ حَتَّى يُصَلِّي رَكْعَتَيْنِ]]، اور ابن ماجہ ص: ۷۲ میں حضرت ابی ہریرہ رضی اللہ عنہ کی حدیث مرفوع میں بھی یہی کلمات مبارکہ ہیں، [[arabic: وَاللّٰهُ وَرَسُولُهُ أَعْلَمُ جَلَّ جَلَالُ رَبِّي وَحْدَةً وَصَلَّى اللَّهُ عَلَى حَبِيبِهِ الَّذِي لَا نَبِي بَعْدَهُ]]
چنانچہ اس سلسلے میں درج ذیل گزارش ہے :
(فتاویٰ نوریه ، ج1 ، ص: 302-304)
حضرت مفتی نور اللہ بصیر پوری رحمۃ اللہ علیہ کے فتوے کو پڑھنے کے بعد آپ پر آشکار ہوگا انہوں نے چند سوالات اٹھائے ہیں: (۱) اگر بیٹھ کر اقامت سننا اور حی علی الصلوة پر کھڑے`
},
{
  pageNumber: 98,
  text: `ہونا مستحب ہے، تو منوعات میں مستحب کا مقابل” خلاف اولیٰ ہے۔ انہوں نے لکھا: سب سے پہلے جامع المضمرات والمشكلات“ کے مصنف امام یوسف بن عمر بن یوسف الکادوری نے یہ مسئلہ لکھا ہے اور اس کے بعد سب نے اُس کی پیروی کی اور نقل کرتے چلے گئے ، اس کی علت پر توجہ نہیں دی۔ علامہ نور اللہ بصیر پوری کے بقول اُن سے سہو ہوا اور باقی نے آنکھیں بند کر کے اُن کا اتباع کیا، لہذا کھڑے ہو کر اقامت سنے کو مکر وہ کہنا درست نہیں ہے، زیادہ سے زیادہ خلاف اولیٰ کہہ سکتے ہیں۔
چنانچہ علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: الْحَاصِلُ أَنَّ السُّنَّةَ إِنْ كَانَتْ مُؤَكَّدَةً قَوِيَّةٌ لَا يَبْعُدُ كَوْنُ تَرْكِهَا مَكْرُوهَا تَحْرِيمًا ، وَإِنْ كَانَتْ غَيْرَ مُؤَكَدَةٍ فَتَرْكُهَا مَكْرُوا تَنْزِيهَا وَأَمَّا الْمُسْتَحَبُّ أَوِ الْمَنْدُوبُ فَيَنْبَغِي أَنْ يُكْرَة تركه أَصْلًا، لِقَوْلِهِمْ يُسْتَحَبُّ يَوْمَ الْأَضْحَى أَنْ لَا يَأْكُلَ أَوَّلًا إِلَّا مِنْ أُضْحِيَّتِهِ، وَلَوْ أَكَلَ مِنْ غَيْرِهَا لَمْ يُكْرَهُ ، فَلَمْ يَلْزَمُ مِنْ تَرْكِ الْمُسْتَحَبِّ ثُبُوْتُ الْكَرَاهَةِ إِلَّا أَنَّهُ يُشْكِلُ عَلَيْهِ قَوْلُهُمُ الْمَكْرُوهُ تَنْزِيْهَا مَرْجِعُهُ إِلَى خِلَافِ الْأَولَى ، وَلَا شَكَ أَنَّ تَرْكَ الْمُسْتَحَبِّ خِلَافُ الأولى]]
ترجمہ : ” حاصل یہ ہے کہ سنت اگر قوت کے ساتھ مؤکدہ ہو، تو بعید نہیں کہ اس کا ترک مکروہ تحریمی ہو اور اگر غیر مؤکدہ ہے تو اس کا ترک مکروہ تنزیہی ہو اور رہا مستحب یا مندوب تو چاہیے کہ اس کا ترک اصلا مکروہ ہو، کیونکہ فقہائے کرام نے فرمایا: یوم الاضحیٰ کو مستحب یہ ہے کہ نماز عید سے پہلے نہ کھائے اور قربانی کے گوشت سے کھائے اور اگر قربانی کے گوشت کے علاوہ کوئی اور چیز کھائی تو مکروہ نہیں ہے، سو ترک مستحب سے کراہت کا ثابت ہونا لازم نہیں آتا ، سوائے اس کے کہ اس پر فقہائے کرام کے اس قول پر اشکال ہوتا ہے کہ مکروہ تنزیہی کا مرجع (یعنی مال ) ” خلاف اولیٰ ہے اور اس میں کوئی شک نہیں کہ مستحب کا ترک کرنا خلاف اولیٰ ہے، (رد المحتار علی الدر المختار، ج:2 ، ص: 367)۔ اس عبارت کا مستفاد یہ ہے کہ اصولی اعتبار سے تو ترک مستحب کو خلاف اولیٰ کہنا چاہیے لیکن چونکہ مکروہ تنزیہی کا`
},
{
  pageNumber: 99,
  text: `مآل بھی خلاف اولیٰ ہے، لہذا ترک مستحب کو بھی مکروہ تنزیہی کہہ سکتے ہیں، یعنی دلیل خاص کے بغیر بھی مکروہ تنزیہی کا اطلاق کیا جا سکتا ہے۔
علامہ علاء الدین حصکفی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: فَالْوُضُوءُ لِمُطْلَقِ الذِّكْرِ مَنْدُوبٌ وَتَرْكُهُ خِلَافُ الْأَوْلَى، وَهُوَ مَرْجِعُ كَرَاهَةِ التَّنْزِيهِ]]
ترجمہ: مطلق ذکر کے لیے وضو مستحب ہے اور اس کا ترک خلاف اولیٰ ہے اور یہی کراہت تنزیہی کا مآل ہے ، اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: (قَوْلُهُ : وَهُوَ مَرْجِعُ كَرَاهَةِ التَّنْزِيهِ ) أَيْ فَلِذَا قَيَّدَ بِقَوْلِهِ أَيْ تَحْرِيبًا، وَقَصَدَ بِذلِكَ الرَّدَّ عَلَى قَوْلِ الْبَحْرِ ، وَتَرْكُ الْمُسْتَحَبِّ لَا يُوجِبُ كَرَاهَةٌ]]
ترجمہ: علامہ علاء الدین رحمۃ اللہ علیہ کا یہ قول : ” خلاف اولیٰ کا مرجع کراہت تنزیہی ہے ، یعنی اسی لیے علامہ حصکفی نے حالت جنابت و نفاس میں دعا پڑھنے کے بارے میں کہا کہ یہ مکروہ تحریمی نہیں ہے ، تحریما کی قید سے علامہ حصکفی نے علامہ ابن نجیم کے اس قول کا رد کیا ہے کہ ترک مستحب سے کراہت تحریمی لازم نہیں آتی ، (رد المحتار علی الدر المختار ، ج:1 ، ص: 174)۔ اس کا مطلب یہ ہے کہ بعض صورتوں میں ترک مستحب پر کراہت تنزیہی کا اطلاق کیا جا سکتا ہے۔
علامہ علاء الدین حصکفی رحمۃ اللہ علیہ نے مکروہات صلوٰۃ بیان کرتے ہوئے لکھا:
[[arabic: وَتَرْكُ كُلِّ سُنَّةِ وَ مُسْتَحَب]] ، ترجمہ: ہر سنت اور مستحب کا ترک مکروہ ہے، (الدر المختار، ج:1 ، ص: 653) ۔ ظاہر ہے کہ اس سے مراد مکروہ تنزیہی ہے ، پس معلوم ہوا کہ ترک مستحب پر بھی فقہائے کرام بعض اوقات مکروہ تنزیہی کا اطلاق کر دیتے ہیں۔
علامہ ابن نجیم رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: ثَانِيهِمَا الْمَكْرُوهُ تَنْزِيهَا وَمَرْجِعُهُ إِلَى مَا تَرْكُهُ أَوْلَى وَكَثِيرًا مَا يُطْلِقُونَهُ كَمَا ذَكَرَهُ الْعَلَّامَةُ الْحَلَبِيُّ فِي مَسْأَلَةِ مَسْحِ الْعَرَقِ فَحِينَينِ إِذَا ذَكَرُوا مَكْرُوهَا فَلَا بُدَّ مِنَ النَّظَرِ فِي دَلِيْلِهِ فَإِنْ كَانَ نَهْيَا طَيِّيَا يُحْكَمُ بِكَرَاهَةِ التَّحْرِيمِ إِلَّا لِصَارِ فِي لِلنَّهْي عَنِ التَّحْرِيمِ إِلَى النَّدْبِ فَإِنْ لَمْ يَكُنِ الدَّلِيلُ نَهْيَا بَلْ كَانَ مُفِيدَ اللتَّرْكِ الْغَيْرِ الْجَازِ مِ فَهِيَ تَنْزِيهِيَّة]]
ترجمہ : ان میں سے دوسرا مکروہ تنزیہی ہے اور اس کا مآل ترک اولی ہے اور فقہائے کرام ترک اولی پر اکثر مکروہ تنزیہی کا اطلاق کرتے ہیں، جیسا کہ علامہ حلبی نے پسینہ پونچھنے کے مسئلے پر اس کا اطلاق کیا ہے، پس نتیجہ یہ نکلا کہ جب فقہائے کرام کسی بات کو مکروہ بیان کریں، تو اس کی دلیل پر غور کرنا ضروری ہے، سو اگر دلیل نہی ظنی ہے تو کراہت تحریمی کا اطلاق کیا جائے گا، ورنہ نہی کو تحریم سے (ترک) مستحب پر محمول کیا جائے گا، پس اگر دلیل نہی نہ ہو بلکہ تاکید کے ساتھ ترک کا حکم نہ ہو تو وہ تنزیہی ہے، (البحر الرائق ، ج : 2 ، ص : 20)۔۔ وہ مزید لکھتے ہیں :
فقہائے کرام نے علت یہ بیان کی ہے کہ اس میں سنت کا ترک ہے اور یہ مکروہ تنزیہی کا فائدہ دیتا ہے، کیونکہ اس میں نہی خاص نہیں ہے کہ مکروہ تحریمی قرار دیا جاتا۔
(البحر الرائق، ج:2 ، ص: 40)
علامہ وحید الزماں لکھتے ہیں :
[[arabic: لَا تَقُومُوا حَتَّی]] ( مسجد میں جب تم لوگ بیٹھے ہو تو ) اس وقت تک کھڑے نہ ہو جب تک مجھ کو نہ دیکھو ( یعنی نماز کے لیے پہلے سے کھڑے ہو جانا بے فائدہ بات ہے، جب امام آجائے اس وقت لوگ کھڑے ہوں۔ بعضوں نے کہا: یہ حکم ہر ایک مجلس کے لیے عام ہے)، (لغات الحدیث، باب القاف مع الواو ، ص: 184 ، نور محمد کارخانہ تجارت کتب، کراچی)۔
علامہ مفتی سعید احمد پالن پوری لکھتے ہیں :
دوسرا مسئلہ: اگر امام مسجد میں موجود ہو تو لوگ اقامت کے ساتھ ہی کھڑے ہو سکتے ہیں، کیونکہ اقامت کے معنی ہیں: کھڑا کرنا، پس جب کھڑا کرنا پایا گیا تو کھڑے ہونے کی گنجائش ہے، البتہ اگر کوئی بیٹھا ر ہے تو حی علی الصلاۃ پر ضرور کھڑا ہو جائے ، ورنہ اللہ کے داعی کی مخالفت لازم آئے گی۔علامہ احمد طحطاوی رحمۃ اللہ علیہ نے فقہ کی عبارت [[arabic: يقوم الناس عند حی علی]]`
},
{
  pageNumber: 100,
  text: `[[arabic: الصلاۃ]] کا یہی مطلب لکھا ہے، (حاشیہ طحطاوی علی الدر المختار ، ج:1 ص: 215)، (تحفۃ الالمعی ، ج:1 ، ص: 511)۔۔ مزید لکھتے ہیں:
اور اگر امام مسجد سے ملحق کمرہ میں ہو تو جب تک امام کمرہ سے نہ نکلے لوگ کھڑے نہ ہوں، کیونکہ اقامت سے امام کا نکلنا متخلف ہو سکتا ہے، نبی ﷺ نے صحابہ کرام رضوان اللہ علیہم اجمعین کو یہی نصیحت فرمائی ہے کہ حضرت بلال رضی اللہ عنہ کے تکبیر شروع کرنے پر آپ حضرات کھڑے نہ ہوں ، بلکہ جب مجھے حجرہ سے نکلتا دیکھیں ، تب کھڑے ہوں، کیونکہ اس کا امکان ہے کہ نبی ﷺ گھر میں کسی کام میں مشغول ہوں یا آپ ﷺ کی نیت بندھی ہوئی ہو، پس لوگوں کو کھڑے کھڑے نماز کا انتظار کرنا پڑے گا ، جو مکروہ ہے۔
فائدہ (1): اگر اقامت سے امام کا نکلنا متخلف ہو جائے تو مؤذن کو بھی بیٹھ جانا چاہیے، پھر اگر امام فورا نکل آئے تو تکبیر کا اعادہ ضروری نہیں اور امام کو نکلنے میں تاخیر ہو تو تکبیر دوبارہ کہنی چاہیے اور تھوڑے اور زیادہ وقفہ کا فیصلہ رائے مبتلی بہ پر چھوڑ دیا گیا ہے، یعنی لوگ خود ہی اس کا فیصلہ کریں۔
فائدہ (2): اسی طرح یہ جو طریقہ چل پڑا ہے کہ لوگ پہلے کھڑے ہو جاتے ہیں اور امام صاحب بھی مصلی پر پہنچ جاتے ہیں، پھر تکبیر شروع ہوتی ہے، یہ بھی غلط طریقہ چل پڑا ہے۔ جب تک اقامہ (کھڑا کرنا) نہ پایا جائے ، کھڑے ہونے کے کیا معنی ؟ ، اور کھڑے کھڑے اقامت کا انتظار کرنا مکروہ ہے ، فقہ کی کتابوں میں اس کی صراحت ہے۔ پس لوگوں کو چاہیے کہ وہ گھڑی میں وقت ہونے پر کھڑے نہ ہوں، نہ امام صاحب نہ مقتدی۔ بلکہ پہلے اقامہ ( تکبیر ) شروع کی جائے ، پھر لوگ کھڑے ہوں۔
(تحفۃ الالمعی ، ج:1 ، ص: 511، زمزم پبلشرز کراچی )
امام اہلسنت اعلیٰ حضرت احمد رضا خان قادری قُدِّسَ سِرُّهُ الْعَزِیز سے پوچھا گیا:
علمائے دین اس مسئلے میں کہ تکبیر کے شروع ہونے کے وقت امام و مقتدی کو کھڑا رہنا چاہیے یا بیٹھ جانا چاہیے اور بیٹھ جانے میں کیا فضیلت ہے اور کھڑا رہنے میں کیا نقصان ہے`
},
{
  pageNumber: 101,
  text: `کے جواب میں لکھتے ہیں :
امام کے لیے اس میں کوئی خاص حکم نہیں، مقتدیوں کو حکم ہے کہ تکبیر بیٹھ کر سنیں، حَيَّ عَلَى الْفَلَاحِ پر کھڑے ہوں ، کھڑے کھڑے تکبیر سننا مکروہ ہے یہاں تک کہ عالمگیری میں فرمایا ہے کہ اگر کوئی شخص ایسے وقت میں مسجد میں آئے کہ تکبیر ہورہی ہو فورا بیٹھ جائے اور حَيَّ عَلَی الْفَلَاحِ پر کھڑا ہو اور اس میں راز مکبر کے اس قول کی مطابقت ہے : [[arabic: قَدْ قَامَتِ الصَّلوة]] اُدھر اس نے حَيَّ عَلَی الْفَلَاح کہا کہ آؤ مراد پانے کو جماعت کھڑی ہوئی، اس نے کہا: [[arabic: قَدْ قَامَتِ الصَّلوةُ]] ، جماعت قائم ہوگئی ، ( فتاوی رضویہ، ج: 5، ص: 421)۔
مزید لکھتے ہیں :
اگر امام تکبیر ہوتے میں چلا تو اُسے بیٹھنے کی بھی حاجت نہیں ، مصلے پر جائے اور حی علی الفلاح یاختم تکبیر پر تکبیر تحریمہ کہے، یونہی بعد خطبہ اسے اختیار ہے، کہیں منقول نہیں کہ خطبہ فرما کر تکبیر ہونے تک جلوس فرماتے ، یہ حکم قوم کے لیے ہے۔
(فتاوی رضویہ، ج: 5، ص : 419)
آپ سے پوچھا گیا: ”’زید کہتا ہے کہ امام اور مقتدی بیٹھ کر تکبیر سنیں الخ“ ، آپ اس کے جواب میں لکھتے ہیں:
مقتدیوں کو حکم یہ ہے کہ تکبیر بیٹھ کر سنیں ، جب مکبر حَى عَلَى الفلاح پر پہنچے تو اس وقت کھڑے ہوں، (فتاوی رضویہ ، ج 5، ص : 422)۔

[[heading: رمضان میں عشاء کی نماز تنہا پڑھنے والے شخص کی وتر کی جماعت میں شمولیت کا جواز]]

ماہ رمضان میں تنہا عشاء کے فرض پڑھنے والے شخص کے لیے وتر کی جماعت میں شامل ہونے کا مسئلہ فقہائے احناف کے مابین مختلف فیہ ہے اور یہ نزاع اور اختلاف بھی محض اولویت اور غیر اولویت کے اعتبار سے ہے، یعنی اختلاف محض اس بات میں ہے کہ تنہا عشاء کے فرض پڑھنے والے کے لیے آیا وتر کی جماعت میں شامل ہونا اولی ہے یا خلاف`
},
{
  pageNumber: 102,
  text: `اولی ہے اور بطور عادت ہو تو زیادہ سے زیادہ کراہت تنزیہی کا قول کیا جا سکتا ہے، بلکہ خود ماہ رمضان میں جماعت کے ساتھ وتر پڑھنے کی افضلیت وغیر افضلیت فقہاء احناف کے ما بین مختلف فیہ ہے، اگر چہ مفتی بہ قول یہ ہے کہ جماعت کے ساتھ وتر پڑھنا افضل ہے۔
اس مسئلہ کے متعلق ہم اپنی رائے ذکر کرنے سے پہلے اس بارے میں فقہاء احناف کی آراء اور اُن کے مابین اس اختلاف کی بنیاد اور وجہ پیش کرتے ہیں۔ الغرض فقہاء احناف کے مابین اس بارے میں اختلاف ہے کہ آیا ماہِ رمضان میں وتر کی جماعت ، عشاء کے فرضوں کے تابع ہے یا تراویح کے تابع ہے، یا یہ ان دونوں سے جدا اور علیحدہ مستقل جماعت ہے اور ماہ رمضان کے تابع ہے۔
قول اول: بعض فقہائے کرام کے نزدیک وتر کی جماعت تمام نمازیوں کے حق میں جماعت عشاء کے تابع ہے، لہذا جس نے کسی بھی وجہ سے عشاء کے فرض جماعت کے بغیر تنہا پڑھے ہوں ، وہ وتر کی نماز بھی تنہا پڑھے گا اور اُس کے لئے وتر کی جماعت میں شامل ہونا خلاف اولیٰ اور بطور عادت کراہت تنزیہی ہے اور اگر اُس نے عشاء کی فرض نماز جماعت کے ساتھ پڑھی ہو تو وہ با جماعت وتر پڑھ سکتا ہے، چاہے تو اُس امام کے ساتھ وتر کی جماعت میں شامل ہو جائے جس کی اقتدا میں عشاء کے فرض ادا کئے ہیں اور کسی دوسرے امام کی اقتدا میں بھی وتر پڑھ سکتا ہے۔ چنانچہ قہستانی کے حوالے سے علامہ شامی لکھتے ہیں کہ اُنہوں نے فرمایا : [[arabic: لٰكِنَّهُ إِذَا لَمْ يُصَلِّ الْفَرْضَ مَعَهُ لَا يَتْبَعُهُ فِي الْوِتْرِ]]
ترجمہ: ”لیکن اگر اُس نے امام کے ساتھ فرض نہ پڑھے ہوں تو وہ وتر میں اُس کا اتباع نہیں کرے گا۔
علامہ قہستانی کی عبارت کی تشریح کرتے ہوئے علامہ شامی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: لٰكِنْ يَنْبَغِي أَنْ يَكُونَ قَوْلُ الْقُهُسْتَانِ مَعَهُ احْتَرَازًا عَنْ صَلَاتِهَا مُنْفَرِدًا ، أَمَّا لَوْ صَلَّا هَا جَمَاعَةً مَعَ غَيْرِهِ ثُمَّ صَلَّى الْوِتْرَ مَعَهُ لَا كَرَاهَةً]]`
},
{
  pageNumber: 103,
  text: `ترجمہ: لیکن علامہ قہستانی کا یہ کہنا کہ عشاء کے فرض امام کے ساتھ نہ پڑھے ہوں ، یہ اس کے تنہا عشاء کے فرض پڑھنے سے احتراز ہے، یعنی اگر کسی نے تنہا عشاء کے فرض پڑھے ہوں تو وتر کی نماز بھی تنہا پڑھے گا البتہ اگر اُس نے عشاء کے فرض کسی دوسرے امام کی اقتدا میں باجماعت پڑھے ہوں ، پھر اس نے اُس (دوسرے) امام کے ساتھ وتر کی نماز پڑھی تو یہ مکروہ نہیں ہے، (رد المحتار، ج 2، ص:48)۔ یعنی کسی کراہیت کے بغیر وتر کی جماعت میں شامل ہونے کے لیے بہر حال جماعت کے ساتھ عشاء کی نماز پڑھنا ضروری ہے، خواہ اُسی امام کے پیچھے عشاء کی نماز پڑھی ہو جس کے ساتھ جماعت وتر میں شامل ہو رہا ہے یا کسی اور امام کی اقتدا میں پڑھی ہو۔
ہمارے بعض متاخرین اکابر فقہائے کرام نے اسی رائے پر عمل کرتے ہوئے ماہِ رمضان میں تنہا عشاء کے فرض پڑھنے والے شخص کو وتر کی جماعت میں شامل ہونے سے منع فرمایا ہے، چنانچہ امام اہلسنت امام احمد رضا قادری قُدِّسَ سِرُّهُ الْعَزِیز فرماتے ہیں:
[[arabic: مَنْ صَلَّى الْفَرْضَ بِجَمَاعَةٍ يَجُوزُ لَهُ الدُّخُولُ فِي جَمَاعَةٍ سَوَاءٌ صَلَّى الْقَرْضَ خَلْفَ هُذَا الْإِمَامِ أَوْ خَلْفَ غَيْرِهِ وَسَوَاءٌ صَلَّى التَّرَاوِيحَ وَحْدَةً أَوْ خَلْفَ هُذَا الْإِمَامِ أَوْ خَلْفَ غَيْرِه بَلْ وَمَن لَّمْ يُصَلِّهَا رَأْسًا - - - إلى قَوْلِهِ - - - فَإِنَّ مَنْ صَلَّى الْفَرِيضَةَ مُنْفَرِدًا لَيْسَ لَهُ أن يَدْخُلَ فِي جَمَاعَةِ الْوِتْرِ لَا مَعَ هَذَا الْإِمَامِ وَلَا مَعَ غَيْرِهِ]]
ترجمہ: ”جس نے عشاء کے فرض جماعت کے ساتھ پڑھے ہوں تو اُس کے لیے جماعت (وتر) میں داخل ہونا جائز ہے، خواہ اُس نے فرض اس امام کے پیچھے پڑھے ہوں یا کسی دوسرے امام کے پیچھے اور خواہ اس نے تراویح تنہا پڑھی ہوں یا اُس امام کی اقتداء میں (جس کے ساتھ جماعت وتر میں شامل ہونا چاہتا ہے ) یا کسی اور امام کی اقتدا میں تراویح پڑھی ہوں، بلکہ اگر سرے سے تراویح پڑھی ہی نہ ہوں تب بھی (مذکورہ بالا صورت میں ) وہ جماعت کے ساتھ وتر پڑھ سکتا ہے اور جس نے عشاء کے فرض تنہا پڑھے ہوں اُس کے لیے وتر کی جماعت میں شامل نہیں ہونا چاہیے، نہ تو اس امام کے ساتھ (جس کی اقتدا میں تراویح پڑھی ہے ) اور نہ کسی دوسرے امام کے ساتھ، (جِدُّ الْمُمْتَار: ج 3 ص:493)۔`
},
{
  pageNumber: 104,
  text: `صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ نے لکھا ہے :
اگر عشاء جماعت سے پڑھی اور تراویح تنہا، تو وتر کی جماعت میں شریک ہو سکتا ہے اور اگر عشاء تنہا پڑھ لی اگر چه تراویح با جماعت پڑھی تو وتر تنہا پڑھے۔
(بہار شریعت ، جلد : 1 ، ص : 693)
قول دوم: اس کے برعکس بعض فقہائے کرام نے کہا ہے کہ جماعت وتر ، جماعت تراویح کے تابع ہے، لہذا اگر کسی نے جماعت کے ساتھ تراویح نہ پڑھی ہو تو اس قول کی روشنی میں وہ وتر کی جماعت میں شامل نہیں ہو سکتا ، بلکہ وہ وتر تنہا پڑھے۔
علامہ حلبی رحمۃ اللہ علیہ شرح صغیر میں لکھتے ہیں :
[[arabic: إِذَا لَمْ يُصَلِّ الْفَرْضَ مَعَ الْإِمَامِ، قِيلَ : لا يَتْبَعُهُ فِي التَّرَاوِيحِ وَلَا فِي الْوِتْرِ وَكَذَا إِذَا لَمْ يُصَلِّ مَعَهُ التَّرَاوِيحَ لَا يَتْبَعُهُ فِي الْوِتْرِ]]
ترجمہ: اگر امام کے ساتھ فرض نہ پڑھے ہوں، تو کہا گیا ہے کہ وہ نہ تو تراویح میں امام کی اقتدا کرے اور نہ ہی وتر میں، اسی طرح اگر امام کی اقتدا میں صرف تراویح نہ پڑھی ہوں تو اس کی اقتداء میں وتر نہ پڑھے، (صغیری ، صلاة التراويح، فروع مَنْ فَاتَتْهُ تَرْوِيحَةٌ : ص 210)
علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: فِي التَّنَارُ خَانِيَّةِ عَنِ التَّنِيَّةِ أَنَّهُ سُبِلَ عَلِيُّ بْنُ أَحْمَدَ عَمَّنْ صَلَّى الْفَرْضَ وَالتَّرَاوِيحَ وَحْدَةً أَوْ التَّرَاوِيحَ فَقَطْ ، هَلْ يُصَلِّي الْوِتْرَ مَعَ الْإِمَامِ ، فَقَالَ : لا]]
ترجمہ: "تتارخانیہ میں التتمہ کے حوالے سے منقول ہے کہ علی بن احمد سے اُس شخص کے بارے میں سوال کیا گیا جس نے فرض اور تراویح تنہا پڑھی ہوں یا صرف تراویح تنہا پڑھی ہوں، تو کیا وہ امام کے ساتھ وتر پڑھے گا ؟ انہوں نے فرمایا: نہیں۔
(رَدُّ الْمُحْتَار : ج:2 ، ص: 48)`
},
{
  pageNumber: 105,
  text: `قول سوم: علامہ عبد الرحمن آفندی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: وَلَوْ تَرَكُوا الْجَمَاعَةَ فِي الْفَرْضِ لَمْ يُصَلُّوا التَّرَاوِيحَ بِجَمَاعَةٍ وَلَوْ لَمْ يُصَلِّهَا مَعَ الْإِمَامِ صَلَّى الْوِتْرَ بِهِ لِأَنَّهُ تَابِعُ لِرَمَضَانَ وَعِنْدَ الْبَعْضِ لَا لِأَنَّهُ تَابِعُ لِلتَّرَاوِيحِ]]
ترجمہ: اور اگر لوگوں نے فرض میں جماعت کو ترک کر دیا ہو تو وہ تراویح جماعت کے ساتھ نہیں پڑھیں گے اور اگر کسی نمازی نے تراویح امام کے ساتھ نہ پڑھی ہوں، تو وہ وتر اُس کے ساتھ پڑھ لے، کیونکہ وتر رمضان کے تابع ہیں اور بعض کے نزدیک نہ پڑھے کیونکہ وتر کی جماعت تراویح کے تابع ہے، (مَجْمَعُ الْأَنْهُر: ج: 1، ص 136 ) ۔
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں :
صحیح یہ ہے کہ نفس وتر اگر چہ عشاء کے تابع ہیں لیکن وتر کی جماعت کا مسنون ہونا تراویح کی جماعت کے سنت ہونے کے تابع ہے، کیونکہ اگر وتر جماعت عشاء کے تابع ہوتے تو سارا سال وتر جماعت کے ساتھ مسنون ہوتے ، کیونکہ عشاء کی نماز میں جماعت سارا سال مسنون ہے اور چونکہ وتر کی جماعت صرف رمضان میں مسنون ہے، اس سے معلوم ہوا کہ وتر کی جماعت کا سنت ہونا تراویح کی جماعت کے سنت ہونے کے تابع ہے۔
مزید لکھتے ہیں : علامہ ابن عابدین شامی رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: الَّذِي يَظْهَرُ أَنَّ جَمَاعَةَ الْوِتْرِ تَبَعْ لِجَمَاعَةِ التَّرَاوِيحِ وَإِنْ كَانَ الْوِتْرُ نَفْسُهُ أَصْلًا فِي ذَاتِهِ لِأَنَّ سُنَّةَ الْجَمَاعَةِ فِي الْوِتْرِ إِنَّمَا عُرِفَتْ بِالْأَثَرِ تَابِعَةٌ لِلتَّرَاوِيحِ]]
ترجمہ: ” ظاہر بات یہ ہے کہ ( جماعت کے حق میں ) وتر کی جماعت تراویح کی جماعت کے تابع ہے، اگر چہ وتر بذاتہ اصل ہے لیکن (ماہِ رمضان میں ) وتر کی جماعت کا سنت ہونا آثار (صحابہ) کی روشنی میں تراویح کے تابع ہے۔
(رَدُّ الْمُحْتَارِ عَلَى الدُّرِّ الْمُخْتَارِ، ج:2 ، ص: 436، بیروت)
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ کا وتر کی جماعت کے سنت ہونے کو تراویح کی جماعت کے سنت ہونے کے تابع قرار دینے پر علامہ ابن عابدین شامی کی اس عبارت سے`
},
{
  pageNumber: 106,
  text: `استدلال محل نظر ہے، اس لیے کہ علامہ ابن عابدین شامی نے وتر کی جماعت کی تابعیت کو فقط جماعت عشاء میں محصور نہیں کیا، بلکہ وہ فرماتے ہیں کہ جماعت و تر بیک وقت جماعت عشاء و جماعت تراویح اور ماہ رمضان کے تابع ہے ۔ البتہ وتر کی جماعت کا فرضِ عشاء کی جماعت کے تابع ہونا ہر ایک کے حق میں ہے اور اس کا تراویح کے تابع ہونا فقط جماعت کے حق میں ہے، منفرد کے حق میں نہیں ہے، چنانچہ انہوں نے اپنی مذکورہ بالا عبارت میں اسی کو بیان فرمایا ہے۔ علامہ ابن عابدین نے منفرد کے حق میں اس بات کی تصریح فرمائی ہے کہ اُس کے لئے نماز وتر نماز تراویح کے تابع نہیں ہے، سو ہماری نظر میں اس عبارت کا مستفاد یہ ہے کہ اگر کسی مقام پر سب لوگوں نے تراویح کی نماز با جماعت نہیں پڑھی تو وہ وتر بھی با جماعت نہیں پڑھیں گے لیکن اگر اکثر نے نماز تراویح با جماعت پڑھ لی ہے یا کسی مسجد میں باجماعت تراویح ہو چکی ہے اور کسی ایک شخص یا چند اشخاص نے تراویح با جماعت نہیں پڑھیں ، تو وہ وتر کی جماعت میں شریک ہو سکتے ہیں، چنانچہ تنویر الابصار مع الدر المختار میں ہے:
[[arabic: لأَنَّ جَمَاعَتَهَا تَبَعْ لِجَمَاعَةِ الْفَرْضِ ، فَإِنَّهَا لَمْ تَقُمْ إِلَّا بِجَمَاعَةِ الْفَرْضِ، فَلَوْ أُقِيمَتْ بِجَمَاعَةٍ وَحْدَهَا كَانَتْ مُخَالِفَةٌ لِلْوَارِ دِ فِيهَا فَلَمْ تَكُنْ مَشْرُوعَةً ؛ أَمَّا لَوْ صُلِيَتْ بِجَمَاعَةِ الْفَرْضِ وَكَانَ رَجُلٌ قَدْ صَلَّى الْفَرْضَ وَحْدَهُ ، فَلَهُ أَنْ يُصَلِّيَهَا مَعَ ذَلِكَ الْإِمَامِ لأَنَّ جَمَاعَتَهُمْ مَشْرُوعَةٌ فَلَهُ الدُّخُولُ فِيهَا مَعَهُمْ لِعَدَمِ الْمَحْذُورِ]]
ترجمہ: ” کیونکہ تراویح کی جماعت فرض کی جماعت کے تابع ہے، اس لیے کہ تراویح کی جماعت فرض کی جماعت کے ساتھ ہی قائم ہوئی ہے، پس اگر ایک جماعت نے اکیلے اکیلے نماز تراویح پڑھ لی تو (چونکہ ) یہ اس بارے میں وارد ہونے والے آثار کی مخالفت ہوگی، لہذا اسے جائز قرار نہیں دیا جائے گا۔ البتہ اگر تراویح کی نماز فرض عشاء کی جماعت کے ساتھ پڑھ لی گئی اور کوئی ایسا شخص ہے جس نے فرض تنہا پڑھے ہیں تو اُس کے لیے امام کے ساتھ تراویح پڑھنا جائز ہے، اس لیے کہ تراویح کی جماعت بحیثیت مجموعی مشروع ہے،`
},

  {
    pageNumber: 107,
    text: `لہذا اس کے لیے اُن کے ساتھ جماعت میں داخل ہونا جائز ہے، کیونکہ اس سے کوئی مانع نہیں پایا جاتا ، (رد الْمُحْتَار: ج:2 ، ص: 48)۔
تنویر الابصار مع الدر المختار میں ہے:
[[arabic: وَلَوْ لَمْ يُصَلِّهَا أَي التَّرَاوِيحَ بِالْإِمَامِ أَوْ صَلَّاهَا مَعَ غَيْرِهِ لَهُ أَنْ تُصَلِّيَ الْوِتْرَ مَعَهُ ، بَقِيَ لَوْ تَرَكَهَا الْكُلُّ ، هَلْ يُصَلُّونَ الْوِتْرَ بِجَمَاعَةِ ، فَلْيُرَا جَع]]
ترجمہ: اور اگر اُس نے تراویح امام کے ساتھ نہیں پڑھیں یا کسی اور امام کے ساتھ پڑھی ہیں تو وہ وتر امام کے ساتھ باجماعت پڑھ سکتا ہے ( کیونکہ اس کے حق میں وتر کی جماعت تراویح کی جماعت کے تابع نہیں اور مطلقاً تراویح کی جماعت ادا ہو چکی ہے ) ، باقی یہ صورت رہ جاتی ہے کہ اگر (کسی مقام پر ) تمام لوگوں نے تراویح کی جماعت کو ترک کر دیا ہو ( کیونکہ یہ سنتِ متوارثہ کا ترک ہے ) تو کیا وہ جماعت کے ساتھ وتر پڑھیں گے؟ تو اس کی بابت ( ماخذ فقہ سے ) رجوع کیا جائے (اس کی تشریح علامہ شامی کے حوالے سے گزر چکی ہے کہ اس صورت میں وہ سب وتر با جماعت نہیں پڑھیں گے )۔
(رد الْمُحْتار ، جلد 2 ، ص : 436، بیروت)
قول چہارم : بعض فقہائے کرام کے نزدیک ماہِ رمضان میں وتر کی جماعت نہ تو جماعت تراویح کے تابع ہے اور نہ ہی عشاء کی جماعت کے تابع ، بلکہ یہ مستقل نماز ہے اور اس کی جماعت ماه رمضان کے تابع ہے ، اس تعلیل کی روشنی میں عشاء کے فرض تنہا پڑھنے والے کے لیے وتر کی جماعت میں شامل ہونے کا جواز ثابت ہوتا ہے، یہ علامہ طحطاوی اور علامہ حلبی کا مذہب ہے۔
چنانچہ امام اہلسنت امام احمد رضا قُدِّسَ سِرُّهُ الْعَزِیز لکھتے ہیں :
[[arabic: أَمَّا مَا ذَكَرُوا أَنَّ جَمَاعَةَ الْوِتْرِ هَلْ هِيَ تَبَعَ لِجِمَاعَةِ التَّرَاوِيحِ أَمْ لَا ، جَنَحَ الْفَاضِلَانِ الْحَلَبِيُّ وَالطَّحْطَاوِي فِي حَوَاشِي الدُّرِّ إِلَى الثَّانِي وَاسْتَظْهَرَ الشَّامِيُّ أَوَّلا]]
ترجمہ : ” رہی یہ بات جو فقہاء نے ذکر کی ہے کہ وتر کی جماعت آیا تراویح کی جماعت کے`
  },
  {
    pageNumber: 108,
    text: `تابع ہے یا نہیں ! تو فاضلان گرامی علامہ حلبی اور علامہ طحطاوی نے در مختار کے حاشیہ میں روسری شق (یعنی جماعت وتر جماعت تراویح کے تابع نہیں ہے کی طرف اور علامہ شامی نے پہلی شق (یعنی جماعت وتر جماعت تراویح کے تابع ہے ) کو ترجیح دی ہے۔
( جِدُّ الْمُمْتَار: ج 3 ص : 496)
چنانچہ علامہ طحطاوی نے در مختار پر تحریر کردہ اپنے حاشیہ میں اس صورت (یعنی اگر تمام لوگ با جماعت تراویح کو ترک کر دیں تو آیا وہ وتر جماعت کے ساتھ پڑھیں گے یا نہیں) کے بارے میں علامہ علاء الدین حصکفی کا یہ قول نقل کیا : فَلْيُرَاجَعْ، یعنی اس کی بابت تاخذ فقہ کی طرف رجوع کر لیا جائے ، علامہ شامی نے تو منع لکھا ہے، لیکن علامہ طحطاوی اس پر تفریح فرماتے ہیں:
[[arabic: قَضِيَّةَ التَّعْلِيلِ فِي الْمَسْئَلَةِ السَّابِقَةِ بِقَوْلِهِمْ: لِأَنَّهَا تَبَعْ ، أَنْ يُصَلِّيَ الْوِتْرَ بِجَمَاعَةِ في هَذِهِ الصُّورَةِ، لِأَنَّهَا لَيْسَ بِتَبَعَ لِلتَّرَاوِيحِ وَلَا لِلْعِشَاءِ عِنْدَ الْإِمَامِ رَحِمَهُ اللهُ تعالى]]
ترجمہ: سابقہ مسئلہ میں (علامہ حصکفی کا ) اپنے اس قول لانها تبع سے بیان کردہ علت کا تقاضا یہ ہے کہ اس صورت میں وتر کی نماز جماعت کے ساتھ پڑھی جائے، کیونکہ نماز وتر امام ابوحنیفہ رحمۃ اللہ علیہ کے نزدیک نہ تو تراویح کے تابع ہے اور نہ ہی فرض عشاء کے تابع، (حاشیة الطحطاوي: ج 1 ، ص : 297)، یعنی علامہ حصکفی نے فرض کی جماعت ترک کرنے والے کے لیے تراویح کی جماعت میں شامل ہونے کے جواز کی علت چونکہ یہ بیان کی ہے کہ تراویح کی جماعت عشاء کی جماعت کے تابع ہے، لہذا اس تعلیل سے یہ معلوم ہوا کہ اگر تمام لوگ تراویح کو ترک کر دیں تو وہ با جماعت وتر پڑھ سکتے ہیں، کیونکہ نماز وتر مستقل نماز ہے یہ نہ تو عشاء کے تابع ہے اور نہ ہی تروایح کے تابع ۔
علامه طحطاوی کے اس کلام کی روشنی میں تنہا فرض پڑھنے والے کے لیے کراہت کے بغیر وتر کی جماعت میں شامل ہونے کا جواز بھی ثابت ہوتا ہے، کیونکہ جب اصل یعنی`
  },
  {
    pageNumber: 109,
    text: `جماعت فرض کو چھوڑنے والا تابع یعنی جماعت تراویح میں شامل ہو سکتا ہے، تو اُس کے لیے وتر کی جماعت میں شامل ہونا بطریق اولی جائز ہوگا، کیونکہ وہ تو مستقل اور علیحدہ نماز ہے، نہ وہ فرض کے تابع ہے اور نہ ہی تراویح کے۔
علامہ حلبی رحمۃ اللہ علیہ شرح صغیر میں لکھتے ہیں :
[[arabic: إِذَا لَمْ يُصَلِّ الْفَرْضَ مَعَ الْإِمَامِ، قِيلَ : لا يَتْبَعُهُ فِي التَّرَاوِيحِ وَلَا فِي الْوِتْرِ وَكَذَا إِذَا لَمْ يُصَلِّ مَعَهُ التَّرَاوِيحَ لَا يَتْبَعُهُ فِي الْوِتْرِ، وَالصَّحِيحُ أَنَّهُ يَجُوزُ أَن يَتْبَعَهُ فِي ذَلِكَ كُلِّهِ حَتَّى لَوْ دَخَلَ بَعْدَ مَا صَلَّى الاِمَامُ الْفَرْضَ وَشَرَعَ فِي التَّراوِيحِ فَإِنَّهُ يُصَلِّيِّ الْقَرْضَ أَوَّلًا وَحْدَهُ ثُمَّ يُتَابِعُهُ فِي التَّرَاوِيحِ ، وَفِي الْقُنْيَةِ لَوْ تَرَكُوا الْجَمَاعَةَ فِي الْقَرْضِ لَيْسَ لَهُمْ أَنْ يُصَلُّوا التَّرَاوِيحَ جَمَاعَةً]]
ترجمہ: ”اگر کسی نے امام کے ساتھ فرض نہ پڑھے ہوں ، تو کہا گیا ہے کہ پھر امام کی اقتدا میں نہ تراویح پڑھے نہ وتر ، اسی طرح اگر امام کی اقتداء میں صرف تراویح نہ پڑھی ہوں تو اس کی اقتداء میں وتر نہ پڑھے اور صحیح یہ ہے کہ ان سب میں امام کی اقتدا کرے گا حتی کہ اگر کوئی شخص اس وقت داخل ہوا جب امام فرض پڑھا کر تراویح شروع کر چکا تھا تو وہ پہلے تنہا فرض پڑھے گا اور پھر تراویح میں اس کا اتباع کرے گا۔ اور ” القنیة“ میں ہے: اگر تمام لوگوں نے فرض عشاء کی جماعت کو ترک کر دیا تو اُن کے لیے جماعت کے ساتھ تراویح پڑھنا جائز نہیں ہے، (صغیری ، صلاة التراویح ، فروع مَنْ فَاتَتْهُ تَرْوِيحَةٌ : ص: 210)۔ یعنی یہ عدم جواز تنها جماعت فرض کے تارک کے لیے نہیں ہے۔
نیز علامہ عبدالرحمن آفندی نے صراحت کی ہے کہ ماہ رمضان میں وتر کی جماعت کا تراویح کی جماعت کے تابع ہونا فقہائے کرام کے نزدیک مختلف فیہ ہے، کیونکہ بعض فقہائے کرام کے نزدیک وتر کی جماعت محض ماہِ رمضان کے تابع ہے ، چنانچہ وہ لکھتے ہیں :
[[arabic: وَلَوْ تَرَكُوا الْجَمَاعَةَ فِي الْفَرْضِ لَمْ يُصَلُّوا التَّرَاوِيحَ بِجَمَاعَةٍ وَلَوْ لَمْ يُصَلِّهَا مَعَ الْإِمَامِ صَلَّى الْوِتْرَ بِهِ لِأَنَّهُ تَابِعُ لِرَمَضَانَ وَعِنْدَ الْبَعْضِ لَا لِأَنَّهُ تَابِعُ لِلتَّرَاوِيحِ]]`
  },
  {
    pageNumber: 110,
    text: `ترجمہ : اور اگر کسی مقام پر سب نے فرض کی جماعت کو ترک کر دیا تو وہ تراویح بھی جماعت کے ساتھ نہیں پڑھیں گے اور اگر کسی نے تراویح امام کے ساتھ نہ پڑھی ہوں تو وہ وتر اُس کے ساتھ پڑھے گا کیونکہ وتر رمضان کے تابع ہے اور بعض کے نزدیک نہیں پڑھے گا، کیونکہ وتر کی جماعت تراویح کی جماعت کے تابع ہے ، (مَجْمَعُ الْأَنْهُر: ج: 1، ص: 136)۔ اس سے بھی وہی بات ثابت ہوتی ہے کہ تنہا فرض پڑھنے والے کے لیے جماعت وتر میں شامل ہونا بلا کراہت جائز ہے۔
نیز فقہائے کرام نے ذکر کیا ہے کہ اگر عشاء کے فرض نماز تراویح اور وتر پڑھنے کے بعد یہ معلوم ہوا کہ امام نے عشاء کے فرض طہارت کے بغیر ادا کیے تھے جبکہ تراویح اور وتر کی نماز طہارت کے ساتھ ادا کی تھی ، تو عشاء کے فرضوں کے ساتھ ساتھ تراویح کا بھی اعادہ لازم ہوگا، لیکن وتر کا اعادہ لازم نہیں ہوگا۔ اس سے بھی یہی بات ثابت ہوتی ہے کہ وتر کی جماعت نہ تو عشاء کے فرضوں کے تابع ہے اور نہ تراویح کے تابع ، کیونکہ اگر یہ ان میں سے کسی ایک کے تابع ہوتی تو جس طرح اصل یعنی عشاء یا تراویح کا اعادہ لازم ہوا ہے، وتر کا اعادہ بھی لازم ہوتا لیکن وتر کا اعادہ لازم نہیں ہے ۔ اس سے معلوم ہوتا ہے کہ وتر کی جماعت مستقل بالذات ہے، فرض یا تراویح کی جماعت کے تابع نہیں ہے۔
چنانچہ علامہ زیلعی حنفی رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: وَهُوَ مَا بَعْدَ الْعِشَاءِ إِلَى طُلُوعِ الْفَجْرِ ، قَبْلَ الْوِتْرِ وَبَعْدَهُ ، كَمَا ذُكِرَ فِي الْمُخْتَصَرِ حَتَّى لَوْ تَبَيَّنَ أَنَّ الْعِشَاءَ صَلَّوْهَا بِلَا طَهَارَةِ دُونَ التَّرَاوِيحِ وَالْوِتْرِ ، أَعَادُوا التَّرَاوِيحَ مَعَ الْعِشَاءِ دُونَ الْوِتْرِ عِنْدَ أَبِي حَنِيفَةَ، لِأَنَّهَا تَبَعْ لِلْعِشَاءِ]]
ترجمہ : تراویح کا وقت عشاء کے بعد سے لیکر طلوع فجر تک ہے، وتر سے پہلے بھی (تراویح پڑھ سکتے ہیں) اور اُس کے بعد بھی، جیسا کہ مختصر میں مذکور ہے حتی کہ اگر یہ بات ظاہر ہوئی کہ لوگوں نے عشاء کی نماز طہارت کے بغیر پڑھی تھی لیکن تروایح اور وتر طہارت کے ساتھ پڑھے تھے، تو امام ابو حنیفہ کے نزدیک وہ عشاء کے ساتھ تراویح کا اعادہ کریں گے،`
  },
  {
    pageNumber: 111,
    text: `وتر کا اعادہ نہیں کریں گے، اس لیے کہ تراویح عشاء کے تابع ہے (اور وتر مستقل نماز ہے)۔ (تبیین الحقائق : ج 1 ص : 178)
علامہ عبد الرحمن آفندی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: وَقْتُ التَّرَاوِيحِ بَعْدَ صَلَاةِ الْعِشَاءِ إِلَى آخِرِ اللَّيْلِ لِأَنَّهَا تَبَعْ لِلْعِشَاءِ دُونَ الْوِتْرِ حَتَّى لَوْ ظَهَرَ أَنَّ الْعِشَاءَ صُلِّيَتْ بِلَا طَهَارَةِ وَالتَّرَاوِيحَ بِطَهَارَةِ أُعِيدَتِ التَّرَاوِيحُ مَعَ الْعِشَاءِ، لَا الْوِتْرُ عِنْدَ الْإِمَامِ]]
ترجمه: تراویح کا وقت عشاء کی نماز کے بعد سے لیکر رات کے آخر تک ہے، کیونکہ وہ عشاء کے تابع ہے نہ کہ وتر کے حتی کہ اگر یہ بات معلوم ہوئی کہ عشاء کی نماز طہارت کے بغیر اور تراویح طہارت کے ساتھ پڑھی گئی ہے، تو امام ابو حنیفہ کے نزدیک عشاء کے ساتھ تراویح کا اعادہ کیا جائے ، نہ کہ وتر کا ، ( مَجْمَعُ الأَنْهُر : ج : 1 ص136)‘ ۔ کیونکہ تراویح کی جماعت فرض عشاء کی جماعت کے تابع ہے، جبکہ وتر اس کے تابع نہیں ہے۔
علامہ نظام الدین حنفی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: وَالصَّحِيحُ أَنَّ وَقْتَهَا مَا بَعْدَ الْعِشَاءِ إِلَى طُلُوعِ الْفَجْرِ قَبْلَ الْوِتْرِ وَ بَعْدَةً حَتَّى لَوْ تَبَيَّنَ أَنَّ الْعِشَاءَ صَلَّاهَا بِلَا طَهَارَةٍ دُونَ التَّرَاوِيحِ وَالْوِتْرِ أَعَادَ التَّرَاوِيحَ مَعَ الْعِشَاءِ دُونَ الْوِتْرِ، لِأَنَّهَا تَبَعَ لِلْعِشَاءِ ، هَذَا عِنْدَ أَبِي حَنِيفَةَ رَحِمَهُ اللَّهُ تَعَالَى فَإِنَّ الْوِتْرَ غَيْرُ تَابِعَ لِلْعِشَاءِ فِي الْوَقْتِ عِنْدَهُ ، وَالتَّقْدِيمُ إِنَّمَا وَجَبَ لِأَجْلِ التَّرْتِيبِ وَذَلِكَ يَسْقُطُ بِعُذْرِ النِّسْيَانِ فَيَصِرُّ إِذَا أَذًى قَبْلَ الْعِشَاءِ بِالنِّسْيَانِ بِخِلَافِ التَّرَاوِيحِ فَإِنَّ وَقْتَهَا بَعْدَ أَدَاءِ الْعِشَاءِ فَلَا يُعْتَدُّ بِمَا أُدِّيَ قَبْلَ الْعِشَاءِ]]
ترجمہ: صحیح یہ ہے کہ تراویح کا وقت عشاء کی نماز کے بعد سے لیکر طلوع فجر تک ہے ، وتر پہلے بھی اور بعد بھی حتی کہ اگر یہ بات ظاہر ہوئی کہ عشاء کی نماز طہارت کے بغیر پڑھی تھی لیکن تروایح اور وتر طہارت کے ساتھ پڑھے تھے، تو عشاء کے ساتھ تراویح کا اعادہ`
  },
  {
    pageNumber: 112,
    text: `کریں گے نہ کہ وتر کا ، اس لیے کہ تراویح عشاء کے تابع ہے۔ یہ امام ابو حنیفہ کا مذہب ہے، کیونکہ اُن کے نزدیک وقت کے اندر وتر کی نماز عشاء کی نماز کے تابع نہیں ہیں اور عشاء کی نماز کو وتر پر ترتیب کی وجہ سے مقدم کرنا واجب ہے اور وہ نسیان کے عذر کی وجہ سے ساقط ہو جاتا ہے، پس اگر کسی نے بھولے سے وتر کی نماز عشاء کے فرضوں سے پہلے پڑھ لی تو اس کی نماز صحیح ہے، بر خلاف تراویح کے، کہ اُن کا وقت عشاء کے فرض ادا کرنے کے بعد شروع ہوتا ہے، لہذا عشاء سے پہلے ادا کی گئی تراویح کا اعتبار نہیں کیا جائے گا۔
(فتاوی عالمگیری جلد 1 ، ص : 115 )
فقیه ملت علامہ ابوالخیر محمد نوراللہ نعیمی رحمۃ اللہ علیہ سے سوال ہوا: ”ایک مولانا رمضان المبارک میں فرض اکیلے پڑھنے والے کے لیے وتر کی جماعت میں شمولیت ناجائز بتاتے ہیں، میں نے صغیری کی عبارت پیش کی ، ساتھ ہی عالمگیری اور کبیری کا حوالہ دیا، مگر وہ اپنی تائید میں علامہ شامی کی عبارت پیش کرتے ہیں ، آپ سے رہنمائی چاہیے ۔ وہ جواب میں لکھتے ہیں : ” بلا شک وریب شامل ہو سکتا ہے کہ ایسی جماعت وتر بالا تفاق جائز و مشروع ہے اور جماعت جائز و مشروع کے ساتھ نماز ادا کرنا بہ حکم قرآن کریم جائز ہے، اس جماعت کے نمازی راکعین ہیں اور اللہ رب العالمین کا ارشاد ہے: [[arabic: وَارُ كَعُوا مَعَ الرَّاكِعِينَ]]” اور حدیث صحیح میں ہے: [[arabic: إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ]]“ اور یہ بھی ہے : [[arabic: فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَأَتِمُوا]]، (صحیح البخاری : 635,378)۔
وہ لکھتے ہیں: ”مذہب حنفیہ متون و شروح و فتاوی و حواشی بالاتفاق ماہِ رمضان میں علی الاطلاق وتر باجماعت کے جواز واستحباب سے گونج رہے ہیں ، حالانکہ اگر صرف متون میں ہی ہوتا اور شروح و فتاوی میں اس کے خلاف ہوتا ، تب بھی جائز رہتا کہ محققین نے تصریح فرمائی کہ مسئلہ متون ، مسئلۂ شروح و فتاوی سے مقدم ہوتا ہے۔ پھر انہوں نے علامہ ابن عابدین شامی رحمۃ اللہ علیہ کے حوالے سے ایک فقہی ضابطہ لکھا : [[arabic: أَنَّ مَا فِي الْبُتُونِ مُقَدَّمْ عَلَى مَا فِي الشُّرُوحِ وَمَا فِي الشُّرُوحِ مُقَدَّهُ عَلَى مَا فِي الْفَتَاوَى]]“۔`
  },
  {
    pageNumber: 113,
    text: `(رد المحتار علی الدر المختار ، ج:1 ، ص: 72 ، دار الفکر، بیروت )
اُس کے بعد وہ مزید بحث کرتے ہیں اور جن کتب فقہ کے ہم نے حوالہ جات دیے ہیں، اُن کا بھی ذکر کر کے لکھتے ہیں: ” بفضلہ وکرمہ اسی مختصر فتوے سے مہر نیم روز کی مانند واضح ہو گیا کہ صورتِ مذکورہ میں وہ شخص جماعت وتر میں شامل ہو سکتا ہے اور یہ شمول جائز وروا ہے، ( فتاوی نوریہ ، ج:1 ، ص: 563) علامہ محمد نوراللہ نعیمی رحمۃ اللہ علیہ کے اسی مقام پر اس موضوع پر مختلف سائلین کے جواب میں مزید فتاوی بھی موجود ہیں۔
فقہائے کرام کی مذکورہ بالا عبارات سے معلوم ہوا کہ جب نفس و تر نفس عشاء کے تابع نہیں ہیں، تو وتر کی جماعت بھی عشاء کی جماعت کے تابع نہیں ہوگی ۔ پس اگر چہ امام اہلسنت امام احمد رضا قادری اور حضرت صدر الشریعہ رحمہ اللہ علیہما نے علامہ ابن عابدین شامی رحمۃ اللہ علیہ کے قول کو راجح قرار دیتے ہوئے عشاء کی جماعت میں شریک نہ ہونے والے شخص کے لیے وتر کی جماعت میں عدم شرکت کو راجح اور اولی قرار دیا ہے۔ حالانکہ ایسے شخص کے لیے عشاء کی نماز تنہا پڑھ کر تراویح کی جماعت میں شامل ہونے کو جائز قرار دیا ہے ، جبکہ تراویح کی جماعت بالاتفاق فرض کی جماعت کے تابع ہے، اس کے برعکس وتر کی جماعت کا فرض عشاء کی جماعت کے تابع ہونا فقہائے احناف کے نزدیک متفق علیہ مسئلہ نہیں ہے، تو ہم فرض با جماعت نہ پڑھنے والے کے لیے وتر کی جماعت میں شامل ہونے کے جواز کا قول کریں گے تاکہ رمضان المبارک میں جماعت کی برکت اور اجر زائد سے محروم نہ رہیں ۔
فقیه ملت علامہ مفتی محمد نوراللہ نعیمی ، استاذ العلماء حضرت علامہ عطا محمد بندیالوی اور علامہ غلام رسول سعیدی رحمۃ اللہ علیہما اور علامہ مفتی محمد رفیق حسنی مُدَّ ظلهم نے بھی یہی موقف اختیار کیا ہے۔ تاہم اعلیٰ حضرت اور حضرت صدر الشریعہ رحمۃ اللہ علیہما ہمارے مسلمہ اکابر میں سے ہیں ، لہذا جو حضرات ان کے موقف کو اختیار کرنا چاہیں ، وہ ایسا کر سکتے ہیں، اس مسئلے کو راجح اور مرجوح کے درجے میں لیا جائے۔`
  },
  {
    pageNumber: 114,
    text: `تصدیقات مفتیان کرام:
نوٹ: راقم نے معاصرین میں سے اہلسنت و جماعت کے انتہائی ثقہ مفتی علامہ مفتی محمد ابراہیم قادری مُدَّ ظلهم کی خدمت میں یہ فتوی بھیجا تا کہ اگرہم سے کوئی فروگزاشت ہوگئی ہو تو اُس کی نشاندہی ہو جائے۔ میں حضرت قبلہ مفتی صاحب دامت برکاتہم کا شکرگزار ہوں کہ انہوں نے گہری نظر سے اس کا مطالعہ فرمایا بعض جگہ عربی عبارات کے ترجمے کو بہتر بنایا اور بعض جگہ کچھ لفظی تبدیلیاں تجویز فرمائیں ، میں نے بہ طیب خاطر اُن کی رائے کو قبول کر کے اس فتوے میں جذب کر لیا ہے، آخر میں وہ لکھتے ہیں :
” یہ فقیر اعلیٰ حضرت فاضل بریلوی رحمۃ اللہ علیہ کی رائے کو بہت وقیع سمجھتا ہے لیکن چونکہ جواز دوسری جانب بھی ہے اور اسی پر اس فقیر کا عمل ہے ، اس لیے اس مسئلے کو نزاع کا باعث نہیں بننا چاہیے، کیونکہ یہ اختلاف بھی اولویت اور غیر اولویت کے اعتبار سے ہے ، یعنی اختلاف محض اس بنا پر ہے کہ رمضان المبارک میں عشاء کے فرض تنہا پڑھنے والے کے لیے آیا وتر کی جماعت میں شامل ہونا اولی ہے یا خلاف اولی ، بھلا خلاف اولی کام بھی نا جائز ہو سکتا ہے۔
(2) حضرت علامہ مفتی محمد رفیق حسنی مد ظلهم :
ما شاء الله ! مفتی اعظم حضرت مولانا منیب الرحمن صاحب دامت برکاتہم العالیہ نے وتروں کی جماعت کے جواز پر مفصل فتوی تحریر فرمایا ہے ، الحمد للہ! میں اپنی کتاب رفیق الصائمین“ میں غالباً 1987 ء استاذ العرب والعجم استاذیم مولانا عطا محمد بندیالوی کی تحقیق کے حوالے سے جواز کا فتوی لکھ چکا ہوں ، مگر اس میں اجمال تھا اور حضرت مفتی صاحب نے تفصیل ذکر فرمادی، واللہ تعالیٰ اعلم ، (23 جولائی 2018ء)۔
(3) حضرت علامہ مفتی محمد جان نعیمی مد ظلهم :
فقیر نے حضرت العلام مفتی منیب الرحمن مدظلہ العالی (مفتی اعظم پاکستان) کا تحریر کردہ فتوی وتروں کی جماعت کے جواز پر اول سے آخر تک پڑھا، فقیر کا اتفاق ہے اور اسی قول کو مخادیم سندھ رحمہم اللہ تعالیٰ نے ترجیح دی ہے، [[arabic: وَاللهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ بِالصَّوَابِ]] وعلمه اتم واحکم، (30 جولائی 2018ء)
(4) حضرت علامہ مفتی محمد اکمل مدنی مد ظلهم :`
  },
  {
    pageNumber: 115,
    text: `[[arabic: بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ]]
راقم ، زیر بحث مسئلے میں قبلہ مفتی منیب الرحمن صاحب دامت فیو ہم سے نہ صرف مکمل اتفاق رکھتا ہے، بلکہ اس مذہب کے اختیار کرنے کو دین و عبادات کے سلسلے میں بے رغبتی سے بھر پور موجودہ ماحول کے پیش نظر، دوسرے موقف کے مقابلے میں انسب واولی گمان کرتا ہے۔ نیز عرصہ دراز سے خود بھی اس پر عامل اور اسی کی ترغیب دیتا ہے اور اس اختیار قول کی چند وجوہات ہیں :
(1) من جانب شرع نافذ کردہ ، عبادات اجتماعیہ کی حکمتوں پر غور کیا جائے تو بعد تکبر، رغبت نفوس، تنقید و گرفت خلق کے خوف کے باعث، عبادات پر حصول استقامت اور فضائے اتحاد و اتفاق قائم کرنا، جیسے امور سر فہرست نظر آئیں گے۔ چونکہ مذکورہ مسئلے میں، اختیار قول مرجوح کی صورت میں ان حکمتوں کا حصول واضح طور پر نظر آرہا ہے، لہذا اس کا اختیار کیا جانا ، انسب معلوم ہوتا ہے۔
(2) جماعت کی موافقت، شریعت اور اس کی اتباع میں اکابرین اسلام رضی اللہ عنہم کو ہمیشہ مطلوب ومحبوب، جب کہ اس کی مخالفت، معیوب و معتوب رہی ہے۔ قرآنِ عظیم میں [[arabic: وَارْكَعُوا مَعَ الرَّاكِعِينَ]]، حدیث میں رسول اکرم ﷺ کا منافقین کے جماعت سے پیچھے رہ جانے پر اظہار غضب ، فقہائے احناف رحمۃ اللہ علیہم کا صلوات مکتوبہ کی جماعت کے سلسلے میں ، 16 اقوال میں سے، واجب عین کا اختیار کرنا اور مسجد میں موجود مسلمان کے، آغاز وقت نماز کے بعد ، مسجد سے بلا عذر چلے جانے کو نا پسند فرمانا، اس کی نظائر صریحہ ہیں۔ چنانچہ وتر کے سلسلے میں اسی مزاج کی موافقت، انسب معلوم ہوتی ہے۔
(3) یہ دور عوام کی دین سے بے رغبتی کا دور ہے، چنانچہ بے حد ضروری ہے کہ جس طرح بھی ممکن ہو، انہیں مذہب اور مذہبی شخصیات کے قریب لایا جائے اور متنفر ہونے سے بچایا جائے ، چاہے وہ کسی مکروہ تنزیہی فعل کے ذریعے ہی کیوں نہ ہو۔ کیونکہ عند اتحقیق فعل مکروہ تنزیہی ، گناہ نہیں، چاہے اس کی عادت ہی کیوں نہ قائم ہو جائے ۔`
  },
  {
    pageNumber: 116,
    text: `اعلیٰ حضرت رحمۃ اللہ علیہ فرماتے ہیں کہ جان لو جو کچھ پہلے گزر چکا ہے اور اس پر ہم نے جزم اور بھروسا کیا، وہ یہ ہے کہ مکروہ تنزیہی پرصغیرہ، کبیرہ کوئی گناہ نہیں اور اس سے بندہ کسی قسم کی سزا کا ستحق نہیں ہوتا ، نہ زیادہ کا اور نہی کم کا، یہی واضح حق ہے، جس سے علیحدگی اختیار نہیں کی جاسکتی اور معتمد علماء نے اس کی تصریح کی ہے۔ ردالمحتار کے باب الحظر میں اما المكروه كراهة تنزیہ کے تحت ہے کہ بالا تفاق حلت کے زیادہ قریب ہے، یعنی اس کے مرتکب کو بالکل عذاب نہیں ہوگا لیکن تارک کو کچھ نہ کچھ ثواب ملے گا۔
( جلد 4 ، ص : 505 ، رضا فاؤنڈیشن )
اور مکروہ تنزیہی فعل کے باعث لوگوں کے دین کی جانب مائل ہونے اور اس سے روکنے کے بارے میں فرمایا:
اور عوام کو اللہ عزوجل کے ایسے ذکر سے منع کرنا جو شرعا گناہ نہ ہو، محض بدخواہی عام مسلمین ہے اور اس کا مرتکب نہ ہوگا، مگر متقشف کہ مقاصد شرع سے جاہل و نا واقف ہو یا متصلف کہ مسلمانوں میں اختلاف ڈال کر اپنی رفعت و شہرت چاہتا ہو، بلکہ ائمہ ناصحین تو یہاں تک فرماتے ہیں کہ منع کرنا اُس منکر سے ضرور ہے جو بالا جماع حرام ہو، بلکہ تصریحیں فرمائیں کہ عوام اگر کسی طرح یاد خدا میں مشغول ہوں ، ہر گز منع نہ کیے جائیں، اگر چہ وہ طریقہ اپنے مذہب میں حرام ہو، مثلاً سورج نکلتے وقت نماز حرام ہے اور عوام پڑھتے ہوں تو نہ روکے جائیں کہ کسی طرح وہ خدا کا نام تو لیں، اسے سجدہ تو کریں ، اگرچہ کسی دوسرے مذہب پر اس کی صحت ہو سکے ، ( جلد 9 صفحہ : 141 ، رضا فاؤنڈیشن)۔
مذکورہ مسئلے میں وتر کی جماعت کا ترک ، شائد نماز وتر کی ادائیگی میں بے رغبتی کا سبب تو نہ بنے لیکن اس سلسلے میں تنفر ضرور مشاہدہ کیا گیا ہے اور ازالہ فساد، جلب مصالح سے بہتر ہے کے تحت، اس کے ازالے یا سد باب کے سلسلے میں، مکروہ تنزیہی فعل کے ارتکاب کی اجازت دینا، غالباً عین مزاج شرع کے موافق ہوگا۔`
  },
  {
    pageNumber: 117,
    text: `(۴) بدگمانی، نا اتفاقی قلبی و زبانی غیبت و غیر با امور سے بچنا اور مسجد جیسی مقدس و محترم جگہ کو، ان گناہوں سے یکسر پاک وصاف رکھنا بھی از حد ضروری ہے۔ اگر غور کیا جائے تو جماعت وتر میں شرکت سے روکنا، مذکورہ امور میں ابتلاء کا سبب بن سکتا ہے، بلکہ بنتے دیکھا بھی گیا ہے، خصوصاً ان مقامات پر جہاں، ایک امام نے عوام کو قول ثانی پر عمل کی اجازت دی تھی، لیکن جب امام تبدیل ہوا اور اس نے قول اول کے نفاذ میں مبالغے سے کام لینے کی کوشش کی۔ یونہی یورپی ممالک کی نئی نسل، اس طرح کے اختلافات سے سخت متنفر دیکھی گئی ہے۔
(۵) ہر نیا دور، دین سے دوری کے لحاظ سے پہلے سے بڑھ کر ہوتا ہے اور یہ علماء کی ذمہ داری ہے کہ اہلِ زمانہ کی بدلتی ہوئی کیفیات وعادات پر گہری نظر رکھتے ہوئے، بوقتِ ضرورت، سابقہ مسائل میں ضروری تبدیلی پیدا کریں۔ یہی وجہ ہے کہ کبھی ایک زمانے کا مفتی بہ قول کسی دوسرے زمانے میں ، ضرورت صحیحہ کی بنا پر، غیر مفتی بہ ہو جاتا ہے۔ ظاہر الرواایہ کے برخلاف، دیگر شرائط کے ساتھ ، فقط بشہوت چھونے سے حکم حرمت ابدیہ کا اجراء اور عاقلہ بالغہ کی جانب سے، بلا اجازت ولی غیر کفو میں کیے گئے نکاح کو موقف کے بجائے، غیر نافذ ماننا، اس کی بہترین مثالیں ہیں۔ بلکہ بعض مواقع پر قول امام اعظم رحمۃ اللہ علیہ ترک کر کے کسی دوسرے امام کے قول پر فتوی دینا بھی روا رکھا گیا ہے ۔ الہندا اعلیٰ حضرت رحمۃ اللہ علیہ بھی اکابرین رحمۃ اللہ علیہم کی اسی سنت پر عمل پیرا ر ہے۔ فتاوی رضویہ میں اس کی بکثرت امثلہ ملاحظہ کی جاسکتی ہیں۔ موقع کی مناسبت سے صرف ایک مثال پیش خدمت ہے۔ سابقہ ادوار میں جنازے کے ساتھ بلند آواز سے ذکر کو مکروہ لکھا گیا۔ لیکن دورِ اعلیٰ حضرت رحمۃ اللہ علیہ میں، جب اس کے بارے میں مسلمانوں کے عمل مخالف کو ذکر کر کے وضاحت طلب کی گئی ، تو آپ نے فرمایا:
ہاں کتب حنفیہ میں جنازے کے ساتھ ذکر جہر کو مکر وہ لکھا ہے، جس طرح خود نفس ذکر جہر کو بکثرت کتب حنفیہ میں مکروہ بتایا، حالانکہ وہ اطلاعات قرآن عظیم و احادیث حضور سید المرسلین ﷺ سے ثابت ہے اور عند اتحقیق کراہت کا عروض نظر بعوارض خارجہ غیر لازم ہے۔ جیسا کہ علامہ خیر الدین رحمۃ اللہ علیہ استاد صاحب در مختار وغیرہ محققین نے تحقیق فرمایا اور ہم نے اپنے فتوئی میں اسے مفتح کیا، یہاں`
  },

  {
    pageNumber: 118,
    text: `بھی اس کا منشاء عوارض ہی ہیں ۔ قلب ہمراہیاں کا مشوش ہونا، یادموت سے دوسری طرف توجہ کرنا۔ انصاف کیجیے تو یہ حکم اس زمان خیر کے لیے تھا، جبکہ ہمراہیان جنازہ تصور موت میں ایسے غرق ہوتے تھے کہ گویا میت ان میں ہر ایک کا خاص اپنا کوئی جگر پارہ ہے، بلکہ گو یا خود ہی میت ہیں، ہمیں کو جنازہ پر لیے جاتے ہیں اور اب قبر میں رکھیں گے، والہذا علماء نے سکوت محض کونا پسند کیا تھا کہ کلام اگر چہ ذکر ہی ہو، اگر چہ آہستہ ہو، اس تصور سے کہ ( بغایت نافع اور مفید اور برسوں کے زنگ دل سے دھو دینے والا ہے ) روکے گا یا کم از کم دل بٹ تو جائے گا، تو اس وقت محض خاموشی ہی مناسب تر ہے، ورنہ حاش الله ذکر خدا عز و جل و رسول ﷺ نہ کسی وقت منع ہے۔ اب کہ زمانہ منقلب ہوا، لوگ جنازہ کے ساتھ اور دفن کے وقت اور قبروں پر بیٹھ کر لغویات و فضولیات اور دنیوی تذکروں بلکہ خندہ ولہو میں مشغول ہوتے ہیں، تو انہیں ذکر خدا اور رسول عز وجل وصل ﷺ کی طرف مشغول کرنا ، عین صواب و کار ثواب ہے ، مع ہذا جنازہ کے ساتھ ذکر جہر کی کراہت میں اختلاف ہے کہ تحریمی ہے یا تنزیہی ہے اور ترجیح بھی مختلف آئی۔ قنیہ میں کراہت تنزیہ کو ترجیح دی اور اسی پر فتاوی تتمہ میں جزم فرمایا اور یہی تجرید مجتبی و حاوی و بحر الرائق وغیر ہا کے لفظ ینبغی کا مفاد ہے اور ترک اولی اصلاً گناہ نہیں ، [[arabic: كَمَا نَصُّوْا عَلَيْهِ وَحَقَّقْنَاهُ فِي جُمَل مجلية]] ( جیسا کہ علماء نے اس کی صراحت فرمائی اور ہم نے رسالے جمل مجلية [[arabic: أَنَّ الْمَكْرُوهَ تَنْزِيهَا لَيْسَ بِمَعْصِيَةِ]]“ میں اس کی تحقیق کی ہے )۔`
  },
  {
    pageNumber: 119,
    text: `(ج: 9 ، ص: 140.141 ، رضا فاؤنڈیشن )
چونکہ ہمارے زمانے میں علمی اختلافات سے ناواقف اور صحبت علماء سے محروم عوام الناس کے لیے جماعت وتر میں شرکت ، تنہا نماز پڑھنے سے افضل، فوائد کثیرہ کی حامل اور کئی نقصانات سے حفظ کا سبب بھی ہے، لہذا مکروہ تنزیہی ہونے کو نظر انداز کرتے ہوئے، اس کی اجازت دینا ہی بہتر وافضل گمان ہوتا ہے، واللہ اعلم بالصواب
(5) حضرت علامہ مولانا مفتی محمد اسماعیل نورانی زِيدَ مَجْدُه:
[[arabic: الْجَوَابُ حَقٌّ وَالْحَقُّ أَحَقُّ أَنْ يُتَّبَعَ]] ، (28 جولائی 2018ء)۔

[[heading: مقتدی کو سہو ہوا تو اس پر سجدہ سہو واجب نہیں ہے]]
سوال: 
مقتدی امام کے ساتھ تکبیر اولیٰ سے شامل تھا، مقتدی نے غلطی سے دوسری رکعت میں التحیات کے بعد درود ابراہیمی پڑھ لیا، جس کی وجہ سے اس پر سجدہ سہو واجب ہو گیا ، اب وہ سجدہ سہو کیسے کرے گا، کیونکہ وہ امام کے ساتھ پہلی رکعت سے شامل ہے اور کیا اس کی نماز سجدہ سہو کے بغیر مکمل ہو جائے گی؟ ، (محمد ناظم ، ظفر وال )۔
جواب:
اگر امام کی اقتدا میں نماز پڑھتے ہوئے مقتدی سے نماز میں سہو واقع ہو جائے، تو اُس پر سجدہ سہو نہیں ہے، حدیث پاک میں ہے:
[[arabic: إِنَّ الْإِمَامَ يَكْفِي مَنْ وَرَائَهُ ، فَإِنْ سَهَا الْإِمَامُ فَعَلَيْهِ سَجْدَنَا السَّهْوِ وَ عَلَى مَنْ وَرَاثَهُ أَنْ يَسْجُدُوا مَعَهُ وَإِنْ سَهَا أَحَدٌ مِّمَّنْ خَلْفَهُ فَلَيْسَ عَلَيْهِ أَنْ يَسْجُدَ، وَالْإِمَامُ يَكْفِيهِ]]۔
ترجمہ: بے شک امام اپنے مقتدیوں کو کفایت کرتا ہے، پس اگر امام سے سہو واقع ہو تو اس پر سہو کے دو سجدے لازم ہیں اور اس میں مقتدی اُس کی پیروی کریں گے ، جماعت میں شامل کسی مقتدی سے انفرادی طور پر سہو ہو تو اس پر سجدہ سہو لازم نہیں ہے، امام ( کی نماز کی صحت ) اس کے لیے کافی ہے، (السنن الكبرى للبيهقي : 3884)۔`
  },
  {
    pageNumber: 120,
    text: `مراقی الفلاح میں ہے:
[[arabic: قَالَ : الْإِمَامُ لَكُمْ ضَامِنْ يَرْفَعُ عَنْكُمْ سَهْوَكُمْ وَقِرَ انَتَكُمْ]]
ترجمہ: رسول الله ﷺ نے فرمایا : امام ( نماز کی صحت کے لیے ) تمہارا ضامن ہے، وہ`
  },
{
  pageNumber: 121,
  text: `تمہارے سہو اور قراء ت کی ذمہ داری کو پورا کرلیتاہے ،(حاشیہ طحطاوی علی مراقی الفلاح، جلد2،ص:64)‘‘۔
علامہ علاءالدین کاسانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَأَمَّاالْمُقْتَدِیْ إذَاسَہَا فِی صَلَاتِہٖ فَلَا سَہْوَعَلَیْہِ،لِأَنَّہٗ لَا یُمْکِنُہُ السُّجُودُ،لِأَنَّہٗ إنْ سَجَدَ قَبْلَ السَّلَامِ کَانَ مُخَالِفًا لِلْإِمَامِ، وَإِنْ أَخَّرَہٗ إلٰی مَابَعْدَسَلَامِ الْإِمَامِ یَخْرُجُ مِنَ الصَّلَاۃِ بِسَلَامِ الْإِمَامِ]]‘‘۔
ترجمہ:’’ پس اگر مقتدی نماز میں بھول جائے تواس پر سجدۂ سہو لازم نہیں ہے،کیونکہ اس کے لیے سجدہ کرنا ممکن نہیں ہے،اس لیے کہ مقتدی نے اگرامام کے سلام پھیرنے سے پہلے سجدۂ سہو کیا تو امام کی مخالفت ہوگی اور اگر امام کے سلام پھیرنے کے بعد سجدہ کیاتو وہ امام کے سلام پھیرتے ہی نماز سے نکل جاتا ہے،(بدائع الصنائع، جلد1،ص:260)‘‘۔

[[heading: مقتدیوں کا بھول کر سلام پھیرنا]]
سوال: 
جس نمازی کی ایک یا چند رکعات جماعت سے رہ گئی ہوں اور وہ امام کے ساتھ سلام پھیردے تو کیا حکم ہے ،(ہارون الرشید، کراچی)

جواب:
مسبوق مقتدی کے سلام پھیرنے کی چند صورتیں ہیں: (۱) اس نے یہ گمان کرتے ہوئے دانستہ سلام پھیرا کہ اُسے امام کے ساتھ سلام پھیرنا ہے، تو اس کی نماز فاسد ہوجائے گی۔(۲)اُس نے بھول کر امام سے پہلے یا امام کے ساتھ سلام پھیرا ،تو اس پر سجدۂ سہو لازم نہیں ہے ،کیونکہ وہ ابھی امام کی اقتدا سے خارج نہیں ہوا اوراقتدا میں رہتے ہوئے مقتدی سے ایسی خطا ہوجائے ،جو سجدۂ سہو کا موجب ہے ،تو اس پر سجدۂ سہو لازم نہیں ہے ، بشرطیکہ اس نے نماز کو فاسد کرنے والا کوئی عمل نہ کیا ہو۔
(۳) اس نے بھول کر امام کے سلام پھیرنے کے بعد سلام پھیرا ،تو اس پر سجدۂ سہو لازم`
},
{
  pageNumber: 122,
  text: `ہوگا، کیونکہ امام کے سلام پھیرتے ہی وہ امام کی اقتدا سے باہر آگیا اور اب وہ منفرد کے حکم میں ہے ، فقہی دلائل درج ذیل ہیں:
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَلَوْ سَلَّمَ سَاہِیًا إنْ بَعْدَ إمَامِہٖ لَزِمَہُ السَّہْوُ وَإِلَّا ،لَا]]‘‘۔
ترجمہ:’’اور اگر( مسبوق نے)بھول کر سلام پھیردیاتواگر اس نے امام کے سلام پھیرنے کے بعد سلام پھیراہے، تو اس پر سجدۂ سہو لازم ہے اور اگراس نے بھول کرامام کے ساتھ سلام پھیرا ہے ، تواس پر سجدۂ سہو لازم نہیں ہے ‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وَلَوْ سَلَّمَ سَاہِیًا]]:قَیَّدَبِہٖ لِأَنَّہٗ لَوْ سَلَّمَ مَعَ الْإِمَامِ عَلٰی ظَنِّ أَنَّہٗ عَلَیْہِ السَّلَامُ مَعَہٗ، فَہُوَ سَلَامٌ عَمْدٌ، فَتَفْسُدُ، کَمَا فِی ’’الْبَحْرِ‘‘ عَنِ’’ الظَّہِیْرِیَّۃِ‘‘۔قَوْلُہٗ :’’[[arabic: لَزِمَہُ السَّہْوُ]]‘‘: لِأَنَّہٗ مُنْفَرِدٌ فِی ہٰذِہِ الْحَالَۃِ۔قَوْلُہٗ :’’[[arabic: وَإِلَّا، لَا]]‘‘:أَیْ وَإِنْ سَلَّمَ مَعَہٗ أَوْ قَبْلَہٗ لَا یَلْزَمُہٗ، لِأَنَّہٗ مُقْتَدٍ فِی ہَاتَیْنِ الْحَالَتَیْنِ، وَفِیْ ’’شَرْحِ الْمُنْیَۃِ‘‘ عَنِ ’’الْمُحِیْطِ‘‘: إنْ سَلَّمَ فِی الْاُوْلٰی مُقَارِنًا لِسَلَامِہٖ فَلَا سَہْوَ عَلَیْہ، لِأَنَّہٗ مُقْتَدٍ بِہٖ، وَبَعْدَہٗ یَلْزَمُ لِاَنَّہٗ مُنْفَرِدٌ‘‘۔
ترجمہ:’’اور اگر مسبوق نے بھول کر سلام پھیرا، یہاں بھولنے کی قید لگائی ہے ،کیونکہ اگر اس نے یہ گمان کر کے سلام پھیرا کہ اُسے امام کے ساتھ ہی سلام پھیرنا چاہیے ،تو یہ قصداً سلام پھیرنا ہے ،تو اس سے اُس مسبوق مقتدی کی نمازفاسد ہوجائے گی ، جیساکہ ’’البحرالرائق ‘‘ میں ’’ظہیریہ‘‘کے حوالے سے ہے۔ علامہ حصکفی کا یہ کہنا کہ مسبوق مقتدی اگر امام کے سلام پھیرنے کے بعد بھول کرسلام پھیرتاہے ،تواُس پر سجدۂ سہو اس لیے لازم آئے گا کہ اب وہ  منفردکے حکم میں ہے ۔علامہ حصکفی کا یہ کہنا کہ اگرمقتدی نے بھول کر امام کے ساتھ یا اس سے پہلے سلام پھیراہے ، تو اس پر سجدۂ سہو لازم نہیں ہے، کیونکہ ان دونوں حالتوں میں وہ بدستور مقتدی ہے(اور مقتدی کی خطا سے سجدہ سہو لازم نہیں آتا) ۔’’شرح المنیہ‘‘ میں ’’محیط‘‘کے حوالے سے ہے :’’ اگر مسبوق مقتدی نے بھول کر امام کے ساتھ سلام پھیراتو`
},
{
  pageNumber: 123,
  text: `اُس پر سجدہ سہو لازم نہیں ہے، کیونکہ وہ حالتِ اقتدا میں ہے ،اور اگراس نے امام کے بعد سلام پھیراتواس پر سجدۂ سہو لازم ہوگا ،کیونکہ اب وہ منفرد ہے(یعنی امام کے سلام پھیرتے ہی اقتدا سے باہر آچکا ہے)،(جلد3، ص:651، دمشق)‘‘۔

[[heading: نمازِ عید سے پہلے نفل پڑھنا]]
سوال:
کیا عید کے دن نمازِ عید سے پہلے نفل پڑھ سکتے ہیں ،(محمد حذیفہ جمشید، کوٹ ادو)۔
جواب:
نمازِ عید سے پہلے نفل پڑھنا مطلقاً مکروہ ہے ،خواہ گھر میں پڑھے یا عیدگاہ میں ،حتیٰ کہ عورت بھی گھر میں نفل پڑھنا چاہے تو نمازِ عید کے بعد پڑھے،نماز عید کے بعد صرف عیدگاہ میں نفل پڑھنا منع ہے ،گھر آکر پڑھ سکتے ہیں ،حدیث پاک میں ہے: ’’نبی صلی اللہ علیہ وسلم نے عیدالفطر کی نماز دو رکعت پڑھائی ،نہ اُس سے پہلے نماز پڑھی اور نہ اُس کے بعد (عیدگاہ میں)نماز پڑھی، (صحیح البخاری:964)‘‘۔ البتہ اگر کسی نے بدقسمتی سے عید کے دن فجر کی نماز اپنے وقت پر ادا نہ کی ہو اور سورج نکل آیا ہو ،تو وہ نمازِ عید سے پہلے فجر کی نماز قضا پڑھ سکتا ہے،کیونکہ فرض کی قضا فرض ہے ۔

[[heading: اذان سے پہلے صلوٰۃ وسلام پڑھنا منع نہیں ہے]] 
سوال: 
ایک شخص اذان سے پہلے صلوٰۃ وسلام پڑھنے کو گناہ کبیرہ قرار دے رہاہے ، رہنمائی فرمائیں،(سردارریاض احمد عباسی ، آزادکشمیر )۔
جواب:
حدیث پاک میں ہے :’’[[arabic: عَنْ عَبْدِ اللّٰہِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّہٗ سَمِعَ النَّبِیَّ ﷺیَقُوْلُ: إِذَا سَمِعْتُمُ الْمُؤَذِّنَ فَقُوْلُوْا مِثْلَ مَا یَقُوْلُ، ثُمَّ صَلُّوْا عَلَیَّ،فَإِنَّہٗ مَنْ صَلّٰی عَلَیَّ صَلَاۃً صَلَّی اللّٰہُ عَلَیْہِ بِہَا عَشْرًا،ثُمَّ سَلُوا اللّٰہَ لِیَ الْوَسِیلَۃَ،فَإِنَّہَا مَنْزِلَۃٌ فِی الْجَنَّۃِ،لَا تَنْبَغِی إِلَّا لِعَبْدٍ مِنْ عِبَادِ اللّٰہِ وَأَرْجُوْ أَنْ أَکُوْنَ أَنَا ہُوَ،فَمَنْ سَأَلَ لِی الْوَسِیلَۃَ]]`
},
{
  pageNumber: 124,
  text: `[[arabic: حَلَّتْ لَہُ الشَّفَاعَۃُ]]‘‘۔
ترجمہ:’’حضرت عبد اللہ بن عمرو بن العاص رضی اللہ عنہما بیان کرتے ہیں :رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب مؤذن کو اذان دیتے ہوئے سنو تو جیسے کلمات وہ کہتا ہے ،ویسے ہی کہو (یعنی کلمات ِ اذان کو دہراؤ)،پھر تم مجھ پر درود پڑھو ،کیونکہ جو شخص مجھ پر ایک بار درود پڑھے گا، اللہ تعالیٰ اس پر دس رحمتیں نازل فرمائے گا ،پھر میرے لیے جنت میں مقام وسیلہ(نمایاں مقام)کی دعا کرو ،کیونکہ یہ جنت میں ایک ایسا مقام ہے جو اللہ تعالیٰ اپنے صرف ایک (خاص) بندے کو عطا فرمائے گا اور مجھے یقین ہے کہ وہ ایک بندہ میں ہی ہوں ،تو جو (مومن ) میرے لیے مقام وسیلہ کی دعا مانگے گا، اس کی شفاعت مجھ پر لازم ہے‘‘۔
(صحیح مسلم : 384) 
اس حدیث مبارک کی رو سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:’’ جب مؤذن اذان دے رہاہو تو دوکلمات کے درمیان جو وہ سکتہ کرتاہے، اس میں ان کلمات کو دہراؤ اور اذان کے اختتام پر مجھ پر درود بھیجو ،کیونکہ جو مجھ پر درود بھیجے ، اللہ اس پر دس رحمتیں نازل فرماتاہے ، پھر وہ اللہ تعالیٰ سے میرے لیے مقامِ وسیلہ (جنت میں ایک نمایاں مقام جو آپ صلی اللہ علیہ وسلم کے لیے خاص ہے) کی دعاکرے ،وہ شفاعت کا حق دار بن گیا،(صحیح مسلم : 384)‘‘۔
پس اتّبا عِ سنّت کا تقاضا یہ ہے کہ اذان کے بعد درود شریف پڑھے ،لیکن اذان سے پہلے درود شریف پڑھنے کی ممانعت نہیں ہے ، درود شریف کسی وقت بھی پڑھا جاسکتاہے ۔ لہٰذا جو شخص اذان سے پہلے درود شریف پڑھنے کو گناہ کبیرہ یا بدعت قراردے ،یہ اپنی طرف سے شریعت وضع کرنے کے مترادف ہے، ایسے شخص کو اللہ تعالیٰ سے توبہ کرنی چاہیے ۔

[[heading: زوال وغروب کے وقت اذکار وتسبیحات پڑھنا بہتر ہے]] 
سوال: 
زوال اور غروبِ آفتاب کے وقت قرآن پاک کی تلاوت اور دیگر اذکار وتسبیحات`
},
{
  pageNumber: 125,
  text: `پڑھنا جائز ہے یا نہیں ؟،(ایم۔عدنان، کراچی)۔
جواب: 
زوالِ آفتاب کے وقت اور غروبِ آفتاب سے قبل کے بیس منٹ ، ان دونوں اوقات میں کسی بھی قسم کی نماز پڑھنا مکروہ و ممنوع ہے ، سوائے اس کے کہ جنازہ عین اُسی وقت آئے، تو پڑھاجاسکتاہے ،لیکن پہلے سے موجود جنازے کو تاخیر کرکے ان اوقات میں پڑھنا مکروہ ہے اورقراءت نماز کا رکن ہے اس لیے  بہتر یہ ہے کہ ان مکروہ اوقات میں قرآن مجید کی تلاوت نہ کی جائے، البتہ اَذکار اور تسبیحات و درود شریف پڑھ سکتے ہیں ۔
علامہ زین الدین ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَفِی الْبُغْیَۃِ:اَلصَّلَاۃُ عَلَی النَّبِیِّ ﷺ فِی الْاَوْقَاتِ الَّتِی تُکْرَہٗ فِیہَاالصَّلَاۃُ وَالدُّعَآءُ وَالتَّسْبِیْحُ أَفْضَلُ مِنْ قِرَائَۃِ الْقُرْآنِ ۔وَلَعَلَّہٗ لِاَنَّ الْقِرَائَۃَ رُکْنُ الصَّلَاۃِ وَہِیَ مَکْرُوہَۃٌ فَالْاَوْلٰی تَرْکُ مَا کَانَ رُکْنًا لَہَا]]‘‘۔
ترجمہ:اور ’’بُغْیَہ‘‘میں ہے :اُن اوقات میں جن میں نماز پڑھنا مکروہ ہے، نبی صلی اللہ علیہ وسلم پر درود پڑھنا ، دعا کرنا اور تسبیح پڑھنا قرآن کی تلاوت کرنے سے افضل ہے ،اِس کا سبب یہ ہے کہ قراء ت نماز کا رکن ہے اورنماز مکروہ اوقات میں مکروہ تحریمی ہے ،پس بہتریہ ہے کہ نماز کے رکن کو بھی( ان اوقات میں)ترک کیاجائے،(البحر الرائق،ج:1، ص: 437)‘‘۔پس ان اوقات میں اگرچہ قراء ت کرسکتے ہیں لیکن یہ خلافِ اَولیٰ ہے  اور اگر اس وقت قراءت کی اور دورانِ قراءت آیتِ سجدہ آگئی تو سجدہ کی تلاوت بھی کرسکتے ہیں۔ 

[[heading: نماز باجماعت کی صف بندی میں بچوں کی رعایت]]  
سوال:
آپ کے اس مفید اور علمی صفحے کے ذریعے میں آپ کی توجہ دو اہم مسائل کی طرف دلانا چاہتا ہوں ۔پہلایہ کہ آج کل بزرگوں کو نئی نسل سے یوں تو بہت شکایات ہیں، لیکن بڑی شکایت یہ ہے کہ نئی نسل اپنے دین سے بیگانہ ہے اور مساجد ویران ہیں، لیکن کیا کبھی`
},
{
  pageNumber: 126,
  text: `ہم نے اس کے اسباب پر غور کیاہے ۔ اس سلسلے میں ایک خاص بات جو میں نے نوٹ کی ہے وہ یہ کہ بڑوں کا رویہ اس معاملے میں مناسب نہیں ہے۔ خاص طور پر جمعے کے دن بچے سب سے پہلے تیار ہوکر مسجد میں آجاتے ہیں، بڑے لوگ عام طور پر آخری وقت میںآتے ہیں۔ جماعت کھڑی ہونے کے وقت امام صاحب یہ اعلان کردیتے ہیں کہ تمام بچے پچھلی صف میں چلے جائیں تو عام طور پر ہمارے جیسے چھوٹے علاقے کی مسجد کی آخری صف دراصل مسجد کے باہر ہوتی ہے، اس اعلان پر لوگ فوری طور پر عمل کرتے ہیں اور گرمی ہو یا سردی  بچوں کو اگلی صفوں سے نکال کر پیچھے کردیتے ہیں، جس کی وجہ سے بڑی خوشی سے نمازکے لیے آنے والے بچوںکے دل ٹوٹ جاتے ہیں۔ عام نمازوں میں بھی یہ ہوتا ہے کہ بچے جو کہ بڑے نمازیوں کی صف چھوڑ کر ان سے پچھلی صف میں کھڑے ہوتے ہیں بعد میں آنے والے بڑے ان کو نیت بندھی حالت میں کھسکاتے ہوئے پیچھے پہنچادیتے ہیں، جس سے اُن کے دل و دماغ پر مسجد میں باجماعت نماز پڑھنے کے بارے میں کوئی زیادہ اچھا اثر نہیں پڑتا۔ ہونا تو یہ چاہیے کہ خاص طور پر جمعے کے دن بڑے نمازی وقت سے پہلے پہنچنے کی کوشش کریں اور جب جماعت کھڑی ہو تو چھوٹے بچوں کو صفوں کے دائیں بائیں کھڑا کیا جائے نہ کہ سب سے پیچھے یا مسجد سے باہر ۔ ازراہِ کرم بتائیں کہ ہمارا دین تو آسانیاں پہنچانے والا اور انتہا پسندی سے روکنے والا مذہب ہے، وہ اس بارے میں کیا کہتا ہے،(ایس این اقبال، سرجانی ٹائون، کراچی)۔
جواب :
سب سے پہلے چند احادیث مبارکہ ملاحظہ ہوں: 
(۱) ’’[[arabic: قَالَ أَبُوْمَالِکٍ الْأَشْعَرِیُّ:أَلَا أُحَدِّثُکُمْ بِصَلَاۃِ النَّبِیِّ ﷺقَالَ:فَاَقَامَ الصَّلَاۃَ وَصَفَّ الرِّجَالَ وَصَفَّ خَلْفَہُمُ الْغِلْمَانَ،ثُمَّ صَلّٰی بِہِمْ فَذَکَرَ صَلَاتَہٗ،ثُمَّ قَالَ: ہٰکَذَا صَلَاۃٌ ،قَالَ عَبْدُ الْاَعْلَی: لَا أَحْسَبُہٗ إِلَّا قَالَ:صَلَاۃُ أُمَّتِیْ]]‘‘۔
ترجمہ:’’ابومالک اشعری بیان کرتے ہیں: میں تمہیں نبی صلی اللہ علیہ وسلم کی نماز کے بارے میں نہ`
},
{
  pageNumber: 127,
  text: `بتاؤں ؟،انہوںنے کہا: (نبی صلی اللہ علیہ وسلم نے) نماز کی اقامت کا حکم دیا ، پہلے مردوں کی صفیں بنائیں ، پھر ان کے پیچھے باشعور لڑکوں کی صفیں بنائیں ، پھر آپ صلی اللہ علیہ وسلم نے انہیں نماز پڑھائی ، پھرابومالک نے رسول اللہ صلی اللہ علیہ وسلم کی نماز کی کیفیت بیان کی اورکہا: نماز اس طرح ہوتی ہے  ، عبدالاعلیٰ کہتے ہیں : میں گمان کرتاہوں کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’ میری اُمّت کی نماز اس طرح ہے،(سنن ابودائود:677)‘‘۔
(۲)’’[[arabic: عَنْ أَبِیْ مَسْعُوْدٍ قَالَ: کَانَ رَسُوْلُ اللّٰہِ ﷺ یَمْسَحُ مَنَاکِبَنَا فِی الصَّلَاۃِ، وَیَقُوْلُ: اِسْتَوُوْاوَلَا تَخْتَلِفُوْا، فَتَخْتَلِفَ قُلُوبُکُمْ، لِیَلِنِیْ مِنْکُمْ أُولُوْ الْأَحْلَامِ وَالنُّہٰی ثُمَّ الَّذِینَ یَلُوْنَہُمْ، ثُمَّ الَّذِیْنَ یَلُوْنَہُمْ قَالَ أَبُوْ مَسْعُوْدٍ: فَأَنْتُمُ الْیَوْمَ أَشَدُّ اخْتِلَافًا]]‘‘۔
ترجمہ:’’ عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نماز میں صف بندی کے وقت ہمارے کندھے چھوتے اورفرماتے: برابر ہوجاؤاور (صفوں میں) فرق نہ کرو کہ اس کے سبب تمہارے دل جداہوجائیں گے ،تم میں سے میرے قریب بالغ اورعقلمند لوگ کھڑے ہوں، پھر وہ جو درجے میں ان کے قریب ہیں، پھر وہ جو درجے میں ان کے قریب ہیں، ابومسعود نے کہا: (صف بندی میں لاپرواہی کے سبب ) آج تم میں بہت اختلافات در آئے ہیں ،(صحیح مسلم:432)‘‘۔
کتب ِفقہ میں نماز کی صفوں کی ترتیب اس طرح درج ہے:
’’[[arabic: وَیَصُفُّ الرِّجَالُ،ثُمَّ الصِّبْیَانُ،ثُمَّ النِّسَاءُ،لِقَوْلِہٖ عَلَیْہِ السَّلَامُ: لِیَلِینِیْ مِنْکُمْ أُولُوالْاَحْلَامِ وَالنُّھٰی]]‘‘۔
ترجمہ:’’اور پہلے مردوں کی صفیں ہوں، پھر(باشعور) بچوں کی اور پھر عورتوں کی، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے:(جماعت میں)تم میں سے میرے قریب بالغ اور عقلمند ہونے چاہییں، (ہدایہ،جلد1، صفحہ:239)‘‘۔
تنویر الابصار مع الدرالمختار  میں ہے:
’’[[arabic: (الرِّجَالُ) ظَاہِرُہٗ یَعُمُّ الْعَبْدَ (ثُمَّ الصِّبْیَانُ) ظَاہِرُہٗ تَعَدُّدُہُمْ، فَلَوْ وَاحِدًا دَخَلَ]]`
},
{
  pageNumber: 128,
  text: `[[arabic: الصَّفَّ]]‘‘۔
ترجمہ:’’(نماز کی صفوں کی ترتیب میںپہلے) مرد ہوں گے، پھر بچے، بظاہر یہ اس صورت میں ہے کہ ان کی تعداد زیادہ ہو اور اگر ایک ہی بچہ ہو تو (مردوں کی) صف میں شامل ہوجائے گا۔‘‘
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: ذَکَرَہٗ فِی الْبَحْرِ بَحْثًا،قَالَ:وَکَذَا لَوْکَانَ الْمُقْتَدِیْ رَجُلًاوَصَبِیًّا یَصُفُّہُمَاخَلْفَہٗ لِحَدِیثِ أَنَسٍ، فَصَفَفْت أَنَاوَالْیَتِیْمُ وَرَائَہٗ وَالْعَجُوزُ مِنْ وَرَائِنَا وَہٰذَا بِخِلَافِ الْمَرْأَۃِ الْوَاحِدَۃِ فَإِنَّہَا تَتَاَخَّرُ مُطْلَقًا کَالْمُتَعَدِّدَاتِ لِلْحَدِیثِ الْمَذْکُورِ]]‘‘۔
ترجمہ:’’البحرالرائق‘‘ میں اس مسئلے پر بحث کرتے ہوئے فرمایا: اور اسی طرح اگر مقتدی صرف ایک مرد اور ایک بچہ ہوں تو وہ دونوں امام کے پیچھے اکٹھے صف بناکے کھڑے ہوں گے، کیونکہ حضرت انس رضی اللہ عنہ سے روایت ہے :میں نے اور یتیم نے آپ کے پیچھے صف بنائی اور بڑھیا ہمارے پیچھے تھیں، اور ایک بچے کا مسئلہ ایک عورت کے مسئلے سے مختلف ہے، کیونکہ عورتیں ایک ہوں یا زیادہ حدیث مذکور کی بناء پر ہر صورت میں پیچھے الگ صف میں کھڑی ہوں گی‘‘۔
(ردالمحتار علی الدرالمختار ، جلد :2 ،صفحہ:269-270،داراحیاء التراث العربی بیروت)
حدیث پاک کی روشنی میں پہلی صف میں امام کے پیچھے وسط ِصف میں ایسے عاقل وبالغ اور متشرع افراد ہونے چاہییں جو کسی ہنگامی صورت میں امام کی نیابت کرسکیں۔ باقی ترجیحی ترتیب تو یہی ہے کہ پہلے مردوں کی صفیں ہوں اور پھر بچوں کی، لیکن مذکورہ بالا فقہی عبارت سے ظاہر ہے کہ بوقت ِضرورت جب کہ اگلی صفیں نامکمل ہوں تو بچے بڑوں کے ساتھ کھڑے ہوسکتے ہیں۔ اگر اگلی صفیں نامکمل تھیں اور بچے درمیان میں آکر شامل ہوگئے تو بعد میں انہیں نکال کر پیچھے بھیجنا مروت کے خلاف ہے۔
آج کل عام طور پر مشاہدے میں آیا ہے کہ بچوں کوبالکل الگ تھلگ کرکے آخری`
},
{
  pageNumber: 129,
  text: `صف میں کھڑا کردیا جائے تو وہ دورانِ نماز شرارتیں کرتے ہیں اور اس طرح سارے نمازیوں کی یکسوئی اور حضورِ قلبی میں خلل واقع ہوتا ہے، اگر انہیں بڑوں کے درمیان کھڑا کیا جائے تو زیادہ باادب ہوکر پڑھتے ہیں اور بڑوں سے سیکھتے بھی ہیں اور جب بچے نیت باندھ کر آگے کی صف میں کھڑے ہوجائیں تو انہیں گھسیٹ کر پیچھے کرنا آدابِ نماز کے منافی ہے اور اگر اس کا سینہ قبلے سے پھرگیاتو اس کی نماز فاسد ہوجائے گی۔ لیکن یہاں ایسے بچے مراد ہیں جو باشعور ہوں، نماز اور مسجد کے آداب کو سمجھتے ہوں۔
الشیخ عبدالقادر الرافعی مُتوفّٰی 1323؁ھ لکھتے ہیں: 
[[arabic: قَالَ الرَّحمَتِی:رُبَمَا یَتعَیَّنُ فِی زَمَانِنَا اِدْخَالُ الصِّبْیَانِ فِیْ صُفُوْفِ الرِّجَالِ،لاَِنَّ الْمَعْہُوْدَ مِنْہُمْ اِذَا اجْتَمَعَ صَبِیَّانِ فَاَکْثَرُ تُبْطِلُ صَلَاۃُ بَعْضِہِمْ بِبَعْضٍ،وَرُبَّمَاتَعَدّٰی ضَرَرُہُمْ اِلٰی اِفْسَادِ صَلَاۃِ الرِّجَالِ،اِنْتَھٰی]]۔
ترجمہ:’’علامہ رحمتی نے کہا: ہمارے زمانے میں بچوں کو اکثر مردوں کے درمیان کھڑا کیاجاتاہے ،کیونکہ مشاہدے میں آیاہے کہ جب (نمازمیں) بچے ایک ساتھ جمع ہوجائیں تو (چھیڑچھاڑ کرکے) ایک دوسرے کی نماز فاسد کردیتے ہیں اوربعض صورتوں میںان کا ضرر مردوں کی نماز فاسد کرنے تک پہنچ جاتا ہے‘‘۔
(تقریرات الرافعی علی الردالمحتار علی الدرالمختار ، جلد1،ص:100)
بعض لوگ ایسے کم عمر اور ناسمجھ شرارتی بچوں کو اپنے ساتھ مسجد میں لے آتے ہیں، جو مسجد میں اِدھر اُدھر دوڑتے ہیں، نمازیوں کے آگے سے بے دھڑک گزرتے ہیں، شور مچاتے ہیں، کبھی جماعت کے دوران رونے  یا  ہنسنے لگتے ہیں، کبھی پیشاب بھی کرلیتے ہیں اور آج کل مساجد میں بالعموم قالینیں بچھی ہوتی ہیں، جن کو پاک کرنا کافی دشوار ہوتا ہے، تو ایسے بچوں کو مسجد میں لانا ہی شرعاً منع ہے،حدیث شریف میں ہے:
’’[[arabic: جَنِّبُوْا مَسَاجِدَکُمْ صِبْیَانَکُمْ وَمَجَانِیْنَکُمْ وَشِرَاءَکُمْ وَبَیْعَکُمْ وَخُصُوْمَاتِکُمْ وَرَفْعَ أَصْوَاتِکُمْ وَإِقَامَۃَ حُدُوْدِکُمْ وَسَلَّ سُیُوْفِکُمْ، وَاتَّخِذُوْا عَلٰی أَبْوَابِہَا الْمَطَاہِرَ وَجَمِّرُوْہَا فِی]]`
},
{
  pageNumber: 130,
  text: `[[arabic: الْجُمَعِ]]‘‘۔
ترجمہ:’’اپنی مسجدوں کو (ناسمجھ) بچوں، پاگلوں، لین دین کے معاملات،آپس کے جھگڑوں ، شعور وشغب، حدودِ شرعی کے قیام اور (ایک دوسرے پر)تلواریں سونتنے سے بچاکر رکھو اور جمعہ کے دن مسجد کے دروازوں پر صفائی کے لیے برتن رکھ دیاکرو اورکسی خوشبودار چیز کی دھونی دو، (سُنن ابن ماجہ:750)‘‘۔
تنویر الابصار مع الدرالمختار میں ہے:
’’[[arabic: وَیَحْرُمُ إدْخَالُ صِبْیَانٍ وَمَجَانِیْنَ حَیْثُ غَلَبَ تَنْجِیْسُہُمْ وَإِلَّا فَیُکْرَہٗ]]‘‘۔
ترجمہ:’’اور بچوں اور فاترالعقل لوگوں کا مسجد میں داخل کرنا حرام ہے، کیونکہ اکثر وہ ناپاک ہوتے ہیں، اور اگر ناپاک نہ ہوں تو مکروہِ تنزیہی ہے، (جلد:2 ص: 371)‘‘ ۔ 
یہاں حرام سے مراد مکروہِ تحریمی ہے۔ ہمیں بچوں کے معاملے میں افراط و تفریط سے بچنا چاہیے، ناسمجھ اورآدابِ مسجد کا شعور نہ رکھنے والے کم عمر  بچوں کو مسجد میں لے کر نہیں آناچاہیے اور باشعورو باادب بچوں کی حوصلہ شکنی بھی نہیں کرنی چاہیے، اگر وہ صفوں کے درمیان پہلے سے موجود ہیں تو انہیں گھسیٹ کرپیچھے نہیں کرنا چاہیے، یہ مروت اور بزرگانہ شفقت کے خلاف ہے، وہ بڑوں کے درمیان کھڑے ہوں گے تو باادب رہیں گے اور بڑوں سے سیکھیں گے۔

[[heading: معذور بیٹھ کر نماز پڑھ سکتاہے]] 
سوال:
بسا اوقات میں شدید تھک جاتا ہوں ،ہمت جواب دے جاتی ہے اور بڑی مشکل سے مسجد تک جاتا ہوں تو کیا ایسی صورت میں میرے لیے بیٹھ کر نماز ادا کرنا درست ہے، (حسنین احمد ،لاہور) ۔ 
جواب: 
اگر آپ مسجد تک جانے سے اتنے تھک جاتے ہیں کہ جماعت کے ساتھ کھڑے ہوکر`
},
{
  pageNumber: 131,
  text: `نماز نہیں پڑھ سکتے ،مگر گھر پر کھڑے ہوکر پڑھ سکتے ہیں ،تو گھر پر نماز پڑھ لیاکریں ۔لیکن ایساشخص جو قیام پر قادرہی نہیں، اُس کے لیے حکم یہ ہے کہ وہ زمین پر بیٹھ کر نماز پڑھے ،اگر زمین پر سر رکھ کر سجدہ نہیں کرسکتا تو حکم یہ ہے کہ وہ اشارے سے سجدہ کرے اور رکوع کی بہ نسبت سجدے کے لیے سر کو تھوڑا زیادہ نیچے جھکائے ۔ایسا معذور شخص اگر کرسی پر بیٹھ کر بھی نماز ادا کرے تو جائز ہے اوراس صورت میں رکوع اور سجود اشارے سے کرے ۔زمین پر رکھی ہوئی کسی شے پر سر رکھ کر سجدہ کرنے میں کوئی کراہت نہیں ،لیکن اُس شے کی بلندی موضع قدم (یعنی زمین سے )ایک یا دو اینٹوں کی مقدار(یعنی نوانچ) بلندی سے زائد نہ ہو ، علامہ کمال الدین ابن ہمام رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: فَلَوِارْتَفَعَ مَوْضِعَ السُّجُوْدِ عَنْ مَوْضِعِ الْقَدَمَیْنِ قَدْرَلَبِنَۃٍ أَوْلَبِنَتَیْنِ مَنْصُوْبَتَیْنِ جَازَ، لَا اِنْ زَادَ]]‘‘۔
ترجمہ:’’پس اگر سجدہ کی جگہ کوزمین سے ایک یا دو اینٹوں کی بلندی کی مقدار اٹھایا ہے تو (نماز ) جائز ہے اور اگر اِس مقدار سے زائد ہے تو جائز نہیں ہے ،(فتح القدیر ، ج:1، ص: 311،مطبوعہ:مرکز اہلسنّت برکات رضا ،ہند)‘‘۔کرسی اگرچہ زمین پر ہی رکھی ہوتی ہے ، لیکن اس کی اونچائی بیان کی گئی مقدار سے زیادہ ہوتی ہے ۔
علامہ بدرالدین عینی متوفی855؁ھ ’’البنایہ فی شرح الھدایہ‘‘میںلکھتے ہیں:
’’[[arabic: قَالَ: فَاِنْ لَّمْ یَسْتَطِعِ الرُّکُوْعَ وَالسُّجُوْدَأَوْمَاَ اِیْمَاءً یَعْنِیْ قَاعِدًالِأَنَّہٗ وَسِعَ مِثْلَہٗ، وَجَعَلَ سُجوْدَہٗ اَخْفَضَ مِنْ رُکُوْعِہٖ لِأَنَّہٗ قَائِمٌ مَّقَامَھُمَا،فَاَخَذَحُکمَھُمَا،وَلَایَرفَعُ اِلٰی وَجْھِہٖ شَیْءٌ یَسْجُدُعَلَیْہِ، لِقَوْلِہٖ عَلَیْہِ السَّلَامُ:وَاِنْ قَدَرْتَ أَنْ تَسْجُدَ عَلَی الْاَرْضِ فَاسْجُدْ وَاِلَّافَاَوْمِ بِرَأسِکَ وَاِنْ فَعَلَ ذٰلِکَ وَھُوَ یَخْفِضُ رَاْسَہٗ اَجْزَأَہٗ لِوُجُوْدِالْاِیْمَاءِ]]‘‘۔
ترجمہ:’’ (ماتن نے )کہا:اگرنمازی رکوع وسجود کی طاقت نہیں رکھتا،تو (رکوع وسجود) کے لیے بیٹھ کر اشارہ کرے ،کیونکہ وہ اسی کی طاقت رکھتاہے اور سجدوں کے لیے رکوع کی نسبت سرکو زیادہ جھکائے کیونکہ اشارہ ہی رکوع وسجود کے قائم مقام ہے ،تو اس کا حکم وہی ہوگااور سجدہ کرنے کے لیے اپنے چہرے کی طرف کوئی چیز نہ اٹھائے،کیونکہ رسول اللہ صلی اللہ علیہ وسلم کا یہی ارشاد ہے :’’اور اگرتم زمین پر سجدہ کرنے کی طاقت رکھتے ہو،تو سجدہ کرو ،ورنہ سر سے`
},
{
  pageNumber: 132,
  text: `اشارہ کرو‘‘اور اگر وہ سر کو جھکاکر اس طرح سجدہ کرتاہے تو یہ (ادائے فرض کے لیے) کافی ہے ، کیونکہ اشارہ پایاگیا‘‘۔(جلد3،ص:193تا196،مکتبۂ حقانیہ ،ملتان)
اگر کوئی شخص صف میں کھڑے ہوکر اشارے سے رکوع وسجود نہ کرسکتاہو اوربیٹھ بھی نہ سکتاہو تو گھر پر جیسا اس سے ہوسکے نماز پڑھ لے ،وہ جماعت سے معذور ہے ۔ باجماعت نمازوں میں صفوں کے درمیان کرسی رکھنے سے ’’تسویۃ الصف ‘‘یعنی صف کی برابری کی سنّت اداہوہی نہیں سکتی ۔ ہماری نظر میں جب تک بندہ بیٹھ کر،خواہ التحیات کی وضع میں ہو یا پاؤں دائیں جانب نکال کر یا آلتی پالتی مارکر بیٹھ سکتاہو، حتی الامکان بیٹھ کر نماز پڑھے۔

[[heading: دورانِ جماعت جب مقتدی جماعت میں شامل ہو]]
سوال: 
امام کے رکوع کے بعد پہلے یا دوسرے سجدے میں کوئی مقتدی شامل ہوا،نماز کے آخر میں اپنی بقیہ رکعت بھی پڑھ لی ،آٹھ سجدوں کے بجائے نو سجدے اداکرلیے تو کیانماز مکمل ہوجائے گی ،(محمد ناظم ،نارووال)۔
جواب:
حدیث پاک میں ہے :
’’[[arabic: عَنْ عَبْدِ اللّٰہِ بْنِ أَبِیْ قَتَادَۃَعَنْ أَبِیْہِ،قَالَ:بَیْنَمَا نَحْنُ نُصَلِّی مَعَ النَّبِیِّ ﷺ إِذْ سَمِعَ جَلَبَۃَ رِجَالٍ،فَلَمَّا صَلّٰی قَالَ:مَا شَاْنُکُمْ،قَالُوْا:اِسْتَعْجَلْنَا إِلَی الصَّلاَۃِ،قَالَ:فَلاَ تَفْعَلُوْا إِذَا أَتَیْتُمُ الصَّلاَۃَ فَعَلَیْکُمْ بِالسَّکِیْنَۃِ، فَمَا أَدْرَکْتُمْ فَصَلُّوْا وَمَا فَاتَکُمْ فَاَتِمُّوْا]]‘‘۔
ترجمہ:’’ حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں: جس وقت ہم نبی صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ رہے تھے ،اچانک آپ کو لوگوں کی آہٹیں اور آوازیں سنائی دیں ،آپ صلی اللہ علیہ وسلم نے نماز پڑھنے کے بعد فرمایا: تمہیں کیاہواتھا؟،انہوں نے عرض کی : ہم جماعت میں شامل`
},
{
  pageNumber: 133,
  text: `ہونے کے لیے جلدی کررہے تھے ،آپ صلی اللہ علیہ وسلم نے فرمایا: تم ایسانہ کرو ،جب تم نمازپڑھنے کے لیے آؤ توتم اطمینان اور سکون کے ساتھ آؤ ،تم کو(امام کے ساتھ) جتنی نماز مل جائے ،اس کو پڑھ لو اور جتنی نماز تم سے فوت ہوجائے ،اسے (آخر میں) پوری کرلو،(صحیح بخاری:635) ‘‘ ۔
اس حدیث کے مطابق مقتدی کو چاہیے کہ سکون واطمینان کے ساتھ جماعت میں شامل ہونے کے لیے آئے اور امام کے ساتھ نماز میں شامل ہوجائے اورامام کے سلام پھیرنے کے بعد اپنی بقیہ نماز پوری کرلے ۔جتنی نماز ملنے کا واضح مطلب یہ ہے کہ اگر امام پہلے یا دوسرے سجدے میں ہے ،تو سجدہ میں شامل ہوجائے ،یہ اضافی یا زائد سجدہ نماز کی تکمیل میں مانع نہیں ہوگا اور امام کے سلام پھیرنے کے بعد بقیہ نماز پوری کرنے پر نماز کامل شمار ہوگی ۔ مسبوق مقتدی مکمل رکعات کے علاوہ امام کی اقتدا میں جو اضافی سجدہ یا قعدہ کرے گا ،اس پر اسے اجرکی اُمید رکھنی چاہیے ۔بعض لوگ امام کو سجدے یا قعدے میں دیکھ کر کھڑے رہتے ہیں اور امام جب نئی رکعت کے لیے کھڑا ہوتاہے ،تو شامل ہوجاتے ہیں،  ایسا نہ کریں ،بلکہ امام جس مرحلے میں بھی ہو نیت کرکے جماعت میں شامل ہوجائیں ، آپ کے ہر سجدے ،تسبیح اور قعدے پر آپ کو اجر ملے گا ، ان شاء اللہ تعالیٰ۔
امام ترمذی نے اپنی سُنَن میں باب باندھا ہے :’’[[arabic: بَابُ مَا ذُكِرَ فِي الرَّجُلِ يُدْرِكُ الْإِمَامَ وَهُوَ سَاجِدٌ كَيْفَ يَصْنَعُ]]‘‘،ترجمہ:’’کوئی شخص امام کو سجدے کی حالت میں پائے تو کیا کرے‘‘، اس کے تحت انہوں نے حضرت معاذ بن جبل رضی اللہ عنہ کی یہ حدیث نقل کی ہے: 
’’[[arabic: قَالَ النَّبِيُّ ﷺ: إِذَا أَتٰى أَحَدُكُمُ الصَّلاَةَ وَالْإِمَامُ عَلٰى حَالٍ فَلْيَصْنَعْ كَمَا يَصْنَعُ الإِمَامُ]]‘‘۔
ترجمہ:’’نبی صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی نماز کے لیے آئے اور امام کسی حال میں ہو (یعنی حالتِ رکوع  یا قیام  یا سجدہ یا تشہدمیں ہو)تو وہی کرے جو امام کر رہا ہے، (ترمذی:591)‘‘۔ امام ابوعیسیٰ نے کہا ہے: ’’یہ حدیث غریب ہے اور صرف اسی طریق`
},
{
  pageNumber: 134,
  text: `سے مروی ہے ،لیکن اہلِ علم کا اس پر عمل ہے، انہوں نے کہا:کوئی شخص آئے اور امام کو سجدے میں پائے تو امام کے ساتھ سجدے میں شامل ہوجائےاوراگر امام کے ساتھ رکوع فوت ہوگیا ہے تو یہ رکعت ادا نہ ہوئی (یعنی مسبوق اس کو امام کے سلام پھیرنے کے بعد ادا کرے )اور عبداللہ بن مبارک نے بھی اسی کو اختیار کیا ہے کہ امام کے ساتھ سجدے میں شامل ہوجائے اور انہوں نے بعض ائمہ سے نقل کیا ہے :امید کی جاتی ہے کہ اس سجدے سے سر اٹھانے سے پہلے اس کی مغفرت کردی جائے گی‘‘۔ 

[[heading: نابینا کی امامت]] 
سوال:
کیا نابینا امام کے پیچھے نماز پنجگانہ اور نمازِ جنازہ ادا کی جاسکتی ہے، (عرفان احمد، آزاد کشمیر)۔
جواب:
نابینا شخص اگر احتیاط برتتا ہے یعنی کپڑوں یا بدن پر کوئی چیز لگ جائے تو کسی بینا شخص کو دکھا کر اطمینان کرلیتا ہے کہ کہیں نجاست تو نہیںلگی اور اگر نجاست لگ گئی ہو تو دھو لیتاہے ، ایسے نابینا کی امامت جائز ہے ،مگرمکروہ ِ تنزیہی ہے اور اگروہ حاضرین میں مسائل نمازکا سب سے زیادہ جاننے والا ہے، تو اس کی امامت بلا کراہت جائز ہے۔
امام ابو داؤد سجستانی رحمۃ اللہ علیہ اپنی سند کے ساتھ بیان کرتے ہیں :
’’[[arabic: عَنْ أَنَسٍ اَنَّ النَّبِیَّ ﷺ اِسْتَخْلَفَ ابْنَ أُمِّ مَکْتُوْمٍ یَؤ ُمُّ النَّاسَ وَھُوَ أَعْمیٰ]]‘‘ ۔
ترجمہ: ’’حضرت انس رضی اللہ عنہ بیان کرتے ہیں: نبی کریم صلی اللہ علیہ وسلم نے (غزوۂ تبوک کے موقع پرعبداللہ)بن اُمِّ مکتوم کو (مدینہ منورہ میں ) اپنا خلیفہ بنایا تاکہ وہ لوگوں کی امامت کریں،حالانکہ وہ نابینا تھے ، (سنن ابو داؤد : 595 )‘‘۔
اس کی شرح میں علامہ علی القاری الحنفی رحمۃ اللہ علیہ لکھتے ہیں : 
ابن الملک نے کہا :نابینا کی امامت کی کراہت اس صورت میں ہے کہ قوم میں اس کے`
},
{
  pageNumber: 135,
  text: `مقابلے میں تندرست شخص اس سے بڑا عالم یا اس کے برابر درجے کا عالم موجود ہو،علامہ ابن حجر نے کہا: اس میں نابینا کی امامت کا جواز ہے اور اس میں کوئی اختلاف نہیں ، اختلاف صرف اس بات میں ہے کہ بینا کی امامت اَولیٰ ہے یا نابینا کی (جبکہ دونوں دستیاب ہوں)، (مرقاۃ المفاتیح،جلد:3،ص :84مکتبۂ امدادیہ ،ملتان ) ‘‘ ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: (وَیَکْرَہٗ)تَنْزِیْہاً(اِمَامَۃَُأَعْمٰی)وَنَحْوِہِ الْاَعْشٰی’’نَہْرٌ‘‘(إلَّا أَنْ یَّکُوْنَ) أَیْ غَیْرُ الْفَاسِقِ (أَعْلَمَ الْقَوْمِ) فَہُوَ أَوْلٰی]]‘‘۔
ترجمہ: ’’نابینا اور ایسا شخص جسے رات کو نظر نہ آتا ہو ، اس کی امامت مکروہ تنزیہی ہے(بحوالہ النہر الفائق ) اور اگر یہ زیادہ صاحب علم ہوتو اس کی امامت بہتر ہے،  (جلد:2،ص: 254,255، بیروت )‘‘۔چونکہ علامہ حصکفی نے نابینا کا ذکر فاسق اور اَعرابی کے سیاق میں کیا ہے ، اس لیے اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَحَاصِلُہٗ:أَنَّ قَوْلَہٗ إلَّا أَنْ یَکُوْنَ أَعْلَمَ الْقَوْمِ خَاصٌّ بِالْأَعْمٰی،أَمَّا غَیْرُہٗ فَلَا تَنْتَفِیْ الْکَرَاہَۃُ بِعِلْمِہٖ]]‘‘۔
ترجمہ:’’اس بحث کا حاصل یہ ہے علامہ حصکفی کا یہ قول کہ’’اگر وہ پوری قوم سے زیادہ عالم ہو ‘‘(تووہ نابینا امامت کا زیادہ حق دار ہے ) نابینا کے ساتھ خاص ہے ،جہاں تک غیرِ نابینا (مثلاً فاسق کی امامت) کا تعلق ہے ، تو علم کی بنا پراس کی کراہت منتفی نہیں ہوگی ۔۔۔۔اور آگے چل کر لکھتے ہیں :کہ اگر نابینا دوسروں کے مقابلے میں زیادہ عالم ہے تو استحقاقِ امامت کا معاملہ بالکل برعکس ہوگا (یعنی نابینا عالم ہی زیادہ حق دار ہوگا )‘‘۔
 (ردالمحتار علی الدرالمختار ج:2، ص:255، بیروت)
امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْزسے سوال ہوا :’’ اندھے کے پیچھے نماز پڑھنا مکروہ تنزیہی یا تحریمی ہے یا نہیں اور یہ امامت کے واسطے سزاوار ہے یا نہیں‘‘، آپ جواب میں لکھتے ہیں :’’ اندھا اگر تمام موجودین میں سب سے زیادہ مسائل کا جاننے والا نہ ہو اور`
},
{
  pageNumber: 136,
  text: `اس کے سوا دوسرا صحیح القرا ء ت، صحیح العقیدہ ،غیر فاسقِ مُعْلِنْ حاضر جماعت ہے، تو اندھے کی امامت مکروہِ تنزیہی ہے اور اگر وہی سب سے زیادہ علم ِ نماز رکھتا ہے، تو اسی کی امامت افضل ہے،(فتاویٰ رضویہ ، جلد 6،ص:520رضا فاؤنڈیشن ،لاہور )‘‘۔
علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں : 
’’نابینا کی امامت مکروہ تنزیہی ہے ،جبکہ دوسرے لوگ مسائل طہارت ونماز میں اس سے زائد یا اس کے برابر ہوں اور اگر سب سے زائد یہی علم رکھتا ہو ، تو اس کی امامت میں اصلاً کراہت نہیں ، بلکہ اس صورت میں اسی کو امام بنانا بہتر ہے، بحرالرائق میں ہے :
’’[[arabic: وَقَيَّدَ كَرَاهَةَ إمَامَةِ الْاَعْمٰى فِي الْمُحِیْطِ وَغَيْرِهِ بِاَنْ لَا يَكُونَ أَفْضَلَ الْقَوْمِ، فَإِنْ كَانَ أَفْضَلَهُمْ فَهُوَ أَوْلٰى]]‘‘۔
ترجمہ:’’اندھے کی امامت کے مکروہ ہونے کو ’’المحیط‘‘ وغیرہ کتب میں اس بات کے ساتھ مقید کیا  ہے کہ وہ قوم (حاضرینِ جماعت) میں سب سے بڑھ کر افضل نہ ہو، ورنہ تو پھر اُسی کو امام بنانا اولیٰ ہے،(البحر الرائق،ج:۱، ص:۳۶۹)‘‘۔
مکروہ تنزیہی ناجائز نہیں ہوتا مگر اس سے بچنا بہتر ، اور کرنا برا ہے، مگر گناہ نہیں، (فتاویٰ امجدیہ جلد اول ص: 107مطبوعہ مکتبۂ رضویہ، آرام باغ ،کراچی )۔

[[heading: نمازِ تہجد کا افضل وقت]] 
سوال:
تہجد کا مقبول وقت کیا ہے؟،( مجیب خان ،احمدپورشرقیہ)۔
جواب:
عشاء کے بعد سو کر اٹھیں اور نوافل پڑھیں ،وہ تہجد ہیں ۔
صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں: 
’’ جو شخص تہائی رات سونا چاہے اور ایک تہائی عبادت کرنا ،اُس کے لیے افضل یہ ہے کہ پہلی اور پچھلی تہائی میں سوئے اوردرمیان کی تہائی میں عبادت کرے اور اگر نصف شب میں سونا`
},
{
  pageNumber: 137,
  text: `چاہتاہے اور نصف جاگنا تو پچھلی نصف میں عبادت افضل ہے ،حدیث پاک میں ہے : 
’’[[arabic: یَنْزِلُ رَبُّنَا تَبَارَکَ وَتَعَالٰی کُلَّ لَیْلَۃٍ إِلَی السَّمَاءِ الدُّنْیَا،حِینَ یَبْقٰی ثُلُثُ اللَّیْلِ الْاٰخِرِ، فَیَقُوْلُ: مَنْ یَّدْعُوْنِیْ فَأَسْتَجِیْبُ لَہٗ وَمَنْ یَّسْاَلُنِیْ فَاُعْطِیَہٗ وَمَنْ یَّسْتَغْفِرُنِیْ فَاَغْفِرَ لَہٗ]]‘‘۔
ترجمہ: ’’ رات کے پچھلے پہر جب ایک تہائی رات باقی رہ جاتی ہے ،تو اللہ تعالیٰ آسمانِ دنیاپر خاص تجلی فرماتاہے اورندا فرماتاہے :’’ہے کوئی دعا کرنے والا کہ اُس کی دعا قبول کروں ، ہے کوئی مانگنے والا کہ اُسے دوں ،ہے کوئی مغفرت چاہنے والا کہ اس کی بخشش کردوں‘‘۔
(صحیح مسلم: 758)، (بہارِ شریعت ،جلد اول،ص:678) 

[[heading: نمازِ عشاء کی بابت ایک سوال]] 
سوال:
اگر کوئی شخص عشاء کی نماز (فرض)پڑھے بغیر سو گیا اور وہ نماز فجر سے دو گھنٹے قبل اٹھ کر عشاء کی نماز ادا کرتا ہے اور تہجد پڑھتا ہے تو اس کی دونوں نمازیں ہو جائیں گی؟،( مجیب خان ،احمدپورشرقیہ)۔
جواب:
نمازِعشاء کی ادائیگی میں تہائی رات تک تاخیر کرنا مستحب ہے اور آدھی رات تک تاخیر مباح ،اتنی تاخیر کہ رات ڈھل گئی ،مکروہ ہے کیونکہ یہ جماعت کی تعداد کم ہونے کا سبب ہے۔  مذکورہ وقت میں نمازِ عشاء اور تہجد دونوں ادا ہوجائیں گے ،حدیث پاک میں ہے : 
(۱)’’[[arabic: عَنْ أَبِیْ بَرْزَۃَأَنَّ رَسُوْلَ اللّٰہِ ﷺ کَانَ یَکْرَہُ النَّوْمَ قَبْلَ الْعِشَاءِ وَالْحَدِیْثَ بَعْدَہَا]]‘‘۔
ترجمہ:’’ حضرت ابو برزہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم عشاء سے پہلے سونے کو ناپسند کرتے تھے اورعشاء کے بعد (فضول) باتیں کرنے کو، (صحیح بخاری:568)‘‘۔
(۲)’’[[arabic: حَدَّثَنَا عَبْدُ اللّٰہِ بْنُ عُمَرَ:أَنَّ رَسُوْلَ اللّٰہِ ﷺشُغِلَ عَنْہَا لَیْلَۃً،فَأَخَّرَہَاحَتّٰی]]`
},
{
  pageNumber: 138,
  text: `[[arabic: رَقَدْنَافِی الْمَسْجِدِ،ثُمَّ اسْتَیْقَظْنَا،ثُمَّ رَقَدْنَا،ثُمَّ اسْتَیْقَظْنَا،ثُمَّ خَرَجَ عَلَیْنَا النَّبِیُّ ﷺ،ثُمَّ قَالَ:لَیْسَ أَحَدٌ مِّنْ أَہْلِ الْاَرْضِ یَنْتَظِرُ الصَّلاَۃَ غَیْرُکُمْ وَکَانَ ابْنُ عُمَرَ:لاَ یُبَالِیْ أَقَدَّمَہَا أَمْ أَخَّرَہَاإِذَا کَانَ لاَ یَخْشٰی أَنْ یَّغْلِبَہُ النَّوْمُ عَنْ وَقْتِہَاوَکَانَ یَرْقُدُ قَبْلَہَا]]‘‘۔
ترجمہ:’’ حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں: ایک رات رسول اللہ صلی اللہ علیہ وسلم کسی کا م میں مشغول تھے ،تو آپ صلی اللہ علیہ وسلم نے عشاء کی نماز کو مؤخر کردیا ،حتیٰ کہ ہم مسجد میں سوگئے ،پھر ہم بیدار ہوئے ،پھر ہم سوگئے ،پھر ہم بیدار ہوئے،پھر آپ صلی اللہ علیہ وسلم ہمارے پاس نکل کر تشریف لائے،پھر آپ نے فرمایا:تمام روئے زمین پر اس نماز کا تمہارے سوااورکوئی انتظار نہیں کررہا اور حضرت ابن عمر رضی اللہ عنہما اس کی کوئی پرواہ نہیں کرتے تھے کہ عشاء کی نماز مقدّم کریں یا مؤخّر کریں جب کہ انہیں یہ خطرہ نہ ہو کہ نیند کے غلبہ کی وجہ سے عشاء کا وقت نکل جائے گا اوروہ عشاء پڑھنے سے پہلے سوجاتے تھے ،(صحیح بخاری: 570)‘‘ ۔ 
(۳)’’[[arabic: عَنْ أَبِیْ ہُرَیْرَۃَقَالَ:قَالَ النَّبِیُّ ﷺ:لَوْلَا أَنْ أَشُقَّ عَلٰی أُمَّتِی لَاَمَرْتُہُمْ أَنْ یُؤَخِّرُواالْعِشَاءَ إِلٰی ثُلُثِ اللَّیْلِ أَونِصْفِہٖ]]‘‘۔ 
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی صلی اللہ علیہ وسلم نے فرمایا: اگر میری اُمّت پر دشوار نہ ہوتا تو میں اُنہیں عشاء کی نماز تہائی رات یا نصف رات تک مؤخر کرنے کا حکم دیتا ، (سُنن ترمذی:168)‘‘۔
علامہ زین الدین ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: (قَوْلُہٗ:وَالْعِشَاءُ إلَی الثُّلُثِ)أَیْ نُدِبَ تَأْخِیرُہَاإلٰی ثُلُثِ اللَّیْلِ لِمَارَوَاہُ التِّرْمِذِیُّ وَصَحَّحَہٗ:لَوْلَاأَنْ أَشُقَّ عَلٰی أُمَّتِی لَأَخَّرْتُ الْعِشَاءَ إلٰی ثُلُثِ اللَّیْلِ أَوْنِصْفِہٖ وَفِی مُخْتَصَرِالْقُدُورِیِّ إلٰی مَا قَبْلَ الثُّلُثِ لِرِوَایَۃِ الْبُخَارِیِّ: کَانُوا یُصَلُّونَ الْعَتَمَۃَ فِیمَا بَیْنَ أَنْ یَّغِیْبَ الشَّفَقُ إلٰی ثُلُثِ اللَّیْلِ وَمُقْتَضَاہُ أَنَّہٗ لَا یُسْتَحَبُّ تَاْخِیْرُہَا إلٰی الثُّلُثِ بِخِلَافِ الْأَوَّلِ وَ وُفِّقَ بَیْنَہُمَا فِی شَرْحِ الْمَجْمَعِ لِابْنِ الْمَلِکِ بِحَمْلِ الْأَوَّلِ عَلَی الشِّتَاءِ]]`
},
{
  pageNumber: 139,
  text: `[[arabic: وَالثَّانِیْ عَلَی الصَّیْفِ لِغَلَبَۃِ النَّوْمِ.وَأَطْلَقَہٗ فَشَمِلَ الصَّیْفَ وَالشِّتَاءَ وَقِیْلَ:یُسْتَحَبُّ تَعْجِیْلُ الْعِشَاءِ فِی الصَّیْفِ لِئَلَّا تَتَقَلَّلَ الْجَمَاعَۃُ وَأَفَادَأَنَّ التَّاْخِیْرَ إلٰی نِصْفِ اللَّیْلِ لَیْسَ بِمُسْتَحَبٍّ وَقَالُوْا: إنَّہٗ مُبَاحٌ وَإِلٰی مَا بَعْدَہٗ مَکْرُوْہٌ وَقِیْلَ إلٰی مَا بَعْدَ الثُّلُثِ مَکْرُوْہٌ وَرَوَی الْإِمَامُ أَحْمَدُ وَغَیْرُہٗ أَنَّہٗ عَلَیْہِ الصَّلَاۃُ وَالسَّلَامُ کَانَ یَسْتَحِبُّ أَنْ یُؤَخِّرَ الْعِشَاءَ وَکَانَ یَکْرَہُ النَّوْمَ قَبْلَہَا وَالْحَدِیْثَ بَعْدَہَا وَقَیَّدَ الطَّحَاوِیُّ کَرَاہَۃَ النَّوْمِ قَبْلَہَا بِمَنْ خُشِیَ عَلَیْہِ فَوْتُ وَقْتِہَا أَوْ فَوْتُ الْجَمَاعَۃِ فِیْہَا وَإِلَّا فَلَا]]‘‘۔
ترجمہ:’’امام ابوالبرکات عبداللہ بن احمد بن محمود نسفی کا یہ قول:’’ عشاء کی نماز میں تہائی رات تک تاخیر مستحب ہے ‘‘، کیونکہ اس حدیث کو امام ترمذی نے روایت کیا اور صحیح کہاہے : ’’اگرمیں  اپنی امت کے لیے دشواری محسوس نہ کرتا تو میں نمازِ عشاء کو نصف شب یا تہائی شب تک مؤخر کرتا ‘‘اور’’ مختصر القدوری ‘‘میں صحیح بخاری کی روایت میں  تہائی رات سے قبل پڑھنے کا حکم ہے :’’عشاء کی نماز کو وہ شفق (کی سفیدی ) غائب ہونے کے بعد تہائی رات کے اول حصہ تک مؤخر کرتے تھے ‘‘۔ اس  روایت کاتقاضا یہ ہے کہ پہلے قول کے برعکس تہائی رات تک تاخیر کرنامستحب نہیں ہے ،’’ابن الملک ‘‘ کی ’’شرح المجمع‘‘ میں ان دونوں اقوال کے درمیان موافقت یوںبیان کی گئی ہے کہ پہلے قول کو موسمِ سرماپر محمول کریں گے اور دوسرے قول کو موسمِ گرما پر،کیونکہ اس موسم میں نیند کا غلبہ ہوتاہے اور بعض نے مطلق بات کی ہے ،پس یہ موسمِ گرما وسرما دونوں کو شامل ہے  اورایک قول یہ ہے کہ موسمِ گرما میں عشاء کی نماز جلد پڑھنا مستحب قرار دیاگیاہے ،کیونکہ تاخیر سے جماعت کی تعداد کم ہونے کا اندیشہ ہے ۔اس سے معلوم ہواکہ نصف رات تک تاخیر مستحب نہیں ہے،بعض فقہاء نے کہا: عشاء کی نماز نصف شب تک مؤخر کرنا مباح ہے اورنصف شب کے بعد تک مؤخرکرنا مکروہ ہے ، ایک قول کے مطابق تہائی رات کے بعد تاخیر کرنا مکروہ ہےاور امام احمد ودیگر مُحدّثین نے روایت کیاہے کہ آپ ﷺ عشاء میں تاخیر کو پسند فرماتے تھے اور عشاء سے پہلے سونے اورعشاء کے بعد باتیں کرنے کو ناپسند فرماتے تھے ۔  امام طحاوی نے عشاء سے پہلے سونے کو ان لوگوں`
},
{
  pageNumber: 140,
  text: `کے لیے مکروہ کہاہے ،جن کے لیے (نیند کے سبب) نماز یا جماعت فوت ہونے کا اندیشہ ہو ، ورنہ عشاء سے پہلے سونا مطلقاًمکروہ نہیں ہے ، (البحرالرائق ، جلد1،ص:430)‘‘۔
جماعت کے ساتھ نماز کی ادائیگی تنہانماز پڑھنے سے ستائیس درجہ افضل ہے،حدیث  میں ہے:
’’[[arabic: صَلَاۃُ الْجَمَاعَۃِ تَفْضُلُ صَلاَۃَ الْفَذِّ بِسَبْعٍ وَّعِشْرِیْنَ دَرَجَۃً]]‘‘۔
ترجمہ:’’جماعت کے ساتھ نماز پڑھنا تنہا نماز پڑھنے پر ستائیس درجہ فضیلت رکھتاہے ، (صحیح بخاری:645)‘‘۔
 مسجد کے لیے چل کر جانا ثواب کی زیادتی کا سبب ہے ۔
(۱)’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ قَالَ:قَالَ رَسُوْلُ اللّٰہِ ﷺ:مَنْ تَطَہَّرَ فِی بَیْتِہٖ،ثُمَّ مَشٰی إِلٰی بَیْتٍ مِّنْ بُیُوْتِ اللّٰہِ لِیَقْضِیَ فَرِیْضَۃً مِّنْ فَرَائِضِ اللّٰہِ،کَانَتْ خَطْوَتَاہُ إِحْدَاہُمَاتَحُطُّ خَطِیْئَۃً، وَالْأُخْرٰی تَرْفَعُ دَرَجَۃً]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اپنے گھر میں وضو کرے پھر اللہ تعالیٰ کے کسی گھر میں کوئی فریضہ اداکرنے جائے تو اس کاایک قدم ایک گناہ ساقط کرے گا اور دوسرا ایک درجہ بلند کرے گا،(صحیح مسلم:666)‘‘۔
(۲)’’[[arabic: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللّٰہِ،قَالَ:کَانَتْ دِیَارُنَا نَائِیَۃً عَنِ الْمَسْجِدِ، فَاَرَدْنَا أَنْ نَّبِیْعَ بُیُوْتَنَا، فَنَقْتَرِبَ مِنَ الْمَسْجِدِ، فَنَہَانَا رَسُوْلُ اللہِ ﷺ، فَقَالَ: إِنَّ لَکُمْ بِکُلِّ خَطْوَۃٍ دَرَجَۃً]]‘‘۔
ترجمہ:’’ حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں : ہمارے گھر مسجد سے دور تھے ،ہم نے ارادہ کیا کہ اپنے گھر بیچ کر مسجد کے قریب گھر خرید لیں ،رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع کیا اورفرمایا: تمہارے ہر قدم کے عوض ایک درجہ ہے ، (صحیح مسلم:664)‘‘۔
(۳)’’[[arabic: مَنْ تَوَضَّاَ لِلصَّلَاۃِ فَاَسْبَغَ الْوُضُوْ ءَ،ثُمَّ مَشٰی إِلَی الصَّلَاۃِ الْمَکْتُوْبَۃِ فَصَلَّاہَامَعَ النَّاسِ أَوْمَعَ الْجَمَاعَۃِ أَوْ فِی الْمَسْجِدِغَفَرَ اللَّہُ لَہٗ ذُنُوبَہٗ]]‘‘۔
ترجمہ:’’ جس نے نماز کے لیے اچھی طرح وضو کیا ،پھر فرض نماز کے لیے گیا اور لوگوں کے`
},
{
  pageNumber: 141,
  text: `ساتھ  یا جماعت کے ساتھ مسجد میں نماز پڑھی ،اللہ تعالیٰ اُس کے گناہوں کو معاف فرمادے گا  ،(سُنن نسائی:856)‘‘۔
(۴)’’[[arabic: صَلاَۃُ الرَّجُلِ فِی الْجَمَاعَۃِ تُضَعَّفُ عَلٰی صَلاَتِہٖ فِی بَیْتِہٖ،وَفِی سُوْقِہٖ، خَمْسًا وَّعِشْرِیْنَ ضِعْفًا،وَذٰلِکَ أَنَّہٗ:إِذَا تَوَضَّاَ،فَاَحْسَنَ الْوُضُوْ ءَ،ثُمَّ خَرَجَ إِلَی المَسْجِدِ،لاَ یُخْرِجُہٗ إِلَّا الصَّلاَۃُ،لَمْ یَخْطُ خَطْوَۃً،إِلَّا رُفِعَتْ لَہٗ بِہَادَرَجَۃٌ،وَحُطَّ عَنْہُ بِہَا خَطِیئَۃٌ،فَإِذَا صَلّٰی لَمْ تَزَلِ المَلاَئِکَۃُ تُصَلِّی عَلَیْہِ،مَا دَامَ فِی مُصَلَّاہُ:،اَللّٰہُمَّ صَلِّ عَلَیْہِ،اَللّٰہُمَّ ارْحَمْہُ وَلاَ یَزَالُ أَحَدُکُمْ فِی صَلاَۃٍ مَا انْتَظَرَ الصَّلاَۃَ]]‘‘۔
ترجمہ:’’مرد کی (مسجدمیں)جماعت کے ساتھ نماز اس کی گھر میں اور بازار میں نمازپر پچیس درجہ افضل ہے کیونکہ جب وہ عمدہ طریقہ سے وضو کرتاہے ،پھر مسجد کی طرف نکلتاہے اور صرف نماز ہی اس کے نکلنے کا سبب ہے ،تو اس کے ہرقدم پر اس کا ایک درجہ بلند کردیاجاتا ہے اوراس کے ایک گناہ کو مٹادیاجاتا ہے اور جب وہ نماز پڑھتاہے توجب تک وہ نماز کی جگہ پر رہتاہے ،فرشتے اس کے لیے دعاکرتے رہتے ہیں :اے اللہ ! اس پر رحمت نازل فرما،اس پر رحم فرمااورتم میں سے کوئی شخص جب تک نماز کے انتظار میں رہتاہے ،اس کا نماز میں شمار ہوتارہتاہے ،(صحیح بخاری:647)‘‘۔

[[heading: عشاکی  نیت میں غلطی سے ظہر یا عصر کہہ دینا]] 
سوال:
اگر کوئی شخص عشاء کی جماعت میں غلطی سے ظہر ،عصر یا مغرب کی نیت کرکے شامل ہوجائے ،سلام پھیرنے سے پہلے یا سلام پھیرتے وقت یاد آیا تو اس نماز کا شرعی حکم کیاہے؟، (محمد اشرف قادری ،قصبہ کالونی کراچی)۔ 
جواب:
نیت دل کے ارادے کا نام ہے، زبان سے نیت کے کلمات کا اداکرنا ، جوہمارے ہاں معروف ہیں ،نہ حدیث سے ثابت ہیں،نہ شرعاً ضروری ہیں ۔ہمارے متاخرین فقہائے`
},
{
  pageNumber: 142,
  text: `کرام نے ذہنی استحضار یعنی ذہن کومُتوجہ رکھنے کے لیے زبانی نیت کو مستحب قراردیاہے ۔ فرض نماز میں یہ ضروری ہے کہ دل میں اُس خاص نماز کی نیت کرے ،مثلاً: آج کی ظہر ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: اَلْوَاجِبَاتُ وَالْفَرَائِضُ لَا تَتَاَدّٰی بِمُطْلَقِ النِّیَّۃِ إِجْمَاعًا.کَذَا فِی الْغِیَاثِیَّۃِ فَلَا بُدَّ مِنَ التَّعْیِیْنِ فَیَقُوْلُ: نَوَیْتُ ظُہْرَ الْیَوْمِ أَوْعَصْرَ الْیَوْمِ أَوْ فَرْضَ الْوَقْتِ أَوْ ظُہْرَ الْوَقْتِ کَذَا فِیْ شَرْحِ مُقَدِّمَۃِ أَبِی اللَّیْثِ وَلَا یَکْفِیْہِ نِیَّۃُ الْفَرْضِ وَإِذَا نَویٰ فَرْضَ الْوَقْتِ جَازَ إِلَّا فِی الْجُمُعَۃِ وَلَوْ نَویٰ الظُّہْرَ فِیْ غَیْرِ الْجُمُعَۃِ قِیْلَ یَجُوْزُ ہُوَالصَّحِیْحُ]]‘‘۔
ترجمہ:’’واجبات اور فرائض مطلق نیت سے ادا نہیں ہوںگے ،اس پر اجماع ہے ، جیسا کہ ’’غیاثیہ‘‘ میں ہے ،فرض نماز میں تعیین ضروری ہے ،پس یہ کہے: میں آج کے ظہر کی نیت کرتاہوںیا وقتی فرض کی یا وقتِ ظہر کی نیت کرتاہوں ،جیساکہ ’’مُقَدِّمہ ابو اللّیث ‘‘ کی شرح میں ہے اور(وقت کی تعیین کے بغیر مطلق) فرض کی نیت کافی نہیں ہے ،مگر جب فرض ِوقت کی نیت کی تو جائز ہے مگر جمعہ میں فرض وقت کی نیت کافی نہیں اور اگر جمعہ کے علاوہ ظہر کی نیت کی تو بعض نے جائز قرار دیا ،یہ صحیح ہے ،(فتاویٰ عالمگیری ، جلد1،ص:65)‘‘۔
صحتِ نیت کے لیے چند امور ضروری ہیں: 
(۱) نیت دل کے ارادے کو کہتے ہیں،محض جاننا نیت نہیں ہے ۔
(۲) نیت میں محض زبان سے اداکیے ہوئے الفاظ کا اعتبار نہیں ہے ،پس اگر دل میں ظہر کی نیت کی اور وقت بھی ظہر کاہے ، لیکن زبان سے لفظ عصر نکلا تونماز اداہوجائے گی۔
(۳) محتاط ترین بات یہ ہے کہ تکبیرِ تحریمہ کے وقت نیت حاضر ہو،اگرنیت  پہلے کرلی اور درمیان میں کوئی اجنبی فعل عارض نہیں ہوا (جیسے کھانا پینا کلام وغیرہ) توبھی صحتِ ادا کے لیے یہ نیت کافی ہے۔
(۴) نماز شروع کرتے وقت دل میں نیت حاضر نہیں ہے ،تودوران نماز کی نیت کا اعتبار نہیں ہے۔`
},
{
  pageNumber: 143,
  text: `(۵) صحیح یہ ہے کہ سنت اور نفل کے لیے مطلق نماز کی نیت کافی ہے ،وقت کی تعیین ضروری نہیں ہے، البتہ احتیاط کاتقاضا یہ ہے کہ تراویح کے لیے تراویح یا قیام اللیل کی نیت کرے ، البتہ فرض اور واجب نماز کے لیے بالترتیب فرض اور واجب کی نیت ضروری ہے۔
(۶) نیت حاضر ہونے کے معنیٰ یہ ہیں کہ اگرکوئی پوچھے، کون سی نماز پڑھ رہے ہو توکسی تردّد یا سوچ بچار کیے بغیر بتادے کہ مثلاً : ظہر کی نماز پڑھ رہاہوں،(بہارِ شریعت،جلدسوم ، ص:493، ملخصاً ) ‘‘ ۔

[[heading: مسبوق کی نماز اور سِرّی نماز میں ثناء پڑھنے کا مسئلہ]] 
سوال:
زید ظہر ،عصر یا عشا ء کی چوتھی رکعت میں شامل ہوا ،بقیہ رکعات اداکرنے کا کیا طریقہ ہے ؟،(محمد اشرف ،قصبہ کالونی کراچی )۔ 
جواب: 
امام کے ایک رکعت یا چند رکعات پڑھنے کے بعد جو شخص جماعت میں شامل ہوا اور آخر تک رہا ،اُسے ’’مسبوق‘‘ کہتے ہیں ۔مسبوق  امام کے سلام پھیرنے کے بعدجب اپنی نماز شروع کرے گا تویہ حقِ قراء ت میں اس کی پہلی رکعت قرار دی جائے گی اور اِس میں مسبوق ثناء (اگر پہلے نہ پڑھی ہو)، سورۂ فاتحہ اور سورت پڑھے گا ،رکوع وسجود کے بعد حقِ تَشہُّد میں یہ دوسری  یا تیسری یا چوتھی رکعت جوشمار میں آئے، قرار پائے گی ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَلَوْ أَدْرَکَ رَکْعَۃً مِّنَ الرُّبَاعِیَّۃِ فَعَلَیْہِ أَن یَقْضِیَ رَکْعَۃً یَقْرَأُ فِیْہَا الْفَاتِحَۃَ وَالسُّوْرَۃَ وَیَتَشَہَّدُ وَیَقْضِیَ رَکْعَۃً أُخْرٰی کَذٰلِکَ وَلَا یَتَشَہَّدُ وَفِی الثَّالِثَۃِ بِالْخِیَارِ وَالْقِرَائَۃُ أَفْضَلُ.ہٰکَذا فِی الْخُلَاصَۃِ]]‘‘۔
ترجمہ:’’اگر مسبوق نے چار رکعات والی نماز میں سے ایک رکعت پائی ،(امام کے سلام پھیرنے کے بعد) اس پر لازم ہے کہ پہلی رکعت اس طرح پوری کرے کہ سورۂ فاتحہ اور`
},
{
  pageNumber: 144,
  text: `سورت اور (قعدہ میں) تَشَہُّد پڑھے ،دوسری رکعت بھی اسی طرح پڑھے اور اس میں تَشَہُّد نہ پڑھے ،اور تیسری رکعت میں خیار ہے ،قرا ء ت کرناافضل ہے، ’’خلاصۃ الفتاویٰ‘‘ میں اسی طرح ہے ، (فتاویٰ عالمگیری ،جلد اول،ص:95)‘‘۔
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَیَقْضِیْ أَوَّلَ صَلَاتِہٖ فِی حَقِّ قِرَائَۃٍ،وَاٰخِرَہَا فِیْ حَقِّ تَشَہُّدٍ، فَمُدْرِکُ رَکْعَۃٍ مِّنْ غَیْرِ فَجْرٍ یَاْتِیْ بِرَکْعَتَیْنِ بِفَاتِحَۃٍ وَّسُوْرَۃٍ وَّتَشَہُّدٍ بَیْنَہُمَاوَبِرَابِعَۃٍ الرُّبَاعِیِّ بِفَاتِحَۃٍ فَقَطْ،وَلَا یَقْعُدُ قَبْلَہَا]]‘‘۔
ترجمہ:’’مسبوق اپنی فوت شدہ رکعت قراء ت کے حق میں اول اور تَشَہُّد کے حق میں آخر نماز تصورکرکے ادا کرے،فجر کے علاوہ ایک رکعت پانے والا دو رکعات کو فاتحہ اور سورت اور ان کے درمیان تَشہُّد کے ساتھ اداکرے اور چاررکعات نماز میں چوتھی رکعت کو صرف فاتحہ کے ساتھ پڑھے اور اس سے پہلے قعدہ نہ کرے ،(جلد 3،ص:644،دمشق )‘‘۔
آپ نے مسئلے کی جو صورت دریافت کی ہے ،اُس کا جواب یہ ہے : مُقتدی امام کے سلام پھیرنے کے بعد اللہ اکبر کہہ کر اٹھے اورثناو فاتحہ کے ساتھ سورت ملاکر رکعت مکمل کرے اور اَلتّحیات پر بیٹھ جائے کیونکہ امام کے ساتھ پڑھی جانے والی ایک رکعت کو ملاکر اب اُس کی دو رکعات ہوچکی ہیں ۔ اُس کے بعد تیسری رکعت کے لیے کھڑا ہو اور اُس میں فاتحہ کے ساتھ سورت ملاکر رکعت مکمل کرے اور آخر میں صرف فاتحہ پڑھ کر اپنی چوتھی رکعت پڑھے اور اس طرح نماز مکمل کرے ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’ [[arabic: اِلَّاإذَاشَرَعَ الْإِمَامُ فِی الْقِرَاءَۃِ سَوَاءٌ کَانَ مَسْبُوْقًاأَوْ مُدْرِکًاوَّسَوَاءٌ کَانَ إمَامُہٗ یَجْہَرُ بِالْقِرَاءَۃِأَوْ لَا، فَإنَّہٗ لَا یَاْتِی بِہٖ لِمَا فِی النَّہْرِ عَنِ الصُّغْرٰی:أَدْرَکَ الْإِمَامَ فِی الْقِیَامِ یُثْنِیْ مَا لَمْ یَبْدَأْ بِالْقِرَاءَۃِ، وَقِیْلَ فِی الْمُخَافَتَۃِ یُثْنِیْ]]‘‘۔
ترجمہ:’’ مگرجب امام قراء ت شروع کردے ،خواہ وہ جہری قراء ت کررہاہو یا سرّی ،`
},
{
  pageNumber: 145,
  text: `مقتدی ثناء (سُبْحَانَکَ اللّٰہُمَّ) نہیں پڑھے گا ، خواہ وہ مقتدی مسبوق ہو یا مُدرِک، ’’اَلنَّھْرُ الْفَائِق ‘‘ میں صغریٰ کے حوالے سے ہے: (مقتدی نے )امام کو قیام میں پایا ،توجب تک امام نے قراء ت نہ شروع کی ہو ،مقتدی ثناء پڑھ لے اور ایک قول یہ ہے کہ سرّی قراء ت کے دوران بھی ثناء پڑھ لے ‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ متعدد ثقہ حوالہ جات کے ساتھ بشمول امام قاضی خان رحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: وَلَوْ أَدْرَکَ الْإِمَامَ بَعْدَ مَا اشْتَغَلَ بِالْقِرَاءَۃِ،قَالَ ابْنُ الْفَضْلِ:لَا یُثْنِیْ وَقَالَ غَیْرُہٗ : یُثْنِیْ وَیَنْبَغِیْ التَّفْصِیْلُ:إِنْ کَانَ الْإِمَامُ یَجْہَرُ لَا یُثْنِیْ وَإِنْ کَانَ یُسِرُّ یُثْنِیْ وَہُوَ مُخْتَارُ شَیْخِ الْإِسْلَامِ خَوَاہَرْ زَادَہْ،وَعَلَّلَہٗ فِی الذَّخِیرَۃِ بِمَاحَاصِلُہٗ أَنَّ الْاِسْتِمَاعَ فِی غَیْرِحَالَۃِ الْجَہْرِلَیْسَ بِفَرْضٍ،بَلْ یُسَنُّ تَعْظِیمًالِلْقِرَاءَۃِ فَکَانَ سُنَّۃً غَیْرَ مَقْصُوْدَۃٍ لِذَاتِہَا،وَعَدَمُ قِرَائَۃِ الْمُؤْتَمِّ فِی غَیْرِ حَالَۃِ الْجَہْرِ لَا لِوُجُوْبِ الْإِنْصَاتِ،بَلْ لِأَنَّ قِرَائَۃَ الْإِمَامِ لَہٗ قِرَائَۃٌ۔ وَأَمَّا الثَّنَاءُ فَہُوَ سُنَّۃٌ مَقْصُوْدَۃٌ لِّذَاتِہَاوَلَیْسَ ثَنَاءُ الْإِمَامِ ثَنَاءً لِلْمُؤْتَمِّ،فَإِذَا تَرَکَہٗ یَلْزَمُ تَرْکُ سُنَّۃٍ مَّقْصُوْدَۃٍ لِذَاتِہَا لِلْإِنْصَاتِ الَّذِیْ ہُوَ سُنَّۃٌ تَبَعًابِخِلَافِ تَرْکِہٖ حَالَۃَ الْجَہْرِ،فَکَانَ الْمُعْتَمَدُ مَا مَشَی عَلَیْہِ الْمُصَنِّفُ،فَافْہَمْ]]‘‘۔
ترجمہ:’’اورجب مقتدی امام کے قراء ت میں مشغول ہونے کے بعد جماعت میں شامل ہوا،ابن فضل نے کہا: ثناء نہیں پڑھے گا اور دوسرے علماء نے کہا : پڑھے گا اور اس کے لیے تفصیل درکار ہے ،اگر امام جہری قراء ت کررہاہے ،تو ثناء(سُبْحَانَکَ اللّٰہُمَّ) نہ پڑھے اوراگر سرّی قراء ت کررہا ہے تو پڑھ لے ،شیخ الاسلام خواہر زادہ کا یہی مختار ہے اور’’ ذخیرہ‘‘ میںاس کی علت یہ بیان کی ہے ،قراء تِ سِرّی ہورہی ہو تو اِستماع ( توجہ سے سننا) فرض نہیں ہے ،بلکہ قراء ت کی تعظیم کے لیے یہ سنّت ہے ،سویہ ایسی سنت ہے جو مقصود بالذات نہیں ہے اور سرّی قراء ت کی صورت میں مقتدی کے قراء ت نہ کرنے کا حکم اس وجہ سے`
},
{
  pageNumber: 146,
  text: `نہیں کہ ( سِرّی قراء ت کے دوران )اس کا چپ رہنا واجب ہے، بلکہ اس لیے ہے کہ امام کی قراء ت ہی اس کی قراء ت ہے (یعنی باجماعت نماز میں امام کی جہری اور سرّی قراء ت کا حکم یکساں ہے)،جبکہ ثناء (سُبْحَانَکَ اللّٰہُمَّ) پڑھنا ’’ مقصود بالذات سنت ‘‘ہے اور امام کی ثناء مقتدی کے لیے کافی نہیں ہے، پس جب مقتدی(امام کی سرّی قراء ت کے دوران) ثناء کو چھوڑے گا تو (قراء ت کے دوران) انصات(خاموش رہنا)کی خاطرجوکہ تبعاًسنت ہے مقصودبالذات سنت ثناء کوچھوڑے گا۔ اس کے برعکس امام کی جہری قراء ت کے دوران چونکہ اِنصات واِستماع(خاموش رہنا اور توجہ سے سننا) واجب ہے ،لہٰذا مصنف کا قول ہی معتمد ہے، اسے سمجھیے ،(ردالمحتار علی الدرالمختار ، جلد  2،ص:167-168،بیروت )‘‘۔
الغرض جب مسبوق مقتدی امام کے ساتھ اس حال میں شامل ہوا کہ امام سرّی قراءت کررہاہے،تو مقتدی ثناء پڑھ لے ،کیونکہ امام کی سرّی قراء ت کے دوران مقتد ی کا انصات (خاموش رہنا) مقصود بالذات سنّت نہیں ہے، بلکہ تعظیم قراء ت کے لیے تبعاً سنت ہے ،جبکہ مقتدی کا ثناء پڑھنا مقصود بالذات سنّت ہے اور ثناء کوقراء ت پر قیاس نہیں کرسکتے، کیونکہ امام کی قراء ت مقتدی کے لیے کافی ہے ،جبکہ امام کی ثنا مقتدی کے لیے کافی نہیں ہے،بلکہ مقتدی کو اپنی ثناء پڑھنی ہوتی ہے ۔

[[heading: نماز کے لیے مقررہ وقت میں تاخیر کرنا]] 
سوال:
ہماری محلے کی مسجد میں پچھلے تقریباً 25 سال سے گیارہویں شریف کی محفل پاک چاند کی گیارہ کی نمازِ مغرب سے عشا تک بلا ناغہ ہو رہی ہے اور محفل کا کچھ حصہ نماز عشاکے بعد بھی جاری رہتا ہے، مثلاً ذکر شریف اور لنگر شریف وغیرہ ، اکثر نماز عشا لیٹ ہو جاتی ہے ۔ اس ضمن میں پیش امام صاحب کو کئی دفعہ انتظامیہ کی جانب سے باور کرایا گیا ہے کیونکہ نقیب محفل کے فرائض بھی امام صاحب ہی ادا کر رہے ہوتے ہیں، تقریباً پونے دو گھنٹے کی محفل میں عشا کی نماز دس سے پندرہ منٹ لیٹ ہونا معمول بن گیا ہے ۔ اس کے علاوہ نماز جمعہ بھی پانچ سے دس منٹ لیٹ ہونا معمول بن گیا ہے ۔ باقی نمازیں جو وقت پر پڑھانا اُن کی ذمہ`
},
{
  pageNumber: 147,
  text: `داری ہے ، ایک یا دو منٹ لیٹ پڑھاتے ہیں ۔ برائے مہربانی قرآن و سنت کی روشنی میں فرمائیے کہ اس عمل سے گنہگار ی تو نہیں ہو رہی اور اگر یہ گنہگاری والا عمل ہے، تو اس کا ذمہ دار کون ہے انتظامیہ یا امام صاحب اور یہ کہ فرض نماز پر نفلی عبادت کو ترجیح دی جا سکتی ہے؟، (محمد اعظم ظہیر، انتظامیہ مسجد )۔
جواب:
نماز کے حوالے سے ارشادِ باری تعالیٰ ہے :
’’[[arabic: إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا]]‘‘۔
ترجمہ:’’ بے شک نماز مومنوں پر وقت کی پابندی کے ساتھ فرض کی گئی ہے ، (نساء: 103)‘‘۔نمازِ فجر کا وقت صبحِ صادق سے طلوعِ آفتاب تک ہے ،نمازِ ظہر سورج ڈھلنے سے ہرچیز کا سایہ سایۂ اصلی کے علاوہ دو مثل ہونے تک ہے ،عصر کا وقت سایہ دومثل ہونے سے سورج ڈوبنے تک ہے ۔مغرب کا وقت غروبِ آفتاب سے غروبِ شفق تک ہے اور عشاء کا وقت غروبِ شفق سے طلوعِ فجر تک ہے ۔الغرض شریعت میں نمازوں کے اوقات کا اول وآخر وقت بیان کرکے تعین کردیاگیاہے، فقہ میں اس امرکا بھی بیان ہے کہ افضل وقت کون ساہے۔
ہمارے یہاں گھڑی کے اعتبار سے نمازوں کے اوقات کی تعیین ایک انتظامی امر ہے اوریہ آسانی کے لیےاورشریعت کی مُقررہ حد کے اندر رہتے ہوئے کرتے ہیں ،اس لیے اِس تعیین میں کوئی حرج نہیں ہے ،اللہ تعالیٰ کا ارشاد ہے :
(۱)’’ [[arabic: وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ]]‘‘۔
ترجمہ:’’ تمہارے لیے دین میں تنگی نہیں رکھی ، (الحج:78)‘‘ ۔
(۲)’’[[arabic: يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ]]‘‘۔
ترجمہ:’’ اللہ تعالیٰ تمہارے لیے آسانی چاہتاہے ، وہ تمہارے لیے دشواری نہیں چاہتا، (البقرہ:185 ) ‘‘۔`
},
{
  pageNumber: 148,
  text: `امام صاحب کو چاہیے کہ نمازوں کے مقررہ اوقات کی پابندی کریں تاکہ لوگ مُتنفّر نہ ہوں،رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے:
’’ [[arabic: یَسِّرُوْاوَلَاتُعَسِّرُوْا وَبَشِّرُوْا وَلَاتُنَفِّرُوْا]]‘‘۔
 ترجمہ:’’ دین کو آسان کرکے پیش کرو ،مشکل کرکے پیش نہ کرواور لوگوں کو (اللہ کی رحمت کی) بشارت دو،اُنہیں (دین سے) مُتنفّر نہ کرو،(صحیح بخاری:69)‘‘۔
پانچوں نمازوں کے شرعی اوقات نماز کے لیے ظرفِ زمان ہیں ،کوئی بھی فرض نمازپورے وقت کو محیط نہیں ہوتی،البتہ شریعت میںافضل ومستحب اور مکروہ اوقات کے بارے میں رہنمائی کی ہے ۔مساجد میں نمازِ باجماعت کے لیے جو اوقات مقرر کیے جاتے ہیں، یہ تعیینِ شرعی نہیں ہے، بلکہ لوگوں کی آسانی کے لیے ہے۔تاہم اگر ان مُقررہ اوقات میں نماز کی ادائیگی میں کبھی کبھار تقدیم وتاخیر ہوجائے تو شرعاً مواخذہ نہیں ہے اور نہ  گنہگاری کا عمل ہے ، البتہ وقت کی پابندی اخلاقی فریضہ ہے ۔
ہمارے نزدیک افضل صورت تویہ ہے کہ اذان ونماز باجماعت مقررہ وقت پر ہو اور وقفۂ نماز کے لیے تقریب موقوف کرلی جائے ،نماز سے فراغت کے بعد اسے جاری رکھ سکتے ہیں ۔ہمارے ادارے جامعہ نعیمیہ کا سالانہ جلسۂ تقسیم اَسناد ودستارِ فضیلت اگر مسجد میں ہورہاہے ،توہم نظم اس طرح ترتیب دیتے ہیں کہ اذان ونماز باجماعت اپنے مقررہ وقت پر ہو ۔لیکن اگر تقریب کے منتظمین کا نظم یہ ہوکہ تقریب جاری رہے اور اس کے بعد اذان ونمازِ باجماعت ہوبشرطیکہ وقت میں گنجائش ہے ،تو اس کے لیے ایک دن پہلے نمازیوں کو مطلع کردیاجائے ۔جمعۃ المبارک کی نماز میں بھی وقت کی پابندی کرنی چاہیے ۔ ہم جب نماز کا فلسفہ اورحکمتیں بیان کرتے ہیں تو بتاتے ہیں کہ نماز پابندیٔ وقت سکھاتی ہے اور عمل اس کے برعکس کریں تویہ قول وفعل میں تضاد ہے جو اللہ تعالیٰ کو بہت ناپسند ہے۔ارشادِ باری تعالیٰ ہے :
’’[[arabic: يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ]]‘‘۔`
},
{
  pageNumber: 149,
  text: `ترجمہ:’’اے ایمان والو! تم ایسی بات کیوں کہتے ہو ،جن پر تم خود عمل نہیں کرتے ،اللہ کے نزدیک یہ بڑی ناراضی کی بات ہے کہ تم ایسی بات کہو ،جو خود کرتے نہیں ہو، (الصف: 2-3) ‘‘۔
رسول اللہ صلی اللہ علیہ وسلم باجماعت نمازوں میںلوگوں کے احوال کا لحاظ رکھتے تھے ،حدیث پاک میں ہے : 
(۱)’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ أَنَّ رَسُوْلَ اللَّہِ ﷺقَالَ: إِذَا صَلّٰی أَحَدُکُمْ لِلنَّاسِ فَلْیُخَفِّفْ، فَإِنَّ مِنْہُمُ الضَّعِیْفَ وَالسَّقِیْمَ وَالکَبِیْرَ،وَإِذَا صَلّٰی أَحَدُکُمْ لِنَفْسِہٖ فَلْیُطَوِّلْ مَا شَاءَ]]‘‘۔
ترجمہ:’’ حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے : رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا: جب تم میں سے کوئی شخص لوگوں کو نماز پڑھائے (یعنی امامت کرے ) تو اسے چاہیے کہ(مقدارِقرا ء ت میں ) تخفیف کرے ،کیونکہ اُن میں (یعنی جماعت میں شامل لوگوں میں) بعض لوگ کمزور ہوتے ہیںاوربعض بیمار یا بوڑھے ہوتے ہیں (یعنی زیادہ دیر تک نماز میں قیام اُن کے لیے دشوار ہوتا ہے ) اورجب تم میں سے کوئی شخص تنہانماز پڑھے تو وہ (اپنی استطاعت اور ذوق کے مطابق ) جتنی چاہے ،لمبی نماز پڑھے،(صحیح بخاری : 703)‘‘۔
(۲)’’[[arabic: أَخْبَرَنِیْ أَبُوْ مَسْعُوْدٍأَنَّ رَجُلًاقَالَ:وَاللّٰہِ یَارَسُولَ اللَّہِ!إِنِّی لَاَتَاَخَّرُ عَنْ صَلاَۃِ الْغَدَاۃِ مِنْ أَجْلِ فُلاَنٍ مِمَّا یُطِیْلُ بِنَا،فَمَا رَأَیْتُ رَسُوْلَ اللّٰہِ ﷺ فِی مَوْعِظَۃٍ أَشَدَّ غَضَبًا مِّنْہُ یَوْمَئِذٍ،ثُمَّ قَالَ:إِنَّ مِنْکُمْ مُنَفِّرِیْنَ،فَأَیُّکُمْ مَا صَلّٰی بِالنَّاسِ فَلْیَتَجَوَّزْ،فَإِنَّ فِیْہِمُ الضَّعِیْفَ وَالکَبِیْرَ وَذَا الْحَاجَۃِ]]‘‘۔
ترجمہ:’’ حضرت ابو مسعود رضی اللہ عنہ بیان کرتے ہیں :ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوکر عرض کی : یارسول اللہ صلی اللہ علیہ وسلم ! میںفلاں شخص کی وجہ سے نماز ِفجر سے رہ جاتا ہوں کیونکہ وہ ہمیں طویل نماز پڑھاتے ہیں ۔حضرت ابو مسعود کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اُس دن کے مقابلے میں کبھی وعظ ونصیحت کے موقع پراتنا غضبناک نہیں دیکھا، پھر آپ  صلی اللہ علیہ وسلم نے فرمایا: تم لوگوں کو (دین سے) متنفّرکرنے والے ہو، پس تم میں سے جو شخص لوگوں کو نماز پڑھائے (یعنی امامت کرے) ،تو اسے چاہئے کہ (مقدارِ`
},
{
  pageNumber: 150,
  text: `قراء ت میں) تخفیف کرے کیونکہ ان میں (یعنی جماعت میں شامل لوگوں میں سے) بعض لوگ کمزور یا بوڑھے یا کام کاج والے ہوتے ہیں،(یعنی زیادہ دیر تک نماز میں قیام اُن کے لیے دشوار ہوتا ہے)،(صحیح بخاری:702)‘‘۔
(۳)’’[[arabic: عَنْ أَبِیْ قَتَادَۃَعَنِ النَّبِیِّ ﷺقَالَ:إِنِّی لَاَقُوْمُ فِی الصَّلاَۃِ أُرِیْدُ أَنْ أُطَوِّلَ فِیْہَا، فَأَسْمَعُ بُکَاءَ الصَّبِیِّ،فَأَتَجَوَّزُ فِیْ صَلاَتِیْ کَرَاہِیَۃَ أَنْ أَشُقَّ عَلٰی أُمِّہٖ]]‘‘۔
ترجمہ:’’ حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نماز کے لیے کھڑا ہوتاہوں اورمیری خواہش ہوتی ہے کہ لمبی نماز پڑھوں کہ دریں اثنا ء میں بچے کے رونے کی آواز سنتاہوں، تومیں اس بات کو ناپسند کرتے ہوئے کہ اس کی ماں کو طول دشوار ہوگا ،میں نماز کو مختصر کردیتاہوں، (صحیح بخاری: 707)‘‘۔
الغرض اجتماعی عبادات میں مستحبات ومستحسنات کی سعادت کے حصول کے ساتھ ساتھ لوگوں کے احوال کی رعایت اور دشواریوں کا لحاظ رکھنا بھی ضروری ہے ،کیونکہ عبادت کے وقت خشوع وخضوع اور استحضار قلبی بھی ضروری ہے اور حتی الامکان کوشش کی جائے کہ لوگوں کی طبیعت پر گراں نہ گزرے ،جیساکہ حدیث پاک سے معلوم ہواکہ رحمۃ للعٰلمین صلی اللہ علیہ وسلم ایک بچے کے رونے پر اس کی ماں کے قلبی اضطراب کابھی پاس رکھتے تھے ۔

[[heading: صحت اقتدا کے لیے امام اور مقتدی کی نماز کا ایک ہونا ضروری ہے]] 
سوال:
اگر امامت کرانیوالا شخص مسافر ہواور اسکی مغرب کی نماز قضا ہو چکی ہو،عشاء کا وقت ہو۔ امام کہے کہ میں تین فرض مغرب کے پڑھ کر سلام پھیر دوں گا اورآپ اپنی عشاء کی نماز پوری کر لیجیے گا، اب امام اور مقتدیوں کی نیت میں تضاد آگیا،ایسی صورت میںکیا مقتدیوں کی نمازِ عشاء اداہو جائیگی ؟، (رائے فیصل پناہ،دبئی)۔
جواب: 
اقتدا کی شرائط میں سے ایک شرط یہ ہے کہ امام اور مقتدی دونوں کی نمازاس طورپر`
},
{
  pageNumber: 151,
  text: `ایک ہوکہ امام کی نماز مقتدی کی نماز کو مُتضمن ہو ۔
علامہ زین الدین ابن نجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں :
’’ [[arabic: اِنَّ اتِّحَادَ الصَّلَاتَیْنِ شَرْطٌ لِصِحَّۃِ الِاقْتِدَاءِ وَذٰلِکَ بِاَنْ یُّمْکِنَہُ الدُّخُوْلَ فِی صَلَاتِہٖ بِنِیَّۃِ صَلَاۃِ الْإِمَامِ فَتَکُوْنَ صَلَاۃُ الْإِمَامِ مُتَضَمِّنَۃً لِّصَلَاۃِ الْمُقْتَدِیْ وَہُوَ الْمُرَادُ بِقَوْلِہٖ عَلَیْہِ الصَّلَاۃُ وَالسَّلَامُ: اَلْإِمَامُ ضَامِنٌ أَیْ تَتَضَمَّنُ صَلَاتُہٗ صَلَاۃَ الْمُقْتَدِیْ]]‘‘۔
ترجمہ:’’صحتِ اقتدا کی ایک شرط یہ ہے کہ امام ومقتدی کی نمازایک ہو(یعنی دونوں ایک ہی وقت کی ادا یا قضا نمازپڑھ رہے ہوں)اوروہ اس طرح کہ مقتدی کے لیے امام کی نیت کے مطابق نماز میں داخل ہونا ممکن ہو،تاکہ امام کی نماز مقتدی کی نماز کو مُتضمن ہو ،نبی کریم صلی اللہ علیہ وسلم کے اس ارشاد کہ’’ امام ضامن ہے ،یعنی اس کی نماز مقتدی کی نماز کو مُتضّمن ہے‘‘ سے یہی مراد ہے ،(البحرالرائق،جلد1،ص:631-632)‘‘۔
مکمل حدیث یہ ہے : 
’’[[arabic: قَالَ رَسُوْلُ اللّٰہِﷺ:اَلْإِمَامُ ضَامِنٌ، وَالْمُؤَذِّنُ مُؤْتَمَنٌ،اَللّٰہُمَّ أَرْشِدِ الْاَئِمَّۃَ وَاغْفِرْ لِلْمُؤَذِّنِیْنَ]]‘‘۔
ترجمہ:’’ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: امام ضامن ہے اور مؤذن امین ہے ،اے اللہ ! اماموں کو ہدایت نصیب فرما اور مؤذنوں کی مغفرت فرما،(سُنن ترمذی: 207)‘‘۔
 ایک شرط یہ بھی ہے کہ امام کا مقیم یا مسافر ہونا معلوم ہو ،یہ شرط حقیقۃً صحتِ نماز کی شرط نہیں بلکہ صحتِ اقتدا کے لیے شرط ہے ،لہٰذا اگر نماز کے بعد حال معلوم ہو جائے ،نماز صحیح ہوجائے گی ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: لَا یَصِحُّ اِقْتَدَاءُ مُصَلِّی الظُّہرِ بِمُصَلِّی الْعَصْرِ وَمُصَلِّی ظُہْرَ یَومِہٖ بِمُصَلِّی ظُہْرِ أَمْسِہٖ وَبِمُصَلِّی الْجُمُعَۃِ وَکَذَا عَکْسُہٗ]]‘‘۔
ترجمہ:’’ ظہر کی نماز پڑھنے والے کی  عصر کی نماز پڑھنے والے کے پیچھے اقتداءدرست نہیں`
},
{
  pageNumber: 152,
  text: `ہے ،اسی طرح آج کی (ادا) ظہر پڑھنے والے کی کل کی قضائے ظہر یا جمعہ پڑھانے والے  کے پیچھے اقتداءدرست نہیں ہے اور اسی طرح اس کے برعکس صورت کا حکم ہے ،(فتاویٰ عالمگیری ،جلد1، ص:86)‘‘۔یعنی وقت اور ادا ء وقضا کے اعتبار سے امام اور مقتدی کی نیت ایک ہونی چاہیے ۔ صورتِ مسئولہ میں چونکہ امام اور مقتدیوں کی نماز میں اتحاد نہ ہونے کی وجہ سے امام کی نماز مقتدیوں کی نماز کو مُتضمن نہیں ہے، لہٰذا عشاء کی ادانماز پڑھنے والے مقتدیوں کی نماز وقت عشاء میں مغرب کی قضا پڑھنے والے امام کے پیچھے درست نہیں ہوگی، مقتدی اپنی ادا نماز تنہایا باجماعت پڑھیں اور اگر سوال میں بیان کی گئی صورت کے مطابق وہ نماز پڑھ چکے ہیں ، وہ نماز ادانہیں ہوئی ،اس کا اعادہ کریں۔

[[heading: امام کی اقتدا میں مقتدی کے لیے قراء ت کا حکم]] 
سوال:
باجماعت نماز میں تیسری اور چوتھی رکعت میں کہ جب امام با آواز بلند تلاوت نہ کر رہے ہوں،خود مقتدی کے لیے تلاوت کا کیا حکم ہے، نیز اگر یہ غلط ہے تو پچھلی ادا کردہ نمازوں کی صحت کا کیا حکم ہے؟،(محمددانیال احمد ،ملتان)۔
جواب: 
باجماعت نمازوں میں مقتدی امام کے پیچھے خاموش کھڑا رہے گا ،خواہ نماز سرّی (یعنی ظہر وعصرکی)ہو یا جہری(فجر ،مغرب اورعشاء کی) ۔ ہر نماز کی ہر رکعت میں مقتدی کو قراء ت اصلاً جائز نہیں ہے ،وہ خاموش کھڑا رہے ،تکبیرِ تحریمہ کے بعدصرف ثنا(سُبْحَانَکَ اللّٰہُمَّ)پڑھے ،جبکہ امام نے جہراً قراء ت شروع نہ کی ہو،تنویرالابصار مع الدرالمختار میں ہے :
’’[[arabic: وَالْمُؤْتَمُّ لَایَقْرَأُ مُطْلَقًاوَلَا الْفَاتِحَۃَ فِی السِّرِّیَّۃِ اتِّفَاقًا۔۔۔بَلْ یَسْتَمِعُ إذَا جَہَرَ وَیُنْصِتُ إذَا أَسَرَّلِقَوْلِ أَبِی ہُرَیْرَۃَ رَضِیَ اللّٰہُ عَنْہُ: کُنَّا نَقْرَأُ خَلْفَ الْإِمَامِ فَنَزَلَ:وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَہٗ وَأَنْصِتُوْا]]‘‘۔
ترجمہ:’’ مقتدی مُطلقاً(کسی بھی رکعت میں)قراء ت نہ کرے ،(نہ جہری نماز میں نہ سِرّی`
},
{
  pageNumber: 153,
  text: `نماز میں) اور نہ ہی سرّی نماز میں فاتحہ پڑھے ، اِس پر احناف کے ائمۂ ثلاثہ کا اتفاق ہے‘‘۔۔۔ آگے چل کر لکھتے ہیں: ’’بلکہ جب امام جہراً قراء ت کرے، تو مقتدی سُنے اور جب امام سرّاً پڑھے تو مقتدی چپ رہے ، حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : ہم امام کے پیچھے قراء ت کیاکرتے تھے ،پھریہ آیت نازل ہوئی:’’اورجب قرآن پڑھا جائے تو اس کو غور سے سنو اورخاموش رہو‘‘،(اعراف:204)‘‘۔
 (رَدُّالمحتار علی الدرالمختار ،جلد3،ص:475،دمشق)
حدیث کے الفاظ یہ ہیں:’’[[arabic: عَنْ أَبِیْ ہُرَیْرَۃَ،قَالَ:کَانُوْا یَتَکَلَّمُوْنَ فِی الصَّلَاۃِ، فَنَزَلَتْ:وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوْا لَہٗ وَأَنْصِتُوْا، قَالُوْا:ہٰذَا فِی الصَّلَاۃِ]]‘‘۔
ترجمہ:’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : صحابہ نماز میں گفتگو کرلیاکرتے تھے ، پھریہ آیت نازل ہوئی:’’اورجب قرآن پڑھاجائے تو اس کو غور سے سنو اورخاموش رہو، (اعراف:204)‘‘،انہوں نے فرمایا:یہ حکم نماز کے بارے میںہے ،(مُصَنَّف ابن ابی شیبہ : 8380)‘‘۔

[[heading: ہرقعدے میں تَشَہُّد پورا پڑھنا واجب ہے]]
سوال:
التحیات کے آخر میں کلمہ شہادت پورا پڑھنا افضل ہے، کچھ حذف کرنے کا حکم کیاہے ؟، (محمددانیال احمد ،ملتان)۔
جواب: 
دونوں قعدوں میں پورا تَشَہُّد پڑھنا واجب ہے ،ایک لفظ بھی چھوڑا تو واجب ترک ہوگا اورسجدۂ سہو لازم ہوگا،علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَیَجِبُ التَّشَہُّدُ فِی الْقَعْدَۃِ الْاَخِیْرَۃِوَکَذَا فِی الْقَعْدَۃِ الْاُوْلٰی وَھُوَالصَّحِیْحُ ھٰکَذَافِی السِّرَاجِ الْوَہَّاجِ،وَھُوَ الْاَصَحُّ کَذَافِی مُحِیْطِ السَّرَخْسِیْ]]‘‘۔
ترجمہ:قعدۂ اخیرہ میں تَشَہُّد واجب ہے اور اسی طرح قعدۂ اُولیٰ میں بھی تَشَہُّد واجب ہے اور`
},
{
  pageNumber: 154,
  text: `یہی صحیح ہے ،جیساکہ ’’السراج الوہاج ‘‘ میںہے ،یہی صحیح ترین ہے ،محیط السرخسی میں اسی طرح ہے ،(فتاویٰ عالمگیری ،جلد 1،ص:71)‘‘۔
تنویرالابصار مع الدرالمختار میں ہے :
’’[[arabic: (وَالتَّشَہُّدَانِ)وَیَسْجُدُ لِلسَّہْوِ بِتَرْکِ بَعْضِہٖ کَکُلِّہٖ وَکَذَا فِی کُلِّ قَعْدَۃٍ فِی الْاَصَحِّ]]‘‘۔
ترجمہ:’’ دونوں قعدوں میں پورا تَشہُّدپڑھناواجب ہے اور تَشَہُّدکے بعض حصے کے ترک کرنے پر بھی سجدۂ سہو کرے گا جیساکہ پوری اَلتَّحیات ( تَشَہُّد)  کے ترک کرنے پر سجدۂ سہو لازم ہے،یہی حکم ہر قعدے کاہے ،یہی صحیح ترین ہے،(جلد3،ص:214،دمشق)‘‘۔ 

[[heading: امام کی پیروی میں مقتدی تکبیرات آہستہ کہے]] 
سوال:
باجماعت نماز کے دوران کون سے کلمات ہیںجو امام بآواز بلند پڑھےتومقتدی بھی پڑھے؟،(محمد دانیال احمد،ملتان)۔
جواب: 
دورانِ جماعت امام تکبیرِ تحریمہ،تکبیراتِ انتقال بلند آواز سے پڑھتاہے ،مقتدی بھی آہستہ پڑھے ،رکوع سے اٹھتے وقت جب امام ’’[[arabic: سَمِعَ اللّٰہُ لِمَنْ حَمِدَہٗ]]‘‘ پڑھے تو مقتدی ’’[[arabic: رَبّنَا لَکَ الْحَمْدُ]]‘‘آہستہ پڑھے اوراسی طرح نماز سے نکلنے کے لیے مقتدی ا مام کے سلام کہنے کے وقت  سلام بھی آہستہ کہے ۔
امام جہری نماز میں جہراً اور سِرّی نماز میں سِرًّاتلاوت کرتا ہے، لیکن مقتدی دونوں صورتوں میں خاموش رہے گا ،حدیث مبارک میں ہے : ’’[[arabic: مَنْ کَانَ لَہٗ اِمَامٌ فَقِرَائَتُہٗ لَہٗ قِراءَ ۃٌ]]‘‘، ترجمہ:’’ جس نے امام کی اقتدا میں نماز پڑھی ،تو امام کی قراء ت مقتدی کے لیے`
},
{
  pageNumber: 155,
  text: `کافی ہے،(مُصَنَّف ابن ابی شیبہ : 3779)‘‘۔ 

[[heading: نماز کے بعد وظائف پر شوہر کا اعتراض]] 
سوال:
میرے شوہر میری عبادت کی زیادتی پر اعتراض کرتے ہیں، خاص طور پر صبح کی نماز اور وظائف جو بیس منٹ پر مشتمل ہیں اور عشاء کی نماز اور وظائف جو تیس منٹ پر مشتمل ہیں۔ ان کا کہنا ہے کہ صرف فرض نماز ،سنت اور مختصر وظائف ہونے چاہئیں۔ان کا موقف صحیح ہے یا میں حق بجانب ہوں،  اس بارے میں شرعی حُکم کیا ہے، خاوند کی بات کو مانا جائے یا روزمرہ کی عبادت کوکم کیا جائے۔ برائے مہربانی تفصیلی جواب حوالہ جات کے ساتھ سے راہنمائی فرمائیں،(مدیحہ خان )۔
 جواب:  
اسلام میں فرائض وواجبات اورسُنن مؤکدہ پر تو اعتراض کی گنجائش ہی نہیں ہے ،البتہ ازدواجی تعلق استوار رکھنے اور حقوق وفرائض میں توازن پیداکرنے کے لیے نفلی عبادات میں اعتدال بہترہے ۔ذیل میں ہم دو اَحادیث مبارکہ پیش کررہے ہیں:
(۱) نبی صلی اللہ علیہ وسلم نے(مُواخاتِ انصار ومہاجرین کے موقع پر) حضرت سلمان اور حضرت ابوالدرداء کو ایک دوسرے کا بھائی بنایا، حضرت سلمان ،حضرت ابوالدرداء کی ملاقات کے لیے گئے۔ اُنہوں نے(اُن کی بیوی) حضرت اُم الدرداء کوخستہ حالت میں دیکھا توان سے پوچھا :یہ آپ نے اپنی کیاحالت بنارکھی ہے؟۔اُنہوں نے بتایاکہ تمہارے بھائی ابوالدرداء کو دنیامیں کوئی دلچسپی نہیں ہے۔پھر حضرت ابوالدرداء آئے توانہوں نے حضرت سلمان کو کھانا پیش کیا،حضرت سلمان نے کہا: آپ بھی کھائیں ،تو حضرت ابوالدرداء نے کہا: میں روزے سے ہوں ،حضرت سلمان نے کہا: میں اُس وقت تک نہیں کھاؤں گا ، جب تک کہ آپ نہیں کھائیں گے ، پھر حضرت ابوالدرداء نے(مہمان کی دلداری کے لیے نفلی روزہ توڑ کر) کھانا کھایا۔پھر جب رات ہوگئی تو حضرت ابوالدرداء(قیام اللیل کے)نوافل پڑھنے کے لیے کھڑے ہوگئے ،حضرت سلمان نے اُن سے کہا: آپ سوجائیں ،سو`
},
{
  pageNumber: 156,
  text: `وہ سو گئے۔ پھر(تھوڑی دیر بعد ) وہ نماز کے لیے اٹھے، حضرت سلمان نے پھرکہا: آپ سوجائیں ۔پھر جب رات کا آخری پہر ہواتو حضرت سلمان نے کہا: اب آپ اٹھیں ،پھر دونوں نے نماز پڑھی ،پھر اُن سے حضرت سلمان نے کہا:’’[[arabic: اِنَّ لِرَبِّکَ عَلَیْکَ حَقًّاوَلِنَفْسِکَ عَلَیْکَ حَقًّاوَلاَِہْلِکَ عَلَیْکَ حَقًّا، فَاَعْطِ کُلَّ ذِیْ حَقٍّ حَقَّہٗ،فَاَتَی النَّبِیَّ ﷺ فَذَکَرَ ذٰلِکَ لَہٗ،فَقَالَ النَّبِیُّ ﷺ:صَدَقَ سَلْمَانُ]]‘‘۔
ترجمہ:’’بے شک آپ کے رب کا آپ پر حق ہے ،آپ کے نفس کا آپ پر حق ہے اور آپ کے اہلِ خانہ کا آپ پر حق ہے،سو آپ ہر حق دار کو اُس کا حق (پورا پورا)دیں، پھر حضرت ابوالدرداء نبی صلی اللہ علیہ وسلم کے پاس حاضر ہوئے اور(شکایت کے انداز میں)آپ کو یہ ماجرا بیان کیا (کہ میرے بھائی سلمان نے رات مجھے قیام اللیل سے روکے رکھا)تونبی صلی اللہ علیہ وسلم نے فرمایا: سلمان نے سچ کہاہے ، (صحیح بخاری:1968)‘‘۔
(۲)’’[[arabic: سَمِعَ اَنَسَ بْنَ مَالِکٍ رَضِیَ اللّٰہُ عَنْہُ یَقُوْلُ: جَاءَ ثَلَاثَۃُ رَھْطٍ اِلٰی بُیُوْتِ اَزْوَاجِ النَّبِیِّ ﷺ یَسْاَلُوْنَ عَنْ عِبَادَۃِ النَّبِیِّ ﷺ ،فَلَمَّا اُخْبِرُوْا کَاَنَّھُمْ تَقَالُّوْھَا، فَقَالُوْا: وَاَیْنَ نَحْنُ مِنَ النَّبِیِّ ﷺ ،قَدْ غُفِرَلَہٗ مَا تَقَدَّمَ مِنْ ذَنْبِہٖ وَمَا تَاَخَّرَ، قَالَ اَحَدُھُمْ: اَمَّا اَنَا فَاِنِّیْ اُصَلِّیْ اللَّیْلَ اَبَدًا ،وَقَالَ اٰخَرُ: اَنَا اَصُوْمُ الدَّھْرَ وَلَا اُفْطِرُ، وَقَالَ اٰخَرُ: اَنَا اَعْتَزِلُ النِّسَاءَ فَلَا اَتَزَوَّجُ اَبَدًا،فَجَاءَ رَسُوْلُ اللّٰہِ ﷺ اِلَیْھِمْ،فَقَالَ: اَنْتُمُ الَّذِیْنَ قُلْتُمْ کَذَا وَکَذَا، اَمَا وَاللّٰہِ اِنِّیْ لَاَخْشَاکُمْ لِلّٰہِ وَاَتْقَاکُمْ لَہٗ لٰکِنِّیْ اَصُوْمُ وَاُفطِرُ وَاُصَلِّیْ وَاَرْقُدُ وَاَتَزَوَّجُ النِّسَاءَ فَمَن رَّغِبَ عَنْ سُنَّتِیْ فَلَیْسَ مِنِّیْ]]‘‘۔ 
ترجمہ:’’حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ: تین افرادنبی صلی اللہ علیہ وسلم کی ازواج کے گھروں پرگئے اور ان سے نبی صلی اللہ علیہ وسلم کی عبادت (کے معمولات) سے متعلق سوال کیا، پس جب انہیں(نبی صلی اللہ علیہ وسلم کی عبادت کے معمولات) بتائے گئے ، توگویا انہوں نے(اپنی دانست میںاس مقدارِ عبادت کو) کم سمجھا ۔ پھر انہوں نے کہا: کہاں ہم اورکہاں نبی صلی اللہ علیہ وسلم ؟،آپ کے تو تمام اگلے اور پچھلے بہ ظاہر خلافِ اولیٰ کاموں کی مغفرت کی (قرآن`
},
{
  pageNumber: 157,
  text: `کریم میں قطعی) نوید دی گئی ہے،تو ان میں سے ایک نے کہا:’’میں تو ہمیشہ پوری رات نوافل پڑھتے ہوئے گزاروں گا‘‘، دوسرے نے کہا:’’ میں ہمیشہ (نفلی)روزے رکھاکروں گا اور روزہ کبھی نہیں چھوڑوں گا‘‘، تیسرے نے کہا: ’’میں ہمیشہ عورتوں سے اجتناب کروں گااور کبھی نکاح نہیں کروں گا(تاکہ نہ بیوی بچے ہوں اورنہ خانگی ذمے داریوں کا جھنجھٹ)‘‘ ۔دریں اثنا رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے ،تو آپ ﷺ نے (اُن کی باتوں کو سن کر ) فرمایا: تو تم وہ لوگ ہو جنہوں نے ایسا ایسا کہا تھا؟،سنو! اللہ کی قسم! بے شک میں تم سب سے زیادہ متقی ہوں اور میرے دل میں اللہ کی خَشیَت سب سے زیادہ ہے، لیکن میں (نفلی)روزے رکھتا بھی ہوں اورکبھی چھوڑبھی دیتا ہوں اوررات کو(نوافل) پڑھتاہوں اور(کچھ دیر کے لیے) سوبھی جاتا ہوں اور میں نے عورتوں سے نکاح بھی کیے ہوئے ہیں،سو جس نے میری سنت سے اِعراض کرکے(تقوے کا من پسند طریقہ اختیار کیا) تو وہ میرے (پسندیدہ)طریقے پر نہیں ہے،(بخاری: 5063)‘‘۔
سطور بالا میں ہم نے عام ضابطہ بیان کیاہے ،لیکن آپ نے نماز فجر کے بعد بیس منٹ اور نمازِ عشاء کے بعد تیس منٹ کے وظائف کاجومعمول بتایاہے ،یہ بہت زیادہ وقت نہیں ہے۔اگر ان اوقات میں آپ کے شوہر کے کسی کام کاحرج نہ ہورہاہو یا صبح بچوں کے اسکول کی تیاری یا رات کو چھوٹے بچوں کے سلانے میں حرج نہ ہورہاہو ،تو شوہر کو دل بڑا رکھنا چاہیے ،کیونکہ گھر میں عبادت ،تلاوت اور اَذکار برکت کا سبب ہوتے ہیں اوراگروظائف کسی کام میں حرج کا سبب ہوں تو آپ اپنی سہولت کے مطابق وقت تبدیل کرلیں ۔نفلی عبادت کے معاملے میںخاوند سے مطابقت پیداکرنا بہتر ہے، خاوند کی رضامندی کے لیے نفلی عبادات میں تخفیف کی جاسکتی ہے ، یہاں تک کہ خاوند کے کہنے پر نفلی روزہ بھی چھوڑا جاسکتاہے۔

[[heading: ادا بہ نیتِ قضا یا قضا بہ نیتِ ادا پڑھنا]] 
سوال:
ایک شخص نمازِ ظہراخیروقت میں پڑھنے کے لیے کھڑا ہوا ،اُس نے گمان کیا کہ نماز قضا`
},
{
  pageNumber: 158,
  text: `ہوچکی ہے ،لہٰذا آج کی نمازِ ظہر قضا کی نیت کرلی ،بعد میں معلوم ہواکہ جس وقت اس نے نماز پڑھی ،ظہر کا وقت باقی تھا ،کیا اس کی نماز اداہوگئی ؟،(سید عمیر الحسن برنی ،کراچی ) ۔
جواب: 
فقہی مسئلہ یہی ہے کہ وقتی نماز پڑھ رہاہے تو قضا یا اداکی نیت کی ضرورت نہیں ، مطلق نیت کافی ہے اور زیادہ بہتر یہ ہے کہ آج کی (ظہر یا عصر) کی نیت کرلے ۔ اگر قضا نمازبہ نیتِ ادا پڑھی یا ادا بہ نیتِ قضا پڑھی ،تو نماز ہوجائے گی ،مثلاً وقتِ ظہر ابھی باقی ہے اور اس نے گمان کیا کہ وقت ختم ہوگیا اور اس دن کی نمازِ ظہر قضا کی نیت سے پڑھی یا وقت نکل جانے کے بعد اس نے اس گمان کے ساتھ کہ وقت باقی ہے ،اداکی نیت سے پڑھی ، نماز ہوگئی یہی مختار قول ہے ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: فَالْاَوْلٰی نِیَّۃُ ظُہْرِالْیَوْمِ لِجَوَازِہٖ مُطْلَقًا لِصِحَّۃِ الْقَضَاءِ بِنِیَّۃِ الْاَدَاءِ کَعَکْسِہٖ ہُوَ الْمُخْتَارُ]]‘‘۔
ترجمہ:’’بہتر یہ ہے کہ آج کی نیت کرے کیونکہ اس کا مطلقاً جواز ہے کیونکہ اداکی نیت سے قضا نماز صحیح ہے جیساکہ قضا کی نیت سے ادانماز صحیح ہے ،یہی مختار قول ہے ‘‘۔
’’[[arabic: قَوْلُہٗ لِصِحَّۃِ الْقَضَاءِ بِنِیَّۃِ الْاَدَاءِ]]‘‘ کی شرح میں علامہ ابن عابدین شامی لکھتے ہیں: 
’’[[arabic: ہٰذَا التَّعْلِیْلُ إنَّمَا یَظْہَرُ إِذَا نَوٰی الْاَدَاءَ،أَمَّاإذَا تَجَرَّدَتْ نِیَّتُہٗ فَلَا، وَالْمُنَاسِبُ مَا فِی الْأَشْبَاہِ عَنِ الْفَتْحِ:لَوْ نَوٰی الْاَدَاءَ عَلٰی ظَنِّ بَقَاءِ الْوَقْتِ فَتَبَیَّنَ خُرُوْجُہٗ أَجْزَأَہٗ وَکَذَا عَکْسُہٗ،ثُمَّ مَثَّلَ لَہٗ نَاقِلًا عَنْ کَشْفِ الْاَسْرَارِ بِقَوْلِہٖ: کَنِیَّۃِ مَنْ نَوٰی أَدَاءَ ظُہْرِ الْیَوْمِ بَعْدَخُرُوجِ الْوَقْتِ عَلٰی ظَنِّ أَنَّ الْوَقْتَ بَاقٍ،وَکَنِیَّۃِ الْاَسِیْرِ الَّذِی اشْتَبَہَ عَلَیْہِ رَمَضَانُ فَتَحَرّٰی شَہْرًا وَصَامَہٗ بِنِیَّۃِ الْاَدَاءِ فَوَقَعَ صَوْمُہٗ بَعْدَ رَمَضَانَ وَعَکْسُہٗ کَنِیَّۃِ مَنْ نَوٰی قَضَاءَ الظُّہْرِعَلٰی ظَنِّ أَنَّ الْوَقْتَ قَدْ خَرَجَ وَلَمْ یَخْرُجْ بَعْدُ، وَکَنِیَّۃِ الْاَسِیْرِ الَّذِیْ صَامَ رَمَضَانَ بِنِیَّۃِ الْقَضَاءِ عَلٰی ظَنِّ أَنَّہٗ قَدْ مَضٰی وَالصِّحَّۃُ فِیْہِ بِاعْتِبَارِ أَنَّہٗ أَتٰی بِاَصْلِ النِّیَّۃِ،وَلٰکِنْ أَخْطَاَ فِی الظَّنِّ وَالْخَطَاُ فِی مِثْلِہٖ مَعْفُوٌّ عَنْہٗ.أَقُوْلُ:وَمَعْنَی کَوْنِہِ أَتٰی بِاَصْلِ]]`
},


{
  pageNumber: 73,
  text: ``
},
{
  pageNumber: 73,
  text: ``
},
{
  pageNumber: 73,
  text: ``
},
]
}
