// جلد یازدہم کا ڈیٹا
// window.bookVolumes میں خودکار رجسٹر ہو جائے گا
window.bookVolumes = window.bookVolumes || {};

window.bookVolumes[11] = {
  volume: 11,
  title: "جلد یازدہم",
  pages: [
    {
      pageNumber: 1,
      text:  `[[heading:  تفہیم المسائل یازدہم
      11]]`
      
    },
    {
      pageNumber: 16,
      text: `[[heading: عقائد کے مسائل]]`
    },
    {
    pageNumber: 17,
    text: `[[heading: عالمِ دین کا کہنا:ہم احمدی ہیں]]
سوال:
کیا فرماتے ہیں علمائے دین شرع متین مسئلہ ھٰذا میں کہ بکر کہتا ہے کہ احمدیہ ہم ہیں، کیونکہ رسول اللہ ﷺ کا نام مبارک احمد ہے، اس لیے احمدیہ ہم ہیں ،قادیانی احمدیہ نہیں ہیں۔ زید نے کہا: احمدیہ قادیانیوں اور مرزائیوں کو کہتے ہیں اور ہمارے عرف میں یہ بات مشہور ہے کہ اگر آپ احمدیہ کہلواتے ہو ،تو وہابی بھی کہلوالو ،کیونکہ وہاب اللہ عزوجل کا نام مبارک ہے۔دریافت طلب بات یہ ہے کہ دونوں میں کس کا قول راجح ہے اور بکر امامت بھی کرواتا ہے،(سائل:محمد امجد رضوی، لاہور)۔
جواب:
یہ بات درست ہے کہ قرآنِ کریم میں سید المرسلین ﷺ کے دو اسمائے گرامی مذکور ہیں :
(۱) احمد ،اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] وَاِذْ قَالَ عِیْسَی ابْنُ مَرْیَمَ یٰبَنِیْ اِسْرَآءِیْلَ اِنِّیْ رَسُوْلُ اللّٰہِ اِلَیْکُمْ مُّصَدِّقًا لِّمَا بَیْنَ یَدَیَّ مِنَ التَّوْرٰىۃِ وَ مُبَشِّرًۢا بِرَسُوْلٍ یَّاْتِیْ مِنْۢ بَعْدِی اسْمُہٗۤ اَحْمَدُ ۫ فَلَمَّا جَآءَہُمْ بِالْبَیِّنٰتِ قَالُوْا ہٰذَا سِحْرٌ مُّبِیْنٌ
ترجمہ:’’اور(یاد کرو)جب عیسیٰ بن مریم نے کہا: اے بنی اسرائیل! میں تمہاری طرف اللہ کا رسول ہوں، اپنے سے پہلی کتاب تورات کی تصدیق کرنے والا ہوں اوراُس( عظیم) رسول کی بشارت دینے والا ہوں ، جو میرے بعد آئے گا، اس کا نام احمد ہے ،پس جب وہ ان کے پاس واضح نشانیاں لے کر آئے تو(کافروں)نے کہا: یہ کھلا جادو ہے، (الصف:6)‘‘۔
(۲)محمد، اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] مُحَمَّدٌ رَّسُوْلُ اللّٰہِ
ترجمہ:’’ محمد اللہ کے رسول ہیں، (الفتح:29)‘‘۔
حدیث پاک میں ہے:’’قَالَ رَسُوْلُ اللّٰہِ ﷺ: أَنَا مُحَمَّدٌ وَأَحْمَدُ ‘‘۔`
  },
  {
    pageNumber: 18,
    text: `ترجمہ: ’’رسول اللہ ﷺ نے فرمایا: میں محمد اور احمد ہوں ،(صحیح البخاری:3532)‘‘۔
 محمد کے معنی ہیں:’’ جس کی بہت زیادہ تعریف کی گئی ہو‘‘ اور احمد کے معنی ہیں:’’بہت زیادہ تعریف کرنے والا ‘‘۔آپ ﷺ کا رب قرآنِ کریم کی آیاتِ مبارکہ میں آپ کی جا بجا تعریف فرماتا ہے اور آپ اپنے ربِ کریم کی تعریف فرماتے ہیں ،ملائکہ اورجنّ وانس میں سے اہلِ ایمان آپ کی تعریف میں رطب اللسان ہیں ۔
	پس نبی کریم ﷺ کے اَعلامِ مبارکہ کی طرف منسوب کر کے معنوی طور پر کوئی صاحبِ ایمان اپنے آپ کو احمدی یا محمدی کہہ سکتا ہے ، لیکن چونکہ ہمارے خطے میں منکرینِ ختمِ نبوت یعنی قادیانی طبقہ اپنے آپ کو ’’احمدی‘‘ کے نام سے متعارف کراتا ہے ، اس لیے احمدی کہنے سے گریز کرنا لازم ہے،سارے مخاطَبین اہلِ علم نہیں ہوتے ،کوئی یہ گمان بھی کرسکتا ہے کہ اس شخص کا تعلق منکرین ختمِ نبوت سے ہے اور کوئی اپنے آپ کو احمدی کہلانے والا قادیانی یہ کہہ سکتا ہے :’’ فلاں مولانا صاحب نے بتایا ہے کہ ہم احمدی ہیں ،تو میں اُن کی تقلید میں ایسا کر رہا ہوں‘‘، اس لیے عوام میں اپنے آپ کو بطورِ احمدی متعارف کرانے سے گریز کرنا چاہیے ، کیونکہ ہر بار اور ہر شخص کے سامنے آپ تقریر کر کے اس کی وضاحت نہیں کر پائیں گے۔حضرت علی کرم اللہ وجہہ الکریم کا قول ہے:
[[arabic]] إِیَّاکَ وَمَا یَسْبِقُ إِلَی الْعُقُوْلِ إِنْکَارُہٗ وَإِنْ کَانَ عِنْدَکَ اِعْتِذَارُہٗ
ترجمہ: ’’ایسی بات کرنے سے بچو جس کا عام لوگ فوراً رد کرنے پر آمادہ ہوجائیں ،اگرچہ آپ کے پاس اس بات کی کوئی (قابلِ قبول) توجیہ بھی ہو، (حاشیۃ الطحطاوی علی مراقی الفلاح، ج:1،ص:680)‘‘۔
علامہ اسماعیل بن محمد العجلونی لکھتے ہیں:
[[arabic]] مَنْ سَلَکَ مَسَالِکَ الظَّنِّ اُتُّھِمَ وَرَوَاہُ ’’الْخَرَائِطِیْ‘‘ فِیْ ’’مَکَارِمِ الْاَخْلَاقِ‘‘ مَرْفُوْعاً بِلَفْظِ: ’’مَنْ اَقَامَ نَفْسَہٗ مَقَامَ التُّھَمِ فَلَا یَلُوْمَنَّ مَنْ اَسَاءَالظَّنَّ بِہٖ‘‘
ترجمہ:’’ جو (بد)گمانوں کی راہوں پر چلے گا،وہ تہمت کا ہدف بنے گا`
  },

  {
    pageNumber: 19,
    text: `اور’’مکارمِ اخلاق‘‘ میں خرائطی نے ان الفاظ کے ساتھ مرفوعاً روایت کیا: ’’مَنْ أَقَامَ نَفْسَہٗ مَقَامَ التُّہَمِ فَلَا یَلُوْمَنَّ مَنْ أَسَاءَ الظَّنَّ بِہٖ‘‘۔
ترجمہ:’’ جو (بد)گمانوں کی راہوں پر چلے گا،وہ تہمت کا ہدف بنے گااور ’’مکارمِ اخلاق‘‘ میں خرائطی نے ان الفاظ کے ساتھ مرفوعاً روایت کیا: ’’جو مقامِ تہمت پر ٹھہرا، اُسے چاہیے کہ بدگمانی کرنے والوں کو ملامت نہ کرے،(کشف الخفاء ومزیل الالباس،الجزء الاول، ص:44)‘‘، یعنی اُس نے اپنے آپ کو ہدفِ ملامت بنانے کا موقع خود فراہم کیا۔ 
علامہ علی القاری نقل کرتے ہیں:
[[arabic]] مَنْ کَانَ یُؤْمِنُ بِاللّٰہِ وَالْیَوْمِ الآخِرِ فَلَا یَقِفَنَّ مَوَاقِفَ التُّھَمِ
ترجمہ:’’جو اللہ اور قیامت کے دن پر ایمان رکھتا ہے ،وہ تہمت کے مقامات پر نہ ٹھہرے، (مرقاۃ المفاتیح شرح مشکاۃ المصابیح،ج:3،ص:77)‘‘۔نیز مقاصدِ شریعہ میں ایک سَدُّ الذَرَائِع بھی ہے، یعنی جس بات سے کوئی خرابی پیدا ہوتی ہو، جواز کی گنجائش کے باوجود اس سے اجتناب بہتر ہے۔ لیکن اگر کوئی صحیح العقیدہ عالم اپنی تاویل اور توجیہ کے ساتھ اپنے آپ کو احمدی کہے تو اس پر کوئی فتویٰ لگانا درست نہیں ہے، تاہم ان کو احسن انداز میں سمجھایا جائے کہ حکمتِ دین کے تحت اور دفعِ مفاسد کے لیے انہیں اس شعار سے گریز کرنا چاہیے، ایسے عالم کی اقتدا میں نماز پڑھنے میں حرج نہیں ہے ،بشرطیکہ کوئی اور شرعی سبب مانع نہ ہو۔
[[heading: کیا ہر صحابی پر ایمان لانا ارکانِ ایمان میں داخل ہے]]
سوال:
	اسلامی عقائد وایمانیات کتنے ہیں، اللہ تعالیٰ پر ،اس کے ہر ایک فرشتے، ہر ایک کتاب، ہر ایک نبی، قیامت کے دن اور تقدیر پر ایمان لانے کے علاوہ آخری نبی رسول اللہ ﷺ کے ہر ایک صحابی پر ایمان لانا ارکان ایمان میں داخل ہے، سائل کا استفتاء ہر ایک صحابی کے صحابی ہونے پر ایمان رکھنے کے بارے میں نہیں ہے بلکہ ہر ایک صحابی پر ایمان لانے کے بارے میں ہے ، (مولانا خطیب الرحمن، یوکے)۔
جواب:
	اسلامی عقائد کا بیان قرآنِ کریم کی متفرق آیات میں موجود ہے ،ذیل میں ہم دو آیاتِ مبارکہ درج کر رہے ہیں:
(۱)
[[arabic]] لَیْسَ الْبِرَّ اَنْ تُوَلُّوْا وُجُوْہَکُمْ قِبَلَ`
  },
  {
    pageNumber: 20,
    text: `[[arabic: الْمَشْرِقِ وَ الْمَغْرِبِ وَ لٰکِنَّ الْبِرَّ مَنْ اٰمَنَ بِاللّٰہِ وَ الْیَوْمِ الْاٰخِرِ وَ الْمَلٰٓئِکَۃِ وَ الْکِتٰبِ وَ النَّبِیّٖنَ
ترجمہ:’’نیکی (کا مرتبۂ کمال) یہ نہیں کہ تم اپنا رُخ مشرق یا مغرب کی جانب پھیر دو ،ہاں ! (کامل)نیکی اُس شخص کی ہے جو اللہ ، قیامت کے دن ، فرشتوں ،(الہامی) کتابوں اور نبیوں پر ایمان لائے ]]،(البقرہ:177)‘‘۔
(۲)
[[arabic]] اٰمَنَ الرَّسُوْلُ بِمَاۤ اُنْزِلَ اِلَیْہِ مِنْ رَّبِّہٖ وَالْمُؤْمِنُوْنَ ۭ کُلٌّ اٰمَنَ بِاللّٰہِ وَمَلٰٓئِکَتِہٖ وَکُتُبِہٖ وَرُسُلِہٖ ۭ لَا نُفَرِّقُ بَیْنَ اَحَدٍ مِّنْ رُّسُلِہٖ ۘ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا ۫ غُفْرَانَکَ رَبَّنَا وَاِلَیْکَ الْمَصِیْرُ
ترجمہ:’’رسول اُس (کلام) پر ایمان لائے جو اُن کی طرف اُن کے رب کی جانب سے نازل ہوا اورمومن (بھی ایمان لائے)، سب ایمان لائے اللہ پر، اُس کے فرشتوں پر، اُس کی کتابوں پر اور اس کے رسولوں پر (یہ کہتے ہوئے)ایمان لائے کہ ہم (ایمان لانے میں) اس کے رسولوں میں کوئی امتیاز نہیں برتتے اورانہوں نے کہا: ہم نے سنا اور ہم نے اطاعت کی ، اے ہمارے رب! ہم تجھ سے بخشش کے طلبگار ہیں اور (ہمیں)تیری ہی طرف لوٹنا ہے ،(البقرہ:285)‘‘۔
	سورۃ البقرہ: 4میں آخرت پر یقین رکھنے کا بھی ذکر ہے ۔موت کے برحق ہونے اور تقدیر کے بارے میں اللہ تعالیٰ نے فرمایا:
[[arabic]] اَیْنَ مَا تَکُوْنُوْا یُدْرِکْکُّمُ الْمَوْتُ وَلَوْ کُنْتُمْ فِیْ بُرُوْجٍ مُّشَیَّدَۃٍ ۭ وَاِنْ تُصِبْہُمْ حَسَنَۃٌ یَّقُوْلُوْا ہٰذِہٖ مِنْ عِنْدِ اللّٰہِ ۚ وَاِنْ تُصِبْہُمْ سَیِّئَۃٌ یَّقُوْلُوْا ہٰذِہٖ مِنْ عِنْدِکَ ۭ قُلْ کُلٌّ مِّنْ عِنْدِ اللّٰہِ ۣ فَمَالِ ہٰٓؤُلَاۗءِ الْقَوْمِ لَا یَکَادُوْنَ یَفْقَہُوْنَ حَدِیْثًا۔ مَآ اَصَابَکَ مِنْ حَسَنَۃٍ فَمِنَ اللّٰہِ ۣ وَمَآ اَصَابَکَ مِنْ سَیِّئَۃٍ فَمِنْ نَّفْسِکَ
ترجمہ:’’تم جہاں کہیں بھی ہو ،موت تم کو پا لے گی ،خواہ تم مضبوط قلعوں میں (محفوظ) ہو،اور اگر اُن کو کچھ اچھائی پہنچے تو کہتے ہیں : یہ اللہ کی جانب سے ہے اور(اے رسول!) اگر اُن کو کوئی برائی پہنچے توکہتے ہیں: یہ آپ کی طرف سے ہے ،آپ کہیے: ہر چیز اللہ کی طرف سے ہے ،تو ان لوگوں کو کیا ہوا کہ یہ کوئی بات سمجھ نہیں پاتے ،(اے مخاطب!)تم کو جو اچھائی پہنچتی ہے ،سو وہ اللہ کی طرف`
  },
  {
    pageNumber: 21,
    text: `سے ہے،اور تم کو جو کوئی برائی پہنچتی ہے ،یہ تمہاری ذات کی طرف سے ہے ،تو(اے مخاطب!) تم کو جو اچھائی پہنچتی ہے ،سو وہ اللہ کی طرف سے ہے اور تم کو جو برائی پہنچتی ہے ،تو وہ تمہاری ذات کے سبب ہے،(النساء:78-79)‘‘۔
	ہمارے ہاں جوابتدائی قاعدے یا نماز کی کتاب پڑھائی جاتی ہے ،اُن میں انہی مسلّمہ عقائد کوایمانِ مُجْمَل اور ایمان مُفصَّل کے عنوان سے بیان کیا گیا ہے ،یہ تو معلوم نہیں ہے کہ ابتدا میں اسے کن صاحبِ علم نے ان عنوانات سے مرتّب کیا ،لیکن یہ بہر حال قرآن وسنت سے ماخوذ ہیں اور معنوی طور پر بالکل درست ہیں ۔جن کتبِ الٰہی کے نام قرآنِ مجید میں صراحت کے ساتھ مذکور ہیں، اُن پر تعیین کے ساتھ ایمان لانا ضروری ہے اور باقی کتب سماوی پر اجمالی طور پر ایمان لانا ضروری ہے، قرآنِ کریم میں سورۃ الاعلیٰ میں صُحُفِ اِبْراھِیْمَ وَمُوْسیٰ ’’علیہما السلام ‘‘کا بھی اجمالاً تذکرہ کیا گیا ہے۔ اجمالی ایمان لانے کے معنی یہ ہیں کہ اللہ تعالیٰ نے جتنی کتابیں مختلف ادوار میں نازل فرمائیں ،وہ سب حق ہیں ۔ اسی طرح اللہ تعالیٰ نے فرمایا:
[[arabic]] وَ لَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِکَ مِنْہُمْ مَّنْ قَصَصْنَا عَلَیْکَ وَمِنْہُمْ مَّنْ لَّمْ نَقْصُصْ عَلَیْکَ
ترجمہ: ’’اور بے شک ہم نے (وقتاً فوقتاً )آپ سے پہلے بھی رسول بھیجے اور ہم نے بعض کے حالات آپ کے سامنے بیان کیے ہیں اور بعض کے حالات بیان نہیں کیے ، (المومن:78)‘‘۔ 
	سو جن انبیائے کرام اور رُسُلِ عظام کے اسمائے مبارکہ قرآنِ کریم اور احادیثِ مبارکہ میں تعیین کے ساتھ بیان کیے گئے ہیں ،اُن پر نام بنام اور تعیین کے ساتھ ایمان لانا ضروری ہے اور جن انبیائے کرام کے اسمائے مبارکہ قرآن وحدیث میں بیان نہیں ہوئے، اُن پر اجمالاً ایمان لانا ضروری ہے ۔بعض روایات کی رُو سے انبیائے کرام کی تعداد ایک لاکھ چوبیس ہزار (یا کم وبیش )، رُسلِ عظام کی تعداد تین سو تیرہ( یا کم وبیش ) اور الہامی کتابوں اور صحیفوںکی تعداد ایک سو دس (یا کم وبیش ) ہے،وَاللہُ تَعَالیٰ اَعْلَمُ بِالصَّوَاب۔ 
	اسی طرح ملائکہ میں سے بعض کے نام قرآنِ کریم میں مذکور ہیں ،جن میں چار ملائک کا تذکرہ`
  },
  {
    pageNumber: 22,
    text: `واضح طور پر آیا ہے،بعض کا حاملینِ عرش کے طور پر آیا،بعض کا ملائکۃ المقرّبین کے نام سے ذکر آیا ہے ،بعض کا کراماً کاتبین کے طور پر آیا ہے ،جہنم کے نگہبان فرشتے کا نام مالک بتایا گیا ہے وغیرہم۔اللہ تعالیٰ کے فرشتوں کی حقیقی اور قطعی تعداد قرآنِ کریم یا احادیثِ صحیحہ میں بیان نہیں فرمائی گئی، اس لیے اُن سب پر اجمالاً ایمان لانا ضروری ہے ۔
	ہر صحابی پر ایمان لانا ضروری نہیں ہے ،جن کی صحابیت احادیث وروایات سے ثابت ہو ،انہیں صحابیِ رسول ماننا لازم ہے اور ہوسکتا ہے کہ کئی ایسے صحابہ وصحابیات ہوں جن کے اسمائے گرامی احادیث وآثار میں مذکور نہیں ہیں ،اُنہیں اجمالی طور پر ماننا لازم ہے۔اگر ہم یہ کہیں کہ ہر صحابی پر ایمان لانا ضروری ہے ،توکسی صحابی کی صحابیت سے انکارپر کفر لازم آئے گا۔بعض صحابۂ کرام کی طرف قرآنِ کریم میں اشارات موجود ہیں ،بطورِ خاص حضرت ابوبکر صدیق رضی اللہ عنہ کا تذکرہ سفرِ ہجرت کے موقع پر غارِ ثور کے حوالے سے قرآن میں بیان فرمایا اور ’’صَاحِب‘‘کہہ کر اُن کا ذکر کیا گیا ہے اور اس پر امت کا اجماع ہے کہ اس کے مصداق وہی ہیں ،یہاں تک کہ اہلِ تشیّع بھی اس کا انکار نہیں کرسکتے ،کیونکہ غار میں آپ ﷺ اور حضرت ابوبکر صدیق رضی اللہ عنہ کے سوا کوئی اورتھا ہی نہیں  اور اس آیت میں چھ مرتبہ اُن کا ذکر ہوا ہے ۔
امام فخر الدین رازی التوبہ:40کی تفسیر میں حضرت ابوبکر صدیق ؄ کی فضیلت اور خصائص کی من جملہ وجوہ میں سے لکھتے ہیں:
’’اللہ تعالیٰ نے ابوبکر کا وصف بیان کیا کہ وہ رسول اللہ ﷺ کے صاحب ہیں اور یہ اُن کی کمالِ فضیلت پر دلالت کرتا ہے، حسین بن فضیل بَجَلی نے کہا: جو ابوبکر کی صحابیت کا انکار کرے ،وہ کافر ہے،کیونکہ امت کا اس پر اجماع ہے :’’ إِذْ يَقُولُ لِصاحِبِهٖ‘‘کا مصداق ابوبکرِ صدیق ہی ہیں اور یہ اس بات پر دلالت کرتا ہے کہ اللہ تعالیٰ نےاُن کا وصف ’’صاحِب‘‘بتایا‘‘۔

علامہ غلام رسول سعیدی  لکھتے ہیں:
’’اس آیت(التوبہ:40) میں اللہ تعالیٰ نے یہ تصریح فرمائی ہے کہ حضرت ابوبکر`
  },
  {
    pageNumber: 23,
    text: `نبی ﷺ کے صاحب ہیں اور یہ نصِ قطعی ہے،اس کا انکار کفر ہے اور تمام صحابہ میں صرف حضرت ابوبکر ؄کی صحابیت منصوص ہے اور آپ کے صحابی ہونے کا انکار کفر ہے،(تبیان القرآن، ج:5، ص:141)‘‘۔
امام احمد رضا قادری نے لکھا ہے:
’’یہ فقہائے کرام کے نزدیک ہے ، متکلمین یعنی ماہرینِ علم العقائد کے نزدیک کفر نہیں ہے، (جِدُّ الْمُمْتَار، ج:3،ص:42)‘‘۔
	سورۃ الاحزاب میں حضرت زید کا نام کے ساتھ ذکر ہوا، بعض دیگر اجلہّ صحابۂ کرام کو بھی بعض آیات کا مصداق قرار دیا گیا ہے ،مہاجرین وانصار ،اہلِ بدر واُحُد ،بیعتِ رضوان،  فتحِ مکہ ودیگر غزوات کے حوالے سے صحابۂ کرام کا ذکرمتعدد مقامات پر قرآنِ مجید میں ہے،چند آیاتِ مبارکہ  پیش کی جاتی ہیں:
(۱)
[[arabic]] لَقَدْ رَضِیَ اللّٰہُ عَنِ الْمُؤْمِنِیْنَ اِذْ یُبَایِعُوْنَکَ تَحْتَ الشَّجَرَۃِ فَعَلِمَ مَا فِیْ قُلُوْبِہِمْ فَاَنْزَلَ السَّکِیْنَۃَ عَلَیْہِمْ وَاَثَابَہُمْ فَتْحًا قَرِیْبًا
ترجمہ:’’بے شک اللہ ایمان والوں سے اس وقت راضی ہوگیا جب وہ درخت کے نیچےآپ سے بیعت کر رہے تھے، سو اللہ جانتا تھا جو کچھ ان کے دلوں میں ہے، پس اللہ نے ان کے دلوں پر طمانیت نازل فرمائی اور ان کو عنقریب آنے والی فتح کا انعام دیا، (الفتح:18)‘‘۔
(۲)
[[arabic]] وَالَّذِیْنَ اٰمَنُوْا وَہَاجَرُوْا وَجَاہَدُوْا فِیْ سَبِیْلِ اللّٰہِ وَالَّذِیْنَ اٰوَوْا وَّنَصَرُوْۤا اُولٰٓئِکَ ہُمُ الْمُؤْمِنُوْنَ حَقًّا ۭ لَہُمْ مَّغْفِرَۃٌ وَّرِزْقٌ کَرِیْمٌ۔ وَالَّذِیْنَ اٰمَنُوْا مِنْۢ بَعْدُ وَہَاجَرُوْا وَجَاہَدُوْا مَعَکُمْ فَاُولٰٓئِکَ مِنْکُمْ ۭ وَاُولُوا الْاَرْحَامِ بَعْضُہُمْ اَوْلٰی بِبَعْضٍ فِیْ کِتٰبِ اللّٰہِ ۭ اِنَّ اللّٰہَ بِکُلِّ شَیْءٍ عَلِیْمٌ
ترجمہ:’’اور جولوگ ایمان لائے اور انہوں نے ہجرت کی اور اللہ کی راہ میں جہاد کیا اور جن لوگوں نے (مہاجرین کو)جگہ دی اور ان کی نصرت کی، یہی لوگ برحق مومن ہیں، ان کے`
  },
  {
    pageNumber: 24,
    text: `لیے بخشش ہے اورعزت والی روزی ہے اور جولوگ بعد میں ایمان لائے اورہجرت کی اورتمہارے ساتھ جہاد کیا، سووہ بھی تم میں سے ہیں اور اللہ کی کتاب میں قرابت دار(بہ طور وراثت) ایک دوسرے کے زیادہ حق دار ہیں ،بے شک اللہ ہر چیز کوخوب جاننے والا ہے‘‘،(الانفال:74-75)‘‘۔
(۳)
[[arabic]] لَا یَسْتَوِیْ مِنْکُمْ مَّنْ اَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقٰتَلَ ۭ اُولٰٓئِکَ اَعْظَمُ دَرَجَۃً مِّنَ الَّذِیْنَ اَنْفَقُوْا مِنْۢ بَعْدُ وَقٰتَلُوْا ۭ وَکُلًّا وَّعَدَ اللّٰہُ الْحُسْنٰی ۭ وَاللّٰہُ بِمَا تَعْمَلُوْنَ خَبِیْرٌ
ترجمہ:’’(اے مسلمانو!) تم میں سے کوئی بھی ان کے برابر نہیں ہوسکتا جنہوں نے فتح ( مکہ) سے پہلے (اللہ کی راہ میں)خرچ کیا اور (کافروں سے)قتال کیا، ان کا (ان مسلمانوں سے) بہت بڑادرجہ ہے جنہوں نے بعد میں (اللہ کی راہ میں) خرچ کیا اور(کافروں سے) قتال کیا، اللہ نے ان سب سے اچھے انجام کا وعدہ فرمایا ہے اور اللہ تمہارے تمام کاموں کی خوب خبر رکھنے والا ہے،(الحدید:10)‘‘۔
(۴)
[[arabic]] وَالسّٰبِقُوْنَ الْاَوَّلُوْنَ مِنَ الْمُہٰجِرِیْنَ وَالْاَنْصَارِ وَالَّذِیْنَ اتَّبَعُوْہُمْ بِاِحْسَانٍ رَّضِیَ اللّٰہُ عَنْہُمْ وَرَضُوْا عَنْہُ وَاَعَدَّ لَہُمْ جَنّٰتٍ تَجْرِیْ تَحْتَہَا الْاَنْہٰرُ خٰلِدِیْنَ فِیْہَاۤ اَبَدًا ۭ ذٰلِکَ الْفَوْزُ الْعَظِیْمُ
ترجمہ:’’اور مہاجرین اور انصار میں سے (نیکی میں)سبقت کرنے والے اور سب سے پہلے ایمان لانے والے اور جن مسلمانوں نے نیکی میں ان کا اتباع کیا، اللہ ان سے راضی ہوگیا اور وہ اللہ سے راضی ہوگئے اور اللہ نے ان کے لیے ایسی جنتیں تیار کی ہیں جن کے نیچے دریا بہتے ہیں ،وہ ان میں ہمیشہ ہمیشہ رہیں گے ،یہی بہت بڑی کامیابی ہے، (التوبہ:100)‘‘۔
(۵)
[[arabic]] مُحَمَّدٌ رَّسُوْلُ اللّٰہِ ۭ وَالَّذِیْنَ مَعَہٗۤ اَشِدَّآءُ عَلَی الْکُفَّارِ رُحَمَآءُ بَیْنَہُمْ تَرٰىہُمْ رُکَّعًا سُجَّدًا یَّبْتَغُوْنَ فَضْلًا مِّنَ اللّٰہِ وَرِضْوَانًا ۫ سِیْمَاہُمْ فِیْ وُجُوْہِہِمْ مِّنْ اَثَرِ السُّجُوْدِ`
  },
  {
    pageNumber: 25,
    text: `ذٰلِکَ مَثَلُہُمْ فِی التَّوْرٰىۃِ ۚۖ وَمَثَلُہُمْ فِی الْاِنْجِیْلِ کَزَرْعٍ اَخْرَجَ شَطْاَہٗ فَاٰزَرَہٗ فَاسْتَغْلَظَ فَاسْتَوٰی عَلٰی سُوْقِہٖ یُعْجِبُ الزُّرَّاعَ لِیَغِیْظَ بِہِمُ الْکُفَّارَ ۭ وَعَدَ اللّٰہُ الَّذِیْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ مِنْہُمْ مَّغْفِرَۃً وَّاَجْرًا عَظِیْمًا
ترجمہ:’’ محمد اللہ کے رسول ہیں، جو ان کے اصحاب ہیں کفار پر بہت سخت ہیں ،آپس میں نرم دل ہیں، (اے مخاطب!) تو ان کو رکوع کرتے ہوئے ،سجدہ کرتے ہوئے دیکھے گا، وہ اللہ کا فضل اور اس کی رضاچاہتے ہیں، ان کی نشانی  ان کے چہروں پرسجدوں کے نشان (انوار)ہیں، ان کی یہ صفت تورات میں ہے اور انجیل میں ان کی صفت یہ ہے:جیسے ایک کھیتی ہو، اس نے اپنی کونپل نکالی، پھر اس نے طاقت پکڑی، پھر وہ دبیز ہوئی ، پھر وہ اپنے تنے پر سیدھی کھڑی ہوگئی ،کاشت کاروں کو بھلی لگتی ہے تاکہ ان کی وجہ سے کافروں کے دل جلیں، ان میں سے جو لوگ ایمان لائے اور انہوں نے نیک عمل کیے ،اللہ نے ان سے بخشش اور اجرِ عظیم کا وعدہ فرمایا ہے، (الفتح:29)‘‘۔
	لیکن یہ ذکر عمومی اعتبار سے ہے ،ہر صحابی کا ذکر شخصی طورنہیں ہے،اس لیے ان میں سے ہر ایک کی صحابیت کاشخصی طور پر اعتقاد رکھنا ضروریاتِ دین میں سے نہیں ہے،لیکن جملہ انبیائے کرام علیہم السلام کی طرح اجمالی اعتقاد یقیناً ہے۔الغرض صحابہ کرام کے عمومی فضائل قرآنِ کریم میں مذکور ہیں،اُن پر سبّ وشتم اور تبرّا کرنے والا ضالّ ،مُضلّ اور مبتدع ہے ۔
[[heading: اسمِ جلالت کی ہیئت میں پنجتن پاک کے نام لکھنا]]
سوال:
	کیا فرماتے ہیں علمائے کرام اس مسئلہ کے بارے میں کہ ہماری مسجد کی تعمیر نو ہوئی ہے اور اس کے محراب میں شیشہ کا کام ہوا ہے ،محراب کی چھت میں کاریگر نے فن خطاطی سے اسمائے پنجتن پاک کو اس طرح ڈھالا ہے کہ بداھۃً اسم اللہ عزوجل معلوم ہوتا ہے اور غور وفکرکے بعداسمائے مبارکہ پنجتن پاک ۔ ایک مفتی صاحب  نے کہا کہ یہ ان غالی شیعوں سے تشابہ ہے جو حضرت علی ؄ یا پنج تن پاک کو ہی اللہ مانتے ہیں اوراس میں تَشَبـُہْ فیِ التَّوْحِیْد ہے، یہ صحیح نہیں ہے ۔دوسرے مفتی صاحب کا کہنا ہے کہ یہ اظہار محبت اہل بیت کا بہترین انداز ہے اور دیو بندیوں وھابیوں کو چڑانے کا خوبصورت مرقعہ ہے ،اب آپ حضرات کو اس تبحر علمی کا واسطہ جو اللہ نے آپ کو عطا فرمایا ہے ہما ری رہنمائی کریں اورمفصل اور مدلل فتوی عنایت کریں ،(سائل:حافظ محمد رمضان مصطفائی ،ٹنڈو محمد خان ، سندھ )۔`
  },
  {
    pageNumber: 26,
    text: `جواب:
	پنجتن پاک کے اسمائے مبارکہ کواس انداز میں لکھنا کہ اسمِ جلالت اللہ کی ہیئت نظر آئے، اگر اس بنا ء پر ہو کہ اَلْعِیَاذُ بِاللّٰہ !اللہ تبارک وتعالیٰ ان پانچ مقدس ہستیوں میں حلول کیے ہوئے ہے، جیسا کہ بعض غالی رافضیوں کا عقیدہ ہے کہ اللہ تعالیٰ حضرت علی میں حلول کیے ہوئے ہے ،تو یہ صریح کفر ہے ۔اللہ رب العزت،کسی مخلوق میں،خواہ اس کا مرتبہ کتنا ہی عظیم تر کیوں نہ ہو، حلول کرنے سے پاک اور منزہ ہے اوراللہ تعالیٰ جسم ،جسمانیات ، اُن کے متعلقات اور تقاضوں سے قطعی طور پرپاک اور مبرّا ہے۔
	قرآن پا ک میں اللہ تبارک و تعالیٰ نے عیسائیوں کے اسی عقیدے کو بیان کرتے ہوئے ارشاد فرمایا:
(۱)
[[arabic]] وَاِذْ قَالَ اللّٰہُ یٰعِیْسَی ابْنَ مَرْیَمَ ءَاَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُوْنِیْ وَاُمِّیَ اِلٰہَیْنِ مِنْ دُوْنِ اللّٰہِ ۭ قَالَ سُبْحٰنَکَ مَا یَکُوْنُ لِیْۤ اَنْ اَقُوْلَ مَا لَیْسَ لِیْ بِحَقٍّ ۭ اِنْ کُنْتُ قُلْتُہٗ فَقَدْ عَلِمْتَہٗ ۭ تَعْلَمُ مَا فِیْ نَفْسِیْ وَلَاۤ اَعْلَمُ مَا فِیْ نَفْسِکَ ۭ اِنَّکَ اَنْتَ عَلَّامُ الْغُیُوْبِ
ترجمہ:’’اور(یاد کرو)جب اللہ فرمائے گا: اے عیسیٰ بن مریم! کیا تو نے لوگوں سے کہا تھا: مجھے اور میری ماں کواللہ کے سوا دومعبود مان لو ،وہ  عرض کریں گے:تو(شریک سے)پاک ہے، میری یہ مجال نہیں تھی کہ میں وہ بات کہتا جس کا مجھے کوئی حق نہیں، اگر(بفرضِ محال)میں نے یہ بات کہی ہوتی تو ضرورتو اُسے جانتا،تو ہر وہ بات جانتا ہے جو میرے دل میں ہےاور میں ہر وہ بات نہیں جانتا جو تیرے علم میں ہے ،بے شک تو ہی سب غیبوں کا جاننے والاہے، (المائدہ: 116)‘‘۔
(2)
[[arabic]] لَقَدْ کَفَرَ الَّذِیْنَ قَالُوْۤا اِنَّ اللّٰہَ ثَالِثُ ثَلٰثَۃٍ
ترجمہ:’’بیشک وہ لوگ کافر ہوگئے جنہوں نے کہا: بلاشبہ اللہ تین میں سے تیسرا ہے ، (المائدہ: 73)‘‘۔
اس آیت کی تفسیر میںصدرالافاضل علامہ سید محمد نعیم الدین مراد آبادی فرماتے ہیں:`
  },
  {
    pageNumber: 27,
    text: `’’یہ قول نصارٰی کے فرقہ مرقوسیہ و نسطوریہ کا ہے ۔ اکثر مفسِّرین کا قول ہے کہ اس سے ان کی مراد یہ تھی کہ اللہ اور مریم اور عیسٰی تینوں اِلٰہ ہیں اوراِلٰہ ہونا ان سب میں مشترک ہے ۔ متکلِّمین فرماتے ہیں: نصارٰی کہتے ہیں کہ باپ ، بیٹا ، روح القدس یہ تینوں ایک اِلٰہ ہیں ‘‘۔
امام فخر الدین رازی تفسیر کبیر میں اس آیت کے تحت لکھتے ہیں:
[[arabic]] اِنَّ الْمُتَکَلِّمِیْنَ حَکَوْا عَنِ النَّصَارٰی اَنَّھُمْ یَقُوْلُوْنَ:جَوْھَرٌوَاحِدٌ ،ثَلَاثَۃُ اَقَانِیْم:اَبٌ ، وَاِبْنٌ،وَرُوْحُ الْقُدُسِ،وَھٰذِہِ الثَّلَاثَۃُ اِلٰہٌ وَاحِدٌ ، کَمَااَنَّ الشَّمْسَ اِسْمٌ یَتَنَاوَلُ الْقُرْصَ وَالشُّعَاعَ وَالْحَرَارَۃَ ،وَعَنَوْابِالْاَبِ الذَّاتَ، وَبِالْاِبْنِ الْکَلِمَۃَ ، وَبِا لرُّوْحِ  الْحَیَاۃَ ، وَاَثْبَتُوا الذَّاتَ وَالْکَلِمَۃَ وَالْحَیَاۃَ ، وَقَالُوْا::اِنَّ الْکَلِمَۃَ الَّتِیْ ھِیَ کَلَامُ اللّٰہِ اخْتَلَطَتْ بِجَسَدِعِیْسٰی اِخْتِلَاطَ الْمَاءِ بِا لْخَمْرِ ، وَاِخْتِلَا طَ الْمَاءِ بِا للَّبَنِ ، وَزَعَمُوْا اَنَّ الْاَبَ اِلٰہٌ وَالْاِبْنَ اِلٰہٌ وَالرُّوْحَ اِلٰہٌ وَالْکُلُّ اِلٰہٌ وَاحِدٌ ،وَاعْلَمْ اَنَّ ھٰذَا مَعْلُوْمُ الْبُطْلَانِ بِبَدِیْھَۃِ الْعَقْلِ، فَاِنَّ الثَّلَاثَۃَ لَا تَکُوْنُ وَاحِدًا، وَالْوَاحِدَ لَا یَکُوْنُ ثَلَاثَۃً ، وَلَا یُرٰی فِی الدُّنْیَامَقَالَۃٌ اَشَدُّ فَسَادًا وَاَظْہَرُ  بُطْلَانًا مِّنْ مَّقَالَۃِ النَّصَارٰی
ترجمہ:’’ متکلمین نے نصاری کے حوالے سے بیان کیاہے :(الوہیت )ایک جوہر ہے اور(اس کی) تین اقنوم (یعنی اصلیں)ہیں : باپ ، بیٹا ، اور روح القدس ، اور یہ تینوں (بحیثیت مجموعی )ایک خدا ہیں، جیسے سورج قُرص ، شعاع اور حرارت تینوں پرمشتمل ہے اور انہوں نے باپ سے ذات ،بیٹے سے کلمہ اور روح القدس سے حیات مراد لی ہے۔ انہوں نے ذات ، کلمہ اور حیات کو ثابت کیا اور کہا: کلمہ اللہ کا کلام ہے جو حضرت عیسیٰ کے جسم میں حلول کر گیا ، جیسے پانی شراب یا دودھ میںمل جاتا ہے اور انہوں نے گمان کیا: باپ(بھی) خدا ہے ، بیٹا (بھی)خداہے اور روح(بھی) خدا ہے اوراس کے باوجود سب ایک ہی خدا ہیں ۔اور جان لو کہ نصاریٰ کا یہ عقیدہ بداہۃًباطل ہے (یعنی اس کے بطلان کو سمجھنے کے لیے کسی غوروفکر کی ضرورت نہیں ہے) ، کیونکہ تین ایک نہیں ہوتا اور ایک تین نہیںہوتے اور نصاریٰ کے اس قول سے زیادہ فاسد اور واضح طور پرباطل بات دنیا میں اور کوئی نہیں ہے‘‘۔
محدث اعظم پاکستان علامہ غلام رسول سعیدی لکھتے ہیں:`
  },
  {
    pageNumber: 28,
    text: `’’نصاریٰ میں سے ایک فرقہ یعقوبیہ ہے ،جس کا عقیدہ ہے کہ مسیح ابن مریم ہی اللہ ہے ، وہ کہتے ہیں : اللہ تین اقانیم (اصلوں )سے مرکب ہے : باپ ، بیٹا اور روح القدس۔ باپ اللہ ہے، بیٹا مسیح ہے اور باپ (اللہ)بیٹے ( مسیح)میں حلول کر کے اسکے ساتھ متحدہوگیا اور روح القدس بن گیا اور ان میں سے ہر ایک دوسرے کا عین ہے۔ ان کے اس قول کا خلاصہ یہ ہے کہ مسیح ہی اللہ ہے ، حالانکہ حضرت عیسی علیہ السلام نے پیدا ہوتے ہی جو کلمہ سب سے پہلے کہا ، وہ یہ تھا:’’میں اللہ کا بندہ ہوں‘‘۔
( تبیان القرآن،ج:3،ص:260،فرید بک اسٹال ،لاہور)
	الغرض عیسائیوں کے مذکورہ باطل عقیدے کی طرح بعض غالی روافض بھی پنجتن پاک بالخصوص حضرت علی ؄ میں اللہ تعالی ٰ کا حلول مانتے ہیں جو کہ صریح کفر ہے ، پس اسمائے پنجتن پاک کو اس طرح لکھنے میں اس کفریہ عقیدے کا ایہام پایا جا رہا ہے اور کسی کفریہ معنی کا ایہام ہی اس بات کے ممنوع ہونے کے لیے کافی ہے ،اگرچہ اس کی کوئی صحیح تاویل بھی موجود ہو ۔رہی یہ توجیہ کہ پنجتن پاک کا نام عقیدت ومحبت کے اظہار کے لیے لکھا جاتا ہے، تو اُس کے لیے ایسا پیرایہ اختیار کرنا چاہیے کہ جس میں اس طرح کا نہ کوئی ایہام اور اشتباہ پیدا ہواور نہ ہی لوگوں کو انگشت نمائی کا موقع ملے۔
علامہ ابن عابدین شامی لکھتے ہیں:
[[arabic]] اَنَّ مُجَرَّدَ اِیْھَامِ الْمَعْنَی الْمُحَالِ کَافٍ فِی الْمَنْعِ عَنِ التَّلَفُّظِ بِھٰذَا الْکَلَامِ وَاِنِ احْتَمَلَ مَعْنًی صَحِیْحاً
ترجمہ:’’عبارت سے محض محال معنی کا وہم پیدا ہونا ہی ایسے کلام کو منع کرنے کے لیے کافی ہے ،خواہ (کسی کے نزدیک)وہ صحیح معنی کا احتمال بھی رکھتاہو‘‘۔
(رد المحتار: ج: 9، ص:625)
	الغرض پنجتن پاک کا نام اسمِ جلالت کی ہیئت میں لکھنا کبھی بھی مسلمانوں کا شِعار نہیں رہا اور ہمیں کوئی ایسا انداز اختیار کرنے سے احتراز کرنا چاہیے جو مسلمانوں میں کسی بھی درجے میں افتراق وانتشار کا باعث بنے اور اس سے دینِ حق اسلام اور مسلکِ حق اہلسنت وجماعت کو کوئی فائدہ بھی حاصل نہ ہو۔خصوصاً اس پر فتن دور میں دینی مصلحت وحکمت کے تحت اس طرح کے اندازِ تحریر سے اجتناب لازم ہے ،حدیث پا ک میں ہے:`
  },
  {
    pageNumber: 29,
    text: `(1)
[[arabic]] عَنْ أَبِی أَیُّوبِ الْأَنْصَارِیِّ رَضِیَ اللّٰہُ عَنْہُ ،قَالَ::قَالَ رَسُوْلُ اللّٰہِ ﷺ:إِذَا صَلَّیْتَ فَصَلِّ صَلَاۃَ مُوَدِّعٍ وَلَا تَتَحَدَّثَنَّ بِکَلَامٍ تَعْتَذِرُ مِنْہُ غَدًا، قَالَ أَبُو بَکْرٍ: وَقَالَ بَعْضُ الْحُکَمَاءِ::إِیَّاکَ وَمَا یُعْتَذَرُ مِنْہُ، وَمَا یُسْتَحْیَا مِنْ ذِکْرِہٖ، فَإِنَّمَا یُعْتَذَرُ مِنَ الذَّنْبِ، وَیُسْتَحْیَا مِنَ الْقَبِیحِ
ترجمہ:’’حضرت ابوایوب انصاری ؄ بیان کرتے ہیں :رسول اللہ ﷺ نے فرمایا: ’’جب تم نماز پڑھو (تو اس انہماک سے پڑھو کہ گویا یہ تمہاری زندگی کی )آخری نماز ہے اور ہر ایسی بات سے بچو جس پر بعد میں تمہیںعذر خواہی کرنی پڑے، ابوبکر نے کہا: کسی دانا کا قول ہے :ہر اُس چیز سے بچو ،جس سے عذر خواہی کرنی پڑے اور اس کے ذکر سے حیا آئے، کیونکہ گناہ پر عذر خواہی کرنی پڑتی ہے اور قبیح بات (بیان کرنے )سے حیاآتی ہے،(مکارم الاخلاق للخرائطی:484)‘‘۔
(2):
[[arabic]] عَنْ أَبِی الْحَوْرَاءِ السَّعْدِیِّ قَالَ::قُلْتُ:لِلْحَسَنِ بْنِ عَلِیٍّ رَضِیَ اللّٰہُ عَنْہُمَا :مَاحَفِظْتَ مِنْ رَسُوْلِ اللّٰہِ ﷺ،قَالَ::حَفِظْتُ مِنْ رَّسُوْلِ اللّٰہِ ﷺ:دَعْ مَا یَرِیْبُکَ إِلٰی مَالاَ یَرِیْبُکَ، فَإِنَّ الصِّدْقَ طُمَأْنِیْنَۃٌ وَإِنَّ الْکَذِبَ رِیْبَۃٌ
ترجمہ:’’ابوحوراء بیان کرتے ہیں: میں نے حسن بن علی سے کہا: آپ نے رسول اللہ ﷺ سے (سب سے مفید بات )کون سی یاد رکھی ہے ؟، انہوں نے کہا: میں نے رسول اللہ ﷺ سے (اہم بات یہ )یاد کر رکھی ہے :’’جو چیز تمہیں شک میں ڈالے،اسے چھوڑ دواوراس کے بجائے اس بات کو اختیارکرو جو تمہیں شک میں نہ ڈالے (یعنی اس کی صحت واضح ہو)،کیونکہ سچائی میں طمانیتِ قلب ہے اور جھوٹ میں بے اطمینانی ہے،(سنن ترمذی:2518)‘‘۔
	البتہ ہمارے لیے حکم یہ ہے کہ ہم مسلمانوں کے بارے میں حسن ظن سے کام لیںاور جب تک`
  },
  {
    pageNumber: 30,
    text: `کسی کے کفریہ عقیدے کا قطعی اور صریح ثبوت ہمارے علم میں نہ ہو، ہم ان پر کفرکا حکم لگانے سے اجتناب کریں،اللہ تعالیٰ کا ارشاد ہے:
[[arabic]] یٰۤاَیُّہَا الَّذِیْنَ اٰمَنُوا اجْتَنِبُوْا کَثِیْرًا مِّنَ الظَّنِّ ۣ اِنَّ بَعْضَ الظَّنِّ اِثْمٌ
ترجمہ:اے ایمان والو! بہت گمانوں سے بچو، بے شک بعض گمان گناہ ہوتے ہیں، (الحجرات: 12)‘‘۔حدیث پاک میں ہے :
[[arabic]] إِیَّاکُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَکْذَبُ الحَدِیْثِ
ترجمہ:’’بدگمانی سے بچو ، پس بے شک بدگمانی سب سے جھوٹی بات ہے،(صحیح البخاری: 5143)‘‘۔
	اگر کوئی یہ فاسد استدلال کرے کہ مخلوق میں اللہ کے حلول کا تصورقرآنِ کریم میں موجود ہے ،چنانچہ  فرمایا:
[[arabic]] فَلَمَّا قَضٰی مُوْسَی الْاَجَلَ وَسَارَ بِاَہْلِہٖۤ اٰنَسَ مِنْ جَانِبِ الطُّوْرِ نَارًا ۫ قَالَ لِاَہْلِہِ امْکُثُوْۤا اِنِّیْۤ اٰنَسْتُ نَارًا لَّعَلِّیْۤ اٰتِیْکُمْ مِّنْہَا بِخَبَرٍ اَوْ جَذْوَۃٍ مِّنَ النَّارِ لَعَلَّکُمْ تَصْطَلُوْنَ۔ فَلَمَّاۤ اَتٰىہَا نُوْدِیَ مِنْ شَاطِیِٔ الْوَادِ الْاَیْمَنِ فِی الْبُقْعَۃِ الْمُبٰرَکَۃِ مِنَ الشَّجَرَۃِ اَنْ یّٰمُوْسٰۤی اِنِّیْۤ اَنَا اللّٰہُ رَبُّ الْعٰلَمِیْنَ
ترجمہ: پس جب موسیٰ نے اپنی مدت پوری کرلی اور اپنی اہلیہ کو لے کر (مصرکی جانب )چلے تو انہوں نے طور کی طرف سے ایک آگ دیکھی ،اپنی اہلیہ کو فرمایا: تم یہیں ٹھہرو، میں نے آگ دیکھی ہے ،شاید میں وہاں سے کوئی خبر لائوں یا آگ کا کوئی شعلہ لائوں تاکہ تم تپش حاصل کرو، پھر جب موسیٰ آگ کے پاس حاضر ہوئے تومیدان کے دائیں کنارے سے برکت والے مقام میں ایک درخت سے پکارا گیا :اے موسیٰ!بے شک میں ہی اللہ رب العالمین ہوں، (القصص:29-30)‘‘۔
	اس سے یہ کہیں ثابت نہیں ہوتا کہ العیاذ باللہ تعالیٰ!اللہ تعالیٰ نے درخت میں حلول کرلیا تھا،اللہ تعالیٰ کی ذات اس سے برتر اور پاک ہے ،ہاں !وہ اس بات پر قادر ہے کہ کہیں سے بھی اُس کی جانب سے ندا آئے،اُس کی ذات کی طرح اس کی صوت (آواز)`
  },
  {
pageNumber: 31,
text:` بھی جسم اور جسمانی تقاضوں اور مادی عوارض سے پاک ہے۔ ہو سکتا ہے کوئی اس حدیث مبارک کا بھی حوالہ دے: [[arabic: عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللهِ : إِنَّ اللَّهَ قَالَ : مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَى عَبْدِى بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَى بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَبْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لأُعْطِيَنَّهُ ، وَلَبِنِ اسْتَعَاذَنَ لَاعِيُنَنَّهُ، وَمَا تَرَدَّدْتُ عَنْ شَيْءٍ أَنَا فَاعِلُهُ تَرَدُّدِى عَنْ نَفْسِ الْمُؤْمِنِ ، يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ]] ترجمہ: حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا: اللہ تعالیٰ نے فرمایا: جس شخص نے میرے کسی ولی سے عداوت رکھی تو میں اس سے اعلانِ جنگ کرتا ہوں اور میری محبوب ترین چیز جس سے میرا بندہ میرا تقرب حاصل کرتا ہے، وہ عبادات ہیں جو میں نے اس پر فرض کی ہیں اور میرا بندہ نوافل کے ذریعے مسلسل میرا قرب حاصل کرتا رہتا ہے حتی کہ میں اس سے محبت کرتا ہوں، پس جب میں اس سے محبت کرتا ہوں تو میں اس کے کان ہو جاتا ہوں جن سے وہ سنتا ہے اور میں اس کی وہ آنکھ ہو جاتا ہوں جس سے وہ دیکھتا ہے اور میں اس کے وہ ہاتھ ہو جاتا ہوں جن سے وہ پکڑتا ہے اور اس کے وہ پیر ہو جاتا ہوں جن سے وہ چلتا ہے اور اگر وہ مجھ سے سوال کرے تو میں ضرور اس کو عطا کرتا ہوں اور اگر وہ میری پناہ میں آنا چاہے تو میں ضرور اُسے پناہ دیتا ہوں اور میں کسی کام میں جس کو میں کرنے والا ہوں ، ایسا تردد نہیں کرتا جیسا تردد میں مومن کی روح کو قبض کرنے میں کرتا ہوں کہ وہ موت کو نا پسند کرتا ہے اور میں اُسے رنجیدہ کرنے کو نا پسند کرتا ہوں۔ (صحیح البخاری : 6502) حاشا وکلا ! یہاں تردد سے یہ مراد نہیں ہے کہ اللہ فیصلہ نہیں کر پاتا، جیسا کہ بعض اوقات بندے کو تردد لاحق ہوتا ہے، بلکہ یہاں مراد یہ ہے کہ اللہ اُس کی اجل میں تاخیر فرما دیتا ہے اور
`},
{
pageNumber: 32,
text:` مہلت دیتا ہے، اس کو تقدیر معلق کہتے ہیں ، قرآن کریم کی یہ آیت مبارکہ : ”[[arabic: وَلَنْ يُؤَخِّرَ اللهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا]]“، ترجمہ: اور جب کسی شخص کی اجل (موت کا مقررہ وقت ) آجائے تو اللہ اسے ہرگز مہلت نہیں دے گا، (المنافقون: 11) ۔ یہ آیت تقدیر مبرم کے بارے میں ہے اور تقدیر مبرم یقینا نہیں ٹلتی ، بلکہ نافذ ہو کر رہتی ہے۔ اس حدیث کے تحت کسی نے بھی یہ قول نہیں کیا کہ معاذ اللہ ! اللہ تعالیٰ بندے میں حلول فرمالیتا ہے، بلکہ محدثین کرام نے اس کی توجیہات کی ہیں، علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں : اللہ تعالیٰ بندے کے کان اور آنکھیں ہو جاتا ہے، اس کی کیا توجیہ ہے، عام طور پر شارحین اور علماء نے یہ کہا ہے کہ بندہ اپنے کانوں سے وہی سنتا ہے جس کے سننے کا اللہ تعالیٰ نے حکم دیا ہے اور اپنی آنکھوں سے وہی دیکھتا ہے جس کے دیکھنے کا اللہ تعالیٰ نے حکم دیا ہے تو بندے کا سننا ، اللہ کا سننا اور بندے کا دیکھنا اللہ کا دیکھنا ہوتا ہے، اس لیے فرمایا: میں اس کے کان ہو جاتا ہوں اور اس کی آنکھیں ہو جاتا ہوں لیکن اس پر یہ اعتراض ہے کہ کوئی بندہ اس وقت تک اللہ تعالیٰ کا محبوب نہیں بنے گا جب تک کہ اس کا سننا، اس کا دیکھنا، اس کا تصرف کرنا اور اس کا چلنا اللہ تعالیٰ کے احکام کے مطابق نہ ہو اور جب اللہ تعالیٰ اس کو اپنا محبوب بنالے گا تو پھر اللہ اس کے کان ہو جاتا ہے اور اس کی آنکھیں ہو جاتا ہے کا معنی یہ نہیں ہو سکتا، اس حدیث کی بہترین توجیہ امام رازی رحمۃ اللہ علیہ نے کی ہے، وہ فرماتے ہیں: بندہ جب عبادات پر دوام کرتا ہے تو وہ اس مقام پر پہنچ جاتا ہے جس کے متعلق اللہ تعالیٰ نے فرمایا: میں اس کی آنکھ ہو جاتا ہوں اور اس کے کان ہو جاتا ہوں، پس جب اللہ کا نور جلال اس کے کان ہو جاتا ہے تو وہ قریب اور دور سے سن لیتا ہے اور جب اس کا نور جلال اس کی آنکھ ہو جاتا ہے تو وہ قریب اور بعید کو دیکھ لیتا ہے اور جب اس کا نور اس کے ہاتھ ہو جاتا ہے تو وہ مشکل اور آسان چیزوں پر اور قریب اور بعید کی چیزوں کے تصرف پر قادر ہو جاتا ہے۔
`},
{
pageNumber: 33,
text: `خلاصہ یہ ہےکہ اللہ کا ولی فرائض پر دوام اور نوافل پر پابندی کرنے سے اس مقام پر پہنچ جاتا ہے کہ وہ اللہ تعالیٰ کی صفات کا مظہر ہو جاتا ہے، لیکن بندہ، بندہ ہی رہتا ہے خدا نہیں ہو جاتا ، جیسے آئینے میں کسی چیز کا عکس ہوتو آئینہ وہ چیز نہیں بن جاتا، اس کی صورت کا مظہر ہو جاتا ہے، بلاتشبیہ تمثیل جب بندہ کامل کی اپنی صفات فنا ہو جاتی ہیں تو وہ اللہ تعالی کی صفات کا مظہر ہو جاتا ہے، ( تبیان القرآن، ج: 5، ص: 418)۔

[[heading: اللہ تعالیٰ کو حاضر و ناظر کہنا]]

سوال:
اللہ تعالیٰ کو حاضر ناظر کہنا درست ہے؟ ، ( حافظ محمد جمشید ہاشمی، کوٹ ادو)۔

جواب:
اللہ تعالیٰ کے اسمائے صفات توقیفی ہیں، تو قیفی سے مراد یہ ہے کہ یہ نقل و سماع پر موقوف ہیں، یعنی جو قرآن وحدیث میں آئے ہیں کسی نے اپنی عقل سے مقرر نہیں کیے۔ پس حاضر و ناظر اللہ تعالیٰ کے اسمائے تو قیفیہ میں سے نہیں ہے، ان کے بعض معانی شان الوہیت کے منافی ہیں ، اس لیے اللہ تعالیٰ کو حاضر و ناظر نہیں کہنا چاہیے لیکن اگر کسی نے تاویل کر کے حاضر کو جاننے والے اور ناظر کو دیکھنے والے کے معنی میں کہا تو اس کی تکفیر نہیں کی جائے گی۔
تنویر الابصار مع الدر المختار میں ہے : ”[[arabic: وَيَا حَاضِرُ يَا نَاظِرُ لَيْسَ بِكُفْرٍ]]“۔
ترجمہ : اور یا حاضر یا ناظر کہنا کفر نہیں ہے۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: فَإِنَّ الْحُضُورَ بِمَعْنَى الْعِلْمِ شَائِعٌ : مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَالنَّظَرُ بِمَعْنَى الرُّؤْيَةِ : أَلَمْ يَعْلَمُ بِأَنَّ اللهَ يَرَى ، فَالْمَعْنَى : يَا عَالِمُ مَنْ يَرَى ، بَرَانِيَّةٌ]]
ترجمہ : ” کیونکہ حضور علم کے معنی میں اور نظر رویت کے معنی میں شائع اور معروف ہے اور یہ قرآن کریم کی ان آیات سے مستفاد ہیں : [[arabic: مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ]]
`}, 
{ pageNumber: 34,
   text:`ترجمہ: ” جہاں تین آدمی سرگوشی کریں ، (وہاں) چوتھا اللہ اُن کے ساتھ ہے، (المجادلہ:7)
[[arabic: أَلَمْ يَعْلَمُ بِأَنَّ الله يرى]] ، ترجمہ:” کیا اس نے یہ نہ جانا کہ بے شک اللہ (سب کچھ) دیکھ رہا ہے، (العلق : 14) ، پس [[arabic: يَا حَاضِرُ يَا نَاظِرُ]] کا معنیٰ ہوا : اے جاننے والے ، اے دیکھنے والے!، بحوالہ بزازیة، ( رد المحتار على الدر المختار ، جلد 13 ص: 126، دمشق)۔
قرآن کریم میں اللہ تعالیٰ کے لیے شہید و بصیر کے کلمات آئے ہیں :
(1) [[arabic: وَاللَّهُ عَلَى كُلِّ شَيْ شَهِيدٌ]]۔
ترجمہ: اور اللہ ہر چیز پر نگہبان ہے، (البروج:9)۔
(۲) [[arabic: إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ]]
ترجمہ: بے شک وہی بہت سننے والا، بہت دیکھنے والا ہے، (الاسراء:1)۔
(۳) [[arabic: وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ]]
ترجمہ : ” اور جو کچھ یہ کر رہے ہیں، اس کو اللہ خوب دیکھنے والا ہے، (البقرہ:96)۔
الغرض اللہ کے لیے رویت کے معنی میں ناظر اور بصیر کے کلمات استعمال کرنا قرآن کریم سے ثابت ہیں لیکن ہم کہیں گے: ہمارا ان کے حق ہونے پر ایمان ہے، اللہ تعالیٰ جسم اور جسمانی اعضا سے پاک ہے ، ان کلمات کے معنی اور مراد ہم اللہ تعالیٰ کے علم پر تفویض کرتے ہیں اور اس کے مصداق کے تعین کے ہم مکلف نہیں ہیں۔
حاضرکا معنی عربی کی مشہور لغت المنجد اور مختار الصحاح میں یہ ہیں : نزدیکی، صحن، حاضر ہونے کی جگہ، جو چیز کھلم کھلا بے حجاب آنکھوں کے سامنے ہو اور ناظر کے معنی مختار الصحاح میں آنکھ کے ڈھیلے کی سیاہی“ کے ہیں، جبکہ نظر کے معنی ہیں : ” کسی امر میں تفکر و تدبر کرنا اور آنکھ سے کسی چیز میں تامل کرنا ہیں ۔ لغوی معنی کے اعتبار سے ان دونوں لفظوں کے معانی سے اللہ تعالیٰ کی ذات پاک ہے، بغیر تاویل کے اللہ تعالیٰ کے لیے ان الفاظ کو نہیں بولا جا سکتا ، کیونکہ اللہ تعالیٰ کے اسماء مبارکہ توقیفی، یعنی نقل و 
سماع پر موقوف
`}, 

{ pageNumber: 35,
   text:`ہیں اور اسماء حسنی میں یہ دونوں کلمات (حاضر و ناظر ) بطور اسم یا صفت شامل نہیں ہیں ، قرآن وحدیث میں اللہ تعالیٰ کے لیے نہ یہ الفاظ آئے ہیں اور نہ صحابہ کرام، تابعین وائمہ مجتہدین نے استعمال کیے ہیں ۔ اسی طرح اللہ تعالیٰ کے اسمائے صفات میں مُعلِّم ، تونہیں آیا لیکن اللہ تعالیٰ کے تعلیم فرمانے کے بارے میں آیات آئی ہیں :
(1) [[arabic: الرَّحْمَنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنْسَانَ عَلَّمَهُ الْبَيَانَ]]
ترجمہ : ” رحمن نے قرآن سکھایا ، انسان کو پیدا کیا (اور) اسے اظہار کی صلاحیت سکھائی ، (الرحمن : 4-1) میں اللہ تعالیٰ کے لیے تعلیم دینے کا کلمہ آیا ہے۔
(۲) [[arabic: وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا]]
ترجمہ: اور اس نے آدم کو سب مسمیات (چیزوں) کے نام سکھائے، (البقرہ:31)۔
(۳) [[arabic: وَ عَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا]]۔
ترجمہ: اور جو کچھ آپ نہیں جانتے تھے، وہ آپ کو سکھایا اور آپ پر اللہ کا بڑا فضل ہے، (النساء : 113)۔
اسی طرح قرآن کریم میں بعض طبقات کے لیے اللہ تعالیٰ کی نظرِ رحمت سے محرومی کا ذکر ہے:
(1) [[arabic: إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا أُولَئِكَ لَا خَلَاقَ لَهُمْ فِي الْآخِرَةِ وَلَا يُكَلِّمُهُمُ اللهُ وَلَا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيِّمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ اليم]] ۔ (آل عمران : 77)
ترجمہ: بے شک جو لوگ اللہ کے عہد اور اپنی قسموں کے عوض تھوڑی سی قیمت لے لیتے ہیں ، ان لوگوں کے لیے آخرت میں کوئی حصہ نہیں ہے اور نہ آخرت میں اللہ تعالیٰ ان سے کوئی کلام کرے گا اور نہ قیامت کے دن ان کی طرف نظر (رحمت) فرمائے گا اور نہ ان کو پاکیزہ کرے گا اور ان کے لیے درد ناک عذاب ہے۔
حدیث پاک میں ہے:
[[arabic: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ عَنِ النَّبِيِّ قَالَ : ثَلَاثَةٌ لا يُكَلِّمُهُمُ اللَّهُ يَوْمَ القِيَامَةِ]]
`}, { pageNumber: 36,
   text:`[[arabic: وَلَا يَنْظُرُ إِلَيْهِمْ : رَجُلٌ حَلَفَ عَلَى سِلْعَةٍ لَقَدْ أُعْطَى بِهَا أَكْثَرَ مِمَّا أُعْطَى وَهُوَ كَاذِبٌ ، وَرَجُلٌ حَلَفَ عَلَى يَمِينِ كَاذِبَةٍ بَعْدَ العَصْرِ ، لِيَقْتَطِعَ بِهَا مَالَ رَجُلٍ مُسْلِمٍ، وَرَجُلٌ مَنَعَ فَضْلَ مَاءٍ فَيَقُولُ اللهُ الْيَوْمَ أَمْنَعُكَ فَضْلِي كَمَا مَنَعْتَ فَضْلَ مَا لَمْ تَعْمَلُ يَدَاكَ]]
ترجمہ : حضرت ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی ﷺ نے فرمایا: اللہ تعالیٰ تین آدمیوں سے قیامت کے دن کلام نہیں فرمائے گا اور نہ اُن کی طرف نظر (رحمت) فرمائے گا: ایک وہ شخص جس نے قسم کھائی کہ اسے اس سودے کی قیمت اس سے زیادہ دی جا رہی تھی جتنی اب دی جارہی ہے اور وہ اس قسم میں جھوٹا تھا، دوسرا وہ شخص جس نے عصر کے بعد جھوٹی قسم پر حلف اٹھایا تا کہ اس قسم کے ذریعہ کسی مسلمان شخص کا مال لے لے، تیسرا وہ شخص جس نے اپنی ضرورت سے زائد پانی سے کسی کو منع کیا، اللہ تعالیٰ اس سے فرمائے گا : آج میں تجھے اپنے فضل سے اسی طرح محروم کر دوں گا ، جس طرح تو نے اپنی ضرورت سے زائد ( پانی دوسرے ضرورت مند کو دینے ) سے منع کیا تھا ، حالانکہ اس چیز کو تو نے پیدا نہیں کیا تھا ۔ ( صحیح بخاری:2369)
(۲) [[arabic: عَنِ ابْنِ عُمَرَأَنَّ رَسُولَ اللهِ قَالَ : لَا يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّثَوْبَهُ خُيَلَاءَ]]
ترجمہ : حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ ﷺ نے فرمایا: جو شخص تکبر سے کپڑا گھسیٹ کر چلے ،اللہ تعالیٰ اس کی طرف نظر ( رحمت ) نہیں فرمائے گا ، ( صحیح مسلم: 2085) نظر رحمت کی بابت اور بھی احادیث ہیں۔ اس سے معلوم ہوتا ہے کہ اللہ تعالیٰ اپنے بعض محبوب بندوں پر نظر رحمت فرماتا ہے لیکن اسے ناظر کہنا درست نہیں ہے۔
امام اعظم ابوحنیفہ رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: لَمْ يَزَلْ وَلَا يَزَالُ بِأَسْمَائِهِ وَصِفَاتِهِ النَّاتِيَةِ وَالْفِعْلِيةِ، أَمَّا الذَّاتِيَةُ فَالْحَيَاةُ وَالْقُدْرَةُ وَالْعِلْمُ وَالْكَلَامُ وَالسَّبْعُ وَالْبَصَرُ وَالْإِرَادَةُ]]
ترجمہ : ” وہ اپنے اسماء اور اپنی صفات ذاتیہ اور صفات فعلیہ کے ساتھ ہمیشہ موصوف رہا ہے اور ہمیشہ منتصف رہے گا اور صفات ذاتیہ یہ ہیں : حیات ، قدرت علم کلام ، سننا ، دیکھنا اور`
}, 
{ pageNumber: 37, 
  text:`اراده، (الفقہ الاکبر ص : 25-24)
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں :
ائمہ اربعہ اور دیگر متقدمین کے نزدیک اللہ تعالیٰ کی آنکھیں بھی ہیں اور اس کے ہاتھ بھی ہیں لیکن وہ ہماری طرح جسمانی اعضا نہیں ہیں، بلکہ مخلوقات اور ممکنات میں اس کی کوئی مثال نہیں ہے، قرآن مجید میں ہے: [[arabic: لَيْسَ كَمِثْلِهِ]] ترجمہ: اس کی مثل کوئی چیز نہیں ہے ، (الشوری: 11 ) ۔ قرآن مجید میں اللہ تعالی کے لیے جو ید ،عین اور ساق وغیرہ کے کلمات آئے ہیں ، ہم اُن پر ایمان لاتے ہیں ، اُن کی نفی نہیں کرتے اور نہ ان میں کوئی تاویل کرتے ہیں ، اس کے ہاتھ ، آنکھیں اور پنڈلی ہیں جیسے اس کی شان کے لائق ہیں لیکن ممکنات اور مخلوقات میں ان کی کوئی مثال نہیں ہے، وہ جسم اور جسمانی اعضاء سے مبر ا اور منز ہ اور پاک ہے، یہ ہمارے لیے متشابہات میں سے ہیں ، ( تبیان القرآن، جلد 11 ص: 584)
صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں :
حیات ، قدرت سننا ، دیکھنا ، کلام، علم اور ارادہ اُس کی صفات ذاتیہ ہیں ، مگر کان، آنکھ، زبان سے اُس کا کا سننا ، دیکھنا ، کلام کرنا نہیں کہ یہ سب اجسام ہیں اور اجسام سے وہ پاک ہے۔ ہر پست سے پست آواز کو سنتا ہے، ہر باریک سے باریک کو کہ خورد بین سے محسوس نہ ہو، وہ دیکھتا ہے ، بلکہ اُس کا دیکھنا اور سننا انہیں چیزوں پر منحصر نہیں ، ہر موجود کو دیکھتا ہے اور ہر موجود کو سنتا ہے ، (بہار شریعت ، جلد اول ص : 7 ) ۔
فتاوی فیض الرسول میں ہے:
اگر حاضر و ناظر به معنی شہید و بصیر اعتقاد رکھتے ہیں یعنی ہر موجود اللہ تعالیٰ کے سامنے ہے اور وہ ہر موجود کو دیکھتا ہے، تو یہ عقیدہ حق ہے ، مگر اس کی تعبیر حاضر و ناظر سے کرنا یعنی اللہ تعالی کے بارے میں حاضر و ناظر کا لفظ استعمال نہیں کرنا چاہیے لیکن اگر پھر بھی کوئی شخص اس لفظ کو اللہ تعالیٰ کے بارے میں بولے تو وہ کفر نہ ہوگا ، جیسا کہ درمختار مع شامی جلد سوم، ص : 307 میں ہے : [[arabic: يَا حَاضِرَ يَا نَاظِر لَيْسَ بِكُفْرٍ وَهُوَ أَعْلَمُ]] ، ( جلد اول ص : 3 ) ۔
`}, 
{ pageNumber: 38, 
  text:`[[heading: نماز کی تو ہین کفر ہے]]  

سوال:
میرے شوہر کی طبیعت ٹھیک نہیں رہتی ، اُن کے پیٹ کا نظام اکثر خراب رہتا ہے، جس کی وجہ سے اُنہیں ٹھیک طریقے سے نیند نہیں آتی اور چڑچڑاہٹ کا شکار ہو جاتے ہیں، اسی دوران اُن کے منہ سے عید الاضحیٰ سے دو یا تین دن پہلے یہ الفاظ نکل گئے : ”بھاڑ میں جائے عید کی نماز ، اگر میں سو جاؤں تو نہ اُٹھانا" لیکن پھر اُنہوں نے نماز بھی پڑھی اور اللہ تعالیٰ سے معافی بھی بہت مانگی ، اس بارے میں اُن کے لیے کیا حکم ہے وہ شادی شدہ اور بچوں والے ہیں، (ایک دینی بہن، کراچی)

جواب:
آپ کے شوہر نے نماز کے متعلق جو نازیبا کلمات کہے ہیں ، وہ کفریہ کلمات ہیں، کیونکہ نماز شعائر اسلام میں سے ہے اور شعائر اسلام کی توہین کفر ہے، سو ان پر واجب ہے کہ اُس سے توبہ کریں اور تجدید ایمان و تجدید نکاح بھی کریں ۔ تجدید ایمان یہ ہے کہ صدقِ دل کے ساتھ کلمہ طیبہ پڑھیں اور تجدید نکاح یہ ہے کہ دو گواہوں کی موجودگی میں نئے مہر کے ساتھ نیا نکاح کریں۔ نکاح ایجاب و قبول کا نام ہے اور اس کے لیے صرف دو گواہ کافی ہیں جو دونوں مرد ہوں یا ایک مرد اور دو عورتیں ہوں ، لوگوں کو اکٹھا کرنا ضروری نہیں ہے اور گھر کے افراد مثلاً : بالغ بیٹے اور بیٹیاں یا بھائی بہن بھی گواہ بن سکتے ہیں۔

[[heading: نبی کریم ﷺ کے راستے میں کوڑا پھینکنے والی عورت کا واقعہ]]

سوال:
واعظین و خطباء اپنے بیانات میں اکثر یہ بتاتے ہیں کہ رسول اللہ ﷺ کے راستے میں ایک عورت کوڑا پھینکتی تھی ، ایک دن اس نے کوڑا نہ پھینکا تو رسول اللہ ﷺ اس کے گھر تشریف لے گئے اور اس کے گھر کو صاف کیا ، پانی وغیرہ بھرا ، وہ عورت آپ ﷺ کے حسن اخلاق کو دیکھ کر مسلمان ہوگئی۔ اس واقعہ کی تحقیق مطلوب ہے، کسی کتاب میں ہے`
},

{ pageNumber: 39,
   text:`یا سنی سنائی بات ہے؟ ، (ضیاء احمد، ملتان روڈ ، لاہور ) ۔

جواب:
ہماری معلومات کے مطابق حدیث وسیرت کی مستند اور معتبر کتابوں میں ایسی کوئی روایت موجود نہیں ہے، یہ واقعہ ویسے ہی مشہور ہو گیا ہے، کسی بھی کتاب میں اس کی کوئی سند نہیں ملتی حتی کہ معروف مراجع و مصادر میں اس کا ذکر تک نہیں ملتا۔ بعض لوگ ایسی روایت امام اعظم ابو حنیفہ رحمۃ اللہ علیہ کے حوالے سے بھی بیان کرتے ہیں لیکن ہمیں اس کا بھی کوئی حوالہ نہیں ملا۔
ایک وسیع المطالعہ بزرگ، خلیفہ حضور مفتی اعظم ہند، شارح بخاری علامہ مفتی شریف الحق امجدی رحمۃ اللہ علیہ سے اس روایت کے بارے میں سوال ہوا ، اس کے جواب میں آپ نے لکھا: ” کوڑا کرکٹ ڈالنے کی روایت اس وقت یاد نہیں ہے (لہذا) اس کے بارے میں کچھ نہیں کہہ سکتا ، ( فتاوی شارح بخاری ، جلد 1 ، ص : 415)۔ ہر دور میں واعظین لوگوں کو ترغیب دینے کے لیے اس طرح کے واقعات وضع کرتے رہے ہیں ، اسی لیے محدثین کرام نے موضوعات پر کتابیں لکھی ہیں ۔ الحمد لله علی احسانہ رسول اللہ ﷺ کی سیرت طیبہ کے سچے اور مستند واقعات بہت ہیں، ہمیں انہی واقعات پر اکتفا کرنا چاہیے، جھوٹ یا خلاف واقعہ بات نیک نیتی سے بیان کی جائے یا بد نیتی سے دونوں صورتوں میں اس کا جواز نہیں بنتا۔
رسول اللہ ﷺ کا ارشاد ہے : ”[[arabic: مَنْ كَذَبَ عَلَى مُتَعَمِّد أَفَلِيَتَبَوَّا مَقْعَدَهُ مِنَ النَّارِ]]“
ترجمہ: جس شخص نے جان بوجھ کر میری طرف جھوٹی بات منسوب کی ، اُسے چاہیے کہ اپنا ٹھکانہ جہنم میں بنالے ، ( صحیح بخاری: 110 ، 6197، صحیح مسلم :4)۔ ایک اور حدیث پاک میں ہے: [[arabic: كَفَی بِالْمَرْءِ كَذِبَا أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ]]
ترجمہ: ” کسی آدمی کے جھوٹا ہونے کے لیے اتنی ہی بات کافی ہے کہ وہ ( تحقیق کیے بغیر ) ہر سنی سنائی بات لوگوں کے سامنے بیان کرتا پھرے، (صحیح مسلم :7)، یعنی محض سنی سنائی`
},
 { pageNumber: 40, 
  text:`بات کو تیقن کے ساتھ حق اور حقیقت کے طور پر بیان کرنا درست نہیں ہے، البتہ جس سے سنا ہے، اس کے حوالے سے بیان کرے تو اس پر جھوٹ کا اطلاق نہیں ہوگا ، اسی کو ہمارے ہاں اردو محاورے میں اس طرح تعبیر کرتے ہیں : ” دروغ بر گردن راوی“، یعنی اس کو صحیح ثابت کرنے کی ذمے داری راوی پر ہے، میں یہ ذمے داری اپنے سر نہیں لیتا۔
[[arabic: عَنْ جُنْدَبِ بْنِ عَبْدِ اللهِ قَالَ : قَالَ رَسُولُ اللَّهِ : مَنْ قَالَ فِي القُرْآنِ بِرَأْيِهِ فَأَصَابَ فَقَدْ أَخْطَا]]
ترجمہ: حضرت جندب بن عبد الله بیان کرتے ہیں : رسول اللہ ﷺ نے فرمایا: جس شخص نے قرآن مجید میں اپنی رائے سے صحیح بات بھی کہی تو اس نے خطا کی ، (سنن ترمذی: 2952) نوٹ: "جندب" کے لفظ کو دال کی زبر اور پیش کے ساتھ یعنی دونوں طرح پڑھنا درست ہے۔

[[heading: صحابی کی تعریف]]

سوال:
صحابی کسے کہتے ہیں، کیا جنات میں بھی صحابہ ہیں، کیا صحابیت کا شرف صرف بالغ افراد کو حاصل ہے یا اطفال اور غیر ممیز صبیان کی طرف بھی اس شرف کی نسبت کی گئی ہے، نیز آیا ملائکہ بھی نسبت صحابیت سے مشرف ہوئے ، اگر جواب اثبات میں ہے تو کیا اُن کی طرف آپ ﷺ کی بعثت ارسال تکلیفی ہے یا محض تشریعی ، اسی طرح دیگر مخلوقات کی طرف ارسال کی نوعیت کیا ہے، (ابو عمیر قاری محمد نوید اختر ، کراچی)  

جواب:
علامہ حافظ ابن حجر عسقلانی شافعی رحمۃ اللہ علیہ متوفی 852ھ صحابی کی تعریف میں لکھتے ہیں:
[[arabic: أَصَحُ مَا وَقَفْتُ عَلَيْهِ مِنْ ذَلِكَ أَنَّ الصَّحَابِيَ مَنْ لَقِيَ النَّبِيَّ مُؤْمِنًا بِهِ، وَمَاتَ عَلَى الإِسْلَامِ]]۔
ترجمہ: صحابی کی سب سے زیادہ صحیح تعریف جس سے میں واقف ہوا، یہ ہے : صحابی اس شخص
`},

{
  pageNumber: 41,
  text: `کو کہا جاتا ہے جس نے نبی ﷺ پرایمان رکھنے کی حالت میں آپ سے ملاقات کی اور اسلام پر اس کی وفات ہوئی ،خواہ درمیان میں (بدقسمتی سے)مرتد ہوگیا ،لیکن پھر اسلام قبول کرلیا ہو ، یہی تعریف زیادہ صحیح ہے، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ ، ج:1،ص: 158)‘‘۔
علامہ حافظ ابن حجر اپنی اس تعریف میں مذکور قیودات کی وضاحت کرتے ہوئے لکھتے ہیں:
(1) ’’[[arabic: فَيَدْخُلُ فِي "مَنْ لَقِيَهٗ" مَنْ طَالَتْ مُجَالَسَتُهٗ أَوْ قَصُرَتْ، وَمَنْ رَوٰى عَنْهُ أَوْ لَمْ يَرْوِ، وَمَنْ غَزَا مَعَهٗ أَوْ لَمْ يَغْزُ، وَمَنْ رَآهُ رُؤْيَةً وَلَمْ يُجَالِسْهُ، وَمَنْ لَمْ يَرَهٗ لِعَارِضٍ كَالعَمٰى]]‘‘۔
ترجمہ: ’’صحابی کی تعریف میں ’’نبی کریم ﷺ سے ملاقات‘‘ کی قید (عام ہے، لہٰذا اس قید کی رُو) سے ہر وہ شخص صحابی کی تعریف میں داخل ہوجاتا ہے جس نے نبی کریم ﷺ سے ملاقات کی ہو، خواہ اُس نے آپ ﷺ کی صحبت میں طویل عرصہ گزارا ہو یا تھوڑا، اُس نے آپ سے روایت کی ہو یا نہ کی ہو، آپ کے ساتھ غزوات میں شریک رہا ہو یا نہیں، یاصرف آپ ﷺ کو دیکھا ہو لیکن آپ کے ساتھ ہمنشی نہ کی ہو، یونہی وہ شخص بھی صحابی کی اِس تعریف میں داخل ہے جس نے آپ سے ملاقات کی ہو، لیکن کسی عارضے مثلاً نابینا ہونے کی وجہ سے آپ کو نہ دیکھ پایا ہو (یعنی ملاقات کے باوجود رویتِ بصری سے محروم رہا ہو، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
شرفِ صحابیت کے ثبوت کے لیے کتنی دیر کی صحبت کافی ہے ،اس کی وضاحت کرتے ہوئے علامہ یحییٰ بن شرف نووی لکھتے ہیں:
’’[[arabic: اُخْتُلِفَ فِی حَدِّ الصَّحَابِیِّ: فَالْمَعْرُوفُ عِنْدِ الْمُحَدِّثِینَ أَنَّہٗ کُلُّ مُسْلِمٍ رَاٰی رَسُوْلَ اللّٰہِ ﷺ، وَعَنْ أَصْحَابِ الْاُصُوْلِ أَوْ بَعْضِہِمْ أَنَّہٗ مَنْ طَالَتْ مُجَالَسَتُہٗ عَلٰی طَرِیْقِ التَّبَعِ، وَعَنْ سَعِیْدِ بْنِ الْمُسَیَّبِ: أَنَّہٗ لَا یُعَدُّ صَحَابِیًّا إِلَّا مَنْ أَقَامَ مَعَ رَسُولِ اللّٰہ ﷺسَنَۃً أَوْ سَنَتَیْنِ أَوْ غَزَا مَعَہٗ غَزْوَۃً أَوْ غَزْوَتَیْنِ، فَإِنْ صَحَّ عَنْہُ فَضَعِیْفٌ، فَإِنَّ مُقْتَضَاہٗ أَنْ لَا یُعَدَّ جَرِیْرٌ الْبَجَلِیُّ وَشِبْہُہٗ صَحَابِیًّا، وَلَا خِلَافَ أَنَّهُمْ صَحَابَةٌ]]‘‘۔`
},
{
  pageNumber: 42,
  text: `ترجمہ: ’’صحابی کی تعریف میں اختلاف ہے ،محدثین کے نزدیک معروف تعریف یہ ہے : ’’ہر وہ مسلمان جس نے رسول اللہ ﷺ کو دیکھا ،وہ صحابی ہے‘‘ اوربعض اصحاب الاصول کے نزدیک تعریف یہ ہے: ’’جس نے بہ طریق متابعت نبی ﷺ کی طویل مجلس حاصل کی ہو‘‘ اور سعید بن مسیب سے یہ تعریف منقول ہے : ’’صحابی صرف وہ مسلمان ہے جو آپ کے ساتھ ایک یا دوسال رہا ہو یا جس نے آپ کے ساتھ ایک یا دوغزوات میں شرکت کی ہو، یہ تعریف ضعیف ہے ،کیونکہ اس تعریف کی رو سے حضرت جریر بن عبداللہ البجلی اوران جیسے (حضرت وائل بن حجر رضی اللہ عنہ) صحابی نہیں رہیں گے ،حالانکہ ان کے صحابی ہونے میں کسی کااختلاف نہیں ہے، (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی: ج: 2، ص:667)‘‘۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: قَالَ عَلِیُّ بْنُ الْمَدِ یْنِیِّ: مَنْ صَحِبَ النَّبِیَّ ﷺ أَوْ رَاٰہٗ وَلَوْ سَاعَۃً مِنْ نَہَارٍ فَہُوَ مِنْ أَصْحَابِ النَّبِیِّ ﷺ]]‘‘۔
ترجمہ: ’’علی بن المَدینی نے کہا: ’’جو نبی ﷺ کی مجلس میں بیٹھا یا آپ کو دیکھا، خواہ یہ دن کی ایک ساعت میں ہو، تو وہ نبی ﷺ کے صحابی ہیں، (فتح الباری: ج: 7، ص:5 )‘‘۔
الغرض یہ کہ صحابیت کے ثبوت کے لیےآپ ﷺ سے ملاقات ضروری ہے،خواہ ملاقات طویل عرصے رہی ہو یا کچھ دیر کے لیے ، صحابی ہونے کے لیے نبی کریم ﷺ کے ساتھ طویل عرصے کی صحبت یا آپ کے ساتھ غزوات میں شرکت ضروری نہیں ۔
(2) صحابی کی تعریف میں مذکور دوسری قید ’’مُوْمِنًا‘‘ کی وضاحت کرتے ہوئےعلامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَخْرُجُ بِقَيْدِ الْإِيْمَانِ مَنْ لَقِيَهٗ كَافِرًا وَلَوْ أَسْلَمَ بَعْدَ ذٰلِكَ إِذَا لَمْ يَجْتَمِعْ بِهٖ مَرَّةً أُخْرىٰ]]‘‘۔`
},
{
  pageNumber: 43,
  text: `ترجمہ: ’’صحابی کی تعریف میں ایمان کی قید سے وہ شخص خارج ہوگیا جس نے کفرکی حالت میں آپ سے ملاقات کی ہو،خواہ اِس ملاقات کے بعدوہ اسلام لےآیاہو،بشرطیکہ وہ دوبارہ نبی کریم ﷺ کے ساتھ جمع نہ ہوا ہو، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج: 1، ص: 158)‘‘۔
علامہ جلال الدین سیوطی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنْ رَاٰہٗ كَافِرًا ثُمَّ أَسْلَمَ بَعْدَ مَوْتِہٖ كَرَسُوْلِ قَیْصَرَ فَلَا صُحْبَۃَ لَہٗ]]‘‘۔
ترجمہ: ’’اور جس شخص نے آپ ﷺکو کفر کی حالت میں دیکھا اور آپ کی وفات کے بعد اسلام لایا ، جیسے قیصر کا ایلچی،تواُنہیں صحابیت کا شرف حاصل نہیں ہے، (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘۔
بعض اہلِ علم حضرات نے صحابی ہونے کے لیے بلوغت کی شرط بھی عائد کی ہے،لیکن صحیح اور راجح قول یہ ہے کہ صحابی ہونے کے لیے بالغ ہونا ضروری نہیں ہے،چنانچہ علامہ زین الدین عراقی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَالصَّحِیْحُ أَنَّ الْبُلُوْغ لَیْسَ شَرْطًا فِی حَدِّ الصَّحَابِیِّ وإِلَّا لَخَرَجَ بِذٰلِکَ مَن اَجْمَعَ العُلَمَاءُ عَلٰی عَدِّہِم فِی الصَّحَابَۃِ کَعَبدِ االلّٰہِ بْنِ الزُّبَیْرِ وَالْحَسَنِ وَالْحُسَیْنِ رَضِیَ اللّٰہُ عَنْہُمْ]]‘‘۔
ترجمہ: ’’اور صحیح یہ ہے کہ صحابی کی تعریف میں بلوغ کی شرط نہیں،ورنہ جن شخصیات کی صحابیت پرعلماء کا اجماع ہے ،وہ صحابیت سے خارج ہوجائیں گے ،جیسے امام حسن اور امام حسین اور عبداللہ بن زبیر رضی اللہ عنہم، (اَلتَّقْیِیْد وَالْاِیْضَاح شَرح مُقَدَّمَہ اِبْنُ الصَّلَاح: ص295)‘‘۔
البتہ امام یحییٰ بن معین،امام ابوزرعہ،امام ابوحاتم،امام ابوداؤد اور علامہ ابن عبدالبر وغیرہ بعض محدثین نے صحابی ہونے کےلیے ’’سِنِّ تمییز‘‘ (اچھے برے میں فرق کی صلاحیت کی عمر کو پہنچنا، جوکہ کم ازکم چار برس ہے) کی شرط عائد کی ہے ،چنانچہ علامہ زین الدین عراقی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَأَمَّا التَّمْيِيْزُ فَظَاهِرُ كَلَامِهِمْ اِشْتِرَاطُهٗ كَمَا هُوَ مَوْجُوْدٌ فِي كَلامِ يَحْيَى بْنِ مَعِيْنٍ وَأَبِيْ زُرْعَةَ وَأَبِيْ حَاتَمٍ وَأَبي دَاوٗدَ وَابْنِ عَبْدِ الْبَرِّ وَغَيْرِهِمْ وَهُمْ جَمَاعَةٌ أُتِی بِهِمُ النَّبيَّ ﷺ وَهُمْ أَطْفَالٌ فَحَنَّكَهُمْ وَمَسَحَ وُجُوْهَهُمْ أَوْ تَفَلَ فِيْ أَفْوَاهِهِمْ فَلَمْ يَكْتُبُوْا لَهُمْ صُحْبَةً، كَحَمْدِ بْنِ حَاطِبِ بْنِ الْحَارِثِ وَعَبْدِ الرَّحْمٰنِ بْنِ عُثْمَانَ التَّيْمِىِّ وَمَحْمُوْدِ ابْنِ الرَّبِيْعِ]]`
},
{
  pageNumber: 44,
  text: `[[arabic: وَعُبَيْدِ اللهِ بْنِ مَعْمَرٍ وَعَبْدِ اللهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ وَعَبْدِ اللهِ بْنِ أَبِيْ طَلْحَةَ وَمُحَمَّدِ بْنِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَيَحْيَى بْنِ خَلَّادِ بْنِ رَافِعٍ الزُّرَقِىِّ وَمُحَمَّدِ بْنِ طَلْحَةَ ابْنِ عُبَيْدِ اللهِ وَعَبْدِ اللهِ بْنِ ثَعْلَبَةَ بْنِ صَعِيْرٍ وَعَبْدِ اللهِ بْنِ عَامِرِ بْنِ كَرِيْزٍ وَعَبْدِ الرَّحْمٰنِ ابْنِ عَبْدِ الْقَارِىِّ وَنَحْوِهِمْ]]‘‘۔
ترجمہ: ’’رہی (خیر وشر میں) تمیز کی صلاحیت تو بظاہر یہ شرط ہے،جیساکہ یہ شرط یحییٰ بن معین، ابوزرعہ، ابوحاتم، ابودائود ،ابن عبدالبروغیرہ کےکلام میں موجود ہے،ان حضرات نے غیرممیز بچےکوصحابی قرار نہیں دیا،اِس سے مراد وہ بچے ہیں جنہیں بچپن میں نبی ﷺ کے پاس لایا گیا، آپ نے انہیں گھٹی دی،ان کے چہروں کو (پیار سے )چھوایا ان کے منہ میں لعابِ دہنِ مبارک ڈالا، لیکن انہیں صحابہ میں شمار نہیں کیا گیاجیسے: حمد بن حاطب بن حارث، عبدالرحمٰن بن عثمان التیمی، محمود بن ربیع ،عبیداللہ بن معمر، عبداللہ بن حارث بن نوفل، عبداللہ بن ابی طلحہ، محمد بن ثابت بن قیس بن شماس، یحییٰ بن خلاد بن رافع الزرقی، محمد بن طلحہ بن عبیداللہ، عبداللہ بن ثَعلبہ بن صعیر، عبداللہ بن عامر بن کریز اور عبدالرحمن بن عبدالقاری اور اس طرح کے دوسرےبچے، (اَلتَّقْیِیْد وَالْاِیْضَاح،ص:292)‘‘۔
اس کے برعکس اکثر اہلِ علم کے نزدیک صحابی ہونے کے لیے سن تمییز کو پہنچنا شرط نہیں ہے ،چنانچہ علامہ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اِلَّا اَنَّہٗ ہَلْ یُشْتَرَطُ فِی الرَّائِیْ اَن یَّکُوْنَ بِحَیْثُ یُمَیِّزُ مَارَاٰہُ أَوْ یُکْتَفٰی بِمُجَرَّدِ حُصُولِ الرُّؤْیَۃِ مَحَلُّ نَظَر، وَعَمَلُ مَنْ صَنَّفَ فِی الصَّحَابَۃِ یَدُلُّ عَلَی الثَّانِی ،فَإِنَّہُمْ ذَکَرُوا مِثْلَ مُحَمَّدِ بْنِ أَبِی بَکْرٍ الصِّدِّیقِ ،وَإِنَّمَا وُلِدَ قَبْلَ وَفَاۃِ النَّبِیِّ ﷺ بِثَلَاثَۃِ أَشْہُرٍ وَأَیَّامٍ کَمَا ثَبَتَ فِی الصَّحِیْحِ أَنَّ أُمَّہٗ أَسْمَاءُ بِنْتُ عُمَیْسٍ وَلَدَتْہُ فِی حَجَّۃِ الْوَدَاعِ قَبْلَ أَنْ یَدْخُلُوْا مَکَّۃَ وَذٰلِکَ فِی أَوَاخِرِ ذِی الْقَعْدَۃِ سَنَۃَ عَشْرٍ مِنَ الْہِجْرَۃِ وَمَعَ ذٰلِکَ ،فَاَحَادِیثُ ہٰذَا الضَّرْبِ مَرَاسِیلُ]]‘‘۔
ترجمہ: ’’کیا نبی ﷺ کا دیدار کرنے والے کے لیے یہ شرط ہے کہ وہ جو دیکھے اس کی تمییز`
},
{
  pageNumber: 45,
  text: `کرسکتا ہو یا صرف دیکھنے پر اکتفا کیا جائے گا ،یہ محل نظر ہے اور جن علماء نے صحابہ کے حالات پر کتابیں لکھی ہیں ان کا عمل دوسرے پردلالت کرتا ہے، انہوں نے محمد بن ابوبکر صدیق کا ذکر صحابہ میں کیا ہے، حالانکہ وہ نبی ﷺ کی وفات سے تین ماہ کچھ دن قبل پیدا ہوئے تھے، یہ بات حدیث صحیح سے ثابت ہے کہ ان کی ماں اَسماء بنتِ عُمیس نے ان کو ۱۰ ہجری ماہ ذو القعدہ میں حجۃ الوداع کے موقع پر مکہ داخل ہونے سے پہلے جنا تھا ،باوجود اس شرف کے ان حضرات کی بیان کردہ احادیث مراسیل ہیں ، (فتح الباری:ج: 7،ص: 3)‘‘۔
نیز لکھتے ہیں:
’’[[arabic: مَن لَّمْ يُمَيِّزْ لَا تَصِحُّ نِسْبَةُ الرُّؤْيَةِ إِلَيْهِ، نَعَمْ يَصْدُقُ أَنَّ النَّبيَّ ﷺرَآهُ فَيَكُوْنُ صَحَابِيًّا مِنْ هٰذِهِ الْحَيْثِيَّةِ، وَمِنْ حَيْثُ الرِّوَايَةِ يَكُوْنُ تَابِعِيًّا]]‘‘۔
ترجمہ: ’’جو نبی کریم ﷺ کی حیات میں سن تمیز کو نہ پہنچا ہو، اُس کی طرف نبی کریم ﷺ کو دیکھنے کی نسبت کرنا صحیح نہیں ہے، ہاں یہ بات درست ہے کہ نبی کریم ﷺ نے اُسے دیکھا ہو ،پس وہ اِس حیثیت سے صحابی ہو گا اور روایت کے اعتبار سے وہ تابعی ہوگا‘‘۔
علامہ عبدالحی لکھنوی لکھتے ہیں:
’’[[arabic: وَالْمُرَجَّحُ ہُوَ دُخُولُہٗ فِیْہِمْ نَعَمْ حَدِیْثُہُمْ مُرْسَل لٰکِنَّہٗ مُرْسَلٌ مَقبُوْلٌ]]‘‘۔
ترجمہ: ’’ان کے صحابہ میں داخل ہونے کا قول راجح ہے ،ہاں ان کی روایت کردہ احادیث مرسل ،لیکن مرسل مقبول ہیں، (ظَفر الْاَمَانی فی مُخْتَصر الْجُرجَانی:307)‘‘۔
اسی طرح مجنون کا حکم ہےکہ وہ تبعاً صحابی قرار پائے گا ،وہ تمام اطفال جو عہد طفولیت میں نبی ﷺ کی ملاقات سے مشرف ہوئے، ان کا تبعاً مسلم ہونا ظاہر ہے کہ ان کے والدین مسلم بلکہ صحابہ تھے اور اگر کسی مجنون کو بھی نبی ﷺ سے ملاقات کا شرف حاصل ہوا تھا ،جس کے والدین دونوں یا ان میں سے ایک مسلمان ہو تو وہ بھی یقینا مسلم ہوا، لہٰذا مجنون اور اطفال دونوں ’’مُسْلِمًا‘‘ کی قید سے خارج نہیں ہوئے۔ 
(3) صحابی کی تعریف میں مذکور تیسری قید ’’بِہٖ‘‘ کی وضاحت کرتے ہوئےعلامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:`
},
{
  pageNumber: 46,
  text: `’’[[arabic: وَقَوْلُنَا بِہٖ يَخْرُجُ مَنْ لَقِيَهٗ مُؤْمِنًا بِغَيْرِهٖ، كَمَنْ لَقِيَهٗ مِنْ مُؤْمِنِي أَهْلِ الْكِتَابِ قَبْلَ الْبَعْثَةِ]]‘‘۔
ترجمہ: ’’خاص نبی کریم ﷺ پر ایمان لانے کی قید سے وہ تمام لوگ صحابی کی تعریف سے خارج ہوگئے، جنہوں نے (اعلان نبوت سے قبل ) دیگر انبیاءِ کرام پر ایمان رکھنے کی حالت میں نبی ﷺ سے ملاقات کی ہو(اور وہ آپ پر ایمان نہ لائے ہوں)، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
ایمان کی حالت میں نبی کریم ﷺ سے ملاقات کی قید سے وہ تمام اشخاص صحابی کی تعریف سے خارج ہوگئے جو نبی کریم ﷺ کےزمانے میں آپ پر ایمان لائے ،مگر آپ سے ملاقات کا شرف حاصل نہ کرسکے ،جیساکہ خیر التابعین حضرت اویس قرنی ،جو کہ اپنی والدہ کی خدمت میں منہمک ہونے کی وجہ سے نبی کریم ﷺ سے ملاقات نہ کرسکے، اِسی طرح حبشہ کے بادشاہ أصْحَمَہ نجاشی آپ ﷺپر ایمان لے آئے تھے ،مگر آپ سے ملاقات حاصل نہ ہوسکی۔
محدثین کرام نے یہ شرط بھی عائد کی نبی کریم ﷺ سے یہ ملاقات آپ کی حیاتِ دنیوی اور بیداری میں ہو ،لہٰذا جس شخص نے نبی کریم ﷺ کو آپ کے وصال کے بعد دفن سے پہلے دیکھا ،جیساکہ ابوذؤیب خویلد بن خالد ہذلی ،یا جسے آپ ﷺ کی دنیوی حیات میں یا آپ کے پردہ فرمانے کے بعد خواب میں ملاقات کا شرف حاصل ہوا ،تووہ صحابی نہیں کہلائے گا ، علامہ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں : 
’’[[arabic: وَہٰذَا کُلُّہٗ فِیْمَنْ رَاٰہُ وَہُوَ فِی قَیْدِ الْحَیَاۃِ الدُّنْیَوِیَّۃِ، أَمَّا مَنْ رَاٰہٗ بَعْدَ مَوْتِہٖ وَقَبْلَ دَفْنِہٖ، فَالرَّاجِحُ أَنَّہٗ لَیْسَ بِصَحَابِیٍّ وَإِلَّا لَعُدَّ مَنِ اتَّفَقَ أَنْ یَرٰی جَسَدَہُ الْمُکَرَّمَ وَہُوَ فِی قَبْرِہِ الْمُعَظَّمِ وَلَوْ فِی ھٰذِہِ الْاَعْصَارِ وَکَذلِٰکَ مَنْ کُشِفَ لَہٗ عَنْہُ مِنَ الْاَوْلِیَاءِ فَرَاٰہٗ کَذٰلِکَ عَلٰی طَرِیْقِ الْکَرَامَۃِ]]‘‘۔`
},
{
  pageNumber: 47,
  text: `ترجمہ: ’’اور یہ تمام صورتیں اُس شخص کے متعلق ہیں جس نے آپ کو حیات دنیوی میں دیکھا اور جس نے آپ کو وفات کے بعد اور دفن سے پہلے دیکھا ، تو راجح قول کے مطابق وہ صحابی نہیں ہے ،ورنہ اس کو بھی صحابی شمار کیا جائے گا جس کے بارے میں اتفاق ہو کہ اس نے آپ ﷺ کے جسد مکرم کو آپ کی قبر معظم میں دیکھا ، خواہ وہ اِسی زمانے میں ہو اور اسی طرح وہ اولیاء ِکرام جن کو کشف کی صورت میں آپ کی زیارت کرائی گئی ہو، اسی طرح کرامت کے طور پر آپ کی زیارت کرائی گئی ہو، (فتح الباری : ج:7،ص:6)‘‘۔ 
علامہ جلال الدین سیوطی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنْ رَاٰہٗ بَعْدَ مَوْتِہٖ ﷺ قَبْلَ الدَّفْنِ، وَقَدْ وَقَعَ ذٰلِکَ لِاَبِی ذُؤَیْبٍ خُوَیْلِدِ بْنِ خَالِدٍ الْہُذَلِیِّ، فَإِنَّہٗ لَا صُحْبَۃَ لَہٗ]]‘‘۔
ترجمہ: ’’اور جس شخص نے آپ کی وفات کے بعد دفن ہونے سے پہلے دیکھا ،جیسے ابوذؤیب خُویلد بن خالد ہذلی ،تو اُنہیں صحابیت کا شرف حاصل نہیں ہے ۔ (تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘۔
اب یہاں یہ سوال پیدا ہوتا ہے کہ بعض ایسے اشخاص بھی پائے جاتے ہیں، جنہوں نے نبی کریم ﷺ کے اعلان نبوت سے قبل آپ سے ملاقات کی اورآپ کی بعثت ورسالت کی خبر دیتے ہوئےآپ پر ایمان بھی لائے، مثلاً :بحیراراہب وغیرہ ،تو آیا ایسے اشخاص صحابی کہلائیں گے یا نہیں،اس حوالے سے علامہ حافظ ابن حجر مضطرب نظر آتےہیں اور اُنہوں نے ایسے اشخاص کے صحابہ میں سے ہونے نہ ہونے کی کوئی تعیین نہیں کی ہے،چنانچہ وہ لکھتے ہیں:
’’[[arabic: وَهَلْ يَدْخُلُ مَنْ لَقِيَهُ مِنْهُمْ وَآمَنَ بِأَنَّهٗ سَيُبْعَثُ أَوْ َلا يَدْخُلُ؟ مَحَلُّ اِحْتِمَالٍ. وَمِنْ هَؤُلَاءِ بُحَيْرَا الرَّاهِبُ وَنَظَرَاؤُهٗ]]‘‘۔`
},
{
  pageNumber: 48,
  text: `ترجمہ: ’’جنہوں نے نبی کریم ﷺ سے ملاقات کی اور آپ کی متوقع بعثت پر ایمان لائے، آیا وہ صحابی کہلائیں گے یا نہیں، اس میں احتمال ہے، اس نوع سے بحیرا راہب اور اُن جیسے دیگر لوگ تعلق رکھتے ہیں، (اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘،یعنی علامہ حافظ ابن حجر نے قطعیت کے ساتھ ان کے صحابی ہونے کا قول نہیں کیا۔
جبکہ بعض محدثین نے اُن تمام اشخاص کو صحابہ میں داخل مانا ہے جنہوں نے نبی کریم ﷺ کے اعلان نبوت سے قبل ملت حنفیہ پر قائم رہتے ہوئے ایمان کی حالت میں آپ سے ملاقات کی، مثلاً زید بن عمرو بن نفیل یا آپ کی متوقع بعثت پر ایمان لائے، جیساکہ بحیرا راہب ،چنانچہ علامہ ابن عابدین شامی ’’شرح التحریر‘‘ کے حوالے سے لکھتے ہیں:
’’[[arabic: وَالصَّحَابِیُّ عِنْدَ الْمُحَدِّثِیْنَ وَبَعْضِ الْاُصُوْلِیِّیْنَ: مَنْ لَقِیَ النَّبِیَّ ﷺمُسْلِمًا وَمَاتَ عَلَی الْإِسْلَامِ أَوْ قَبْلَ النُّبُوَّۃِ وَمَاتَ قَبْلَہَا عَلَی الْحَنِیفِیَّۃِ کَزَیْدِ بْنِ عَمْرِو بْنِ نُفَیْلٍ]]‘‘۔
ترجمہ: ’’محدثین اور بعض اصولیین کے نزدیک صحابی وہ ہے ،جس نے اسلام کی حالت میں نبی ﷺ سے ملاقات کی اور اسلام پر وفات پائی یا ملاقات کا یہ شرف اعلان نبوت سے پہلے حاصل ہوا اور اعلان نبوت سے پہلے ملتِ ابراہیمی پر فوت ہوئے، جیسے زید بن عمروبن نفیل، (رَدُّ الْمُحْتَار عَلَی الدُّرِّ الْمُخْتَار:ج:1،ص: 13)‘‘۔
علامہ ابن عابدین شامی ،علامہ جلال الدین سیوطی کے حوالے سے لکھتے ہیں: 
’’[[arabic: قَالَ: وَہَلْ یُشْتَرَطُ لَقْیُہٗ فِیْ حَالِ النُّبُوَّۃِ أَوْ أَعَمُّ مِنْ ذٰلِکَ، حَتّٰی یَدْخُلَ مَنْ رَاٰہٗ قَبْلَہَا وَمَاتَ عَلَی الْحَنِیفِیَّۃِ، کَزَیْدِ بْنِ عَمْرِو بْنِ نُفَیْلٍ، وَقَدْ عَدَّہٗ ابْنُ مَنْدَۃ فِی الصَّحَابَۃِ، وَکَذَا لَوْ رَاٰہُ قَبْلَہَا، ثُمَّ أَدْرَکَ الْبَعْثَۃَ وَأَسْلَمَ وَلَمْ یَرَہٗ]]‘‘۔
ترجمہ: ’’کیا یہ ملاقات اعلان نبوت کے بعد شرط ہے یا یہ عام ہے (یعنی اعلان نبوت سے قبل کی ملاقات کو بھی شامل ہے)حتیٰ کہ اس میں وہ بھی داخل ہوجائیں جنہوں نے اعلان نبوت سے پہلے آپ ﷺ کو دیکھا اور ان کی موت دین حنیف پر ہوئی، جیسے زید بن عمرو بن نفیل وغیرہ ، ابن مندہ نے ان کو صحابہ میں شمار کیا ہے اور اسی طرح جس نے آپ کو اعلان نبوت سے پہلے دیکھا پھر بعثت کا زمانہ پایا اور اسلام قبول لیکن پھر آپ کونہیں دیکھا ‘‘۔`
},
{
  pageNumber: 49,
  text: `(رَدُّ الْمُحْتَار عَلَی الدُّرِّ الْمُخْتَار:ج۱ص 13)
حافظ ابن حجر صحابی کی تعریف میں ’’مُوْمِنًابِہٖ‘‘ کی مزید وضاحت کرتے ہوئےلکھتے ہیں:
’’[[arabic: يَدْخُلُ فِيْ قَوْلِنَا مُؤْمِنًابِہٖ كُلُّ مُكَلَّفٍ مِنَ الْجِنِّ وَالْإنْسِ]]‘‘۔
ترجمہ: ’’ہمارے اس قول ’’وہ نبی کریم ﷺ پر ایمان لانے والا ہو‘‘ میں جنّ وانس میں سے تمام مکلفین صحابی کی تعریف میں داخل ہوجاتے ہیں‘‘۔
(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ، ج:1،ص:158)
اورآپ ﷺ سے ملاقات کرنے والے فرشتوں پر صحابیت کے اطلاق کے حوالے سے لکھتے ہیں:
’’[[arabic: وَأَمَّا الْمَلَائِکَۃُ فَیُتَوَقَّفُ عَدُّہُمْ فِیْہِمْ عَلٰی ثُبُوْتِ بَعْثَتِہٖ إِلَیْہِمْ، فَإِنَّ فِیْہِ خِلَافًا بَیْنَ الْاُصُوْلِیِّینَ، حَتّٰی نَقَلَ بَعْضُہُمُ الْإِجْمَاعَ عَلٰی ثُبُوْتِہٖ وَعَکَسَ بَعْضُہُمْ]]‘‘۔
ترجمہ: ’’اور ملائکہ کو صحابہ میں شمار کرنااس پر موقوف ہے کہ آیاآپ ﷺ کی بعثت ان کی طرف بھی ہوئی ہے ، پس اس مسئلہ میں اصولیین کے درمیان اختلاف ہے، حتّٰی کہ بعض علماء نے اس کے ثبوت پر اجماع نقل کیا ہے اور بعض نے اس کے برعکس کہا ہے ‘‘۔
(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج:1،ص:158)
اس کی مزید تفصیل ووضاحت یہ ہے کہ اہلِ علم کا اس بارے میں اتفاق ہے کہ جنات بھی انسانوں کی طرح مکلف ہیں اور ان میں مومن اور منکر دونوں قسم کے افرادپائے جاتے ہیں، قرآنِ کریم میں اللہ تعالیٰ نےجنّات کےحوالے سےاُن کے قول کی حکایت کرتے ہوئےفرمایا: ’’[[arabic: وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَلِكَ كُنَّا طَرَائِقَ قِدَدًا]]‘‘۔
ترجمہ: ’’اوربے شک ہم میں سے بعض نیک ہیں اور بعض دوسری طرح کے ، یوں ہم مختلف راہوں پر گامزن ہیں، (الجنّ:11)‘‘۔
اِس بات پر بھی اہلِ علم متفق ہیں کہ جس طرح نبی کریم ﷺ کی بعثت ورسالت تمام انسانوں کے لیےہے،اِسی طرح آپ جنات بلکہ فرشتوں اور تمام مخلوقاتِ الٰہیہ کے بھی`
},
{
  pageNumber: 50,
  text: `رسول ہیں،اللہ تعالیٰ کا ارشادہے:
’’[[arabic: تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا]]‘‘۔
ترجمہ: ’’بہت ہی بابرکت ہے  وہ ذات،جس نے اپنے مکرّم بندے  پر قرآن نازل کیا تاکہ وہ تمام جہانوں کے لیے ڈرسنانے والے ہوں،(الفرقان:1)‘‘۔
نبی کریم ﷺ کا ارشاد ہے: ’’[[arabic: أُرْسِلْتُ اِلَی الْخَلْقِ کَا فَّۃً]]‘‘، ترجمہ: ’’مجھے تمام مخلوق کی جانب رسول بناکر بھیجا گیا ہے‘‘۔اس حدیث میں اگر چہ صرف ’’الْخَلْق‘‘ کاعموم ہی  انسان وجنات اور ملائکہ سمیت تمام مخلوقات کو شامل تھا،اس کے باوجودلفظِ ’’کَا فَّۃً‘‘ کا اضافہ کرکے اس بات کو واضح اورمستحکم کردیا گیا کہ لفظ ’’الْخَلْق‘‘ اپنے کامل عموم پرباقی ہے اور اِس سے کوئی مخلوق خارج نہیں ہے،حضرت عبداللہ بن عباس رضی اللہ عنہما ارشاد فرماتے ہیں:
’’[[arabic: قَالَ لِمُحَمَّدٍﷺ: وَمَاأَرْسَلْنَاكَ اِلَّا کَافَّۃً لِلنَّاسِ، فَاَرْسَلَہٗ اِلَی الْاِنْسِ وَالْجِنِّ]]‘‘۔
ترجمہ: ’’اللہ تعالیٰ نے محمد ﷺ کے متعلق فرمایا:ہم نے آپ کو تمام لوگوں کے لیے رسول بناکر بھیجا ہے ،پس اللہ تعالیٰ نے آپﷺ کو تمام انسان وجنات کے لیے رسول بنایا ہے،(المعجم الکبیر:11610)‘‘۔
لہٰذاوہ انسان وجنات جنہوں نے ایمان کی حالت میں نبی کریم ﷺ سے ملاقات کی،وہ آپ کے صحابہ میں داخل ہیں اور اُن کی جانب آپ ﷺ کی بعثت ورسالت ارسالِ تکلیفی ہےاور وہ شریعت کےفروعی احکام کے مکلف ہیں۔
شیخ ابو محمد علي بن احمد ابن حزم اُندلسی قرطبی متوفی 456؁ھ لکھتے ہیں: 
’’[[arabic: وَقَدْ نَصَّ اللَّهُ تَعَالٰی عَلَى أَنَّ نَفَرًا مِنْ الْجِنِّ آمَنُوا وَسَمِعُوا الْقُرْآنَ مِنْ رَسُولِ اللَّهِ ﷺفَهُمْ صَحَابَةٌ وَفُضَلَاءُ]]‘‘۔
ترجمہ: ’’اللہ تعالیٰ نےصراحت فرمائی ہے کہ جنات کاایک گروہ ایمان لایااور اُنہوں نے رسول اللہﷺ سے قرآن کریم کو سُنا،پس وہ صحابہ اور فضلاء ہیں‘‘۔
(اَلْمُحَلی بِالْآثَار: ج: 8،ص:432)`
},

{
  pageNumber: 51,
  text: `علامہ ابن حجر وعلامہ عینی کے شیخ حافظ زين الدين عبد الرحيم العراقی متوفی806؁ھ لکھتے ہیں:
’’[[arabic: اَلْجِنُّ مِنْ جُمْلَةِ الْمُكَلَّفِيْنَ الَّذِيْنَ شَمِلَتْهُمُ الرِّسَالَةُ وَالْبَعْثَةُ فَكَانَ ذِكْرُ مَنْ عُرِفَ اسْمُهٗ مِمَّنْ رَآهُ حَسَنًا]]‘‘۔
ترجمہ:’’جنات من جملہ مکلفین میں سے ہیں،جنہیں رسالت وبعثت شامل ہے،پس جنات میں جن کا نام معلوم ہواُنہیں صحابہ میں ذکر کرنا عمدہ ہے‘‘۔
(اَلتَّقْیِیْد وَالْاِیْضَاح، ص:295)
نبی کریمﷺ سے ملاقات کرنے والے فرشتوں کےحوالے سے عام اہلِ علم کا موقف یہ ہے وہ صحابہ میں داخل نہیں ہیں، جبکہ محققین اہلِ علم نےاُنہیں بھی صحابہ میں داخل مانا ہے،اس اختلاف کی بنیاد اس بات پر ہے کہ آیا نبی کریمﷺ کی بعثت ورسالت فرشتوں کے لیے ہوئی ہے یا نہیںاور آیا فرشتے احکام شریعت کے مکلف ہیںیا نہیں۔پس جو اہلِ علم حضرات فرشتوں کو غیر مکلّف اورنبی کریمﷺ کی بعثت ورسالت کوانسان وجنات اورفرشتوں کے لیےعام ماننے کے بجائےفقط انس وجن کے ساتھ خاص قرار دیتے ہیں ،اُس کے نزدیک فرشتے صحابہ میں داخل نہیں ہیں۔
چنانچہ علامہ فخر الدین رازی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: أَنَّهٗ لَمْ يَكُنْ مُرْسَلاً إِلَى الْمَلَائِكَةِ]]‘‘۔
ترجمہ:’’نبی کریمﷺ کو فرشتوں کی طرف رسول بناکر مبعوث نہیں کیاگیا،(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ:ج:1،ص:158،نَظْمُ الدُّرَرْ فِی تَنَاسُبِ الْآیَاتِ وَالسُّوَرْ: ج:7، ص:72)‘‘اور وہ اہلِ علم جو فرشتوں کو صحابہ میں داخل مانتے ہیں،اُن کے نزدیک آپ ﷺ کی رسالت انسان وجنات اور فرشتوں سمیت تمام مخلوقات الٰہیہ کو عام اور شامل ہے اور فرشتے بھی انسان وجنات کی طرح مکلف ہیں،البتہ فرشتوں کا مکلف ہونا انسان وجنات کی طرح نہیں بلکہ اُن کی اپنی شان کے مطابق ہے اور بعض اہل علم فرماتے ہیں کہ انسان وجنات کی طرف آپ کی بعثت ارسالِ تکلیفی کی نوع سے ہے کہ وہ احکامِ شریعت کے مکلف`
},
{
  pageNumber: 52,
  text: `ہیں اور فرشتوں کے لیے ارسالِ تشریفی ہے،کہ فرشتوں کی جانب آپ کو مبعوث کرکے فرشتوں کو صحابیت کے شرف سے مشرف کیا گیا ۔
علامہ احمد بن محمد صاوی مالکی رحمۃ اللہ علیہ متوفی1241 ؁ھ لکھتے ہیں:
’’[[arabic: رِسَالَتُہٗ عَامَّۃٌ لِلْاِنْسِ وَالْجِنِّ وَالْمَلَائِکَۃِ وَجَمِیْعِ الْخَلْقِ ،لٰکِنْ اِرْسَالُہٗ لِلْاِنْسِ وَالْجِنِّ اِرْسَالُ تَکْلِیْفٍ اِجْمَاعًا وَاِرْسَالُہٌ لِلْمَلَائِکَۃِ قِیْلَ اِرْسَالُ تَکْلِیْفٍ بِمَا یَلِیْقُ بِھْمْ، وَقِیْلَ اِرْسَالُ تَشْرِیْفٍ ،وَاِرْسَالُہٗ لِمَا عَدَاہُمْ مِنَ الْحَیْوَانَاتِ الْغَیْرِ الْعَاقِلَۃِ وَالْجَمَادَاتِ اِرْسَالُ تَشْرِیْفِ وَرَحْمَۃٍ]]‘‘۔
ترجمہ:’’نبی کریمﷺ کی رسالت انس وجن ،فرشتوں اور تما م مخلوق کو عام ہے،لیکن انسانوں وجنات کے لیے آپ کا ارسال اجماعًاارسالِ تکلیف ہےاور فرشتوں کے لیے آپ کےارسال کے متعلق کہا گیا ہے کہ وہ بھی ارسالِ تکلیف ہے اور فرشتے اپنے حال کے لائق مکلف ہیں اور کہا گیا ہے کہ اُن کی طرف آپ کا اِرسال، اِرسالِ تشریف ہے،اوران کے علاوہ دیگر غیر ذوی العقول حیوانات اور جمادات کے لیے آپ کا ارسال،ارسالِ تشریف ورحمت ہے، (حَاشِیَۃُ الصـَاوِیْ عَلَی الْجَلَالَیْن،ج:4،ص:77)‘‘۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: رَجَّحَ الشَّيْخُ تَقِيُّ الدِّيْنِ السُّبْكِيُّ أَنَّهٗ كَانَ مُرْسَلاً إِلَيْهِمْ]]‘‘۔
ترجمہ:’’شیخ تقی الدین سُبکی نے اس بات کو راجح قرار دیا ہے کہ نبی کریمﷺ کو فرشتوں کی جانب بھی مبعوث کیا گیا تھا،(اَلْاِصَابَہ فِی تَمْیِیْزِ الصَّحَابَہ،ج1ص158)‘‘۔
علامہ فخر الدین رازی کے قول کا جواب دیتے ہوئے علامہ ابراهيم بن عمر البقاعي متوفی885؁ھ فرماتے ہیں:
’’امام رازی پر تعجب ہے کہ اُنہوں نے ایسی بات نقل کی ہے جو کہیں اور نہیں پائی جاتی اور اُن کایہ قول خود اُن کے اپنے دوسرے قول کے معارض ہے،چنانچہ اُنہوں نےاپنی تفسیر میں جہاں بنی آدم کے قابلِ احترام ہونے کی وجوہات تحریر کی ہیں، وہاں اُنہوں نے چوتھی وجہ یہ بیان کی ہے:`
},
{
  pageNumber: 53,
  text: `’’[[arabic: أَنَّهٗ جَعَلَ أَبَاهُمْ رَسُوْلاً إِلَى الْمَلَائِكَةِ،حَيْثُ قَالَ:أَنْبِئْهُمْ بِأَسْمَائِهِمْ،وَقَدْ تَقَرَّرَ أَنَّ كُلَّ كَرَامَةِ كَانَتْ لِنَبِيٍّ مِنَ الْأَنْبِيَاءِ فَلِنَبِيِّنَاﷺ مِثْلُهَا أَوْ أَعْظَمُ مِنْهَا]]‘‘۔
ترجمہ:’’اللہ تعالیٰ بنوآدم کے والد حضرت آدم علیہ السلام کو فرشتوں کے لیے رسول بنایا ہے، چنانچہ اللہ تعالیٰ نےفرمایا:اے آدم! تم ان چیزوںکےنام فرشتوں کو بتاؤ ۔اور یہ بات متحقق ہے کہ جو بھی کرامت وخصوصیت انبیاءِ کرام میں سے کسی نبی کو عطا کی گئی ہے تو اُسی کے مثل یا اُس سے بڑھ کر کرامت وخصوصیت ہمارے نبی ﷺ کو بھی دی گئی ہے‘‘۔
(نَظْمُ الدُّرَرْ فِی تَنَاسُبِ الْآیَاتِ وَالسُّوَرْ،ج:7،ص:ص72)
امام احمد رضا قادریقُدِّسَ سِرُّہُ الْعَزِیْز لکھتے ہیں:
’’علماء فرماتے ہیں : رسالت والاکا تمام جن وانس کو شامل ہونا اجماعی ہے اورمحققین کے نزدیک ملائکہ کو بھی شامل ، [[arabic: كَمَا حَقَّقْنَا ہُ بِتَوْفِیْقِ اللہِ تَعَالٰی فِی رِسَالَۃِ اِجْلُالُ جِبْرِیْلَ]]۔ بلکہ تحقیق یہ ہے کہ حجروشجر وارض وسماء وجبال وبحار تمام ماسوا اللہ اس کے احاطہ عامّہ ودائرۂ تامّہ میں داخل اورخود قرآن عظیم لفظ’’عَالَمِیْن‘‘ اور روایتِ صحیح مسلم میں لفظ ’’ خَلْق‘‘ وہ بھی مؤکد بکلمہ ِ’’کَا فَّۃً ‘‘ ، اس مطلب پر احسن الدلائل طبرانی معجم کبیر میں یعلیٰ بن مرہ رضی اللہ عنہ سے راوی ، حضور سید المرسلین ﷺ فرماتے ہیں :  ’’[[arabic: مَامِنْ شَیْئٍ اِلَّا یَعْلَمُ أَنِّیْ رَسُوْلُ اللہِ اِلَّا كَفَرَة الْجِنِّ وَالْاِنْسِ]]‘‘،ترجمہ:’’کوئی چیز نہیں جو مجھے رسول اللہ نہ جانتی ہو ، مگر بے ایمان جن وآدمی،(فتاویٰ رضویہ،ج:30،ص:134)‘‘۔
علامہ غلام جیلانی میرٹھی رحمۃ اللہ علیہ لکھتے ہیں:
’’بلکہ حق یہ ہے کہ فرشتوں کے حق میں آپ کا ارسال صرف ارسالِ تشریف نہیں ،ارسالِ تکلیف بھی ہے ،فروعِ شریعت کے ساتھ مکلف نہ ہونے سے یہ لازم نہیں آتا کہ وہ دائرہ تکلیف سے ہی خارج ہوجائیں،حتیٰ کہ آپ کی رسالت کے کسی باب میں محتاج نہ رہیں،بلکہ عرفان الٰہی کے مدارج طے کرنے میں جن وانس کی طرح فرشتوں کو بھی آپ کی رسالت`
},
{
  pageNumber: 54,
  text: `کی احتیاج ہے،(بشیر القاری ،ص125)‘‘ ۔
(4)علامہ حافظ ابن حجر صحابی کی تعریف میں مذکورقید ’’وَمَاتَ عَلَى الإِسْلاَمِ‘‘کی وضاحت کرتے ہوئے لکھتے ہیں:
’’[[arabic: وَخَرَجَ بِقَوْلِنَا وَمَاتَ عَلَى الإِسْلاَمِ مَنْ لَقِيَهٗ مُوْمِنًا بِهٖ ثُمَّ ارْتَدَّ، وَمَاتَ عَلٰى رِدَّتِهٖ]]‘‘۔یعنی وہ اشخاص صحابہ میں داخل نہیں ہیں ،جنہوں نے ایمان کی حالت میں آپﷺ سے ملاقات کی ،لیکن پھر مرتد ہوگئےاور اُن کی موت حالتِ ارتداد میں ہی ہوئی،جیساکہ عبداللہ بن جحش نےاپنی اہلیہ حضرت اُم حبیبہ کےہمراہ اسلام قبول کیا تھا اور حبشہ کی طرف ہجرت بھی کی تھی لیکن پھر وہ مرتدہوگیا اور نصرانیت پر اُس کی موت واقع ہوئی، اِسی نوع سے عبداللہ بن خطل،ربیعہ بن اُمیہ بن خلف بھی تعلق رکھتے ہیں،کہ یہ بھی اسلام لانے کے بعد مرتد ہوگئے تھے۔
رہے وہ اشخاص جو نبی کریمﷺ پر ایمان لانے کے بعد مرتد ہوگئے تھے ،لیکن اُنہوں نے پھر دوبارہ اسلام قبول کرلیا تھا اور اسلام پر ہی اُن کی وفات ہوئی تھی،تو آیا ایسے لوگ صحابہ کی جماعت میں شامل ہونگے یا نہیں،اس حوالے سے تفصیل ہے:
(الف)	اگر ارتداد اور تجدیدِ اسلام دونوں ہی نبی کریمﷺ کے زمانے میں ہو ،پس اگراُس نے نبی کریمﷺ سےملاقات کرلی ہو ،تو وہ بالاجماع صحابی ہیں،جیساکہ عبداللہ بن ابی سرح،علامہ سیوطی فرماتے ہیں:
’’[[arabic: أَمَّا مَنْ رَجَعَ إِلَی الْإِسْلَامِ فِی حَیَاتِہٖ كَعَبْدِ اللّٰهِ بْنِ أَبِي سَرْحٍ، فَلَا مَانِعَ مِنْ دُخُولِہٖ فِی الصُّحْبَۃِ]]‘‘۔
ترجمہ:’’رہا وہ شخص جس نے نبی کریمﷺ کی حیات میں اسلام کی طرف رجوع کرلیا تھا جیساکہ عبداللہ بن ابی سرح ہیں،تو اُن کے صحابہ میں داخل ہونے سے کوئی چیز مانع نہیں ہے،(تَدْرِیْبُ الرَّاوِیْ فِیْ شَرحِ تَقْرِیْب النَّوَوی:ج 2:،ص:667-668)‘‘اور اگر نبی کریمﷺ سے ملاقات نہ کی ہو تو فقہ حنفیہ کےقاعدے کی رُو سے ایسا شخص صحابہ میں`
},
{
  pageNumber: 55,
  text: `داخل نہیں ہوگا،جبکہ جمہورمحدثین اسے بھی صحابہ میں داخل مانتے ہیں۔
(ب)	ارتداد وتجدیدِ ایمان دونوں نبی کریمﷺ کے وصال فرمانے کے بعد ہوں۔
(ج)	ارتداد نبی کریمﷺ کے زمانے میں ہو اور تجدید اسلام آپ ﷺ کے وصال کے بعد ہو ، جیساکہ اَشعث بن قیس دس ہجری میں اپنی قوم کے ہمراہ نبی کریم ﷺ کی خدمت میں حاضر ہوئے اور اسلام قبول کیا اور پھر نبی کریمﷺ کےوصال کے بعد مرتد ہوگئے اور پھر حضرت ابوبکر کے عہدِ خلافت میں اسلام قبول کرلیا ۔مؤخر الذکر صورتوں کے متعلق ایسے شخص کے صحابی ہونے پر اتفاق ہے ۔
علامہ حافظ ابن حجر رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَلَوِ ارْتَدَّ ثُمَّ عَادَ إِلَى الْإِسْلَامِ لٰكِنْ لَمْ يَرَهٗ ثَانِيًا بَعْدَ عَوْدِهٖ فَالصَّحِيحُ أَنَّهٗ مَعْدُودٌ فِي الصَّحَابَةِ لِإِطْبَاقِ الْمُحَدِّثِينَ عَلَى عَدِّ الْاَشْعَثِ بْنِ قَيْسٍ وَنَحْوِهٖ مِمَّنْ وَقَعَ لَهٗ ذٰلِكَ وَإِخْرَاجِهِمْ أَحَادِيثَهُمْ فِي الْمَسَانِيدِ]]‘‘۔
ترجمہ:’’پس اگر وہ مرتد ہوگیا اور پھر اسلام کی طرف لوٹ آیا ،لیکن اسلام لانے کے بعد دوبارہ نبی کریمﷺ کو نہیں دیکھا تو صحیح بات یہ ہے کہ اُس کا بھی صحابہ میں شمار کیا جائے گا ، کیونکہ محدثین کا اَشعث بن قیس اور ان جیسے دیگر اشخاص کے صحابی ہونے پر اتفاق ہے ، جوکہ اسلام لانےکے بعد مرتد ہوگئے تھے اور پھر انہوں نے اسلام قبول کرلیا تھا اور اُنہوں نےمسانید میں ان کی احادیث کی تخریج کی ہے،(فتح الباری ،ج7ص4)‘‘۔
خلاصہ بحث یہ ہے :
(۱)	جس نے ایمان کی حالت میں نبی ﷺ سے ملاقات کی اور ان کی وفات ایمان پر ہوئی ،اگر خدانخواستہ درمیان میں مرتد ہوگیا ہو ،لیکن اللہ تعالیٰ کی توفیق سے توبہ کرکے پھر اسلام قبول کرلیا اور اسلام کی حالت میں وفات ہوئی،وہ صحابی ہے۔
(۲)	محدثین کرام کے نزدیک معروف تعریف یہ ہے کہ وہ خوش نصیب جس نے ایمان کی حالت میں رسول اللہ ﷺ کی زیارت کی ہو ،بعض اصولیّین نے اس میں یہ اضافہ کیا ہے`
},
{
  pageNumber: 56,
  text: `کہ متابعت کے ساتھ رسول اللہ ﷺ کے ساتھ طویل صحبت اختیار کی ہو،حضرت سعید بن مسیّب نے یہ اضافہ کیا ہے کہ ایک یادوبرس ایک یا دو غزوات میں آپ ﷺ کے ساتھ صحبت رہی ہو ،لیکن یہ ضعیف قول ہے،کیونکہ اس قول کی بنیادپر لازم آئے گا کہ حضرت جریر بن عبداللہ البجلی اور وائل بن حجر ایسے اصحاب صحابیت کی تعریف سےخارج ہو جائیں گے ، حالانکہ وہ بالاتفاق صحابی ہیں۔
(۳) رسول اللہ ﷺ کی رؤیت یا دیدار سے محض رؤیت عینی مراد نہیںہے ورنہ نابینا ہونے کے سبب حضرت عبداللہ ابن ام مکتوم ایسے حضرات صحابیت کی تعریف سے خارج ہوجائیں گے ،پس ان کے لیے محض ملاقات اور صحبت کافی ہوگی ،کیونکہ وہ رؤیت عینی کے مکلف ہی نہیں ہیںاور یہ بالاتفاق صحابی ہیں،جیسے عدم قدرت کے سبب گونگا شخص نماز میں قراءت لفظی کا مکلّف نہیں ہے ۔
(۴) وہ لوگ صحابی نہیں جنہوںنے کفر کی حالت میں آپ ﷺکی زیارت کی ،پھر آپ کے وصال مبارک کے بعد اسلام قبول کیا ،جیساکہ قیصرکاقاصد۔
(۵)	 جنات بھی انسانوں کی طرح مکلف ہیں اور ان میں مومن اور منکر دونوں قسم کے افراد ہیں ،لہٰذا ان میں سے جنہوں نے حیات ظاہری میں ایمان کی حالت میں آپ ﷺ کی زیارت کی ،وہ صحابی ہیں۔
(۶) 	اسی طرح ایسے بچے جنہوں نے شیرخوارگی یا بچپن کے لاشعوری دور میں آپ ﷺ کودیکھا اور ان کے شعوری دور سے پہلے آپﷺ نے وصال فرمالیا،آپﷺ نے بعض بچوں کو اپنے لعاب دہن مبارک میں چبائی ہوئی کھجور یا مٹھاس  ملاکر گھٹی دی ،یہ بچے تبعاً صحابہ میں شمار ہوتے ہیں،کیونکہ بچے اپنے آباء یا اختلاف دین کی صورت میںخیرالآباء کے تابع ہوتے ہیں،لیکن اگر یہ کوئی حدیث بیان کریںتو وہ مرفوع نہیں ہوگی ،بلکہ مرسلِ مقبول ہوگی۔
(۷)عہدرسالت ﷺ کے ایسے مجنو ن ،جن کے آباءدونوں یا کوئی ایک مسلمان`
},
{
  pageNumber: 57,
  text: `تھا،تبعاًمسلمان سمجھے جائیںگےاور ان کی طرف صحابیت کی نسبت کی جاسکے گی ۔
(۸)ملائکہ اگرچہ مکلّف نہیں ہیں ،لیکن اگر انہوںنے حیات ظاہری میں آپ کی زیارت کی ہے ،تو مختار قول کے مطابق وہ بھی صحابہ میں شمار ہوں گے ،امام النحو علامہ غلام جیلانی کی توجیہ کے مطابق وہ صحابی کہلائے جاسکتے ہیں ،اس پر یہ سوال وارد ہوتا ہے کہ ملائک تو معصوم ہیں ، انہیں نسبت صحابیت سے کیافیض متوقع ہوسکتا ہے،اس کی بابتعلامہ غلام جیلانی میرٹھی رحمہ اللہ تعالیٰ نے لکھا: ’’ان کے درجات بلند ہوسکتے ہیں‘‘۔
(۹)صحابیت کی نسبت کا تعلق صرف ذوی العقول سے ہوتا ہے ،غیرذوی العقول ،جیسے جمادات ،نباتات،حیوانات وغیرہ جن سے حیات ظاہری میں آپﷺ کو واسطہ پڑا ، آپ کی نسبت سے متبرک ہوںگے،لیکن ان کی طرف صحابیت کی نسبت نہیں کی جاسکے گی۔

[[heading: کیا ورقہ بن نوفل صحابی تھے]]
سوال:
حضرت ورقہ بن نوفل کی نبی کریم ﷺ سے ملاقات ثابت ہےاوربعض روایات میں ان کے ایمان اورتصدیق بالرسالت کا بھی ذکر ہے،تو سوال یہ ہے کہ کیاان کو بھی صحابیت کا شرف حاصل ہے، (نیازاحمد ، جہلم )۔
جواب: 
ورقہ بن نوفل بن اسد بن عبدالعزیٰ بن قُصَیّ القرشی الاسدی نبی کریم ﷺ کی زوجہ محترمہ ام المومنین حضرت خدیجۃ الکبریٰ رضی اللہ عنہا کےرشتے میں چچا زاد تھے ۔حضرت ورقہ بن نوفل ایمان لائے تھے یانہیں اور آیا وہ صحابی ہیں یا نہیں ،اس کے بارے میں متعدد اقوال ہیں:
علماء کے ایک گروہ کا یہ کہنا ہے کہ حضرت ورقہ، زید بن عمرو بن نفیل کی طرح دین حنیف اور ملت ابراہیمی کے پیروکار تھے اور بعض نے یہ کہا ہے کہ آپ نے نصرانیت کو اختیار کیا تھا اوروہ صحیح بخاری کی اس حدیث سے استدلال کرتے ہیں،جس میں ابتدائے وحی کے احوال بیان کیے گئے ہیںکہ جب حضرت خدیجہ رضی اللہ عنہا رسول اللہ ﷺ کو ورقہ بن نوفل کے پاس لے گئیں۔ اس میں یہ تصریح ہے کہ انہوں نے زمانہ جاہلیت میں بت پرستی سے متنفر ہوکرنصرانیت اختیار کی تھی اور ان کے پاس تورات کا علم تھا،اس بات میں کوئی شک نہیں کہ حضرت ورقہ مُوَحِّد تھے، بتوں کی عبادت سے متنفر تھے ، ملت ابراہیمی کے پیرو کار تھے اورانہوں نصرانیت کو اختیارکرلیا تھا ،لیکن ان کی وفات نصرانیت پر ہوئی یا اسلام پر اور آیا وہ`
},
{
  pageNumber: 58,
  text: `صحابی ہیںیا نہیں ، اس میں اختلاف ہے۔ حضرت عائشہ کی روایت کردہ حدیث میں ہےکہ حضرت ورقہ کی وفات نصرانیت پر ہوئی، لیکن یہ صحیح نہیں ہے، کیونکہ یہ حدیث عثمان بن عطا ءخراسانی کی سند سے روایت ہے اور علماء حدیث کے نزدیک عثمان ایک ضعیف راوی ہیں،علامہ ابن حجر لکھتے ہیں: اور ایک روایت میں جو یہ لفاظ آئے ہیں :’’[[arabic: فَمَاتَ وَرَقَۃُعَلٰی نَصرَانِیَّتِہٖ لٰکِن عُثمانَ ضَعِیْف]]‘‘۔
ترجمہ:’’پس ورقہ کا انتقال دین نصرانیت پر ہوا ،لیکن یہ روایت ضعیف ہے،کیونکہ یہ عثمان بن عطاء خراسانی کی روایت ہے اور انہیںمحدثین نے ضعیف قرار دیا ہے،(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ :ج:6،ص:476) ‘‘۔اس لیے یہ بات ثابت ہوگئی کہ ان کی وفات اسلام  پرہی ہوئی ہے اور اس کی تائید ابتدائے وحی والی حدیث سے بھی ہوتی ہے ، جس میں ہے کہ رسول اللہ ﷺ  کاواقعہ سن کر انہوں نے جواب دیا:
’’[[arabic: ہٰذَا النَّامُوْسُ الَّذِیْ نَزَّلَ اللَّہُ عَلٰی مُوْسٰی، یَا لَیْتَنِیْ فِیْہَا جَذَعًا، لَیْتَنِیْ أَکُوْنُ حَیًّا إِذْ یُخْرِجُکَ قَوْمُکَ]]‘‘۔
ترجمہ:’’یہ تو وہی ناموس (معزز راز داں فرشتہ) ہے ،جسے اللہ نے موسیٰ علیہ السلام پر وحی دے کر بھیجا تھا، کاش کہ جب اعلان نبوت کے موقع پر آپ کی قوم آپ کو وطن سے نکالے گی، میں جوان عمر ہوتا (اور آپ کی مدد کرتا)،(بخاری:3)‘‘۔
علامہ ابن حجر لکھتے ہیں:’’[[arabic: فَہٰذَا ظَاہِرُہٗ اَنَّہٗ اَقَرَّ بِنُبُوتِہٖ]]‘‘۔ترجمہ:’’اس کا ظاہری مفہوم یہی ہے کہ حضرت ورقہ نے آپ ﷺ کی نبوت کا اقرارکرلیا تھا‘‘۔`
},
{
  pageNumber: 59,
  text: `(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج:6،ص:675)
علامہ آجری اور علامہ بیہقی حدیث ذکر کرتے ہیں:
’’[[arabic: فَقَالَ لَہٗ وَرَقَۃُ: اَبْشِرْ، ثُمَّ اَبْشِرْ، فَاَنَا اَشہَدُ اَنَّکَ الَّذِیْ بَشّر بہٖ ابنُ مریم، وَإِنَّکَ عَلٰی مِثلِ نَامُوسِ مُوسٰی، وإنَّکَ نبَیٌّ مُرسَل، وَإِنَّکَ سَوفَ تُؤمَرُ بِالجِہَادِ بَعدَ یَومِکَ ہٰذَا، وَإِن یُّدرِکنِی ذٰلِکَ لاُجَاہِدَنّ مَعَکَ. فَلَمَّا ُتوُفِّیَ قَالَ رَسُولُ اللّٰہِ ﷺ: لَقَد رَاَیتُ الْقَسَّ فِی الْجَنَّۃِ عَلَیْہِ ثِیَابُ الْحَرِیْرِ،لِاَنَّہٗ آمَنَ بِی وَصَدَّقَنِی]]‘‘۔
ترجمہ:’’ورقہ نے جواب میں کہا:بشارت ہو ،پھر بشارت ہو، میں گواہی دیتا ہوں کہ آپ وہی نبی ہیں جس کی بشارت عیسیٰ بن مریم نے دی تھی اور آپ کی شریعت موسیٰ کی شریعت کی مانند ہوگی اور میں شہادت دیتا ہوں کہ آپ نَبِیِّ مُرسَل ہیں اور عنقریب ا ٓپ کوجہاد کا حکم دیا جائے گا ،اگر میں نے اس وقت کو پالیا تو میں آپ کے ساتھ مل کر جہاد کروںگا،جب وہ فوت ہوگئے، تو رسول اللہ ﷺ نے فرمایا:میں نے ورقہ کو جنت میںریشمی لباس میں دیکھا، کیونکہ وہ مجھ پر ایمان لائے تھے اور انہوں نے میری تصدیق کی تھی‘‘۔
(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج:6،ص:675)
علامہ بیہقی نے اس روایت کو منقطع قرار دیا ہے، لیکن جمہور علماء کے نزدیک انقطاع سے صحت اور حجیت میں کچھ خلل نہیں آتا،علامہ علی القاری لکھتے ہیں:
’’[[arabic: وَقَالَ أَبُو دَاوٗدَ:ہٰذَا مُرْسَل: أَيْ: نَوْعٌ مُرْسَلٌ وَہُوَ الْمُنْقَطِعُ لٰکِنَّ الْمُرْسَلَ حُجَّۃٌ عِنْدَنَا وَعِنْدَ الْجُمْہُورِ]]‘‘۔
اور ابودائود نے کہا: یہ حدیث مرسل یعنی منقطع ہے، جو مرسل کی قسم ہے، لیکن ہمارے اور جمہور علماء کے نزدیک مرسل حجت ہے،(مرقاۃ :ج:1،ص:368)‘‘اور ایک روایت میں جو ا لفاظ آئے ہیں :’’[[arabic: فَمَاتَ وَرَقَۃُ عَلٰی نَصْرَانِیَّتِہٖ لٰکِنْ عُثْمَانُ ضَعِیْف]]‘‘۔پس ورقہ کا انتقال دین نصرانیت پر ہوا ،لیکن یہ روایت ضعیف ہے کہ عثمان بن عطاء خراسانی اس کے`
},
{
  pageNumber: 60,
  text: `راوی ہیںجن کو علماء نے ضعیف قرار دیا ہے‘‘۔
(اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ :ج:6،ص:476) 
حضرت ورقہ کے جنتی ہونے کے بارے میںکتب احادیث میں متعدد روایات موجود ہیں،جو ان کے مومن ہونے پر دلالت کرتی ہیں:
’’[[arabic: عَنْ عَائِشَۃَ، أَنَّ خَدِیْجَۃَ سَاَلَتْ رَسُوْلَ اللہِ ﷺعَنْ وَرَقَۃَ بْنِ نَوْفَلٍ، فَقَالَ:قَدْ رَأَیْتُہٗ فِی الْمَنَامِ، فَرَأَیْتُ عَلَیْہِ ثِیَابُ بَیَاضٍ، فَاَحْسِبُہٗ لَوْ کَانَ مِنْ أَہْلِ النَّارِ، لَمْ یَکُنْ عَلَیْہِ بَیَاضٌ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں :حضرت خدیجۃ الکبریٰ رضی اللہ عنہا نے حضرت ورقہ کے بارے میں نبی ﷺ سے پوچھا : تو آپ ﷺ نے فرمایا: میں نے ان کو خواب میں اس حال میں دیکھا کہ ان کے جسم پر سفید لباس تھا ،میرا گمان ہے (کہ وہ جنتی ہیں)اگر وہ اہل جہنم  میںسے ہوتے تو ان کے جسم پر سفید لباس نہ ہوتا ، (مسند احمد:24367 )‘‘۔
امام ابویعلیٰ روایت کرتے ہیں:
’’[[arabic: عَنْ جَابِرِ بْنِ عَبْدِ اللَّہِ: سُئِلَ عَنْ وَرَقَۃَ بْنِ نَوْفَلٍ، قَالَ: أَبْصَرْتُہٗ فِی بُطْنَانِ الْجَنَّۃِ عَلَیْہِ سُنْدُسٌ]]‘‘۔
ترجمہ:’’حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ ﷺ سے حضرت ورقہ کے بارے میں پوچھا گیا :تو آپﷺ نے فرمایا:میں نے ان کو جنت کےنشیب میں ریشمی لباس پہنے دیکھا،(مسند ابی یعلٰی:2047)‘‘۔
’’[[arabic: عَنْ عَائِشَۃَ رَضِیَ اللَّہُ عَنْہَا: أَنَّ النَّبِیَّ ﷺ قَالَ: لَا تَسُبُّوْا وَرَقَۃَ فَإِنِّی رَأَیْتُ لَہٗ جَنَّۃً أَوْ جَنَّتَیْنِ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں:نبی ﷺ نے فرمایا:ورقہ کو برا نہ کہو،کیونکہ میں نے ان کے لیے ایک جنت یا دو جنتیں دیکھی ہیں،(مستدرک للحاکم: 4211)‘‘۔
الغرض حضرت ورقہ کا ایمان ثابت ہے ،لیکن صحابی ہونے میں اختلاف ہے ا ور علماء کی`
},

{
  pageNumber: 61,
  text: `ایک جماعت کا موقف یہ ہے کہ حضرت ورقہ آپ ﷺ کی بعثت یعنی عَلانیہ دعوت سے پہلے وفات پاچکے تھے ،حدیث میں ہے:
[[arabic: فَقَالَ لَہٗ وَرَقَۃُ: ہٰذَا النَّامُوسُ الَّذِی نَزَّلَ اللّٰہُ عَلٰی مُوسٰی، یَا لَیْتَنِی فِیْہَا جَذَعًا، لَیْتَنِی أَکُوْنُ حَیًّا إِذْ یُخْرِجُکَ قَوْمُکَ، فَقَالَ رَسُوْلُ ﷺ: أَوَ مُخْرِجِیَّ ہُمْ، قَالَ: نَعَمْ، لَمْ یَاْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِہِ إِلَّا عُوْدِیَ، وَإِنْ یُدْرِکْنِی یَوْمُکَ أَنْصُرْکَ نَصْرًا مُؤَزَّرًا، ثُمَّ لَمْ یَنْشَبْ وَرَقَۃُ أَنْ تُوُفِّیَ، وَفَتَرَ الوَحْیُ]]
ترجمہ: ’’یہ تو وہی ناموس (معزز راز داں فرشتہ) ہے ،جسے اللہ نے موسیٰ علیہ السلام پر وحی دے کر بھیجا تھا، کاش میں آپ کی دعوت کے شروع ہونے پر جوان عمر ہوتا، کاش میں اس وقت تک زندہ رہتا جب کہ آپ کی قوم آپ کو اس شہر سے نکال دے گی،رسول اللہ ﷺنے یہ سن کر تعجب سے پوچھا : کیا وہ لوگ مجھ کو نکال دیں گے، ورقہ نے کہا:ہاں جو شخص بھی آپ کی طرح دعوت حق لے کر آیا ، اس کے عہد کے لوگوں نے اس سے عداوت کی ،اگر میں نے آپ کی دعوت کا زمانہ پایا ،تو میں پوری قوت سے آپ کی مدد کروں گا ، مگر پھرکچھ عرصہ بعد ورقہ وفات پاگئے اور وحی کا سلسلہ کچھ عرصے تک منقطع رہا ، (بخاری:3)‘‘۔
علامہ ابن حجر لکھتے ہیں:
[[arabic: فَہٰذَا ظَاہِرُہٗ اَنَّہٗ اَقَرَّ بِنُبُوَّتِہٖ، وَلٰکِنَّہٗ مَاتَ قَبْلَ اَنْ یَّدْعُوَرَسُوْلُ اللّٰہِ ﷺ النَّاسَ إِلَی الِإسلَامِ، فَیَکُوْنُ مِثْلَ بَحِیْرَاوَفِی إِثبَاتِ الصُّحْبَۃِ لَہٗ نَظَر]]
ترجمہ: ’’اس کا ظاہرمفہوم یہی ہے کہ انہوں نے نبوت کا اقرار کیا تھا، لیکن وہ رسول اللہ ﷺ کے لوگوں کودعو ت عام دینے سے پہلے وفات پا گئے ، تو وہ بَحیرا راہب کی طرح ہوگئے اور ان کی صحابیت کا ثبوت مَحَلِّ نظر ہے، (الاصابۃ:ج:6،ص: 475)‘‘۔
مومن یا مسلم اسی شخص کو کہتے ہیں، جس نے دعوت کے بعد اسلام قبول کیا ہو، حضرت ورقہ دعوت سے پہلے انتقال کرنے کے سبب جب مسلم نہیں ہوئے ،تو صحابی نہیں ہوسکتے کہ صحابی کی تعریف میں مسلم ہونے کی قید ہے ،ہا ں اہل فترت میں سے ہیں، جیسے بحیرا راہب`
},
{
  pageNumber: 62,
  text: `اور دَلَائِلُ النُّبُوَّۃ کی مذکورہ بالا روایت میں ان کے آپﷺ پر ایمان لانے اور تصدیق کا جو ذکر ہے ،اس میں یہ احتمال بھی ہے کہ وہ تصدیق دعوت سے پہلے کی ہو،لیکن حضرت ورقہ کی وفات کا سن اس بات پر دلالت کرتا ہے کہ وہ خفیہ دعوت کے بعد فوت ہوئے اور اس صورت میں آپ صحابی ہیں ، علامہ حلبی حضرت ورقہ کی سن وفات کے متعلق لکھتے ہیں :
[[arabic: فَفِی الْإِمْتَاعِ: اَنَّ وَرَقَۃَ مَاتَ فِی السَّنَۃِ الرَّابِعَۃِ مِنَ الْمَبعَثِ]]
ترجمہ: ’’اور ’’امتاع‘‘ میں ہے: حضرت ورقہ بعثت کے چوتھے سال وفات پاگئے تھے، (سِیْرَتُ الْحَلْبِیَۃ:ج:1 ،ص: 357 )‘‘۔ اس سے ثابت ہوا کہ حضرت ورقہ نے خفیہ دعوت کا زمانہ پایا تھا اور ان کی زندگی میں وحی کا نزول تین سال تک موقوف رہنے کے بعد جاری بھی ہوگیا تھا، علامہ حلبی لکھتے ہیں:
[[arabic: وَفِیْ کَلَامِ صَاحِبِ کِتَابِ الْخَمِیْسِ فِی الصَّحِیْحَیْنِ اَنَّ الْوَحْیَ تَتَابَعَ فیِ حَیَاۃِ وَرَقَۃَ وَاَنَّہٗ آمَنَ بِہٖ]]
ترجمہ: ’’اور کتاب الخمیس کے مصنف کے قول کے مطابق صحیحین میں ہے : ورقہ کی زندگی میں نزول وحی کا سلسلہ (انقطاع کے بعد) دوبار ہ شروع ہوگیا تھا اور وہ آپ ﷺ پر ایمان لائے تھے، (سِیْرَتُ الْحَلْبِیَۃ:ج:1،ص:359)‘‘۔
پس یہ بات ثابت ہوچکی ہے کہ آپ نے عَلانیہ دعوت کا زمانہ بھی پایا ہے، چناچہ علامہ ابن حجر لکھتے ہیں:
[[arabic: عَنْ عُرْوَۃَ بنِ الزُّبَیْرِ، قَالَ: کاَنَ بِلَال لِجَارِیَۃٍ مِنْ بَنِی جُمَح، وَکَانُوا یُعَذِّبُونَہٗ بِرَمضَاءِ مَکَّۃَ یَلْصِقُوْنَ ظَہْرَہٗ بِالرَّمْضَاءِ لِکَیْ یُشْرِکَ ،فَیَقُولُ: أَحَد، اَحَدْ، فَیَمُرُّ بِہٖ وَرَقَۃُ وَہُوَ عَلٰی تِلکَ الحَالِ، فَیَقُوْلُ: أََحَد أََحَد یَا بِلَالَ، وَاللّٰہِ لَئِنْ قَتَلتُمُوْہُ لاَتَّخذَِنَّہٗ حَنَّانًا، وَہٰذَا مُرسَل جَیِّد، یَدُلُّ عَلٰی اَنَّ وَرَقَۃَ عَاشَ إِلٰی اَن دَعَا النَّبِیُّ ﷺ إِلَی الْإسْلَامِ حَتّٰی اَسْلَمَ بِلَالٌ وَالْجَمْعُ بَینَ ہٰذَا وَبَیْنَ حَدِیْثِ عَائِشَۃ َأَن یُّحْمَلَ قَولُہٗ: وَلَمْ یَنْشَبْ وَرَقَۃُ اَن تُوُفِّیَ، اَیْ قَبْلَ اَن یَّشتَہِرَ الِإسلَامُ وَیُؤمَرَ النَّبِیُّ ﷺ بِالجِہَاد]]`
},
{
  pageNumber: 63,
  text: `ترجمہ: حضرت عروہ بن زبیر رضی اللہ عنہ بیان کرتے ہیں :حضرت بلال بنی جمح کے مظالم کا شکار تھے اور وہ انہیں مکہ کی شدید دھوپ میں گرم زمین پر لٹا کر اذیت دیتے تھے تاکہ وہ اسلام چھوڑ کر مشرک ہوجائیں، پس بلال ’’احد احد‘‘ کہتے تھے ، اس حال میں حضرت ورقہ کا ان کے پاس سے گزر ہوتا ، تو وہ کہتے: اے بلال ’’احد، احد‘‘ اور کفار سے کہتے: بخدا اگر تم نے ان کو قتل کردیا تو میں اس کی قبر کو برکت حاصل کرنے کی جگہ بنادوں گا اور یہ حدیث عمدہ مرسل ہے اور اس بات پر دلالت کرتی ہے کہ حضرت ورقہ نبی ﷺ کی اسلام کی طرف دعوت عام تک زندہ رہے ،حتی کہ بلال اسلام لائے اور اس حدیث اورحضرت عائشہ رضی اللہ عنہا کی حدیث میں تطبیق کی صورت یہ ہے : ’’حضرت ورقہ زیادہ عرصہ زندہ نہ رہے اور وفات پاگئے‘‘، اس قول کو اس پر محمول کریں گے کہ اسلام کے مشتہر ہونے اور جہاد کا حکم آنے سے پہلے وہ فوت ہوگئے، (اَلْاِصَابَۃ فِیْ تَمْیِیْزِ الصَّحَابَۃ:ج؛۶ ،ص۴۷۶)‘‘۔
اور حضرت بلال کو اذیت دینے کا عمل علانیہ دعوت کے بعد شروع ہوا تھا ،علامہ حلبی ان کی صحابیت کے بارے تصریح کرتے ہیں:
[[arabic: وَحَیْثُ أَدْرَکَ الرِّسَالَۃَ فَقَدْ أَسْلَمَ، وَحِیْنَئِذٍ یَکُوْنُ صَحَابِیًّا]]
ترجمہ: ’’اور جب دعوت عام کا زمانہ پایا تو مسلمان ہوئے اور جب اسلام ثابت ہوگیا تو اس صورت میں صحابی ہوگئے ،(سِیْرَتُ الْحَلْبِیَۃ:ج:1،ص:360 )‘‘۔
مندرجہ بالا تمام روایات کی روشنی میں خلاصہ کلام یہ ہے حضرت ورقہ بن نوفل کے بارے میں مختلف اقوال ہیں:
(۱) آپ کی وفات دین نصرانیت پر ہوئی ،لیکن یہ قول ضعیف ہے ۔
(۲) آپ کی وفات ایمان واسلام پر ہوئی اور آپ ﷺ کی دعوت عام سے پہلے ہوئی اور ان کے حسن عاقبت کی بشارات احادیث اور روایات میں موجود ہیں اور یہ قول یقیناً راجح ہےعلامہ ابن حجر نے صحابیت کے قول کے بارے میں کہا: یہ محل نظر ہے۔
(۳) انہوں نے دعوت عام کا ابتدائی دور پایا ہے،حضرت بلال کا واقعہ اس پر شاہد ہے،لہٰذا`
},
{
  pageNumber: 64,
  text: `وہ صحابی ہیں ،علامہ حلبی،علامہ طبری،علامہ بغوی اور ابن السکن اسی کے قائل ہیں شارح بخاری علامہ غلام جیلانی میرٹھی رحمہ اللہ تعالیٰ نے اسی کو راجح قرار دیا ہے۔علامہ غلام رسول سعیدی رحمہ اللہ تعالیٰ نے نعمۃ الباری فی شرح البخاری: ج:۱،ص:۱۳۷ میں تمام اقوال نقل کردیے ہیں لیکن صحابیت کے قول کو راجح قراردینے کی بابت کو ئی تصریح نہیں کی اور نہ اسے رد کیا ہے ،واللہ اعلم بالصواب۔ حاصل کلام یہ کہ جہاں کسی مسئلے کے بارے میں ایک سے زائد اقوال ہوں اور کسی ایک کو اختیار کرنے سے کوئی شرعی خرابی لازم نہ آئے، وہاں مسئلے کے تمام پہلوئوں کی نشاندہی کر کے کسی ایک قول کو قطعی اور حتمی قرار دینے کے بجائے اہلِ علم پر چھوڑ دینا چاہیے، کیونکہ کبھی مقابلہ حق اور باطل یا صحیح اور غلط میں ہوتا ہے اور کبھی بہ اور بہتر میں یا راجح اور مرجوح میں ہوتا ہے۔

[[heading: ملک الموت کا کیا نام ہے]]

سوال:
ملک الموت کاکیانام ہے؟،(منوراحمد ،ملیر کراچی)۔
جواب:
اللہ تعالیٰ کا ارشاد ہے:
[[arabic: قُلْ يَتَوَفّٰكُمْ مَّلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ ثُمَّ إِلَى رَبِّكُمْ تُرْجَعُونَ]]
ترجمہ: ’’آپ کہیے: تمہیں موت کا فرشتہ وفات دیتا ہے جو تم پر مقرر ہے ،پھر تم اپنے رب کی طرف لوٹائے جائو گے،(السجدہ:11)‘‘۔
علامہ ابن کثیر رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: وَاَمَّا مَلَکُ الْمَوْتِ فَلَیْسَ بِمُصَرَّحٍ بِاسْمِہٖ فِی الْقُرْاٰنِ وَلَا فِی الْاَحَادِیْثِ الصِّحَاحِ وَقَدْ جَاءَ تَسْمِیَتُہٗ فِی بَعْضِ الْاٰثَارِ بِعِزْرَائِیلَ]]
ترجمہ: ’’ملک الموت کا نام قرآن اور صحیح احادیث میں صراحت کے ساتھ بیان نہیں ہوا،البتہ بعض آثار میں اُن کا نام عزرائیل آیا ہے، (البدایہ والنہایہ، ج:1،ص:49)‘‘۔`
},
{
  pageNumber: 65,
  text: `السجدہ:11کی تفسیر میں مزید لکھتے ہیں:
[[arabic: وَقَدْ سُمِّیَ فِیْ بَعْضِ الْاٰثَارِ بِعِزْرَائِیْلَ وَہُوَ الْمَشْہُوْرُ، قَالَہٗ قَتَادَۃُ وَغَیْرُ وَاحِدٍ وَلَہٗ اَعْوَانٌ]]
ترجمہ: ’’بعض آثار میں اُن کا نام عزرائیل آیا ہے اور یہی مشہور ہے اور قتادہ اور کئی محدثین نے کہا:اُن کے مددگار (دیگر فرشتے) بھی ہوتے ہیں،(تفسیر ابن کثیر، ج: 6ص : 322)‘‘۔ حضرت عزرائیل کے تحت قبضِ ارواح کے شعبے سے اور بھی فرشتے وابستہ ہیں ۔
علامہ محمود آلوسی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: وَالَّذِیْ ذَہَبَ إِلَیْہِ الْجَمْہُوْرُ اَنَّ مَلَکُ الْمَوْتِ لِمَنْ یَّعْقِلُ وَمَا لَا یَعْقِلُ مِنَ الْحَیَوَانِ وَاحِدٌ وَہُوَ عِزْرَائِیْلُ وَمَعْنَاہُ عَبْدُ اللّٰہِ]]
ترجمہ: ’’جمہور کا قول یہ ہے کہ ذی عقل اور غیر ذی عقل جانداروں کے لیے ملک الموت ایک ہی ہیں اوروہ عزرائیل ہیں اور عزرائیل کے معنی ہیں: اللہ کا بندہ، (روح المعانی، ج:11،ص:124)‘‘۔
علامہ ابوعبداللہ محمد بن احمد قرطبی رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: قَالَ عَبْدُ الرَّحْمٰنِ بْنُ سَابِطٍ:تَدْبِیْرُ اَمْرِ الدُّنْیَا إِلٰی اَرْبَعَۃٍ، جِبْرِیْلَ وَمِیْکَائِیْلَ وَمَلَکِ الْمَوْتِ وَاسْمُہٗ عِزْرَائِیْلُ وَإِسْرَافِیْلَ، فَاَمَّا جِبْرِیْلُ فَمُوَکَّلٌ بِالرِّیَاحِ وَالْجُنُوْدِ، وَاَمَّا مِیْکَائِیْلُ فَمُوَکَّلٌ بِالْقَطْرِ وَالنَّبَاتِ، وَاَمَّا مَلَکُ الْمَوْتِ فَمُوَکَّلٌ بِقَبْضِ الْاَنْفُسِ فِی الْبَرِّ وَالْبَحْرِ، وَاَمَّا إِسْرَافِیلُ فَہُوَ یَنْزِلُ بِالْاَمْرِ عَلَیْہِمْ، وَلَیْسَ مِنَ الْمَلَائِکَۃِ اَقْرَبُ مِنْ إِسْرَافِیلَ، وَبَیْنَہٗ وَبَیْنَ الْعَرْشِ مَسِیْرَۃُ خَمْسِمِائَۃِ عَامٍ]]
ترجمہ: ’’عبدالرحمن بن سابط نے کہا: دنیا کے (تکوینی) امور کی تدبیر چار فرشتوں کے ذمے ہے ،(وہ ہیں:) جبریل، میکائیل اور ملک الموت اور اُن کا نام عزرائیل ہے اور اسرافیل علیہم السلام، جبریل ہوائوں اور لشکروں پر مقرر ہیں اور میکائیل بارش اور نباتات پر مقرر ہیں اور ملک الموت برّوبحر میں روحیں قبض کرنے پر مقرر ہیں اور اسرافیل ان فرشتوں پر (اللہ کا)`
},
{
  pageNumber: 66,
  text: `حکم لے کر نازل ہوتے ہیں اور ملائکہ میں سب سے زیادہ (عرش کے) قریب اسرافیل ہیں اور اُن کے اور عرش کے درمیان پانچ سو سال کا فاصلہ ہے۔
(تفسیر قرطبی ، ج:19، ص: 194)
مذکورہ بالا مفسرین کے کلام سے یہ بات ثابت ہوتی ہے کہ قرآن کریم و احادیث صحیحہ میں ملک الموت کا نام مذکور نہیں ہے، البتہ بعض آثار صحابہ و تابعین میں ملک الموت کا نام عزرائیل آیا ہے اور جمہور کے نزدیک یہی معروف و مشہور ہے۔`
},
 {
  pageNumber: 67,
  text:`[[heading: طہارت کے مسائل]]`
 }, 

 {
  pageNumber: 69,
  text: `[[heading: ٹھوس نجاست سے آلودہ خشک زمین کا حکم]]
سوال:
زمین پر ٹھوس نجاست لگ گئی، پھر وہ نجاست خشک ہو گئی، کیا اب اس پر تیمم کیا جا سکتا ہے، (حیدر علی)۔
جواب:
زمین پر کوئی ٹھوس نجاست گری، جیسے: انسان کا براز (پاخانہ)، جانور کی گوبر وغیرہ اور خشک ہو گئی، اگر وہ ٹھوس نجاست وہاں موجود ہے تو اس سے تیمم نہیں کر سکتے، کیونکہ وہ عین نجاست ہے، علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اَلْاَرْضُ إِذَا أَصَابَتْہَا النّجَاسَۃُ فَیَبِسَتْ وَذَہَبَ أَثرُہَا لَایَجُوْزُ التَّیَمَّمُ بِہَا، کَذَا فِیْ فَتَاوٰی قَاضِیْ خَان]]‘‘۔
ترجمہ: ’’زمین کو نجاست پہنچی اور خشک ہو گئی اور اس کا اثر زائل ہو گیا، (تب بھی) اس سے تیمم جائز نہیں ہے، ’’فتاویٰ قاضی خان‘‘ میں اسی طرح ہے، (فتاویٰ عالمگیری، ج: 1، ص: 26)‘‘۔ ایسی جگہ پر نماز ادا کر سکتے ہیں۔ اگر کسی انسان یا جانور نے پیشاب کیا اور سورج کی گرمی سے وہ زمین خشک ہو گئی ہو، تو اس پر نماز پڑھ سکتے ہیں، کیونکہ مائع (Liquid) کا ٹھوس وجود نہیں ہوتا اور وہ دھوپ کی حرارت سے بخارات بن کر اُڑ جاتا ہے۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’[[arabic: فَتَاوَى الْحُجَّةِ]]‘‘ میں ہے: کپڑے کو جسم رکھنے والی نجاست پہنچی اور خشک ہو گئی تو رگڑنے سے پاک ہو جاتا ہے، جس طرح موزہ پاک ہو جاتا ہے، ’’مضمرات‘‘ میں اسی طرح ہے۔ ایک مسئلہ یہ ہے: زمین خشک ہونے اور نجاست کا اثر زائل ہونے سے نماز کے لیے پاک ہو جاتی ہے، تیمم کے لیے نہیں، اس سے کوئی فرق نہیں پڑتا کہ دھوپ سے خشک ہوئی یا آگ سے یا ہوا اور سائے سے، ’’کافی‘‘ اور ’’البحر الرائق‘‘ میں اسی طرح ہے، (فتاویٰ عالمگیری، ج: 1، ص: 44)‘‘۔`
},
{
  pageNumber: 70,
  text: `[[heading: طہارت کا ایک مسئلہ]]
سوال:
کموڈ استعمال کرتے وقت پاکی کیسے حاصل کریں، نماز ہو جائے گی یا نہیں؟، (غلام مرتضیٰ، لاہور)۔
جواب:
استنجا کرنے کے لیے کموڈ استعمال کرنا درست ہے، کموڈ پر بیٹھتے وقت آدمی کے بدن کا جو حصہ کموڈ سے مس کرتا ہے، اگر اس پر ناپاک چھینٹے ہوں تو ٹشو پیپر یا کسی چیز سے اسے خشک کر لیں۔ کموڈ ایسے اجزا سے بنا ہوتا ہے جو مسام دار نہیں ہوتے اور اس میں پانی جذب نہیں ہوتا، اس لیے اگر اس پر بالفرض ناپاک قطرے ہوں تو ٹشو سے خشک کرنے سے وہ صاف ہو جاتا ہے۔ استنجا پانی سے کیا جا سکتا ہے، کیونکہ آج کل مسلم شاور دستیاب ہیں اور صفائی میں مبالغے اور احتیاط کے لیے ٹشو پیپر بھی استعمال کر سکتے ہیں۔ مسجد قبا والوں کے لیے قرآن کریم میں تعریفی کلمات آئے ہیں، فرمایا:
’’[[arabic: لَمَسْجِدٌ أَسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ اَحَقُّ أَنْ تَقُوْمَ فِيهِ فِيْهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا وَاللَّهُ يُحِبُّ الْمُطَاهِرِينَ]]‘‘۔
ترجمہ: ’’البتہ جس مسجد کی بنیاد پہلے روز سے ہی تقویٰ پر رکھی گئی ہے، وہ اس بات کی زیادہ حق دار ہے کہ آپ اس میں کھڑے ہوں، اس میں ایسے مرد ہیں جو خوب پاکیزہ ہونے کو پسند کرتے ہیں اور اللہ زیادہ پاکیزگی حاصل کرنے والوں کو پسند فرماتا ہے، (التوبہ: 108)‘‘۔
حضرت عویم بن ساعدہ رضی اللہ عنہ بیان کرتے ہیں: ’’[[arabic: اِنَّ النَّبِيَّ ﷺ أَتَاهُمْ فِي مَسْجِدِ قُبَاءَ فَقَالَ: إِنَّ اللَّهَ تَبَارَكَ وَتَعَالٰی قَدْ أَحْسَنَ عَلَيْكُمُ الثَّنَاءَ فِي الطُّهُورِ فِي قِصَّةِ مَسْجِدِكُمْ، فَمَا هٰذَا الطُّهُورُ الَّذِي تَطَّهَّرُونَ بِهٖ، قَالُوا: وَاللَّهِ يَا رَسُولَ اللَّهِ! مَا نَعْلَمُ شَيْئًا إِلَّا أَنَّهٗ كَانَ لَنَا جِيرَانٌ مِنَ الْيَهُودِ، فَكَانُوا يَغْسِلُونَ أَدْبَارَهُمْ مِنَ الْغَائِطِ فَغَسَلْنَا كَمَا]]`
},
{
  pageNumber: 71,
  text: `[[arabic: غَسَلُوا]]‘‘۔
ترجمہ: ’’رسول اللہ ﷺ نے اہل قبا سے فرمایا: میں نے اللہ تعالیٰ سے سنا کہ وہ تمہاری پاکیزگی حاصل کرنے کی تعریف فرماتا ہے، تم کس طرح پاکیزگی حاصل کرتے ہو، انہوں نے عرض کی: یا رسول اللہ! ہمیں اور کسی چیز کا پتا نہیں، لیکن ہم نے دیکھا کہ ہمارے یہودی پڑوسی براز سے فارغ ہونے کے بعد پانی سے استنجا کرتے ہیں، پس ہم بھی اس طرح کرتے ہیں، (مسند احمد: 15485)‘‘۔
(2) حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی ﷺ نے فرمایا: یہ آیت (التوبہ: 108) اہل قبا کے متعلق نازل ہوئی ہے، وہ پانی کے ساتھ استنجا کرتے تھے تو ان کے متعلق یہ آیت نازل ہوئی، (سنن ترمذی: 3100)‘‘۔

[[heading: وضو کے بارے میں ایک پیچیدہ مسئلہ]]
سوال:
میں نے سُنا ہے کہ پیشاب کی جگہ یعنی شرمگاہ سے گیس خارج ہوتی ہے اور وضو ٹوٹ جاتا ہے، اگر ایسا ہے تو میرے ساتھ یہ سلسلہ بہت زیادہ ہے اور نماز کی حالت میں بہت زیادہ ہوتا ہے، میرے لیے اس بارے میں کیا حکم ہے؟، (جاوید اقبال، لاہور)
جواب:
ریح کے خارج ہونے سے وضو فقط اُسی صورت میں ٹوٹتا ہے، جب وہ پچھلے مقام سے خارج ہو اور اس سے بھی وضو تب ٹوٹتا ہے جب اُس کے خارج ہونے کا یقین ہو، محض ظن و گمان کی وجہ سے وضو ختم نہیں ہوتا۔
حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا:
’’[[arabic: إِذَا کَانَ اَحَدُکُمْ فِی الْمَسْجِدِ فَوَجَدَ رِیْحًا بَیْنَ اَلْیَتَیْہِ فَلاَ یَخْرُجْ حَتّٰی یَسْمَعَ صَوْتًا اَوْ یَجِدَرِیحًا]]‘‘۔
ترجمہ: ’’جب تم میں سے کوئی مسجد میں ہو اور وہ اپنے پچھلے مقام سے ریح کا خارج ہونا`
},
{
  pageNumber: 72,
  text: `محسوس کرے تو وہ مسجد سے نہ نکلے یہاں تک کہ اس کی آواز سُن لے یا بد بو محسوس کرے، (صحیح مسلم: 362، سنن ترمذی: 75)‘‘۔
اِس حدیث میں جو فرمایا کہ جب تک ریح کے خارج ہونے کی آواز نہ سُن لی جائے یا بو محسوس نہ ہو جائے تو اس وقت تک مسجد سے نہ نکلا جائے، اس کا مطلب یہ نہیں ہے کہ ریح خارج ہونے کی صورت میں وضو کا ٹوٹنا اُس کی آواز سننے یا بُو کے پائے جانے سے مشروط ہے، بلکہ اس حدیث کا مطلب یہ ہے کہ نماز پڑھنے والے کو جب تک اپنے وضو ٹوٹنے کا یقین نہ ہو جائے، اُس وقت تک وہ مسجد سے نہ نکلے۔
امام ترمذی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وقَالَ ابْنُ الْمُبَارَكِ: إِذَا شَكَّ فِي الْحَدَثِ، فَإِنَّهٗ لاَ يَجِبُ عَلَيْهِ الْوُضُوْ ءُ حَتّٰى يَسْتَيْقِنَ اسْتِيقَانًا يَقْدِرُ أَنْ يَحْلِفَ عَلَيْهِ]]‘‘۔
’’عبداللہ بن مبارک نے کہا: اس پر وضو واجب نہیں ہے تاوقتیکہ اسے اس حد تک یقین ہو جائے کہ قسم کھا سکے، (سنن ترمذی، تحت حدیث: 75)‘‘۔
حضرت علی رضی اللہ عنہ بیان کرتے ہیں: نبی کریم ﷺ نے فرمایا: ’’[[arabic: إِذَا فَسَاَ اَحَدُکُمْ فَلْیَتَوَضَّاْ]]‘‘، ترجمہ: ’’جب تم میں سے کسی شخص کی ریح خارج ہو تو اُسے چاہئے کہ وہ وضو کر لے، (مسند احمد: 34)‘‘۔
شرمگاہ کے اگلے حصے سے ریح کے خارج ہونے کی وجہ سے وضو نہیں ٹوٹتا، چنانچہ علامہ ابن نجیم حنفی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: الرِّیْحُ الْخَارِجَۃُ مِنَ الذَّکَرِ وَفَرْجِ الْمَرْاَۃِ، فَإِنَّہَا لَا تَنْقُضُ الْوُضُوْ ءَ عَلَی الصَّحِیحِ]]‘‘
ترجمہ: ’’صحیح قول کے مطابق مرد کے عضوِ تناسل یا عورت کی شرمگاہ سے خارج ہونے والی ریح سے وضو نہیں ٹوٹتا، (البحر الرائق، جلد: 1، ص: 31)‘‘۔
فقہائے کرام نے ذکر کیا ہے کہ پچھلے مقامِ سے ریح خارج ہونے کی صورت میں وضو ٹوٹنے کی وجہ یہ نہیں کہ نفسِ ریح ناپاک و نجس ہے، کیونکہ اگر نفسِ ریح کو ناپاک اور نجس قرار دیا جائے`
},
{
  pageNumber: 73,
  text: `تو پھر شلوار کا ناپاک ہونا لازم آئے گا، حالانکہ اِس کا کوئی بھی قائل نہیں ہے، سو معلوم ہوا کہ نفسِ ریح نجس نہیں ہے، بلکہ اِس کی وجہ سے وضو اس لیے ٹوٹتا ہے کہ یہ نجاست اور گندگی کے مقام سے گزر کر آتی ہے۔ اور وہ ریح جو اگلے مقام سے خارج ہوتی ہے، یہ عام ریح ہے، اس کا تعلق کھانے کے فُضلات، آنت یا پچھلے مقام سے نکلنے والی ریح سے نہیں ہے، یہ محض اختلاج یعنی شرمگاہ کے عضلات اور پٹھوں کی حر کت کی وجہ سے ہوتا ہے، سو اِس لیے یہ ناقض وضو نہیں ہے۔
البتہ فقہائے کرام نے کہا ہے کہ بعض عورتیں مُفضاۃ ہوتی ہیں، یعنی اُن کے پیشاب اور پاخانے کا مقام یا پیشاب اور ہمبستری کا مقام مل کر ایک ہو جاتے ہیں، اُن کی بابت علامہ ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’پس اگر کسی عورت کی یہ حالت ہو تو جب اُسے اگلے مقام سے ریح نکلتی محسوس ہوئی ہو تو اُسے احتیاطاً وضو کر لینا چاہیے اور بعض فقہائے کرام نے اِس صورت میں وضو کو واجب قرار دیا ہے، چنانچہ امام محمد سے مروی ہے کہ ایسی عورت کے لئے اس صورت میں وضو کرنا واجب ہے اور اسی قول کو احتیاطاً امام ابو حفص نے بھی لیا ہے اور فتح القدیر میں اسی قول کو راجح قرار دیا گیا ہے کیونکہ ہوا اکثر پچھلے مقام سے خارج ہوتی ہے اور اس کے مقابلے میں اگلے راستے سے ہوا کا خروج نہ ہونے کے برابر ہے اور احتیاط بھی اسی میں ہے، لہٰذا غلبہ ظن یقین کے حکم میں ہوگا اور اس صورت میں وضو واجب ہوگا، (البحر الرائق، جلد 1، ص: 60)‘‘۔
بعض خواتین کی بڑی آنت میں زخم پیدا ہو جاتا ہے، جس کی وجہ سے دُبُر اور بڑی آنت کے درمیان شگاف پیدا ہو جاتا ہے اور اُس میں سے ریح شرمگاہ کی طرف سرایت کرتی ہے، سو اگر ایسی صورتحال ہے تو یہ پچھلے مقام سے خارج ہونے والی ریح کے حکم میں ہے، صرف اتنی بات ہے کہ یہ اپنے فطری مَخرج کے علاوہ سے خارج ہوئی ہے، اِس کے لیے ماہر امراضِ نسواں لیڈی ڈاکٹر سے چیک اپ کرا لیا جائے اور اللہ نہ کرے اگر ایسی ہی صورتحال ہے تو پھر اِس ریح کے خارج ہونے سے وضو ٹوٹ جائے گا۔`
},
{
  pageNumber: 75,
  text: `[[heading: نماز کے مسائل]]`
},
  {
    pageNumber: 77,
    text: `[[heading: نمازی کا اپنے سامنے سے گزرنے والے کو روکنے کا حکم]]
سوال:
جو نمازی کے آگے سے گزرے، اس کو کس طرح اور کون کون روک سکتا ہے، اس سے جہاد کس طرح ثابت ہے، کچھ لوگ کہتے ہیں کہ نمازی سامنے گزرنے والے پر اپنا ہاتھ بھی استعمال کر سکتا ہے، (سلمان لودھی )۔
جواب:
اگر نمازی کے سامنے سُترہ قائم نہیں اورکوئی شخص گزرنا چاہتاہے یا سُترہ ہے ،مگر وہ شخص نمازی اور سُترہ کے درمیان سے گزرنا چاہتاہے تو نمازی کو رخصت ہے کہ اُسے گزرنے سے روکے ،خواہ سبحان اللہ کہے یا (مغرب ،عشاء اور فجر میں) جہر سے قراء ت کرے  یا  ہاتھ یا سر یا آنکھ کے اشارے سے منع کرے، اس سے زیادہ کی اجازت نہیں مثلاً کپڑا پکڑ کر جھٹکنا یا مارنا ، اگر کوئی ایسا عمل کیا جو عمل کثیر میں شمار ہوتا ہے تو نماز جاتی رہی۔
امام بخاری رحمۃ اللہ علیہ نے اپنی صحیح میں ایک باب باندھا : ’’[[arabic: بَابٌ يَرُدُّ الْمُصَلِّي مَنْ مَّرَّ بَيْنَ يَدَيْهِ]]‘‘ (نمازی اپنے سامنے سے گزرنے والے کو ہٹائے) پھر اس باب کے تحت ایک تعلیق بیان فرمائی: ’’[[arabic: وَرَدَّ ابْنُ عُمَرَ فِي التَّشَهُدِ وَفِي الْكَعْبَةِ، وَقَالَ إِنْ أَبِي إِلَّا أَنْ تُقَاتِلَهُ فَقَاتِله]]‘‘ (اور حضرت عبداللہ بن عمر رضی اللہ عنہما نے کعبہ میں اپنی نماز کے تَشَہُّد میں سامنے سے گزرنے والے کو دورکیا اورفرمایا: اگر گزرنے والا بغیر لڑائی کے باز نہ آئے تو اس سے لڑو ، صحیح بخاری:کتاب الصلاۃ)‘‘۔
(1): ’’[[arabic: عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ: لَا تَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْكَ وَأَنْتَ تُصَلِّي، فَإِنْ أَبِي إِلَّا أَنْ تُقَاتِلَهُ فَقَاتِلْهُ]]‘‘۔
ترجمہ: ’’ حضرت نافع بیان کرتے ہیں : حضرت ابن عمر رضی اللہ عنہما نے فرمایا: جو شخص نماز میں تمہارے سامنے سے گزرے اس کو مت چھوڑو ،اگر وہ لڑائی کے بغیر بازنہ آئے تواس سے`
  },
  {
    pageNumber: 78,
    text: `لڑو ، (مُصنّف عبدالرزاق :2325)‘‘۔
(2) ’’[[arabic: عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ : مَرَرْتُ بَيْنَ يَدَيِ ابْنِ عُمَرَ، وَهُوَ فِي الصَّلَاةِ ، فَارْتَفَعَ مِنْ قُعُودِهِ، ثُمَّ دَفَعَ فِي صَدْرِی]]‘‘۔
ترجمہ: ’’عمروبن دینار بیان کرتے ہیں: میں حضرت ابن عمر رضی اللہ عنہما کے سامنے سے گزرا ، وہ نماز کے قعدے میں تھے ،وہ قعدےسے کھڑے ہوگئے ،پھر مجھے دھکا دیا، (مُصَنَّف ابن ابی شیبہ:2921)‘‘۔
(3) ’’[[arabic: حَدَّثَنَا أَبُو صَالِحِ السَّمَّانُ، قَالَ: رَأَيْتُ أَبَا سَعِيدِ الخُدْرِيَّ فِي يَوْمِ جُمُعَةٍ يُصَلِّي إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ، فَأَرَادَ شَابٌ مِنْ بَنِي أَبِي مُعَيْطَ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَدَفَعَ أَبُو سَعِيدٍ فِي صَدْرِهِ ، فَنَظَرَ الشَّابُ فَلَمْ يَجِدُ مَسَانًا إِلَّا بَيْنَ يَدَيْهِ، فَعَادَ لِيَجْتَانَ، فَدَفَعَهُ أَبُو سَعِيدٍ أَشَدَّ مِنَ الْأُولَى، فَنَالَ مِنْ أَبِي سَعِيدٍ، ثُمَّ دَخَلَ عَلَى مَرْوَانَ، فَشَكَا إِلَيْهِ مَا لَقِيَ مِنْ أَبِي سَعِيدٍ ، وَدَخَلَ أَبُو سَعِيدٍ خَلْفَهُ عَلَى مَرْوَانَ، فَقَالَ: مَا لَكَ وَلا بْنِ أَخِيكَ يَا أَبَا سَعِيدٍ ، قَالَ : سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ : إِذَا صَلَّى أَحَدُكُمْ إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ فَأَرَادَ أَحَدٌ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَلْيَدْفَعُهُ فَإِنْ أَبِي فَلْيُقَاتِلُهُ فَإِنَّهَا هُوَ شَيْطَانٌ]]‘‘۔
ترجمہ: ’’ا بوصالح السّمّان بیان کرتے ہیں :میں نے دیکھا حضرت ابوسعید خدری رضی اللہ عنہ جمعہ کے دن کسی چیز کو لوگوں سے سُترہ بناکر نماز پڑھ رہے تھے، بنوابی مُعَیط کے ایک نوجوان نے ان کے سامنے سے گزرنے کا ارادہ کیا تو حضرت ابوسعید نے اس کے سینے پر دھکا دیا ، اس نوجوان نے ادھر اُدھر دیکھا ،مگر اس نے حضرت ابوسعید کے سامنے کے علاوہ کوئی جگہ نہ پائی ،وہ دوبارہ ان کے سامنے سے گزرنے لگا ،حضرت ابوسعید نے اس کو پہلی بار سے زیادہ زور سے دھکا دیا ،اس نے حضرت ابوسعید سے تکلیف اٹھائی ،اس نے مروان کے پاس جاکرحضرت ابوسعید سے پہنچنے والی تکلیف کی شکایت کی ، حضرت ابوسعید بھی اس کے پیچھے پیچھے مروان کے پاس آئے ،مروان نے کہا: اے ابوسعید ! آپ کے اور آپ کے بھتیجے کے`
  },
  {
    pageNumber: 79,
    text: `درمیان کیا معاملہ ہوا؟،انہوں نے بیان کیا: میں نے نبی کریم ﷺ کو یہ فرماتے ہوئے سنا ہے: جب تم میں سے کوئی شخص کسی چیز کو لوگوں سے سُترہ بناکر نماز پڑھے ،پھرکوئی شخص اس کے سامنے سے گزرنے کا ارادہ کرے ،تووہ اس کو دفع کرے ،اگر وہ بازنہ آئے تواس سے لڑے کیونکہ وہی شخص شیطان ہے ،(صحیح بخاری:509)‘‘۔
علامہ ابوالحسن علی بن ابوبکر فرغانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَدْرَأُ الْمَارًا ذَا لَمْ يَكُنْ بَيْنَ يَدَيْهِ سُتْرَةٌ أَوْ مَرَّ بَيْنَهُ وَبَيْنَ السُّتْرَةِ لِقَوْلِهِ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ : ادْرَعُوا مَا اسْتَطَعْتُمْ وَيَدْرَأُ بِالْإِشَارَةِ كَمَا فَعَلَ رَسُولُ اللَّهِ ﷺ بِوَلَدَیْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا أَوْ يَدْفَعُ بِالتَّسْبِيحِ]]‘‘۔
ترجمہ: ’’جب نمازی کے سامنے سُترہ نہ ہو اورکوئی اس کے سامنے سے گزرے یا اس کے سامنے سُترہ ہو اورکوئی اس کے اور سُترے کے درمیان سے گزرے تونمازی اس کو منع کرے اور اس کو اشارے سے منع کرے جیساکہ رسول اللہ ﷺ نے حضرت اُمّ سلمہ رضی اللہ عنہا کے دو بچوں کے ساتھ کیایا سبحان اللہ پڑھ کر ان کو گزرنے سے منع کرے ، (ہدایہ ، جلد1،ص:274)‘‘۔ 
علامہ کمال الدین ابن ہمام رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَهُوَ مَا فِي أَبِي دَاوَدَاذَا صَلَّى أَحَدُكُمْ فَلْيَجْعَلُ تِلْقَاءَ وَجْهِهِ شَيْئًا، فَإِنْ لَمْ يَجِدُ فَلْيَنْصِبْ عَصَا وَإِنْ لَمْ يَكُنْ مَعَهُ عَصَا فَلْيَخُطَ خَطًا وَلَا يَضُرُّهُ مَا مَرَّ أَمَامَهُ، وَاخْتَارَ الْمُصَنِّفُ الْأُولَى وَالسُّنَّةُ أَولَى بِالاتِّبَاعِ]]‘‘۔
ترجمہ: ’’اور وہ جو ابوداؤد میں روایت ہے : ’’جب تم میں سے کوئی شخص نماز پڑھے ،تو اپنے سامنے کوئی چیز رکھ لے اوراگر اورکوئی چیز نہ ملے تو عصا رکھ لے ، وہ بھی نہ ہو تو خط کھینچ لے ، پھر آگے سے گزرنے والے کی پرواہ نہ کرے ‘‘،مُصنّف نے پہلے قول کو اختیار کیا ، حدیث کا اتباع کرنا اَولیٰ ہے ،(فتح القدیر ، جلد1،ص:418)‘‘۔
شیخ التفسیر والحدیث علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں: ’’یہ حدیث اگر چہ ضعیف اور`
  },
  {
    pageNumber: 80,
    text: `مضطرب ہے لیکن اس پر عمل کیاجاسکتاہے کیونکہ فضائل اعمال میں حدیث ضعیف معتبر ہوتی ہے ،(شرح صحیح مسلم،جلد1،ص:1324)‘‘۔
علامہ ابن نجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَيَدْرَؤُهُ إِنْ لَمْ يَكُنْ سُتْرَةٌ أَوْ مَرَّبَيْنَهُ وَبَيْنَهَا لِلْأَحَادِيثِ الْوَارِدَةِ وَهُوَ بِالْإِشَارَةِ بِالْيَدِ أَوْ بِالرَّأْسِ أَوْ بِالْعَيْنِ أَوْ بِالتَّسْبِيحِ، وَزَادَ الْوَلْوَالِحِنُ أَنَّهُ يَكُونُ بِرَفْعِ الصَّوْتِ بِقَرَاءَةِ الْقُرْآنِ وَيَنْبَغِي أَنْ يَكُونَ مَحَلُّهُ فِي الصَّلَاةِ الْجَهْرِيَّةِ فِيمَا يُجْهَرُ فِيْهِ مِنْهَا]]‘‘۔
ترجمہ: ’’فقہائے کرام نے کہا: نمازی کے سامنے سُترہ نہیں یا سُترہ ہے اور کوئی شخص نمازی اور سُترہ کے درمیان سے گزرنا چاہتاہے تو نمازی اس کو گزرنے سے روکے ،کیونکہ یہ حکم احادیث میں ہے: وہ ہاتھ کے اشارے سے روکے  یا  سرسے اشارہ کرکے روکے  یا آنکھوں کے اشارے سے روکے یا تسبیح(سبحان اللہ) پڑھے اور ’’ولوالجی ‘‘ نے یہ اضافہ کیاہے کہ آواز سے قرآن کی قراء ت کرے ،بہتریہ ہے کہ جہری(یعنی فجر، مغرب اور عشاء کی) نماز پڑھ رہا ہو تو اس میں (منفرد) اونچی آواز سے قراءت کرے  ،(البحرالرائق ، جلد2،ص:32)‘‘۔
علامہ بدرالدین عینی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’آیا نماز ی سے آگے گزرنے والے کو دفع کرنا واجب ہے یا مستحب، تو امام نووی نے کہا ہے: یہ امر مستحب ہے اور اس کی تاکید ہے اور میرے علم میں نہیں ہے کہ فقہائے کرام میں سے کسی نے اسے واجب قرار دیا ہے ،میں (عینی )کہتا ہوں:اہل ظاہر نے ظاہر حدیث پر عمل کرتے ہوئے اسے واجب قرار دیا ہے، ہوسکتا ہے امام نووی کو اس کا علم نہ ہو۔۔۔مزید لکھتے ہیں:
’’سامنے سے گزرنے والے کو اپنی جگہ سے آگے چل کر روکنااگرچہ جائز ہے ،لیکن بہتر ہے کہ اپنی جگہ پر کھڑے کھڑے روکے، کیونکہ نماز میں چلنے کا بگاڑ نمازی کے آگے سے گزرنے کے بگاڑ سے زیادہ ہے، لہٰذا اس کے لیے اتنا ہی دفع کرنا مباح ہے جتنا کہ وہ اپنی`
  },
  {
    pageNumber: 81,
    text: `جگہ کھڑے کھڑے کرسکے اور اگر گزرنے والا فاصلے پر ہے اور نمازی اپنی جگہ کھڑے کھڑے نہیں روک سکتا تو اشارے سے روکے یا سبحان اللہ کہے، دونوں طریقے اختیار نہ کرے،(عمدۃ القاری،ج:4،ص:426)‘‘۔
الغرض حدیثِ مبارک میں نمازی کے آگے سے گزرنے والے شخص کو روکنے کے لیے لڑنے کے الفاظ اس مسئلے کی شدت کو بیان کرنے کے لیے ہیں ،عملاً ایسا نہیں کرناچاہیے اور عملِ کثیر ویسے ہی مُفسدِ نماز ہے، البتہ اگر نمازی کے آگے سے گزرنے والا ہاتھ کی پہنچ میں ہے تو ایک ہاتھ بڑھا کر اسے روک سکتا ہے۔

[[heading: نمازِ جمعہ کے دونوں خطبوں کے درمیان ہاتھ اٹھاکر دعا مانگنا]]
سوال:
نمازِ جمعہ کے دونوں خطبوں کے درمیان ہاتھ اٹھا کر دعا مانگنا کیساہے ؟،(انعام الحق ، لاہور)۔
جواب:
احادیثِ مبارکہ میں جمعۃ المبارک کے دن قبولیتِ دعا کی ایک ساعت بتائی گئی ہے ، اس کے بارے میں روایات یہ ہیں:
(۱) ’’[[arabic: عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ ﷺ ذَكَرَ يَوْمَ الْجُمُعَةِ، فَقَالَ: فِيهِ سَاعَةٌ، يُوَافِقُهَا عَبْدُ مُسْلِمٌ ، وَهُوَ قَائِمٌ يُصَلِّي، يَسْأَلُ اللهَ تَعَالَى شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا]]‘‘۔
ترجمہ: ’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں :رسول اللہ ﷺ نے جمعہ کے دن کا ذکر کیااور فرمایا: اس میں ایک ایسی ساعت ہے کہ جومسلمان بندہ اس ساعت کو پالے اوروہ اس ساعت میں کھڑاہوانماز پڑھ رہاہو اوروہ اللہ تعالیٰ سے کسی چیز کا سوال کرے تو اللہ تعالیٰ اس کو وہ چیز عطافرمادیتاہے اور آپ نے ہاتھ کے اشارے سے بتایاکہ وہ ساعت بہت تھوڑی ہے ،(صحیح بخاری:935)‘‘۔`
  },
  {
    pageNumber: 82,
    text: `(۲) ’’[[arabic: عَنْ أَبِي مُوسَى الْأَشْعَرِي فِي سَاعَةِ الْجُمُعَةِ ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ : هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الْإِمَامُ إِلَى أَنْ تُقْضَى الصَّلَاةُ]]‘‘۔
ترجمہ: ’’حضرت ابوموسیٰ اشعری رضی اللہ عنہ جمعہ کے دن دعا کی قبولیت کی ساعت کے بارے میں بیان کرتے ہیں،میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا :یہ ساعت امام کے (منبر پر)بیٹھنے سے لے کر نماز کے اختتام تک ہے ،(صحیح مسلم: 853)‘‘۔
(۳) ’’[[arabic: عَنْ عَبْدِ اللَّهِ ابْنِ عُمَرَ يَقُولُ : سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ وَ الْإِمَامُ عَلَى الْمِنْبَرِ ، فَلَا صَلَاةَ وَلَا كَلَامَ ، حَتَّى يَفْرُغَ الْإِمَامُ]]‘‘۔
ترجمہ: ’’عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں : میں نے نبی ﷺ کو بیان کرتے ہوئے سنا: جب تم میں سے کوئی مسجد میں داخل ہو اور امام (خطبے کے لیے )منبر پر بیٹھ چکا ہے، تو نہ نماز پڑھی جائے اور نہ کلام کیا جائے ،یہاں تک کہ امام نماز سے فارغ ہوجائے(یعنی توجہ سے خطبہ سنا جائے)، (المعجم الکبیر للطبرانی:13708)‘‘۔ایک روایت بعدنماز عصر کی بھی ہے۔
(۴) ’’[[arabic: عَنْ أَبِي أُمَامَةَ قَالَ : إِنِّي لَأَرْجُو أَنْ تَكُونَ السَّاعَةُ الَّتِي فِي الْجُمُعَةِ إِحْدَى هَذِهِ السَّاعَاتِ إِذَا أَذَّنَ الْمُؤَذِّنُ أَوِ الْإِمَامُ عَلَى الْمِنْبَرِ أَوْ عِنْدَ الْإِقَامَةِ]]‘‘۔
ترجمہ: ’’حضرت ابواُمامہ رضی اللہ عنہ بیان کرتے ہیں: مجھے امید ہے کہ جمعہ کے دن (دعا کی قبولیت )کی ساعت ان تین میں سے ایک ہے: جب موذن اذان دے یاامام منبر پر ہویااقامت کے وقت ،(مصنف ابن ابی شیبہ:5466)‘‘۔
لہٰذا دوخطبوں کے درمیان امام دعا کرسکتا ہے اورمقتدی بھی دل میں یا آہستہ آواز میں دعا کرسکتے ہیں۔
امام ابن حجر ہیتمی رحمۃ اللہ علیہ لکھتے ہیں:
ترجمہ: ’’قاضی عیاض نے کہا:دو خطبوں کے درمیان جلسے میں دعا مقبول ہے اورحاضرین کے لیے اس جلسے میں دعا میں مشغول رہنا سنت ہے ، کیونکہ یہ بات ثابت ہے کہ اس وقت دعا مقبول ہوتی ہے اور مقتدی آہستہ دعا کریں، کیونکہ اونچی آواز سے دعا کرنے میں`
  },
  {
    pageNumber: 83,
    text: `دوسروں کی توجہ بٹے گی اور آہستہ دعا کرنا افضل ہے، سوا اس کے کہ کوئی امر عارض ہو، (الفتاویٰ الفقہیۃ الکبریٰ  ، ج:1،ص:252)‘‘۔
شیخ محمد بن صالح ابن عثیمین لکھتے ہیں:
ترجمہ: ’’دو خطبوں کے درمیان دعا خیر اور مستحب ہے ،کیونکہ یہ قبولیتِ دعا کا وقت ہے ،پھر انہوں نے صحیح مسلم کی مندرجہ بالا حدیث کا حوالہ دیااور کہا: جہاں تک رفع یدین کا سوال ہے تو میرے نزدیک اس میں کوئی حرج نہیں ہے ،کیونکہ دعا کے آداب میں سے رفع یدین ہے، سو کوئی دعا کے وقت ہاتھ اٹھائے تو کوئی حرج نہیں ہے اور اگر نہ اٹھائے تو بھی حرج نہیں ہے ،دو خطبوں کے درمیان کوئی مخصوص دعا یا ذکر وارد نہیں ہے ،لیکن انسان اپنی پسندیدہ کوئی بھی دعا کرسکتا ہے ،کیونکہ حدیث کی رُو سے یہ دعا کی قبولیت کا وقت ہے ،(فتاویٰ نور علی الدرب،صلاۃ الجمعۃ)‘‘۔
نبی کریم ﷺ سے بطورِ خاص دو خطبوں کے درمیان ہاتھ اٹھاکر دعا کرنا ثابت نہیں ہے ،لیکن فی نفسہٖ دعا کے آداب میں یہ ہے کہ ہاتھ اٹھاکر دعا کرے ،ہتھیلی کا رُخ اوپر کی طرف ہواور دعا کے بعد ہاتھ چہرے پر پھیر لے،احادیثِ مبارکہ یہ ہیں:
(۱) عبداللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں:رسول اللہ ﷺ نے فرمایا:
’’[[arabic: سَلُوا اللَّهَ بِبُطُونِ أَكُقِكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا، فَإِذَا فَرَغْتُمْ، فَامْسَحُوا بِهَا وُجُوهَكُمْ]]‘‘۔
ترجمہ: ’’اپنی ہتھیلیوں کو پھیلاکر اللہ سے سوال کرو ،اپنے ہاتھوں کی پشت کو پھیلاکر سوال نہ کرو،پھر جب دعا سے فارغ ہوجائو تو اپنے ہاتھ اپنے چہرے پر مَل لو، (ابودائود:1485)۔
(2) ’’[[arabic: الْمَسْأَلَةُ أَنْ تَرْفَعَ يَدَيْكَ حَذْوَ مَنْكِبَيْكَ أَوْ نَحْوَهُمَا]]‘‘۔
ترجمہ: ’’حضرت ابن عباس رضی اللہ عنہما فرماتے ہیں:(اللہ تعالیٰ سے ) سوال کرنے کا طریقہ یہ ہے کہ تم اپنے ہاتھ کندھوں کے برابر یا( کم وبیش ) اٹھائو، (ابودائود:1489)‘‘۔
(3) ’’[[arabic: إِنَّ النَّبِيُّ ﷺ كَانَ إِذَا دَعَا فَرَفَعَ يَدَيْهِ ، مَسَحَ وَجْهَهُ بِيَدَيْهِ]]‘‘۔`
  },
  {
    pageNumber: 84,
    text: `ترجمہ: ’’سائب بن یزید اپنے والد سے بیان کرتے ہیں:نبی ﷺ جب دعا کرتے تو اپنے ہاتھ بلند کرتے اور اپنے ہاتھ اپنے چہرہ مبارک پر پھیر لیتے، (ابودائود:1492)‘‘۔
(4) ’’[[arabic: إِنَّ رَبَّكُمْ تَبَارَكَ وَتَعَالَى حَبِى كَرِيمٌ ، يَسْتَحْيِي مِنْ عَبْدِهِ إِذَا رَفَعَ يَدَيْهِ إِلَيْهِ ، أَنْ يَرُدَّهُمَا صِفْرًا]]‘‘۔
ترجمہ: ’’حضرت سلمان رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ ﷺ نے فرمایا: بے شک تمہارا رب تبارک وتعالیٰ بہت حیا فرمانے والا کریم ہے،جب اس کا بندہ اس کی طرف ہاتھ اٹھالے،تو وہ اپنے بندے سے حیا فرماتا ہے کہ اُس کے ہاتھ خالی لوٹادے، (ابودائود: 1488)‘‘۔
الغرض جمعے کے دن دو خطبوں کے درمیان امام کے لیے دعا بالاتفاق جائز ہے، فقہ حنفی میں امام ابویوسف اور امام محمد کے نزدیک دو خطبوں کے درمیان دعا مقتدی کے لیے بھی جائز ہے اور امام اعظم سے بھی ایک روایت جواز کی ہے ،لیکن مقتدی دل میں یا زبان سے آہستہ دعا کریں۔ مقتدی ہاتھ اٹھاکر دعا کا التزام نہ کریں تاکہ اسے جمعے کا شِعار نہ سمجھ لیا جائے ، کبھی ہاتھ اٹھاکر بھی دعا کرسکتے ہیں کہ اس کی ممانعت نہیں ہے اور ہاتھ اٹھانا آدابِ دعامیں سے ہے ۔
چنانچہ مفتی مصر شیخ محمد رشید رضا متوفّیٰ 1354ھ لکھتے ہیں:
ترجمہ: ’’دو خطبوں کے درمیان دعا کے لیے ہاتھ اٹھانااور بلند آواز سے دعا کرنا سنت سے ثابت نہیں ہے اوراگر یہ تاثر پیدا نہ ہو لوگ کسی دلیل کے بغیر اسے سنت سمجھ کر کر رہے ہیں،تو(اپنی اصل کے اعتبار سے )ہاتھ اٹھاکر دعا کرنے میں کوئی حرج بھی نہیں ہے ،آثار سے یہ ثابت ہے کہ جب امام منبر پر کلام کرے تو خاموش رہ کر سنا جائے اور اسی سبب ہم کہتے ہیں :’’جب امام خاموش ہو تو دعا میں حرج نہیں ہے، لیکن دعا آہستہ کرے تاکہ دوسروں کے لیے تکلیف (اور توجہ بٹنے )کا سبب نہ بنے اور سب لوگ ہاتھ بھی نہ اٹھائیں کہ لوگ اسے جمعے کا شِعار نہ سمجھ لیںاورجب امام دوسرے خطبے کے لیے اٹھے تو دعا موقوف کردیںاور خطبہ سنیں، (مجلّۃ المنار،ج:6،ص:792،)‘‘۔ اصل سے مراد یہ ہے کہ مطلقاً دعا میں ہاتھ اٹھانا سنت`
  },
  {
    pageNumber: 85,
    text: `سے ثابت ہے۔
امام اہلسنت امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْز سے جمعۃ المبارک کے دن دو خطبوں کے درمیان دعائوں کے بارے میں سوال ہوا کہ آیایہ مکروہِ تحریمی ہے یا تنزیہی یا جائزہے، ایک صاحب اسے بدعت اور حرام بتاتے ہیں ،آپ نے تفصیلی جواب لکھا،جس کا خلاصہ یہ ہے:
’’دو خطبوں کے درمیان امام کا دعا مانگنا بالاتفاق جائز ہے ،بلکہ خطبے کے درمیان بھی رسول اللہ ﷺ سے ہاتھ اٹھاکر بارش کے لیے دعا مانگنا صحیح احادیث سے ثابت ہے ۔فقہِ حنفی میں دو خطبوں کے درمیان مقتدی کے لیے دعا مانگنا صاحبین کے نزدیک بالاتفاق جائز ہے ، امام اعظم سے بھی ایک قول کے مطابق اس کا جواز ثابت ہے اور امام شافعی کے نزدیک بھی جائز ہے،تاہم آپ نے لکھا:’’یہ کوئی ایسا امر نہیں جس پر شدت اختیار کی جائے ،نرمی سے سمجھایا جائے ،اگر کوئی نہ مانے تو اس کی بنا پر فتنہ اٹھانا اور گروہ بندی کی حاجت نہیں ہے ، آپ نے اس موضوع پر ’’[[arabic: رِعَايَةُ الْمَذْهَبَينِ فِي الدُّعَاءِ بَيْنَ الْخُطَبَتَيْن]]‘‘ کے نام سے ایک مستقل رسالہ لکھا ہے، (فتاویٰ رضویہ، ج:8، ص: 397و477تا494، ملخصاً ، بتصرف)‘‘۔ 

[[heading: اِقامت کا مفصل ومدلل مسئلہ]]
سوال:
چند روز قبل ہماری مسجد کے امام صاحب نے مسئلہ بیان فرمایاکہ:’’ اِقامت نماز سے قبل پڑھی جاتی ہے ،بیٹھ کر سننا سنت ہے اور ’’حی علی الصلوۃ ‘‘پر کھڑا ہونا چاہیے ،اس سے قبل نمازی کا کھڑاہونا مکروہ عمل ہے ‘‘۔میں اس دن سے عجیب ذہنی کیفیت میں مبتلا ہوں ، اپنی67سالہ عمر میں اللہ اکبر کے ساتھ ہی کھڑاہواکرتاتھا ،اگر میرایہ عمل مکروہ ہے تو اس عرصہ میں اداکی گئی نمازوں کاکیاہوا۔حرمین شریفین کی حاضری نصیب ہوئی ،وہاں بھی اللہ اکبر کی صداکے ساتھ ہی صفیں بننا شروع ہوجاتی ہیں ۔کروڑوں مسلمانوں کو اللہ اکبر کے`
  },
  {
    pageNumber: 86,
    text: `ساتھ مساجد میں صف بندی کرتے ہوئے دیکھاہے ،ان کی نمازوں کا کیا ہوگا ۔مجھے امام صاحب کی علمی کمی یاان پر بالادستی مطلوب نہیں ،اپنے اعمال کی درستگی اور گزشتہ نمازوں کی فکر ہے کیونکہ میرے نزدیک مکروہ عمل کے آغاز کے ساتھ کسی عبادت کی قبولیت ممکن نہیں ہوسکتی ،(سرفراز احمد ،قیوم آباد ،کراچی )۔
جواب:
لوگوں کو یہ بتانے کے لیے کہ جماعت کھڑی ہونے والی ہے ،اِقامت کہی جاتی ہے ،یہ امرِمشروع ہے اور سنّت ِ مُتوارثہ ہے ،اس کے کلمات حدیث سے ثابت ہیں ،اسی کو ہمارے عرف میں ’’ تکبیر‘‘ بھی کہاجاتاہے اِقامت کی اصطلاح ’’[[arabic: قَدقَامَتِ الصَّلوٰۃُ]]‘‘ کے کلمے سے اور ’’تکبیر‘‘ کی اصطلاح ’’اللہ اکبر‘‘ سے مستفاد ہے۔ جماعت کے لیے اقامت کے وقت مقتدی کب کھڑے ہوں،اس کے بارے میں احادیث مبارکہ میں کوئی صریح حکم مذکورنہیں ہے، ماسوا صحیح مسلم کی اس حدیث کے کہ ـ’’[[arabic: لَاتَقُوْمُوْا حَتّٰی تَرَوْنِیْ]]‘‘ (جب تک تم مجھے دیکھ نہ لو،مت کھڑے ہو )۔دراصل رسول اللہ ﷺ کا معمول یہ تھاکہ آپ جماعت کھڑی ہونے کے وقت حجرۂ انور سے باہر تشریف لاتے اورحضرت بلال رضی اللہ عنہ کی نظریں حجرۂ انور کی طرف جمی رہتیں، جوں ہی آپ ﷺ نکلتے ،وہ اقامت شروع کردیتے تھے ، حدیث پاک میں ہے :
 ’’[[arabic: عَن أَبِي قَتَادَةَ ، قَالَ: قَالَ رَسُولَ الله ﷺ وَإِذَا أُقِيمَتِ الصَّلَاةُ فَلَا تَقُوْمُوا حَتَّى تَرَوْنِي]]‘‘ ۔
ترجمہ: ’’حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ ﷺ نے صحابہ سے فرمایا: جب نماز کے لیے اِقامت کہی جائے ،توجب تک تم مجھے دیکھ نہ لو ،مت کھڑے ہو،(صحیح مسلم:604)‘‘۔
اس حدیث کے تحت امام یحییٰ بن شرف نووی رحمۃ اللہ علیہ نے یہ روایات بیان کی ہیں:
’’[[arabic: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أُقِيمَتِ الصَّلَاةُ، فَقُمْنَا فَعَدَلْنَا الصُّفُوفَ قَبْلَ أَنْ يَخْرُجَ]]`
  },

  {
  pageNumber: 87,
  text: `[[arabic: إِلَيْنَا رَسُولُ اللَّهِ وَفِي رِوَايَةِ : أَنَّ الصَّلَاةَ كَانَتْ تُقَامُ لِرَسُولِ اللَّهِ ﷺ فَيَأْخُذُ النَّاسُ مَصَافَهُمْ قَبْلَ أَنْ يَقُومَ النَّبِيُّ مَقَامَةَ وَفِي رِوَايَةِ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اللَّهُ عَنْهُ : كَانَ بِلَالٌ رَضِيَ اللَّهُ عَنْهُ يُؤَذِّنُ إِذَا دَحَضَتْ وَلَا يُقِيمُ حَتَّى يَخْرُجَ النَّبِيُّ فَإِذَا خَرَجَ أَقَامَ الصَّلَاةَ حِينَ يَرَاهُ]]
ترجمہ: ابو ہریرہ رضی اللہ عنہ کی ایک روایت میں ہے: ’’نماز کے لیے اقامت کہی گئی، تو رسول الله ﷺ کے اپنے حجرۂ انور سے) نکلنے سے پہلے ہم کھڑے ہوئے اور ہم نے صفیں درست کیں۔ اور ایک روایت میں ہے : رسول اللہ ﷺ کے لیے اقامت کہی جاتی ، تو نبی علیہ السلام کے کھڑے ہونے سے پہلے لوگ صفیں درست کرنے لگ جاتے‘‘۔
(۲) جابر بن سمرہ رضی اللہ عنہ بیان کرتے ہیں : جب سورج ڈھل جاتا تو بلال اذان دیتے اور رسول اللہ ﷺ کے نکلنے سے پہلے اقامت نہ کہتے ، پس جب آپ ﷺ نکلتے تو انہیں دیکھ کر اقامت کہتے۔
اس کی شرح میں علامہ نووی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: قَالَ الْقَاضِي عِيَاضٌ رَحِمَهُ اللهُ تَعَالَى : يُجْمَعُ بَيْنَ مُخْتَلَفِ هُذِهِ الْأَحَادِيثِ بِأَنَّ بِلَالًا رَضِيَ اللهُ عَنْهُ كَانَ يُرَاقِبُ خُرُوجَ النَّبِيِّ ﷺ مِنْ حَيْثُ لَا يَرَاهُ غَيْرُهُ أَوْ إِلَّا الْقَلِيلُ فَعِنْدَ أَوَّلِ خُرُوجِهِ يُقِيمُ وَلَا يَقُوْمُ النَّاسُ حَتَّى يَرَوْهُ ، ثُمَّ لَا يَقُومُ مَقَامَهُ حَتَّى يَعْدِلُوا الصُّفُوفَ، وَقَوْلُهُ فِي رِوَايَةِ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ فَيَأْخُذُ النَّاسُ مَصَافَهُمْ قَبْلَ خُرُوجِهِ لَعَلَّهُ كَانَ مَرَّةً أَوْ مَرَّتَيْنِ وَنَحْوَهُمَا لِبَيَانِ الْجَوَازِ أَوْ لِعُذْرٍ وَلَعَلَّ قَوْلَهُ : فَلَا تَقُومُوا حَتَّى تَرَوُنِي كَانَ بَعْدَ ذَلِكَ ، قَالَ الْعُلَمَاءُ: وَالنَّهَى عَنِ الْقِيَامِ قَبْلَ أَنْ يَرَهُهُ لِئَلَّا يَطُولَ عَلَيْهِمُ الْقِيَامُ وَلِأَنَّهُ قَدْ يَعْرِضُ لَهُ عَارِضٌ فَيَتَأَخَرُ بِسَبَبِهِ ، وَاخْتَلَفَ الْعُلَمَاءُ مِنَ السَّلَفِ فَمَنْ بَعْدَهُمْ مَتَّى يَقُومُ النَّاسُ لِلصَّلَاةِ وَمَتَى يُكَبِّرُ الْإِمَامُ، فَيَذْهَبُ الشَّافِعِي رَحِمَهُ اللهُ تَعَالَى وَطَائِفَةِ أَنَّهُ يُسْتَحَبُّ أَنْ لَا يَقُومَ أَحَدٌ حَتَّى يَفْرُغَ الْمُؤَدِّنُ مِنَ الْإِقَامَةِ، وَنَقَلَ الْقَاضِي عِيَاضٌ عَنْ مَالِكٍ رَحِمَهُ اللهُ تَعَالَى وَعَامَّةِ الْعُلَمَاءِ : أَنَّهُ]]`
},
{
  pageNumber: 88,
  text: `[[arabic: يُسْتَحَبُّ أَنْ يَقُوْمُوا إِذَا أَخَذَ الْمُؤَذِّنُ فِي الْإِقَامَةِ وَكَانَ أَنَسٌ رَحِمَهُ اللَّهُ تَعَالَى يَقُوْمُ إِذَا قَالَ الْمُؤَذِّنُ : قَدْ قَامَتِ الصَّلَاةُ ، وَبِهِ قَالَ أَحْمَدُ رَحِمَهُ اللهُ تَعَالَى، وَقَالَ أَبُو حَنِيفَةً رَضِيَ اللَّهُ عَنْهُ: الْكُوفِيُّوْنَ يَقُوْمُوْنَ فِي الصَّفَ إِذَا قَالَ : حَى عَلَى الصَّلَاةِ فَإِذَا قَالَ: قَدْ قَامَتِ الصَّلَاةُ ، كَبَّرَ الْإِمَامُ ، وَقَالَ جُمْهُورُ الْعُلَمَاءِ مِنَ السَّلَفِ وَالْخَلَفِ لَا يُكَبِّرُ الْإِمَامُ حَتَّى يَفْرُغَ الْمُؤَذِّنُ مِنَ الْإِقَامَةِ ، فَقَوْلُهُ : قُمْنَا فَعَدَلْنَا الصُّفُوفَ ، إِشَارَةٌ إِلَى أَنَّ هَذِهِ سُنَةٌ مَعْهُودَةٌ عِنْدَهُمْ وَقَدْ أَجْمَعَ الْعُلَمَاءُ عَلَى اسْتِحْبَابِ تَعْدِيْلِ الصُّفُوفِ وَالتَّرَاضِ فِيهَا ، وَقَدْ سَبَقَ بَيَانُهُ فِي بَابِهِ ، فَقَوْلُهُ فَأَنَّى رَسُولُ اللَّهِ ﷺ حَتَّى إِذَا قَامَ فِي مُصَلَّاهُ قَبْلَ أَنْ يُكَفِّرَ ذَكَرَ فَانْصَرَفَ وَقَالَ لَنَا: مَكَانَكُمْ فَلَمْ نَزَلْ قِيَامًا تَنْتَظِرُهُ حَتَّى خَرَجَ إِلَيْنَا وَقَدِ اغْتَسَلَ]]
ترجمہ: قاضی عیاض رحمۃ اللہ علیہ کہتے ہیں : ان احادیث میں تطبیق کی صورت یہ ہے کہ بلال رضی اللہ عنہ ایسی جگہ سے رسول اللہ ﷺ کو دیکھ رہے ہوتے ، جہاں سے اور صحابہ نہ دیکھ پاتے یا بہت کم لوگ دیکھ پاتے ، پس حضرت بلال آپ ﷺ کو نکلتے ہوئے دیکھتے ہی اقامت شروع کر دیتے اور لوگ (عام نمازی) جب آپ ﷺ کو خود نہ دیکھتے کھڑے نہ ہوتے ، پھر جب تک صحابہ صفیں برابر نہ کر لیتے ، آپ مصلائے امامت پر نہ کھڑے ہوتے اور ابو ہریرہ رضی اللہ عنہ کی ایک روایت میں ہے : آپ ﷺ کے نکلنے سے پہلے لوگ صفیں بنانے لگ جاتے ، شاید یہ ایک دو یا چند بار بیان جواز کے لیے یا کسی عذر کے سبب ہوا ہو گا (کہ آپ ﷺ تاخیر سے نکلے) اور شاید اسی کے بعد ہی آپ ﷺ نے فرمایا ہوگا : ’’جب تک مجھے (خود) نہ دیکھ لو، مت کھڑے ہوا کرو‘‘۔ علماء نے کہا: آپ ﷺ کو دیکھنے سے پہلے کھڑے ہونے سے روکنے کا سبب شاید یہ ہوگا کہ ان کا قیام طویل نہ ہو جائے، کیونکہ آپ ﷺ کبھی کوئی حاجت در پیش ہونے کے سبب نکلنے میں تاخیر فرما دیتے ۔ سواس باعث علمائے سلف اور ان کے بعد والوں میں اختلاف رائے ہوا کہ لوگ نماز کے لیے کب کھڑے ہوں اور امام تکبیر تحریمہ کب کہے۔ امام شافعی رحمۃ اللہ علیہ اور بعض علماء کا مذہب یہ ہے کہ مؤذن کے اقامت ختم ہونے سے پہلے لوگ کھڑے نہ ہوں ۔ اور قاضی عیاض نے امام مالک رحمۃ اللہ علیہ اور عام علماء سے روایت کیا : جب مؤذن اقامت شروع کرے تو مستحب یہ ہے کہ لوگ کھڑے ہو جائیں اور حضرت انس رضی اللہ عنہ اس وقت کھڑے ہوا کرتے تھے جب موذن ’’قَدْ قَامَتِ الصَّلوة‘‘ کہتا اور امام احمد رحمۃ اللہ علیہ نے بھی یہی کہا ہے۔ امام ابو حنیفہ رحمۃ اللہ علیہ اور علمائے کوفہ نے کہا : اور جب مؤذن ’’حَيَّ عَلَی الصَّلاة‘‘ کہے، تو لوگ کھڑے ہوں اور جب وه ’’قَدْ قَامَتِ الصَّلوٰۃ‘‘ کہے، تو امام تکبیر تحریمہ کہے، اور سلف سے لے کر خلف تک جمہور علماء نے کہا ہے: مؤذن کے اقامت سے فارغ ہونے تک امام تکبیر تحریمہ نہ کہے حضرت ابوہریرہ رضی اللہ عنہ کا یہ قول : "ہم کھڑے ہوئے اور صفیں برابر کیں"، یہ اس طرف اشارہ ہے کہ ان کے ہاں یہ طریقہ رائج تھا۔ اور تمام علماء کے نزدیک صفیں برابر کرنا اور مل کر کھڑا ہونا مستحب ہے اور صحیح مسلم : 605 میں ہے : ابو ہریرہ کا یہ قول : ’’پھر رسول اللہ ﷺ اقامت کے بعد امامت کی جگہ تشریف لے آئے ، پھر آپ کچھ یاد آنے پر چلے گئے، اور ہم سے فرمایا: ’’اپنی جگہ کھڑے رہو‘‘، پھر ہم قیام کی حالت میں انتظار کرتے رہے، یہاں تک کہ آپ غسل فرما کر تشریف لے آئے ، ( صحیح مسلم بشرح النووی، جلد 5 ، ص: 88-87)۔ اس سے معلوم ہوا کہ ضرورت کے وقت اقامت کے بعد تکبیر تحریمہ کے لیے معمولی تاخیر کی جاسکتی ہے، پس اگر امام محسوس کرے کہ صفیں درست نہیں ہوئیں ، تو وہ چند ثانیے یا ایک دو منٹ تاخیر بھی کر سکتا ہے۔`
},
{
  pageNumber: 89,
  text: `علامه ابن قدامہ حنبلی متوفی 620ھ لکھتے ہیں:
[[arabic: وَيُسْتَحَبُّ أَنْ يَقُومَ إِلَى الصَّلَاةِ عِنْدَ قَوْلِ الْمُؤذِّنِ قَدْ قَامَتِ الصَّلَاةِ، وَبِهُذَا قَالَ مَالِكَ، قَالَ ابْنُ الْمُندر عَلى هُذَا أَهْلُ الْحَرمَينِ ، وَقَالَ الشَّافِعِي: يَقُومُ إِذَا فَرَغَ الْمُؤَذِّنَ مِنَ الْإِقَامَةِ]]
ترجمہ: اور مستحب یہ ہے کہ نماز کے لیے مؤذن کے قول ’’قَدْ قَامَتِ الصَّلَاة‘‘ پر کھڑا ہوا جائے اور امام مالک نے بھی یہی کیا ، ابن المنذر نے کہا: اسی پر اہل حرمین کا تعامل ہے اور امام شافعی نے کہا: مؤذن کے اقامت سے فارغ ہونے کے بعد کھڑا ہوگا‘‘۔
مزید لکھتے ہیں :
[[arabic: وَانَّمَا قُلْنَا أَنَّهُ يَقُومُ عِنْدَ قَوْلِهِ : قَدْ قَامَتِ الصَّلَاةُ، لِأَنَّ هُذَا خَبَرٌ بِمَعْنَى الْأَمْرِ وَ مَقْصُودُهُ الْأَعْلامُ ، لِيَقُومُوا ، فَيُسْتَحَبُّ الْمُبَادَرَةُ إِلَى الْقِيَامِ امْتِثَالاً لِلْأَمْرِ، وَتَحْصِيلاً لِلْمَقْصُودِ، وَلَا يُكَبِّرُ حَتَّى فَرَغَ الْمُؤَذِّنُ ، لأَنَّ النَّبِيَّ إِنَّمَا كَانَ يُكَبِّرُ بَعْدَ فَرَانِهِ]]
ترجمہ : یہ جو ہم نے کہا: وہ ’’قَدْ قَامَتِ الصَّلاۃ‘‘ کہتے وقت کھڑا ہوگا، تو یہ اس لیے کہ یہ خبر حکم کے معنی میں ہے اور اس کا مقصد اعلام ( بتانا ) ہے تا کہ لوگ کھڑے ہوں ، تو امر کی تعمیل اور مقصد کے حصول کے لیے کھڑے ہونے میں جلدی کرنا مستحب ہے، اور امام اُس وقت تک تکبیر تحریمہ نہ کہے، جب تک مؤذن اقامت سے فارغ نہ ہو جائے ، اس لیے کہ نبی ﷺ بھی مؤذن کے فارغ ہونے کے بعد تکبیر کہا کرتے تھے۔
(المغنی، جلد 2 ، ص : 6 ، قاہرہ )
ڈاکٹر وھبہ الزحیلی لکھتے ہیں:
[[arabic: لَا يَقُوْمُ الْمُصَلُّونَ لِلصَّلَاةِ عِنْدَ الْإِقَامَةِ حَتَّى يَقُوْمَ الْإِمَامُ أَوْ يَقْبُلَ لِقَولِهِ عَلَيْهِ الصَّلَاةُ وَالسَّلَامُ وَإِذَا أُقِيمَتِ الصَّلَاةُ فَلَا تَقُوْمُوا حَتَّى تَرَوُنِي ، وَأَمَّا تَعْيِينُ وَقتِ قِيَامِ الْمُؤْتَمِينَ إلَى الصَّلَاةِ فَقَالَ الْمَالِكِيَّةُ : يَجُوزُ لِلْمُصَلِّي الْقِيَامُ حَالَ الْإِقَامَةِ أَوْ أَوَّلَهَا أَوْ بَعْدَهَا، فَلَا يُطْلَبُ لَهُ تَعْيِينُ حَالٍ ، بَل بِقَدْرِ الطَّاقَةِ لِلنَّاسِ، فَمِنْهُم الثَّقِيلُ وَالْخَفِيفُ، وَقَالَ الْحَنَفِيَّةُ: يَقُوْمُ عِنْدَ حَى عَلَى الْفَلَاحِ وَبَعْدَ قِيَامِ الْإِمَامِ، وَقَالَ الشَّافِعِيَّةُ: يُسْتَحَبُّ أَن يَقُوْمَ الْمُصَلِّي بَعدَ انْتِهَاءِ الْإِقَامَةِ إِذَا كَانَ الْإِمَامُ مَعَ الْمُصَلِّينَ فِي الْمَسْجِدِ، وَكَانَ يَقْدِرُ عَلَى الْقِيَامِ بِسُرْعَةِ، بِحَيْثُ يُدْرِكُ فَضِيلَةَ تَكْبِيرَةِ الْأَحْرَامِ، وَالأقَامَ قَبْلَ ذَلِكَ بِحَيْثُ يُدْرِكُهَا]]
ترجمہ: لوگ اقامت کے وقت نماز کے لیے نہ کھڑے ہوں ، یہاں تک کہ امام کھڑا ہو جائے یا آگے بڑھے، کیونکہ آپ ﷺ نے فرمایا: ” جب نماز کے لیے اقامت کہی جائے`
},
{
  pageNumber: 90,
  text: `تو جب تک تم (خود) مجھے دیکھ نہ لو مت کھڑے ہو‘‘ ۔ جہاں تک مقتدیوں کا جماعت کے لیے کھڑے ہونے کے وقت کی تعین کامعاملہ ہے تو مالکیہ نے کہا نمازی کے لیے اقامت کے دوران یا اس سے پہلے یا اس کے بعد تمام صورتوں میں کھڑا ہونا جائز ہے، کسی خاص مرحلے پر کھڑا ہونے کی تعیین کا مطالبہ نہ کیا جائے، بلکہ لوگ اپنے حسب حال کھڑے ہو سکتے ہیں، کیونکہ کوئی بھاری (جسامت والا) ہوتا ہے اور کوئی ہلکا ۔ احناف نے کہا: حَيَّ عَلَى الْفَلَاحِ پر اور امام کے کھڑے ہونے کے بعد کھڑے ہوں اور شافعیہ کا قول یہ ہے کہ جب امام نمازیوں کے ساتھ مسجد میں موجود ہو تو نمازی اقامت کے ختم ہونے پر کھڑے ہوں، نمازی فوری کھڑے ہونے پر قدرت رکھتا ہے، تو وہ تکبیر تحریمہ کی فضیلت کو پالے گا اور اگر ایسا نہیں ہے تو وہ پہلے سے کھڑا ہو جائے تا کہ اس فضیلت کو پالے،
( الفقه الاسلامي وأدلته ، ب جلد 1 ، ص : 719 ، دمشق )
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: إِذَا دَخَلَ الرَّجُلُ عِنْدَ الْإِقَامَةِ يُكْرَهُ لَهُ الْانْتِظَارُ قَائِمًا وَلِكِنْ يَقْعُدُ ، ثُمَّ يَقُوْمُ إِذَا بَلَغَ الْمُؤذِّنُ قَوْلَهُ حَيَّ عَلَى الْفَلَاحِ كَذَا فِي المُضْمَرَاتِ]]
ترجمہ: جب کوئی شخص اقامت کے وقت مسجد میں داخل ہو، تو اُسے کھڑے ہو کر انتظار کرنا مکروہ ہے، بلکہ بیٹھ جائے ، جب مؤذن ’’حَيَّ عَلَى الْفَلَاحِ‘‘ پر پہنچے ، تو کھڑا ہو، جیسا کہ مضمرات میں ہے، ( فتاوی عالمگیری، جلد 1، ص:57)۔
صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں :
آج کل اکثر جگہ رواج پڑ گیا ہے کہ وقت اقامت سب لوگ کھڑے رہتے ہیں بلکہ اکثر جگہ تو یہاں تک ہے کہ جب تک امام مصلے پر کھڑا نہ ہو، اُس وقت تک تکبیر نہیں کہی جاتی، یہ خلاف سنت ہے، (بہار شریعت ، جلد اول، ص: 471)۔
امام احمد رضا قادری قُدِّسَ سِرُّهُ الْعَزِیز سے سوال کیا گیا : ” زید دعوی کرتا ہے کہ جب تک سب مقتدی کھڑے نہ ہو لیں اور صف سیدھی نہ ہو اور امام اپنی جانماز پر کھڑا نہ ہو، تب تک`
},
{
  pageNumber: 91,
  text: `اقامت نہ کہی جائے۔ اور عمر و دعوی کرتا ہے کہ مقتدی اور امام کو پہلے ہی سے کھڑا ہوتا ضروری نہیں بلکہ جب اقامت کہتے ہوئے مؤذن حَيَّ عَلَی الْفَلَاحِ تک پہنچ جائے ، اس وقت امام و مقتدی کھڑے ہو جائیں اور جس وقت قَدْ قَامَتِ الصَّلَاةُ“ کہے، تب امام تکبیر کہے ، اب ان دونوں میں کون حق پر ہے؟ ۔ آپ نے جواب میں لکھا: ” عمر وحق پر ہے، کھڑے ہو کر تکبیر سننا مکروہ ہے، یہاں تک کہ علماء حکم فرماتے ہیں کہ جو شخص مسجد میں آیا اور تکبیر ہو رہی ہے، وہ اس کے تمام تک کھڑا نہ رہے، بلکہ بیٹھ جائے ، یہاں تک کہ مکبر حی علی الفلاح تک پہنچے ، اس وقت کھڑا ہو ، وقایہ میں ہے: [[arabic: يَقُوْمُ الْإِمَامُ وَالْقَوْمُ عِنْدَ حَيَّ عَلَى الصَّلَاةُ وَيَشْرَعُ عِنْدَ قَدْ قَامَتِ الصَّلَاةُ]] - ترجمہ: امام اور نمازی "حَيَّ عَلَى الصَّلَاةِ“ پر کھڑے ہوں اور قَدْ قَامَتِ الصَّلاةُ‘ کے الفاظ پر امام نماز شروع کر دے۔
محیط و ” ہندیہ میں ہے:
[[arabic: يَقُومُ الْإِمَامُ وَالْقَوْمُ إِذَا قَالَ الْمُؤَذِّنُ : حَى عَلَى الْفَلَاحِ عِنْدَ عُلَمَائِنَا الثَّلَثَةِ، هُوَ الصَّحِيحُ]]
ترجمہ : ہمارے تینوں ائمہ کے نزدیک جب اقامت کہنے والا حَى عَلَی الْفَلَاحِ “ کہے، تو اُس وقت امام اور تمام نمازی کھڑے ہوں اور یہی صحیح ہے۔
جامع المضمرات و عالمگیری و الدر المحتار میں ہے:
[[arabic: إِذَا دَخَلَ الرَّجُلُ عِنْدَ الْإِقَامَةِ يُكْرَهُ لَهُ الْانْتِظَارُ قَائِمًا وَلِكِنْ يَقْعُدُ ثُمَّ يَقُوْمُ إِذَا بَلَغَ الْمُؤَذِّنُ قَوْلَهُ حَيَّ عَلَى الْفَلَاحِ]] “ ترجمہ : ” جب کوئی نمازی تکبیر کے وقت آئے تو وہ بیٹھ جائے کیونکہ کھڑے ہو کر انتظار کرنا مکروہ ہے پھر جب مؤذن حَيَّ عَلَی الْفَلَاح  کہے تو اس وقت کھڑا ہو۔
اسی طرح بہت کتب میں ہے:
[[arabic: أقُولُ : وَلَا تَعَارُضَ عِنْدِي بَيْنَ قَوْلِ الْوِقَايَةِ وَأَتْبَاعِهَا يَقُوْمُوْنَ عِنْدَ حَى عَلَى الصَّلَاةِ وَالْمُحِيطِ وَالْمُضْمَرَاتِ وَمَنْ مَّعَهُمَا عِنْدَ حَى عَلَى الْفَلَاحِ فَإِنَّا إِذَا حَمَلْنَا]]`
},
{
  pageNumber: 92,
  text: `[[arabic: الأول عَلَى الانْتِهَاءِ وَالْأَخَرَ عَلَى الابْتَدَاءِ اتَّحَدَ الْقَوْلَانِ ، أَى يَقُومُونَ حِينَ يَتِمُّ الْمُؤَذِّنُ حَيَّ عَلَى الصَّلَاةِ وَيَأْتِي عَلَى الْفَلَاحِ وَهُذَا مَا يُعْطِيْهِ قَوْلُ الْمُضْمَرَاتِ يَقُوْمُ إِذَا بَلَغَ الْمُوَقِّنُ حَيَّ عَلَى الْفَلَاحِ وَلَعَلَّ هُذَا أَوْلَى مِمَّانِي مَجْمَعُ الْأَنْهُرُ مِنْ قَوْلِهِ وَفِي الْوَقَايَةِ وَيَقُوْمُ الْإِمَامُ وَالْقَوْمُ عِنْدَ حَيَّ عَلَى الصَّلَاةِ أَيْ قُبَيْلَهُ]]
ترجمہ: میں کہتا ہوں : صاحب وقایہ اور اُن کے متبعین کے اس قول کہ مقتدی مؤذن کے ’’حَيَّ عَلَى الصَّلَاةِ‘‘ کہنے پر کھڑے ہوں اور صاحب محیط و مضمرات اور ان کی جماعت کے اس قول کہ مقتدی مؤذن کے ’’حَى عَلَى الفلاح‘‘ کہنے پر کھڑے ہوں ، میں میرے نزدیک کوئی تعارض نہیں ہے، اس لیے کہ جب ہم پہلے قول کو انتہا اور دوسرے کو ابتدا پر محمول کریں تو دونوں قولوں میں اتحاد حاصل ہو جاتا ہے یعنی جب مؤذن ’’حَيَّ عَلَی الصَّلاة‘‘ پورا کر کے ”حَ عَلَی الْفَلَاح‘‘ کہے ، تو کھڑے ہوں اور اس کی تائید ” مضمرات کے ان الفاظ سے ہوتی ہے : اس وقت کھڑا ہو، جب مؤذن ’’حَى عَلَی الْفَلَاح‘‘ پر پہنچے اور یہ اس سے بہتر ہے ، جو مَجَمَعُ الأَنْهُرُ میں ان کا قول ہے : ” وقایہ میں ہے : امام اور نمازی ”حَ عَلَی الصَّلاةَ“ کے وقت یعنی اس سے تھوڑا سا پہلے کھڑے ہوں۔
یہ اس صورت میں ہے کہ امام بھی تکبیر کے وقت مسجد میں ہو، اور اگر وہ حاضر نہیں ہے، مؤذن جب تک اُسے آتا نہ دیکھے تکبیر نہ کہے، نہ اُس وقت تک کوئی کھڑا ہو لقولہ : [[arabic: لَا تَقُومُوا حَتَّى تَرَوْنِي]] ( کیونکہ نبی اکرم ﷺ کا ارشاد گرامی ہے : تم نہ کھڑے ہوا کرو، یہاں تک کہ مجھے دیکھ لو)، پھر جب امام آئے اور تکبیر شروع ہو، اس وقت دو صورتیں ہیں: (۱) اگر امام صفوں کی طرف سے داخل مسجد ہو تو جس صف سے گزرتا جائے ، وہی صف کھڑی ہوتی جائے ، (۲) اور اگر سامنے سے آئے تو اُسے دیکھتے ہی سب کھڑے ہو جائیں اور اگر خود امام ہی تکبیر کہے تو جب تک پوری تکبیر سے فارغ نہ ہولے مقتدی اصلاً کھڑے نہ ہوں ، بلکہ اگر اس نے تکبیر مسجد سے باہر کہی تو فراغ پر بھی کھڑے نہ ہوں جب وہ مسجد میں قدم رکھے اس وقت قیام کریں ، ہندیہ میں اس عبارت کے بعد مذکور ہے:`
},
{
  pageNumber: 93,
  text: `[[arabic: فَأَمَّا إِذَا كَانَ الْإِمَامُ خَارِجَ الْمَسْجِدِ، فَإِنْ دَخَلَ الْمَسْجِدَ مِنْ قِبَلِ الصُّفُوفِ فَكُلَّمَا جَاوَزَ صَفًا، قَامَ ذَلِكَ الصَّفُ وَإِلَيْهِ مَالَ شَمْسُ الْأَئِمَّةِ الْحُلْوَانِ وَالسَّهَاخُسِقُ وَشَيْخُ الْإِسْلَامِ خَوَاهَرْ زَادَه، وَإِنْ كَانَ الْإِمَامُ دَخَلَ الْمَسْجِدَ مِنْ قُدَّامِهِم يَقُوْمُونَ كَمَا رَأَوا الْإِمَامَ وَإِنْ كَانَ الْمُؤَذِّنُ وَالْإِمَامُ وَاحِدًا ، فَإِنْ أَقَامَ فِي الْمَسْجِدِ فَالْقَوْمُ لَا يَقُوْمُونَ مَا لَمْ يَفْرَغْ عَنِ الْإِقَامَةِ ، وَإِنْ أَقَامَ خَارِجَ الْمَسْجِدِ فَمَشَايِخُنَا اتَّفَقُوا عَلَى أَنَّهُمْ لَا يَقُومُونَ مَا لَمْ يَدْخُلِ الْإِمَامُ الْمَسْجِدَ وَيُكَبِّرُ الْإِمَامُ قُبَيْلَ قَولِهِ قَدْ قَامَتِ الصَّلَاةُ ، قَالَ الشَّيْخُ الإِمَامِ شَمسُ الْآئِيَّةِ الْحُلَوَانِ وَهُوَ الصَّحِيحُ هُكَذَا فِي الْمُحِيطِ]]
ترجمہ: پس جب امام مسجد سے باہر ہو، سو اگر وہ صفوں کی جانب سے مسجد میں میں داخل ہو، تو جس صف سے وہ گزرے، وہ صف کھڑی ہو جائے ، شمس الائمہ حلوانی، امام سرخسی اور شیخ الاسلام خواهر زادہ اسی طرف گئے ہیں اور اگر امام اُن کے سامنے سے مسجد میں داخل ہو، تو اسے دیکھتے ہی تمام مقتدی کھڑے ہو جائیں ، اگر مؤذن اور امام ایک ہی ہے، پس اگر اُس نے مسجد کے اندر ہی تکبیر کہی تو قوم اس وقت تک کھڑی نہ ہو ، جب تک وہ تکبیر سے فارغ نہ ہو جائے اور اگر اس نے خارج از مسجد تکبیر کہی ، تو ہمارے تمام مشائخ اس پر متفق ہیں کہ لوگ اس وقت تک کھڑے نہ ہوں، جب تک امام مسجد میں داخل نہ ہو اور امام ’’قَدْ قَامَتِ الصَّلَاةُ" سے تھوڑا پہلے تکبیر تحریمہ کہے، امام شمس الائمہ حلوانی کہتے ہیں کہ یہی صحیح ہے، محیط میں اسی طرح ہے، ( فتاوی رضویہ، جلد 5 ، ص: 379 تا 382)۔
ایک اور سوال ہوا: ” تکبیر کے شروع ہونے کے وقت امام و مقتدی کو کھڑا رہنا چاہیے یا بیٹھ جانا چاہیے اور بیٹھ جانے میں کیا فضیلت ہے اور کھڑا رہنے میں کیا نقصان ہے؟“۔
الجواب : امام کے لیے اس میں کوئی خاص حکم نہیں ، مقتدیوں کو حکم ہے کہ تکبیر بیٹھ کر سنیں، ’’حَى عَلَى الْفَلَاحِ‘‘ پر کھڑے ہوں، کھڑے کھڑے تکبیر سننا مکروہ ہے، یہاں تک کہ عالمگیری میں فرمایا: اگر کوئی شخص ایسے وقت میں مسجد میں آئے کہ تکبیر ہورہی ہو، فوراً بیٹھ جائے اور حَى عَلَی الْفَلَاحِ پر کھڑا ہو اور اس میں راز مکبر کے اس قول ’’قَدْ قَامَتِ الصَّلَاةُ“ کی مطابقت ہے کہ ادھر اُس نے ”حَ عَلَی الْفَلَامِ“ کہا : آؤ مراد پانے کو،`
},
{
  pageNumber: 94,
  text: `اُدھر جماعت کھڑی ہوئی ، اُس نے کہا: ” قَدْ قَامَتِ الصَّلَاةُ ، جماعت قائم ہوگئی ، والله تعالیٰ اعلم ، (فتاوی رضویہ، جلد 5 ، ص: 421)۔
الغرض جب جماعت کے لیے اقامت کہی جارہی ہو تو مقتدی اس وقت کھڑے ہوں، جب مؤذن ’’حَى عَلَی الْفَلَاح‘‘ کہے، یہ مستحب ہے اور آداب اقامت وصلوٰۃ میں سے ہے۔ شروع ہی سے کھڑے ہو کر اقامت سننے کو ہمارے اکابر فقہائے کرام نے مکروہ کہا ہے اور اس سے مراد مکروہ تنزیہی ہے۔ فقہ حنفی میں یہ مسئلہ مختلف فیہ نہیں ہے، نہ یہ دیو بندی بریلوی خلافیات کا مسئلہ ہے، لہذا اسے مساجد میں فساد کا ذریعہ نہ بنایا جائے ۔ اگر اکثریت کھڑی ہو گئی ہے تو ایک یا چند آدمیوں کے بیٹھے رہنے سے صفوں میں خلل واقع ہوگا اور جہاں اکثریت بیٹھی رہتی ہے، وہاں ایک یا چند آدمیوں کو اپنا نفر داور پارسائی ظاہر کرنے کے لیے کھڑا نہیں ہونا چاہیے ، یہ خالص فقہی مسئلہ ہے اور اس میں انا پرستی کو دخل نہیں ہونا چاہیے۔ آپ پریشان نہ ہوں ، آپ کی گزشتہ نمازیں صحیح ادا ہو گئیں اور امام کا موقف بھی درست ہے۔ مستحبات اور اولیٰ و افضل کاموں پر عمل کرنا باعث اجر ہے لیکن اُن کے ترک پر کوئی مواخذہ نہیں ہے۔ جہاں تک اقامت کے وقت حرمین طیبین کے معمولات کا تعلق ہے، اُن کا تعلق فقہ حنبلی سے ہے اور فقہ حنبلی میں جو کتاب ماخذ کا درجہ رکھتی ہے، وہ المغنی لابن قدامہ ہے اور اس کا حوالہ آچکا ہے کہ جب مؤذن قَدْ قَامَتِ الصَّلاة کہے ، تو مقتدی اس وقت کھڑے ہوں اور ائمہ اربعہ میں سے فقط امام مالک کا قول یہ ہے کہ مقتدیوں کا اقامت کے شروع میں کھڑا ہونا مستحب ہے ممکن ہے وہ اس مسئلے میں امام مالک کے قول پر عمل کرتے ہوں۔ اقوال ائمہ چار ہیں:
(۱) مقتدی اقامت کے شروع میں کھڑے ہوں (امام مالک) (۲) قَدْ قَامَتِ الصَّلَاةُ کے کلمے پر کھڑے ہوں (امام احمد بن حنبل ) (۳) اقامت کے ختم پر کھڑے ہوں (امام شافعی) (۴) ”حَى عَلَى الفلاح پر کھڑے ہوں (امام اعظم ابوحنیفہ ) ۔ ان میں سے کسی بھی قول پر عمل کرنے سے نماز کی صحت پر کوئی اثر نہیں پڑتا ، اختلافات افضلیت میں ہے اور احناف کے نزدیک ’’حَیَّ عَلَی الصَّلاةِ“ پر کھڑا ہونا افضل ہے اور شروع میں کھڑا ہونا مکروہ تنزیہی ہے۔
یہاں تک لکھا جا چکا تھا کہ ایک صاحب نے فتاویٰ نوریہ کے حوالے سے فقیہ العصر علامہ نور اللہ بصیر پوری رحمۃ اللہ علیہ کے مندرجہ ذیل فتوے کی طرف متوجہ کیا، آپ سے سوال ہوا: ایسا نمازی جو اقامت نماز کے دوران مسجد میں آیا جب کہ امام بھی آچکا ہو تو کیا اس کا بیٹھ جانا ضروری ہے کہ حی علی الفلاح پر کھڑا ہو، کیونکہ اس وقت قیام مستحب ہے جو قعود پر موقوف ہے، حالانکہ مستحب کا موقوف علیہ بھی مستحب ہوتا ہے، (استفتی: محمد اجمل نوری عفی عنہ )۔ آپ نے جواب میں لکھا:
حضور پر نور سید عالم ﷺ نے حکم دیا ہے کہ جب کوئی تمہارا مسجد میں داخل ہو تو بیٹھنے سے پہلے دو رکعت نماز ادا کرے اور یوں بھی آیا کہ دو رکعتوں کے پڑھنے تک نہ بیٹھے (متفق علیہ ) ۔ اس حکم کی بنا پر ہمارے ائمہ کرام اور جمہور کے نزدیک نماز تحیۃ المسجد مستحب مؤکد ہے، بلکہ ہمارے مشائخ کرام نے یہ تصریح بھی فرمائی کہ سنت ہے جو کسی بھی سنت یا فرض نماز سے بھی ادا ہو جاتی ہے، جس سے پہلے بیٹھنا تاکیدی مستحب بلکہ سنت کا خلاف اور غیر اولی ہے، لہذا ایسا داخل ہونے والا جس کے متعلق سوال ہے ، اداء نماز سے قبل نہ بیٹھے اور چونکہ امام حاضر ہے ، لہذا حدیث لا تَقُومُوا حَتَّى تَرَوْنِی کا تقاضا بھی نہیں کہ قیام نہ کرے۔ رہا سائل کا استدلال کہ ہمارے نزدیک حی علی الفلاح پر قیام مستحب ہے جو قعود پر موقوف ہے، لہذا قعود بھی مستحب ہوا، تو یہ محض باطل ہے، کیونکہ یہ قیام مستحب تو مقدمہ ہے اسی قیام کا جو بحکم قُومُوا لِلَّهِ قَانِتِین نماز فرض میں فرض ہے، حالانکہ منفرد یا امام و مقتدی پر فرض نماز سے قبل قعود قطعا فرض نہیں بلکہ منفرد کے لیے تو کسی نے مستحب تک بھی نہیں کہا تو معلوم ہوا کہ قیام قعود پر موقوف نہیں ورنہ قعود بھی قیام کی طرح فرض ہوتا ، وَلَمْ يَقُلْ بِهِ أَحَدٌ اور یہیں سے واضح ہوا کہ مضمرات شرح قدوری میں مولانا صوفی یوسف بن عمر کا دوری کا ایسے داخل مسجد`
},
{
  pageNumber: 95,
  text: `کے لیے قعود کا حکم دینا اور قیام مکروہ بتانا بے دلیل ہے اور صحیح نہیں، اس میں حضور پر نور روحی فداء محمد مصطفی ﷺ کے حکم مذکور کی صریح خلاف ورزی ہے جو ہمارے کسی بھی امام کا قول ہرگز ہرگز نہیں ہو سکتا، لہذا مقبول نہیں اور ہندیہ اور دُرّ وغیرہ کا مضمرات سے نقل کرنا بھی صحیح نہیں بنا سکتا کہ غیر صحیح نقل کر دینے سے صحیح نہیں بن جاتا۔
تعجب ہے کہ امام کی موجودگی کی صورت میں تکبیر سے پہلے حاضرین کے لیے قیام عند الفلاح ہمارے ائمہ کرام کے نزدیک مستحب تو ہے مگر مستحب کا خلاف دلیل خاص کے بغیر مکروہ نہیں بن سکتا ، کما صرح به الشامی وغیرہ تو وقت پر آنے والے کے لیے کیوں مکروہ ہوا ؟ اس مبارک اور صحیح حدیث کو بکثرت ائمہ دین نے اپنی اپنی مبارک تصنیف میں باسانید معتبره متصله روایت فرمایا ہے ، چنانچہ موطا امام مالک ص ۱۴۶ ( طبع اصبح )، موطا امام محمد ص ۱۱۹ (یوسفی) مسند امام احمد ، ج ۵، ص: ۲۹۵ ، ۲۹۶، ۳۰۳ صحیح بخاری ص: ۶۳ باسنادین صحیح مسلم ج ا ص ۲۴۸  سنن ابی داؤد ص ۶۷ (مجیدی) باسنادین ترمذی ج اص ۷۳ (اصح)، ابن ماجه ص: ۷۲ (اصح ) ، شرح السنہ ج: ۲، ص: ۳۶۵ وغیر ہا میں بکلمات متقاربہ ہے: [[arabic: وَالنَّظْمُ مِنَ الْبُخَارِيِّ وَغَيْرِهِ عَنْ أَبِي قَتَادَةَ السُّلَّمِي أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكُمْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ]] ، مصنف عبدالرزاق، ج: ص: ۴۲۸، بخاری ، ج : اص: ۱۵۶، مسلم، ج:۱ ص: ۲۴۸، میں بایں کلمات متقاربہ بھی ہے : [[arabic: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلَا يَجْلِسُ حَتَّى يُصَلِّي رَكْعَتَيْنِ]]، اور ابن ماجہ ص: ۷۲ میں حضرت ابی ہریرہ رضی اللہ عنہ کی حدیث مرفوع میں بھی یہی کلمات مبارکہ ہیں، [[arabic: وَاللّٰهُ وَرَسُولُهُ أَعْلَمُ جَلَّ جَلَالُ رَبِّي وَحْدَةً وَصَلَّى اللَّهُ عَلَى حَبِيبِهِ الَّذِي لَا نَبِي بَعْدَهُ]]
چنانچہ اس سلسلے میں درج ذیل گزارش ہے :
حضرت مفتی نور اللہ بصیر پوری رحمۃ اللہ علیہ کے فتوے کو پڑھنے کے بعد آپ پر آشکار ہوگا انہوں نے چند سوالات اٹھائے ہیں: (۱) اگر بیٹھ کر اقامت سننا اور حی علی الصلوة پر کھڑے`
},
{
  pageNumber: 96,
  text: `ہونا مستحب ہے، تو منوعات میں مستحب کا مقابل” خلاف اولیٰ ہے۔ انہوں نے لکھا: سب سے پہلے جامع المضمرات والمشكلات“ کے مصنف امام یوسف بن عمر بن یوسف الکادوری نے یہ مسئلہ لکھا ہے اور اس کے بعد سب نے اُس کی پیروی کی اور نقل کرتے چلے گئے ، اس کی علت پر توجہ نہیں دی۔ علامہ نور اللہ بصیر پوری کے بقول اُن سے سہو ہوا اور باقی نے آنکھیں بند کر کے اُن کا اتباع کیا، لہذا کھڑے ہو کر اقامت سنے کو مکر وہ کہنا درست نہیں ہے، زیادہ سے زیادہ خلاف اولیٰ کہہ سکتے ہیں۔
چنانچہ علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: الْحَاصِلُ أَنَّ السُّنَّةَ إِنْ كَانَتْ مُؤَكَّدَةً قَوِيَّةٌ لَا يَبْعُدُ كَوْنُ تَرْكِهَا مَكْرُوهَا تَحْرِيمًا ، وَإِنْ كَانَتْ غَيْرَ مُؤَكَدَةٍ فَتَرْكُهَا مَكْرُوا تَنْزِيهَا وَأَمَّا الْمُسْتَحَبُّ أَوِ الْمَنْدُوبُ فَيَنْبَغِي أَنْ يُكْرَة تركه أَصْلًا، لِقَوْلِهِمْ يُسْتَحَبُّ يَوْمَ الْأَضْحَى أَنْ لَا يَأْكُلَ أَوَّلًا إِلَّا مِنْ أُضْحِيَّتِهِ، وَلَوْ أَكَلَ مِنْ غَيْرِهَا لَمْ يُكْرَهُ ، فَلَمْ يَلْزَمُ مِنْ تَرْكِ الْمُسْتَحَبِّ ثُبُوْتُ الْكَرَاهَةِ إِلَّا أَنَّهُ يُشْكِلُ عَلَيْهِ قَوْلُهُمُ الْمَكْرُوهُ تَنْزِيْهَا مَرْجِعُهُ إِلَى خِلَافِ الْأَولَى ، وَلَا شَكَ أَنَّ تَرْكَ الْمُسْتَحَبِّ خِلَافُ الأولى]]
ترجمہ : ” حاصل یہ ہے کہ سنت اگر قوت کے ساتھ مؤکدہ ہو، تو بعید نہیں کہ اس کا ترک مکروہ تحریمی ہو اور اگر غیر مؤکدہ ہے تو اس کا ترک مکروہ تنزیہی ہو اور رہا مستحب یا مندوب تو چاہیے کہ اس کا ترک اصلا مکروہ ہو، کیونکہ فقہائے کرام نے فرمایا: یوم الاضحیٰ کو مستحب یہ ہے کہ نماز عید سے پہلے نہ کھائے اور قربانی کے گوشت سے کھائے اور اگر قربانی کے گوشت کے علاوہ کوئی اور چیز کھائی تو مکروہ نہیں ہے، سو ترک مستحب سے کراہت کا ثابت ہونا لازم نہیں آتا ، سوائے اس کے کہ اس پر فقہائے کرام کے اس قول پر اشکال ہوتا ہے کہ مکروہ تنزیہی کا مرجع (یعنی مال ) ” خلاف اولیٰ ہے اور اس میں کوئی شک نہیں کہ مستحب کا ترک کرنا خلاف اولیٰ ہے، (رد المحتار علی الدر المختار، ج:2 ، ص: 367)۔ اس عبارت کا مستفاد یہ ہے کہ اصولی اعتبار سے تو ترک مستحب کو خلاف اولیٰ کہنا چاہیے لیکن چونکہ مکروہ تنزیہی کا`
},

{
  pageNumber: 97,
  text: `کے لیے قعود کا حکم دینا اور قیام مکروہ بتانا بے دلیل ہے اور صحیح نہیں، اس میں حضور پر نور روحی فداء محمد مصطفی ﷺ کے حکم مذکور کی صریح خلاف ورزی ہے جو ہمارے کسی بھی امام کا قول ہرگز ہرگز نہیں ہو سکتا، لہذا مقبول نہیں اور ہندیہ اور دُرّ وغیرہ کا مضمرات سے نقل کرنا بھی صحیح نہیں بنا سکتا کہ غیر صحیح نقل کر دینے سے صحیح نہیں بن جاتا۔
تعجب ہے کہ امام کی موجودگی کی صورت میں تکبیر سے پہلے حاضرین کے لیے قیام عند الفلاح ہمارے ائمہ کرام کے نزدیک مستحب تو ہے مگر مستحب کا خلاف دلیل خاص کے بغیر مکروہ نہیں بن سکتا ، کما صرح به الشامی وغیرہ تو وقت پر آنے والے کے لیے کیوں مکروہ ہوا ؟ اس مبارک اور صحیح حدیث کو بکثرت ائمہ دین نے اپنی اپنی مبارک تصنیف میں باسانید معتبره متصله روایت فرمایا ہے ، چنانچہ موطا امام مالک ص ۱۴۶ ( طبع اصبح )، موطا امام محمد ص ۱۱۹ (یوسفی) مسند امام احمد ، ج ۵، ص: ۲۹۵ ، ۲۹۶، ۳۰۳ صحیح بخاری ص: ۶۳ باسنادین صحیح مسلم ج ا ص ۲۴۸  سنن ابی داؤد ص ۶۷ (مجیدی) باسنادین ترمذی ج اص ۷۳ (اصح)، ابن ماجه ص: ۷۲ (اصح ) ، شرح السنہ ج: ۲، ص: ۳۶۵ وغیر ہا میں بکلمات متقاربہ ہے: [[arabic: وَالنَّظْمُ مِنَ الْبُخَارِيِّ وَغَيْرِهِ عَنْ أَبِي قَتَادَةَ السُّلَّمِي أَنَّ رَسُولَ اللَّهِ ﷺ قَالَ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكُمْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ]] ، مصنف عبدالرزاق، ج: ص: ۴۲۸، بخاری ، ج : اص: ۱۵۶، مسلم، ج:۱ ص: ۲۴۸، میں بایں کلمات متقاربہ بھی ہے : [[arabic: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلَا يَجْلِسُ حَتَّى يُصَلِّي رَكْعَتَيْنِ]]، اور ابن ماجہ ص: ۷۲ میں حضرت ابی ہریرہ رضی اللہ عنہ کی حدیث مرفوع میں بھی یہی کلمات مبارکہ ہیں، [[arabic: وَاللّٰهُ وَرَسُولُهُ أَعْلَمُ جَلَّ جَلَالُ رَبِّي وَحْدَةً وَصَلَّى اللَّهُ عَلَى حَبِيبِهِ الَّذِي لَا نَبِي بَعْدَهُ]]
چنانچہ اس سلسلے میں درج ذیل گزارش ہے :
(فتاویٰ نوریه ، ج1 ، ص: 302-304)
حضرت مفتی نور اللہ بصیر پوری رحمۃ اللہ علیہ کے فتوے کو پڑھنے کے بعد آپ پر آشکار ہوگا انہوں نے چند سوالات اٹھائے ہیں: (۱) اگر بیٹھ کر اقامت سننا اور حی علی الصلوة پر کھڑے`
},
{
  pageNumber: 98,
  text: `ہونا مستحب ہے، تو منوعات میں مستحب کا مقابل” خلاف اولیٰ ہے۔ انہوں نے لکھا: سب سے پہلے جامع المضمرات والمشكلات“ کے مصنف امام یوسف بن عمر بن یوسف الکادوری نے یہ مسئلہ لکھا ہے اور اس کے بعد سب نے اُس کی پیروی کی اور نقل کرتے چلے گئے ، اس کی علت پر توجہ نہیں دی۔ علامہ نور اللہ بصیر پوری کے بقول اُن سے سہو ہوا اور باقی نے آنکھیں بند کر کے اُن کا اتباع کیا، لہذا کھڑے ہو کر اقامت سنے کو مکر وہ کہنا درست نہیں ہے، زیادہ سے زیادہ خلاف اولیٰ کہہ سکتے ہیں۔
چنانچہ علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: الْحَاصِلُ أَنَّ السُّنَّةَ إِنْ كَانَتْ مُؤَكَّدَةً قَوِيَّةٌ لَا يَبْعُدُ كَوْنُ تَرْكِهَا مَكْرُوهَا تَحْرِيمًا ، وَإِنْ كَانَتْ غَيْرَ مُؤَكَدَةٍ فَتَرْكُهَا مَكْرُوا تَنْزِيهَا وَأَمَّا الْمُسْتَحَبُّ أَوِ الْمَنْدُوبُ فَيَنْبَغِي أَنْ يُكْرَة تركه أَصْلًا، لِقَوْلِهِمْ يُسْتَحَبُّ يَوْمَ الْأَضْحَى أَنْ لَا يَأْكُلَ أَوَّلًا إِلَّا مِنْ أُضْحِيَّتِهِ، وَلَوْ أَكَلَ مِنْ غَيْرِهَا لَمْ يُكْرَهُ ، فَلَمْ يَلْزَمُ مِنْ تَرْكِ الْمُسْتَحَبِّ ثُبُوْتُ الْكَرَاهَةِ إِلَّا أَنَّهُ يُشْكِلُ عَلَيْهِ قَوْلُهُمُ الْمَكْرُوهُ تَنْزِيْهَا مَرْجِعُهُ إِلَى خِلَافِ الْأَولَى ، وَلَا شَكَ أَنَّ تَرْكَ الْمُسْتَحَبِّ خِلَافُ الأولى]]
ترجمہ : ” حاصل یہ ہے کہ سنت اگر قوت کے ساتھ مؤکدہ ہو، تو بعید نہیں کہ اس کا ترک مکروہ تحریمی ہو اور اگر غیر مؤکدہ ہے تو اس کا ترک مکروہ تنزیہی ہو اور رہا مستحب یا مندوب تو چاہیے کہ اس کا ترک اصلا مکروہ ہو، کیونکہ فقہائے کرام نے فرمایا: یوم الاضحیٰ کو مستحب یہ ہے کہ نماز عید سے پہلے نہ کھائے اور قربانی کے گوشت سے کھائے اور اگر قربانی کے گوشت کے علاوہ کوئی اور چیز کھائی تو مکروہ نہیں ہے، سو ترک مستحب سے کراہت کا ثابت ہونا لازم نہیں آتا ، سوائے اس کے کہ اس پر فقہائے کرام کے اس قول پر اشکال ہوتا ہے کہ مکروہ تنزیہی کا مرجع (یعنی مال ) ” خلاف اولیٰ ہے اور اس میں کوئی شک نہیں کہ مستحب کا ترک کرنا خلاف اولیٰ ہے، (رد المحتار علی الدر المختار، ج:2 ، ص: 367)۔ اس عبارت کا مستفاد یہ ہے کہ اصولی اعتبار سے تو ترک مستحب کو خلاف اولیٰ کہنا چاہیے لیکن چونکہ مکروہ تنزیہی کا`
},
{
  pageNumber: 99,
  text: `مآل بھی خلاف اولیٰ ہے، لہذا ترک مستحب کو بھی مکروہ تنزیہی کہہ سکتے ہیں، یعنی دلیل خاص کے بغیر بھی مکروہ تنزیہی کا اطلاق کیا جا سکتا ہے۔
علامہ علاء الدین حصکفی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: فَالْوُضُوءُ لِمُطْلَقِ الذِّكْرِ مَنْدُوبٌ وَتَرْكُهُ خِلَافُ الْأَوْلَى، وَهُوَ مَرْجِعُ كَرَاهَةِ التَّنْزِيهِ]]
ترجمہ: مطلق ذکر کے لیے وضو مستحب ہے اور اس کا ترک خلاف اولیٰ ہے اور یہی کراہت تنزیہی کا مآل ہے ، اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: (قَوْلُهُ : وَهُوَ مَرْجِعُ كَرَاهَةِ التَّنْزِيهِ ) أَيْ فَلِذَا قَيَّدَ بِقَوْلِهِ أَيْ تَحْرِيبًا، وَقَصَدَ بِذلِكَ الرَّدَّ عَلَى قَوْلِ الْبَحْرِ ، وَتَرْكُ الْمُسْتَحَبِّ لَا يُوجِبُ كَرَاهَةٌ]]
ترجمہ: علامہ علاء الدین رحمۃ اللہ علیہ کا یہ قول : ” خلاف اولیٰ کا مرجع کراہت تنزیہی ہے ، یعنی اسی لیے علامہ حصکفی نے حالت جنابت و نفاس میں دعا پڑھنے کے بارے میں کہا کہ یہ مکروہ تحریمی نہیں ہے ، تحریما کی قید سے علامہ حصکفی نے علامہ ابن نجیم کے اس قول کا رد کیا ہے کہ ترک مستحب سے کراہت تحریمی لازم نہیں آتی ، (رد المحتار علی الدر المختار ، ج:1 ، ص: 174)۔ اس کا مطلب یہ ہے کہ بعض صورتوں میں ترک مستحب پر کراہت تنزیہی کا اطلاق کیا جا سکتا ہے۔
علامہ علاء الدین حصکفی رحمۃ اللہ علیہ نے مکروہات صلوٰۃ بیان کرتے ہوئے لکھا:
[[arabic: وَتَرْكُ كُلِّ سُنَّةِ وَ مُسْتَحَب]] ، ترجمہ: ہر سنت اور مستحب کا ترک مکروہ ہے، (الدر المختار، ج:1 ، ص: 653) ۔ ظاہر ہے کہ اس سے مراد مکروہ تنزیہی ہے ، پس معلوم ہوا کہ ترک مستحب پر بھی فقہائے کرام بعض اوقات مکروہ تنزیہی کا اطلاق کر دیتے ہیں۔
علامہ ابن نجیم رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: ثَانِيهِمَا الْمَكْرُوهُ تَنْزِيهَا وَمَرْجِعُهُ إِلَى مَا تَرْكُهُ أَوْلَى وَكَثِيرًا مَا يُطْلِقُونَهُ كَمَا ذَكَرَهُ الْعَلَّامَةُ الْحَلَبِيُّ فِي مَسْأَلَةِ مَسْحِ الْعَرَقِ فَحِينَينِ إِذَا ذَكَرُوا مَكْرُوهَا فَلَا بُدَّ مِنَ النَّظَرِ فِي دَلِيْلِهِ فَإِنْ كَانَ نَهْيَا طَيِّيَا يُحْكَمُ بِكَرَاهَةِ التَّحْرِيمِ إِلَّا لِصَارِ فِي لِلنَّهْي عَنِ التَّحْرِيمِ إِلَى النَّدْبِ فَإِنْ لَمْ يَكُنِ الدَّلِيلُ نَهْيَا بَلْ كَانَ مُفِيدَ اللتَّرْكِ الْغَيْرِ الْجَازِ مِ فَهِيَ تَنْزِيهِيَّة]]
ترجمہ : ان میں سے دوسرا مکروہ تنزیہی ہے اور اس کا مآل ترک اولی ہے اور فقہائے کرام ترک اولی پر اکثر مکروہ تنزیہی کا اطلاق کرتے ہیں، جیسا کہ علامہ حلبی نے پسینہ پونچھنے کے مسئلے پر اس کا اطلاق کیا ہے، پس نتیجہ یہ نکلا کہ جب فقہائے کرام کسی بات کو مکروہ بیان کریں، تو اس کی دلیل پر غور کرنا ضروری ہے، سو اگر دلیل نہی ظنی ہے تو کراہت تحریمی کا اطلاق کیا جائے گا، ورنہ نہی کو تحریم سے (ترک) مستحب پر محمول کیا جائے گا، پس اگر دلیل نہی نہ ہو بلکہ تاکید کے ساتھ ترک کا حکم نہ ہو تو وہ تنزیہی ہے، (البحر الرائق ، ج : 2 ، ص : 20)۔۔ وہ مزید لکھتے ہیں :
فقہائے کرام نے علت یہ بیان کی ہے کہ اس میں سنت کا ترک ہے اور یہ مکروہ تنزیہی کا فائدہ دیتا ہے، کیونکہ اس میں نہی خاص نہیں ہے کہ مکروہ تحریمی قرار دیا جاتا۔
(البحر الرائق، ج:2 ، ص: 40)
علامہ وحید الزماں لکھتے ہیں :
[[arabic: لَا تَقُومُوا حَتَّی]] ( مسجد میں جب تم لوگ بیٹھے ہو تو ) اس وقت تک کھڑے نہ ہو جب تک مجھ کو نہ دیکھو ( یعنی نماز کے لیے پہلے سے کھڑے ہو جانا بے فائدہ بات ہے، جب امام آجائے اس وقت لوگ کھڑے ہوں۔ بعضوں نے کہا: یہ حکم ہر ایک مجلس کے لیے عام ہے)، (لغات الحدیث، باب القاف مع الواو ، ص: 184 ، نور محمد کارخانہ تجارت کتب، کراچی)۔
علامہ مفتی سعید احمد پالن پوری لکھتے ہیں :
دوسرا مسئلہ: اگر امام مسجد میں موجود ہو تو لوگ اقامت کے ساتھ ہی کھڑے ہو سکتے ہیں، کیونکہ اقامت کے معنی ہیں: کھڑا کرنا، پس جب کھڑا کرنا پایا گیا تو کھڑے ہونے کی گنجائش ہے، البتہ اگر کوئی بیٹھا ر ہے تو حی علی الصلاۃ پر ضرور کھڑا ہو جائے ، ورنہ اللہ کے داعی کی مخالفت لازم آئے گی۔علامہ احمد طحطاوی رحمۃ اللہ علیہ نے فقہ کی عبارت [[arabic: يقوم الناس عند حی علی]]`
},
{
  pageNumber: 100,
  text: `[[arabic: الصلاۃ]] کا یہی مطلب لکھا ہے، (حاشیہ طحطاوی علی الدر المختار ، ج:1 ص: 215)، (تحفۃ الالمعی ، ج:1 ، ص: 511)۔۔ مزید لکھتے ہیں:
اور اگر امام مسجد سے ملحق کمرہ میں ہو تو جب تک امام کمرہ سے نہ نکلے لوگ کھڑے نہ ہوں، کیونکہ اقامت سے امام کا نکلنا متخلف ہو سکتا ہے، نبی ﷺ نے صحابہ کرام رضوان اللہ علیہم اجمعین کو یہی نصیحت فرمائی ہے کہ حضرت بلال رضی اللہ عنہ کے تکبیر شروع کرنے پر آپ حضرات کھڑے نہ ہوں ، بلکہ جب مجھے حجرہ سے نکلتا دیکھیں ، تب کھڑے ہوں، کیونکہ اس کا امکان ہے کہ نبی ﷺ گھر میں کسی کام میں مشغول ہوں یا آپ ﷺ کی نیت بندھی ہوئی ہو، پس لوگوں کو کھڑے کھڑے نماز کا انتظار کرنا پڑے گا ، جو مکروہ ہے۔
فائدہ (1): اگر اقامت سے امام کا نکلنا متخلف ہو جائے تو مؤذن کو بھی بیٹھ جانا چاہیے، پھر اگر امام فورا نکل آئے تو تکبیر کا اعادہ ضروری نہیں اور امام کو نکلنے میں تاخیر ہو تو تکبیر دوبارہ کہنی چاہیے اور تھوڑے اور زیادہ وقفہ کا فیصلہ رائے مبتلی بہ پر چھوڑ دیا گیا ہے، یعنی لوگ خود ہی اس کا فیصلہ کریں۔
فائدہ (2): اسی طرح یہ جو طریقہ چل پڑا ہے کہ لوگ پہلے کھڑے ہو جاتے ہیں اور امام صاحب بھی مصلی پر پہنچ جاتے ہیں، پھر تکبیر شروع ہوتی ہے، یہ بھی غلط طریقہ چل پڑا ہے۔ جب تک اقامہ (کھڑا کرنا) نہ پایا جائے ، کھڑے ہونے کے کیا معنی ؟ ، اور کھڑے کھڑے اقامت کا انتظار کرنا مکروہ ہے ، فقہ کی کتابوں میں اس کی صراحت ہے۔ پس لوگوں کو چاہیے کہ وہ گھڑی میں وقت ہونے پر کھڑے نہ ہوں، نہ امام صاحب نہ مقتدی۔ بلکہ پہلے اقامہ ( تکبیر ) شروع کی جائے ، پھر لوگ کھڑے ہوں۔
(تحفۃ الالمعی ، ج:1 ، ص: 511، زمزم پبلشرز کراچی )
امام اہلسنت اعلیٰ حضرت احمد رضا خان قادری قُدِّسَ سِرُّهُ الْعَزِیز سے پوچھا گیا:
علمائے دین اس مسئلے میں کہ تکبیر کے شروع ہونے کے وقت امام و مقتدی کو کھڑا رہنا چاہیے یا بیٹھ جانا چاہیے اور بیٹھ جانے میں کیا فضیلت ہے اور کھڑا رہنے میں کیا نقصان ہے`
},
{
  pageNumber: 101,
  text: `کے جواب میں لکھتے ہیں :
امام کے لیے اس میں کوئی خاص حکم نہیں، مقتدیوں کو حکم ہے کہ تکبیر بیٹھ کر سنیں، حَيَّ عَلَى الْفَلَاحِ پر کھڑے ہوں ، کھڑے کھڑے تکبیر سننا مکروہ ہے یہاں تک کہ عالمگیری میں فرمایا ہے کہ اگر کوئی شخص ایسے وقت میں مسجد میں آئے کہ تکبیر ہورہی ہو فورا بیٹھ جائے اور حَيَّ عَلَی الْفَلَاحِ پر کھڑا ہو اور اس میں راز مکبر کے اس قول کی مطابقت ہے : [[arabic: قَدْ قَامَتِ الصَّلوة]] اُدھر اس نے حَيَّ عَلَی الْفَلَاح کہا کہ آؤ مراد پانے کو جماعت کھڑی ہوئی، اس نے کہا: [[arabic: قَدْ قَامَتِ الصَّلوةُ]] ، جماعت قائم ہوگئی ، ( فتاوی رضویہ، ج: 5، ص: 421)۔
مزید لکھتے ہیں :
اگر امام تکبیر ہوتے میں چلا تو اُسے بیٹھنے کی بھی حاجت نہیں ، مصلے پر جائے اور حی علی الفلاح یاختم تکبیر پر تکبیر تحریمہ کہے، یونہی بعد خطبہ اسے اختیار ہے، کہیں منقول نہیں کہ خطبہ فرما کر تکبیر ہونے تک جلوس فرماتے ، یہ حکم قوم کے لیے ہے۔
(فتاوی رضویہ، ج: 5، ص : 419)
آپ سے پوچھا گیا: ”’زید کہتا ہے کہ امام اور مقتدی بیٹھ کر تکبیر سنیں الخ“ ، آپ اس کے جواب میں لکھتے ہیں:
مقتدیوں کو حکم یہ ہے کہ تکبیر بیٹھ کر سنیں ، جب مکبر حَى عَلَى الفلاح پر پہنچے تو اس وقت کھڑے ہوں، (فتاوی رضویہ ، ج 5، ص : 422)۔

[[heading: رمضان میں عشاء کی نماز تنہا پڑھنے والے شخص کی وتر کی جماعت میں شمولیت کا جواز]]

ماہ رمضان میں تنہا عشاء کے فرض پڑھنے والے شخص کے لیے وتر کی جماعت میں شامل ہونے کا مسئلہ فقہائے احناف کے مابین مختلف فیہ ہے اور یہ نزاع اور اختلاف بھی محض اولویت اور غیر اولویت کے اعتبار سے ہے، یعنی اختلاف محض اس بات میں ہے کہ تنہا عشاء کے فرض پڑھنے والے کے لیے آیا وتر کی جماعت میں شامل ہونا اولی ہے یا خلاف`
},
{
  pageNumber: 102,
  text: `اولی ہے اور بطور عادت ہو تو زیادہ سے زیادہ کراہت تنزیہی کا قول کیا جا سکتا ہے، بلکہ خود ماہ رمضان میں جماعت کے ساتھ وتر پڑھنے کی افضلیت وغیر افضلیت فقہاء احناف کے ما بین مختلف فیہ ہے، اگر چہ مفتی بہ قول یہ ہے کہ جماعت کے ساتھ وتر پڑھنا افضل ہے۔
اس مسئلہ کے متعلق ہم اپنی رائے ذکر کرنے سے پہلے اس بارے میں فقہاء احناف کی آراء اور اُن کے مابین اس اختلاف کی بنیاد اور وجہ پیش کرتے ہیں۔ الغرض فقہاء احناف کے مابین اس بارے میں اختلاف ہے کہ آیا ماہِ رمضان میں وتر کی جماعت ، عشاء کے فرضوں کے تابع ہے یا تراویح کے تابع ہے، یا یہ ان دونوں سے جدا اور علیحدہ مستقل جماعت ہے اور ماہ رمضان کے تابع ہے۔
قول اول: بعض فقہائے کرام کے نزدیک وتر کی جماعت تمام نمازیوں کے حق میں جماعت عشاء کے تابع ہے، لہذا جس نے کسی بھی وجہ سے عشاء کے فرض جماعت کے بغیر تنہا پڑھے ہوں ، وہ وتر کی نماز بھی تنہا پڑھے گا اور اُس کے لئے وتر کی جماعت میں شامل ہونا خلاف اولیٰ اور بطور عادت کراہت تنزیہی ہے اور اگر اُس نے عشاء کی فرض نماز جماعت کے ساتھ پڑھی ہو تو وہ با جماعت وتر پڑھ سکتا ہے، چاہے تو اُس امام کے ساتھ وتر کی جماعت میں شامل ہو جائے جس کی اقتدا میں عشاء کے فرض ادا کئے ہیں اور کسی دوسرے امام کی اقتدا میں بھی وتر پڑھ سکتا ہے۔ چنانچہ قہستانی کے حوالے سے علامہ شامی لکھتے ہیں کہ اُنہوں نے فرمایا : [[arabic: لٰكِنَّهُ إِذَا لَمْ يُصَلِّ الْفَرْضَ مَعَهُ لَا يَتْبَعُهُ فِي الْوِتْرِ]]
ترجمہ: ”لیکن اگر اُس نے امام کے ساتھ فرض نہ پڑھے ہوں تو وہ وتر میں اُس کا اتباع نہیں کرے گا۔
علامہ قہستانی کی عبارت کی تشریح کرتے ہوئے علامہ شامی رحمۃ اللہ علیہ لکھتے ہیں:
[[arabic: لٰكِنْ يَنْبَغِي أَنْ يَكُونَ قَوْلُ الْقُهُسْتَانِ مَعَهُ احْتَرَازًا عَنْ صَلَاتِهَا مُنْفَرِدًا ، أَمَّا لَوْ صَلَّا هَا جَمَاعَةً مَعَ غَيْرِهِ ثُمَّ صَلَّى الْوِتْرَ مَعَهُ لَا كَرَاهَةً]]`
},
{
  pageNumber: 103,
  text: `ترجمہ: لیکن علامہ قہستانی کا یہ کہنا کہ عشاء کے فرض امام کے ساتھ نہ پڑھے ہوں ، یہ اس کے تنہا عشاء کے فرض پڑھنے سے احتراز ہے، یعنی اگر کسی نے تنہا عشاء کے فرض پڑھے ہوں تو وتر کی نماز بھی تنہا پڑھے گا البتہ اگر اُس نے عشاء کے فرض کسی دوسرے امام کی اقتدا میں باجماعت پڑھے ہوں ، پھر اس نے اُس (دوسرے) امام کے ساتھ وتر کی نماز پڑھی تو یہ مکروہ نہیں ہے، (رد المحتار، ج 2، ص:48)۔ یعنی کسی کراہیت کے بغیر وتر کی جماعت میں شامل ہونے کے لیے بہر حال جماعت کے ساتھ عشاء کی نماز پڑھنا ضروری ہے، خواہ اُسی امام کے پیچھے عشاء کی نماز پڑھی ہو جس کے ساتھ جماعت وتر میں شامل ہو رہا ہے یا کسی اور امام کی اقتدا میں پڑھی ہو۔
ہمارے بعض متاخرین اکابر فقہائے کرام نے اسی رائے پر عمل کرتے ہوئے ماہِ رمضان میں تنہا عشاء کے فرض پڑھنے والے شخص کو وتر کی جماعت میں شامل ہونے سے منع فرمایا ہے، چنانچہ امام اہلسنت امام احمد رضا قادری قُدِّسَ سِرُّهُ الْعَزِیز فرماتے ہیں:
[[arabic: مَنْ صَلَّى الْفَرْضَ بِجَمَاعَةٍ يَجُوزُ لَهُ الدُّخُولُ فِي جَمَاعَةٍ سَوَاءٌ صَلَّى الْقَرْضَ خَلْفَ هُذَا الْإِمَامِ أَوْ خَلْفَ غَيْرِهِ وَسَوَاءٌ صَلَّى التَّرَاوِيحَ وَحْدَةً أَوْ خَلْفَ هُذَا الْإِمَامِ أَوْ خَلْفَ غَيْرِه بَلْ وَمَن لَّمْ يُصَلِّهَا رَأْسًا - - - إلى قَوْلِهِ - - - فَإِنَّ مَنْ صَلَّى الْفَرِيضَةَ مُنْفَرِدًا لَيْسَ لَهُ أن يَدْخُلَ فِي جَمَاعَةِ الْوِتْرِ لَا مَعَ هَذَا الْإِمَامِ وَلَا مَعَ غَيْرِهِ]]
ترجمہ: ”جس نے عشاء کے فرض جماعت کے ساتھ پڑھے ہوں تو اُس کے لیے جماعت (وتر) میں داخل ہونا جائز ہے، خواہ اُس نے فرض اس امام کے پیچھے پڑھے ہوں یا کسی دوسرے امام کے پیچھے اور خواہ اس نے تراویح تنہا پڑھی ہوں یا اُس امام کی اقتداء میں (جس کے ساتھ جماعت وتر میں شامل ہونا چاہتا ہے ) یا کسی اور امام کی اقتدا میں تراویح پڑھی ہوں، بلکہ اگر سرے سے تراویح پڑھی ہی نہ ہوں تب بھی (مذکورہ بالا صورت میں ) وہ جماعت کے ساتھ وتر پڑھ سکتا ہے اور جس نے عشاء کے فرض تنہا پڑھے ہوں اُس کے لیے وتر کی جماعت میں شامل نہیں ہونا چاہیے، نہ تو اس امام کے ساتھ (جس کی اقتدا میں تراویح پڑھی ہے ) اور نہ کسی دوسرے امام کے ساتھ، (جِدُّ الْمُمْتَار: ج 3 ص:493)۔`
},
{
  pageNumber: 104,
  text: `صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ نے لکھا ہے :
اگر عشاء جماعت سے پڑھی اور تراویح تنہا، تو وتر کی جماعت میں شریک ہو سکتا ہے اور اگر عشاء تنہا پڑھ لی اگر چه تراویح با جماعت پڑھی تو وتر تنہا پڑھے۔
(بہار شریعت ، جلد : 1 ، ص : 693)
قول دوم: اس کے برعکس بعض فقہائے کرام نے کہا ہے کہ جماعت وتر ، جماعت تراویح کے تابع ہے، لہذا اگر کسی نے جماعت کے ساتھ تراویح نہ پڑھی ہو تو اس قول کی روشنی میں وہ وتر کی جماعت میں شامل نہیں ہو سکتا ، بلکہ وہ وتر تنہا پڑھے۔
علامہ حلبی رحمۃ اللہ علیہ شرح صغیر میں لکھتے ہیں :
[[arabic: إِذَا لَمْ يُصَلِّ الْفَرْضَ مَعَ الْإِمَامِ، قِيلَ : لا يَتْبَعُهُ فِي التَّرَاوِيحِ وَلَا فِي الْوِتْرِ وَكَذَا إِذَا لَمْ يُصَلِّ مَعَهُ التَّرَاوِيحَ لَا يَتْبَعُهُ فِي الْوِتْرِ]]
ترجمہ: اگر امام کے ساتھ فرض نہ پڑھے ہوں، تو کہا گیا ہے کہ وہ نہ تو تراویح میں امام کی اقتدا کرے اور نہ ہی وتر میں، اسی طرح اگر امام کی اقتدا میں صرف تراویح نہ پڑھی ہوں تو اس کی اقتداء میں وتر نہ پڑھے، (صغیری ، صلاة التراويح، فروع مَنْ فَاتَتْهُ تَرْوِيحَةٌ : ص 210)
علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: فِي التَّنَارُ خَانِيَّةِ عَنِ التَّنِيَّةِ أَنَّهُ سُبِلَ عَلِيُّ بْنُ أَحْمَدَ عَمَّنْ صَلَّى الْفَرْضَ وَالتَّرَاوِيحَ وَحْدَةً أَوْ التَّرَاوِيحَ فَقَطْ ، هَلْ يُصَلِّي الْوِتْرَ مَعَ الْإِمَامِ ، فَقَالَ : لا]]
ترجمہ: "تتارخانیہ میں التتمہ کے حوالے سے منقول ہے کہ علی بن احمد سے اُس شخص کے بارے میں سوال کیا گیا جس نے فرض اور تراویح تنہا پڑھی ہوں یا صرف تراویح تنہا پڑھی ہوں، تو کیا وہ امام کے ساتھ وتر پڑھے گا ؟ انہوں نے فرمایا: نہیں۔
(رَدُّ الْمُحْتَار : ج:2 ، ص: 48)`
},
{
  pageNumber: 105,
  text: `قول سوم: علامہ عبد الرحمن آفندی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: وَلَوْ تَرَكُوا الْجَمَاعَةَ فِي الْفَرْضِ لَمْ يُصَلُّوا التَّرَاوِيحَ بِجَمَاعَةٍ وَلَوْ لَمْ يُصَلِّهَا مَعَ الْإِمَامِ صَلَّى الْوِتْرَ بِهِ لِأَنَّهُ تَابِعُ لِرَمَضَانَ وَعِنْدَ الْبَعْضِ لَا لِأَنَّهُ تَابِعُ لِلتَّرَاوِيحِ]]
ترجمہ: اور اگر لوگوں نے فرض میں جماعت کو ترک کر دیا ہو تو وہ تراویح جماعت کے ساتھ نہیں پڑھیں گے اور اگر کسی نمازی نے تراویح امام کے ساتھ نہ پڑھی ہوں، تو وہ وتر اُس کے ساتھ پڑھ لے، کیونکہ وتر رمضان کے تابع ہیں اور بعض کے نزدیک نہ پڑھے کیونکہ وتر کی جماعت تراویح کے تابع ہے، (مَجْمَعُ الْأَنْهُر: ج: 1، ص 136 ) ۔
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں :
صحیح یہ ہے کہ نفس وتر اگر چہ عشاء کے تابع ہیں لیکن وتر کی جماعت کا مسنون ہونا تراویح کی جماعت کے سنت ہونے کے تابع ہے، کیونکہ اگر وتر جماعت عشاء کے تابع ہوتے تو سارا سال وتر جماعت کے ساتھ مسنون ہوتے ، کیونکہ عشاء کی نماز میں جماعت سارا سال مسنون ہے اور چونکہ وتر کی جماعت صرف رمضان میں مسنون ہے، اس سے معلوم ہوا کہ وتر کی جماعت کا سنت ہونا تراویح کی جماعت کے سنت ہونے کے تابع ہے۔
مزید لکھتے ہیں : علامہ ابن عابدین شامی رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: الَّذِي يَظْهَرُ أَنَّ جَمَاعَةَ الْوِتْرِ تَبَعْ لِجَمَاعَةِ التَّرَاوِيحِ وَإِنْ كَانَ الْوِتْرُ نَفْسُهُ أَصْلًا فِي ذَاتِهِ لِأَنَّ سُنَّةَ الْجَمَاعَةِ فِي الْوِتْرِ إِنَّمَا عُرِفَتْ بِالْأَثَرِ تَابِعَةٌ لِلتَّرَاوِيحِ]]
ترجمہ: ” ظاہر بات یہ ہے کہ ( جماعت کے حق میں ) وتر کی جماعت تراویح کی جماعت کے تابع ہے، اگر چہ وتر بذاتہ اصل ہے لیکن (ماہِ رمضان میں ) وتر کی جماعت کا سنت ہونا آثار (صحابہ) کی روشنی میں تراویح کے تابع ہے۔
(رَدُّ الْمُحْتَارِ عَلَى الدُّرِّ الْمُخْتَارِ، ج:2 ، ص: 436، بیروت)
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ کا وتر کی جماعت کے سنت ہونے کو تراویح کی جماعت کے سنت ہونے کے تابع قرار دینے پر علامہ ابن عابدین شامی کی اس عبارت سے`
},
{
  pageNumber: 106,
  text: `استدلال محل نظر ہے، اس لیے کہ علامہ ابن عابدین شامی نے وتر کی جماعت کی تابعیت کو فقط جماعت عشاء میں محصور نہیں کیا، بلکہ وہ فرماتے ہیں کہ جماعت و تر بیک وقت جماعت عشاء و جماعت تراویح اور ماہ رمضان کے تابع ہے ۔ البتہ وتر کی جماعت کا فرضِ عشاء کی جماعت کے تابع ہونا ہر ایک کے حق میں ہے اور اس کا تراویح کے تابع ہونا فقط جماعت کے حق میں ہے، منفرد کے حق میں نہیں ہے، چنانچہ انہوں نے اپنی مذکورہ بالا عبارت میں اسی کو بیان فرمایا ہے۔ علامہ ابن عابدین نے منفرد کے حق میں اس بات کی تصریح فرمائی ہے کہ اُس کے لئے نماز وتر نماز تراویح کے تابع نہیں ہے، سو ہماری نظر میں اس عبارت کا مستفاد یہ ہے کہ اگر کسی مقام پر سب لوگوں نے تراویح کی نماز با جماعت نہیں پڑھی تو وہ وتر بھی با جماعت نہیں پڑھیں گے لیکن اگر اکثر نے نماز تراویح با جماعت پڑھ لی ہے یا کسی مسجد میں باجماعت تراویح ہو چکی ہے اور کسی ایک شخص یا چند اشخاص نے تراویح با جماعت نہیں پڑھیں ، تو وہ وتر کی جماعت میں شریک ہو سکتے ہیں، چنانچہ تنویر الابصار مع الدر المختار میں ہے:
[[arabic: لأَنَّ جَمَاعَتَهَا تَبَعْ لِجَمَاعَةِ الْفَرْضِ ، فَإِنَّهَا لَمْ تَقُمْ إِلَّا بِجَمَاعَةِ الْفَرْضِ، فَلَوْ أُقِيمَتْ بِجَمَاعَةٍ وَحْدَهَا كَانَتْ مُخَالِفَةٌ لِلْوَارِ دِ فِيهَا فَلَمْ تَكُنْ مَشْرُوعَةً ؛ أَمَّا لَوْ صُلِيَتْ بِجَمَاعَةِ الْفَرْضِ وَكَانَ رَجُلٌ قَدْ صَلَّى الْفَرْضَ وَحْدَهُ ، فَلَهُ أَنْ يُصَلِّيَهَا مَعَ ذَلِكَ الْإِمَامِ لأَنَّ جَمَاعَتَهُمْ مَشْرُوعَةٌ فَلَهُ الدُّخُولُ فِيهَا مَعَهُمْ لِعَدَمِ الْمَحْذُورِ]]
ترجمہ: ” کیونکہ تراویح کی جماعت فرض کی جماعت کے تابع ہے، اس لیے کہ تراویح کی جماعت فرض کی جماعت کے ساتھ ہی قائم ہوئی ہے، پس اگر ایک جماعت نے اکیلے اکیلے نماز تراویح پڑھ لی تو (چونکہ ) یہ اس بارے میں وارد ہونے والے آثار کی مخالفت ہوگی، لہذا اسے جائز قرار نہیں دیا جائے گا۔ البتہ اگر تراویح کی نماز فرض عشاء کی جماعت کے ساتھ پڑھ لی گئی اور کوئی ایسا شخص ہے جس نے فرض تنہا پڑھے ہیں تو اُس کے لیے امام کے ساتھ تراویح پڑھنا جائز ہے، اس لیے کہ تراویح کی جماعت بحیثیت مجموعی مشروع ہے،`
},

  {
    pageNumber: 107,
    text: `لہذا اس کے لیے اُن کے ساتھ جماعت میں داخل ہونا جائز ہے، کیونکہ اس سے کوئی مانع نہیں پایا جاتا ، (رد الْمُحْتَار: ج:2 ، ص: 48)۔
تنویر الابصار مع الدر المختار میں ہے:
[[arabic: وَلَوْ لَمْ يُصَلِّهَا أَي التَّرَاوِيحَ بِالْإِمَامِ أَوْ صَلَّاهَا مَعَ غَيْرِهِ لَهُ أَنْ تُصَلِّيَ الْوِتْرَ مَعَهُ ، بَقِيَ لَوْ تَرَكَهَا الْكُلُّ ، هَلْ يُصَلُّونَ الْوِتْرَ بِجَمَاعَةِ ، فَلْيُرَا جَع]]
ترجمہ: اور اگر اُس نے تراویح امام کے ساتھ نہیں پڑھیں یا کسی اور امام کے ساتھ پڑھی ہیں تو وہ وتر امام کے ساتھ باجماعت پڑھ سکتا ہے ( کیونکہ اس کے حق میں وتر کی جماعت تراویح کی جماعت کے تابع نہیں اور مطلقاً تراویح کی جماعت ادا ہو چکی ہے ) ، باقی یہ صورت رہ جاتی ہے کہ اگر (کسی مقام پر ) تمام لوگوں نے تراویح کی جماعت کو ترک کر دیا ہو ( کیونکہ یہ سنتِ متوارثہ کا ترک ہے ) تو کیا وہ جماعت کے ساتھ وتر پڑھیں گے؟ تو اس کی بابت ( ماخذ فقہ سے ) رجوع کیا جائے (اس کی تشریح علامہ شامی کے حوالے سے گزر چکی ہے کہ اس صورت میں وہ سب وتر با جماعت نہیں پڑھیں گے )۔
(رد الْمُحْتار ، جلد 2 ، ص : 436، بیروت)
قول چہارم : بعض فقہائے کرام کے نزدیک ماہِ رمضان میں وتر کی جماعت نہ تو جماعت تراویح کے تابع ہے اور نہ ہی عشاء کی جماعت کے تابع ، بلکہ یہ مستقل نماز ہے اور اس کی جماعت ماه رمضان کے تابع ہے ، اس تعلیل کی روشنی میں عشاء کے فرض تنہا پڑھنے والے کے لیے وتر کی جماعت میں شامل ہونے کا جواز ثابت ہوتا ہے، یہ علامہ طحطاوی اور علامہ حلبی کا مذہب ہے۔
چنانچہ امام اہلسنت امام احمد رضا قُدِّسَ سِرُّهُ الْعَزِیز لکھتے ہیں :
[[arabic: أَمَّا مَا ذَكَرُوا أَنَّ جَمَاعَةَ الْوِتْرِ هَلْ هِيَ تَبَعَ لِجِمَاعَةِ التَّرَاوِيحِ أَمْ لَا ، جَنَحَ الْفَاضِلَانِ الْحَلَبِيُّ وَالطَّحْطَاوِي فِي حَوَاشِي الدُّرِّ إِلَى الثَّانِي وَاسْتَظْهَرَ الشَّامِيُّ أَوَّلا]]
ترجمہ : ” رہی یہ بات جو فقہاء نے ذکر کی ہے کہ وتر کی جماعت آیا تراویح کی جماعت کے`
  },
  {
    pageNumber: 108,
    text: `تابع ہے یا نہیں ! تو فاضلان گرامی علامہ حلبی اور علامہ طحطاوی نے در مختار کے حاشیہ میں روسری شق (یعنی جماعت وتر جماعت تراویح کے تابع نہیں ہے کی طرف اور علامہ شامی نے پہلی شق (یعنی جماعت وتر جماعت تراویح کے تابع ہے ) کو ترجیح دی ہے۔
( جِدُّ الْمُمْتَار: ج 3 ص : 496)
چنانچہ علامہ طحطاوی نے در مختار پر تحریر کردہ اپنے حاشیہ میں اس صورت (یعنی اگر تمام لوگ با جماعت تراویح کو ترک کر دیں تو آیا وہ وتر جماعت کے ساتھ پڑھیں گے یا نہیں) کے بارے میں علامہ علاء الدین حصکفی کا یہ قول نقل کیا : فَلْيُرَاجَعْ، یعنی اس کی بابت تاخذ فقہ کی طرف رجوع کر لیا جائے ، علامہ شامی نے تو منع لکھا ہے، لیکن علامہ طحطاوی اس پر تفریح فرماتے ہیں:
[[arabic: قَضِيَّةَ التَّعْلِيلِ فِي الْمَسْئَلَةِ السَّابِقَةِ بِقَوْلِهِمْ: لِأَنَّهَا تَبَعْ ، أَنْ يُصَلِّيَ الْوِتْرَ بِجَمَاعَةِ في هَذِهِ الصُّورَةِ، لِأَنَّهَا لَيْسَ بِتَبَعَ لِلتَّرَاوِيحِ وَلَا لِلْعِشَاءِ عِنْدَ الْإِمَامِ رَحِمَهُ اللهُ تعالى]]
ترجمہ: سابقہ مسئلہ میں (علامہ حصکفی کا ) اپنے اس قول لانها تبع سے بیان کردہ علت کا تقاضا یہ ہے کہ اس صورت میں وتر کی نماز جماعت کے ساتھ پڑھی جائے، کیونکہ نماز وتر امام ابوحنیفہ رحمۃ اللہ علیہ کے نزدیک نہ تو تراویح کے تابع ہے اور نہ ہی فرض عشاء کے تابع، (حاشیة الطحطاوي: ج 1 ، ص : 297)، یعنی علامہ حصکفی نے فرض کی جماعت ترک کرنے والے کے لیے تراویح کی جماعت میں شامل ہونے کے جواز کی علت چونکہ یہ بیان کی ہے کہ تراویح کی جماعت عشاء کی جماعت کے تابع ہے، لہذا اس تعلیل سے یہ معلوم ہوا کہ اگر تمام لوگ تراویح کو ترک کر دیں تو وہ با جماعت وتر پڑھ سکتے ہیں، کیونکہ نماز وتر مستقل نماز ہے یہ نہ تو عشاء کے تابع ہے اور نہ ہی تروایح کے تابع ۔
علامه طحطاوی کے اس کلام کی روشنی میں تنہا فرض پڑھنے والے کے لیے کراہت کے بغیر وتر کی جماعت میں شامل ہونے کا جواز بھی ثابت ہوتا ہے، کیونکہ جب اصل یعنی`
  },
  {
    pageNumber: 109,
    text: `جماعت فرض کو چھوڑنے والا تابع یعنی جماعت تراویح میں شامل ہو سکتا ہے، تو اُس کے لیے وتر کی جماعت میں شامل ہونا بطریق اولی جائز ہوگا، کیونکہ وہ تو مستقل اور علیحدہ نماز ہے، نہ وہ فرض کے تابع ہے اور نہ ہی تراویح کے۔
علامہ حلبی رحمۃ اللہ علیہ شرح صغیر میں لکھتے ہیں :
[[arabic: إِذَا لَمْ يُصَلِّ الْفَرْضَ مَعَ الْإِمَامِ، قِيلَ : لا يَتْبَعُهُ فِي التَّرَاوِيحِ وَلَا فِي الْوِتْرِ وَكَذَا إِذَا لَمْ يُصَلِّ مَعَهُ التَّرَاوِيحَ لَا يَتْبَعُهُ فِي الْوِتْرِ، وَالصَّحِيحُ أَنَّهُ يَجُوزُ أَن يَتْبَعَهُ فِي ذَلِكَ كُلِّهِ حَتَّى لَوْ دَخَلَ بَعْدَ مَا صَلَّى الاِمَامُ الْفَرْضَ وَشَرَعَ فِي التَّراوِيحِ فَإِنَّهُ يُصَلِّيِّ الْقَرْضَ أَوَّلًا وَحْدَهُ ثُمَّ يُتَابِعُهُ فِي التَّرَاوِيحِ ، وَفِي الْقُنْيَةِ لَوْ تَرَكُوا الْجَمَاعَةَ فِي الْقَرْضِ لَيْسَ لَهُمْ أَنْ يُصَلُّوا التَّرَاوِيحَ جَمَاعَةً]]
ترجمہ: ”اگر کسی نے امام کے ساتھ فرض نہ پڑھے ہوں ، تو کہا گیا ہے کہ پھر امام کی اقتدا میں نہ تراویح پڑھے نہ وتر ، اسی طرح اگر امام کی اقتداء میں صرف تراویح نہ پڑھی ہوں تو اس کی اقتداء میں وتر نہ پڑھے اور صحیح یہ ہے کہ ان سب میں امام کی اقتدا کرے گا حتی کہ اگر کوئی شخص اس وقت داخل ہوا جب امام فرض پڑھا کر تراویح شروع کر چکا تھا تو وہ پہلے تنہا فرض پڑھے گا اور پھر تراویح میں اس کا اتباع کرے گا۔ اور ” القنیة“ میں ہے: اگر تمام لوگوں نے فرض عشاء کی جماعت کو ترک کر دیا تو اُن کے لیے جماعت کے ساتھ تراویح پڑھنا جائز نہیں ہے، (صغیری ، صلاة التراویح ، فروع مَنْ فَاتَتْهُ تَرْوِيحَةٌ : ص: 210)۔ یعنی یہ عدم جواز تنها جماعت فرض کے تارک کے لیے نہیں ہے۔
نیز علامہ عبدالرحمن آفندی نے صراحت کی ہے کہ ماہ رمضان میں وتر کی جماعت کا تراویح کی جماعت کے تابع ہونا فقہائے کرام کے نزدیک مختلف فیہ ہے، کیونکہ بعض فقہائے کرام کے نزدیک وتر کی جماعت محض ماہِ رمضان کے تابع ہے ، چنانچہ وہ لکھتے ہیں :
[[arabic: وَلَوْ تَرَكُوا الْجَمَاعَةَ فِي الْفَرْضِ لَمْ يُصَلُّوا التَّرَاوِيحَ بِجَمَاعَةٍ وَلَوْ لَمْ يُصَلِّهَا مَعَ الْإِمَامِ صَلَّى الْوِتْرَ بِهِ لِأَنَّهُ تَابِعُ لِرَمَضَانَ وَعِنْدَ الْبَعْضِ لَا لِأَنَّهُ تَابِعُ لِلتَّرَاوِيحِ]]`
  },
  {
    pageNumber: 110,
    text: `ترجمہ : اور اگر کسی مقام پر سب نے فرض کی جماعت کو ترک کر دیا تو وہ تراویح بھی جماعت کے ساتھ نہیں پڑھیں گے اور اگر کسی نے تراویح امام کے ساتھ نہ پڑھی ہوں تو وہ وتر اُس کے ساتھ پڑھے گا کیونکہ وتر رمضان کے تابع ہے اور بعض کے نزدیک نہیں پڑھے گا، کیونکہ وتر کی جماعت تراویح کی جماعت کے تابع ہے ، (مَجْمَعُ الْأَنْهُر: ج: 1، ص: 136)۔ اس سے بھی وہی بات ثابت ہوتی ہے کہ تنہا فرض پڑھنے والے کے لیے جماعت وتر میں شامل ہونا بلا کراہت جائز ہے۔
نیز فقہائے کرام نے ذکر کیا ہے کہ اگر عشاء کے فرض نماز تراویح اور وتر پڑھنے کے بعد یہ معلوم ہوا کہ امام نے عشاء کے فرض طہارت کے بغیر ادا کیے تھے جبکہ تراویح اور وتر کی نماز طہارت کے ساتھ ادا کی تھی ، تو عشاء کے فرضوں کے ساتھ ساتھ تراویح کا بھی اعادہ لازم ہوگا، لیکن وتر کا اعادہ لازم نہیں ہوگا۔ اس سے بھی یہی بات ثابت ہوتی ہے کہ وتر کی جماعت نہ تو عشاء کے فرضوں کے تابع ہے اور نہ تراویح کے تابع ، کیونکہ اگر یہ ان میں سے کسی ایک کے تابع ہوتی تو جس طرح اصل یعنی عشاء یا تراویح کا اعادہ لازم ہوا ہے، وتر کا اعادہ بھی لازم ہوتا لیکن وتر کا اعادہ لازم نہیں ہے ۔ اس سے معلوم ہوتا ہے کہ وتر کی جماعت مستقل بالذات ہے، فرض یا تراویح کی جماعت کے تابع نہیں ہے۔
چنانچہ علامہ زیلعی حنفی رحمۃ اللہ علیہ فرماتے ہیں:
[[arabic: وَهُوَ مَا بَعْدَ الْعِشَاءِ إِلَى طُلُوعِ الْفَجْرِ ، قَبْلَ الْوِتْرِ وَبَعْدَهُ ، كَمَا ذُكِرَ فِي الْمُخْتَصَرِ حَتَّى لَوْ تَبَيَّنَ أَنَّ الْعِشَاءَ صَلَّوْهَا بِلَا طَهَارَةِ دُونَ التَّرَاوِيحِ وَالْوِتْرِ ، أَعَادُوا التَّرَاوِيحَ مَعَ الْعِشَاءِ دُونَ الْوِتْرِ عِنْدَ أَبِي حَنِيفَةَ، لِأَنَّهَا تَبَعْ لِلْعِشَاءِ]]
ترجمہ : تراویح کا وقت عشاء کے بعد سے لیکر طلوع فجر تک ہے، وتر سے پہلے بھی (تراویح پڑھ سکتے ہیں) اور اُس کے بعد بھی، جیسا کہ مختصر میں مذکور ہے حتی کہ اگر یہ بات ظاہر ہوئی کہ لوگوں نے عشاء کی نماز طہارت کے بغیر پڑھی تھی لیکن تروایح اور وتر طہارت کے ساتھ پڑھے تھے، تو امام ابو حنیفہ کے نزدیک وہ عشاء کے ساتھ تراویح کا اعادہ کریں گے،`
  },
  {
    pageNumber: 111,
    text: `وتر کا اعادہ نہیں کریں گے، اس لیے کہ تراویح عشاء کے تابع ہے (اور وتر مستقل نماز ہے)۔ (تبیین الحقائق : ج 1 ص : 178)
علامہ عبد الرحمن آفندی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: وَقْتُ التَّرَاوِيحِ بَعْدَ صَلَاةِ الْعِشَاءِ إِلَى آخِرِ اللَّيْلِ لِأَنَّهَا تَبَعْ لِلْعِشَاءِ دُونَ الْوِتْرِ حَتَّى لَوْ ظَهَرَ أَنَّ الْعِشَاءَ صُلِّيَتْ بِلَا طَهَارَةِ وَالتَّرَاوِيحَ بِطَهَارَةِ أُعِيدَتِ التَّرَاوِيحُ مَعَ الْعِشَاءِ، لَا الْوِتْرُ عِنْدَ الْإِمَامِ]]
ترجمه: تراویح کا وقت عشاء کی نماز کے بعد سے لیکر رات کے آخر تک ہے، کیونکہ وہ عشاء کے تابع ہے نہ کہ وتر کے حتی کہ اگر یہ بات معلوم ہوئی کہ عشاء کی نماز طہارت کے بغیر اور تراویح طہارت کے ساتھ پڑھی گئی ہے، تو امام ابو حنیفہ کے نزدیک عشاء کے ساتھ تراویح کا اعادہ کیا جائے ، نہ کہ وتر کا ، ( مَجْمَعُ الأَنْهُر : ج : 1 ص136)‘ ۔ کیونکہ تراویح کی جماعت فرض عشاء کی جماعت کے تابع ہے، جبکہ وتر اس کے تابع نہیں ہے۔
علامہ نظام الدین حنفی رحمۃ اللہ علیہ لکھتے ہیں :
[[arabic: وَالصَّحِيحُ أَنَّ وَقْتَهَا مَا بَعْدَ الْعِشَاءِ إِلَى طُلُوعِ الْفَجْرِ قَبْلَ الْوِتْرِ وَ بَعْدَةً حَتَّى لَوْ تَبَيَّنَ أَنَّ الْعِشَاءَ صَلَّاهَا بِلَا طَهَارَةٍ دُونَ التَّرَاوِيحِ وَالْوِتْرِ أَعَادَ التَّرَاوِيحَ مَعَ الْعِشَاءِ دُونَ الْوِتْرِ، لِأَنَّهَا تَبَعَ لِلْعِشَاءِ ، هَذَا عِنْدَ أَبِي حَنِيفَةَ رَحِمَهُ اللَّهُ تَعَالَى فَإِنَّ الْوِتْرَ غَيْرُ تَابِعَ لِلْعِشَاءِ فِي الْوَقْتِ عِنْدَهُ ، وَالتَّقْدِيمُ إِنَّمَا وَجَبَ لِأَجْلِ التَّرْتِيبِ وَذَلِكَ يَسْقُطُ بِعُذْرِ النِّسْيَانِ فَيَصِرُّ إِذَا أَذًى قَبْلَ الْعِشَاءِ بِالنِّسْيَانِ بِخِلَافِ التَّرَاوِيحِ فَإِنَّ وَقْتَهَا بَعْدَ أَدَاءِ الْعِشَاءِ فَلَا يُعْتَدُّ بِمَا أُدِّيَ قَبْلَ الْعِشَاءِ]]
ترجمہ: صحیح یہ ہے کہ تراویح کا وقت عشاء کی نماز کے بعد سے لیکر طلوع فجر تک ہے ، وتر پہلے بھی اور بعد بھی حتی کہ اگر یہ بات ظاہر ہوئی کہ عشاء کی نماز طہارت کے بغیر پڑھی تھی لیکن تروایح اور وتر طہارت کے ساتھ پڑھے تھے، تو عشاء کے ساتھ تراویح کا اعادہ`
  },
  {
    pageNumber: 112,
    text: `کریں گے نہ کہ وتر کا ، اس لیے کہ تراویح عشاء کے تابع ہے۔ یہ امام ابو حنیفہ کا مذہب ہے، کیونکہ اُن کے نزدیک وقت کے اندر وتر کی نماز عشاء کی نماز کے تابع نہیں ہیں اور عشاء کی نماز کو وتر پر ترتیب کی وجہ سے مقدم کرنا واجب ہے اور وہ نسیان کے عذر کی وجہ سے ساقط ہو جاتا ہے، پس اگر کسی نے بھولے سے وتر کی نماز عشاء کے فرضوں سے پہلے پڑھ لی تو اس کی نماز صحیح ہے، بر خلاف تراویح کے، کہ اُن کا وقت عشاء کے فرض ادا کرنے کے بعد شروع ہوتا ہے، لہذا عشاء سے پہلے ادا کی گئی تراویح کا اعتبار نہیں کیا جائے گا۔
(فتاوی عالمگیری جلد 1 ، ص : 115 )
فقیه ملت علامہ ابوالخیر محمد نوراللہ نعیمی رحمۃ اللہ علیہ سے سوال ہوا: ”ایک مولانا رمضان المبارک میں فرض اکیلے پڑھنے والے کے لیے وتر کی جماعت میں شمولیت ناجائز بتاتے ہیں، میں نے صغیری کی عبارت پیش کی ، ساتھ ہی عالمگیری اور کبیری کا حوالہ دیا، مگر وہ اپنی تائید میں علامہ شامی کی عبارت پیش کرتے ہیں ، آپ سے رہنمائی چاہیے ۔ وہ جواب میں لکھتے ہیں : ” بلا شک وریب شامل ہو سکتا ہے کہ ایسی جماعت وتر بالا تفاق جائز و مشروع ہے اور جماعت جائز و مشروع کے ساتھ نماز ادا کرنا بہ حکم قرآن کریم جائز ہے، اس جماعت کے نمازی راکعین ہیں اور اللہ رب العالمین کا ارشاد ہے: [[arabic: وَارُ كَعُوا مَعَ الرَّاكِعِينَ]]” اور حدیث صحیح میں ہے: [[arabic: إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ]]“ اور یہ بھی ہے : [[arabic: فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَأَتِمُوا]]، (صحیح البخاری : 635,378)۔
وہ لکھتے ہیں: ”مذہب حنفیہ متون و شروح و فتاوی و حواشی بالاتفاق ماہِ رمضان میں علی الاطلاق وتر باجماعت کے جواز واستحباب سے گونج رہے ہیں ، حالانکہ اگر صرف متون میں ہی ہوتا اور شروح و فتاوی میں اس کے خلاف ہوتا ، تب بھی جائز رہتا کہ محققین نے تصریح فرمائی کہ مسئلہ متون ، مسئلۂ شروح و فتاوی سے مقدم ہوتا ہے۔ پھر انہوں نے علامہ ابن عابدین شامی رحمۃ اللہ علیہ کے حوالے سے ایک فقہی ضابطہ لکھا : [[arabic: أَنَّ مَا فِي الْبُتُونِ مُقَدَّمْ عَلَى مَا فِي الشُّرُوحِ وَمَا فِي الشُّرُوحِ مُقَدَّهُ عَلَى مَا فِي الْفَتَاوَى]]“۔`
  },
  {
    pageNumber: 113,
    text: `(رد المحتار علی الدر المختار ، ج:1 ، ص: 72 ، دار الفکر، بیروت )
اُس کے بعد وہ مزید بحث کرتے ہیں اور جن کتب فقہ کے ہم نے حوالہ جات دیے ہیں، اُن کا بھی ذکر کر کے لکھتے ہیں: ” بفضلہ وکرمہ اسی مختصر فتوے سے مہر نیم روز کی مانند واضح ہو گیا کہ صورتِ مذکورہ میں وہ شخص جماعت وتر میں شامل ہو سکتا ہے اور یہ شمول جائز وروا ہے، ( فتاوی نوریہ ، ج:1 ، ص: 563) علامہ محمد نوراللہ نعیمی رحمۃ اللہ علیہ کے اسی مقام پر اس موضوع پر مختلف سائلین کے جواب میں مزید فتاوی بھی موجود ہیں۔
فقہائے کرام کی مذکورہ بالا عبارات سے معلوم ہوا کہ جب نفس و تر نفس عشاء کے تابع نہیں ہیں، تو وتر کی جماعت بھی عشاء کی جماعت کے تابع نہیں ہوگی ۔ پس اگر چہ امام اہلسنت امام احمد رضا قادری اور حضرت صدر الشریعہ رحمہ اللہ علیہما نے علامہ ابن عابدین شامی رحمۃ اللہ علیہ کے قول کو راجح قرار دیتے ہوئے عشاء کی جماعت میں شریک نہ ہونے والے شخص کے لیے وتر کی جماعت میں عدم شرکت کو راجح اور اولی قرار دیا ہے۔ حالانکہ ایسے شخص کے لیے عشاء کی نماز تنہا پڑھ کر تراویح کی جماعت میں شامل ہونے کو جائز قرار دیا ہے ، جبکہ تراویح کی جماعت بالاتفاق فرض کی جماعت کے تابع ہے، اس کے برعکس وتر کی جماعت کا فرض عشاء کی جماعت کے تابع ہونا فقہائے احناف کے نزدیک متفق علیہ مسئلہ نہیں ہے، تو ہم فرض با جماعت نہ پڑھنے والے کے لیے وتر کی جماعت میں شامل ہونے کے جواز کا قول کریں گے تاکہ رمضان المبارک میں جماعت کی برکت اور اجر زائد سے محروم نہ رہیں ۔
فقیه ملت علامہ مفتی محمد نوراللہ نعیمی ، استاذ العلماء حضرت علامہ عطا محمد بندیالوی اور علامہ غلام رسول سعیدی رحمۃ اللہ علیہما اور علامہ مفتی محمد رفیق حسنی مُدَّ ظلهم نے بھی یہی موقف اختیار کیا ہے۔ تاہم اعلیٰ حضرت اور حضرت صدر الشریعہ رحمۃ اللہ علیہما ہمارے مسلمہ اکابر میں سے ہیں ، لہذا جو حضرات ان کے موقف کو اختیار کرنا چاہیں ، وہ ایسا کر سکتے ہیں، اس مسئلے کو راجح اور مرجوح کے درجے میں لیا جائے۔`
  },
  {
    pageNumber: 114,
    text: `تصدیقات مفتیان کرام:
نوٹ: راقم نے معاصرین میں سے اہلسنت و جماعت کے انتہائی ثقہ مفتی علامہ مفتی محمد ابراہیم قادری مُدَّ ظلهم کی خدمت میں یہ فتوی بھیجا تا کہ اگرہم سے کوئی فروگزاشت ہوگئی ہو تو اُس کی نشاندہی ہو جائے۔ میں حضرت قبلہ مفتی صاحب دامت برکاتہم کا شکرگزار ہوں کہ انہوں نے گہری نظر سے اس کا مطالعہ فرمایا بعض جگہ عربی عبارات کے ترجمے کو بہتر بنایا اور بعض جگہ کچھ لفظی تبدیلیاں تجویز فرمائیں ، میں نے بہ طیب خاطر اُن کی رائے کو قبول کر کے اس فتوے میں جذب کر لیا ہے، آخر میں وہ لکھتے ہیں :
” یہ فقیر اعلیٰ حضرت فاضل بریلوی رحمۃ اللہ علیہ کی رائے کو بہت وقیع سمجھتا ہے لیکن چونکہ جواز دوسری جانب بھی ہے اور اسی پر اس فقیر کا عمل ہے ، اس لیے اس مسئلے کو نزاع کا باعث نہیں بننا چاہیے، کیونکہ یہ اختلاف بھی اولویت اور غیر اولویت کے اعتبار سے ہے ، یعنی اختلاف محض اس بنا پر ہے کہ رمضان المبارک میں عشاء کے فرض تنہا پڑھنے والے کے لیے آیا وتر کی جماعت میں شامل ہونا اولی ہے یا خلاف اولی ، بھلا خلاف اولی کام بھی نا جائز ہو سکتا ہے۔
(2) حضرت علامہ مفتی محمد رفیق حسنی مد ظلهم :
ما شاء الله ! مفتی اعظم حضرت مولانا منیب الرحمن صاحب دامت برکاتہم العالیہ نے وتروں کی جماعت کے جواز پر مفصل فتوی تحریر فرمایا ہے ، الحمد للہ! میں اپنی کتاب رفیق الصائمین“ میں غالباً 1987 ء استاذ العرب والعجم استاذیم مولانا عطا محمد بندیالوی کی تحقیق کے حوالے سے جواز کا فتوی لکھ چکا ہوں ، مگر اس میں اجمال تھا اور حضرت مفتی صاحب نے تفصیل ذکر فرمادی، واللہ تعالیٰ اعلم ، (23 جولائی 2018ء)۔
(3) حضرت علامہ مفتی محمد جان نعیمی مد ظلهم :
فقیر نے حضرت العلام مفتی منیب الرحمن مدظلہ العالی (مفتی اعظم پاکستان) کا تحریر کردہ فتوی وتروں کی جماعت کے جواز پر اول سے آخر تک پڑھا، فقیر کا اتفاق ہے اور اسی قول کو مخادیم سندھ رحمہم اللہ تعالیٰ نے ترجیح دی ہے، [[arabic: وَاللهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ بِالصَّوَابِ]] وعلمه اتم واحکم، (30 جولائی 2018ء)
(4) حضرت علامہ مفتی محمد اکمل مدنی مد ظلهم :`
  },
  {
    pageNumber: 115,
    text: `[[arabic: بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ]]
راقم ، زیر بحث مسئلے میں قبلہ مفتی منیب الرحمن صاحب دامت فیو ہم سے نہ صرف مکمل اتفاق رکھتا ہے، بلکہ اس مذہب کے اختیار کرنے کو دین و عبادات کے سلسلے میں بے رغبتی سے بھر پور موجودہ ماحول کے پیش نظر، دوسرے موقف کے مقابلے میں انسب واولی گمان کرتا ہے۔ نیز عرصہ دراز سے خود بھی اس پر عامل اور اسی کی ترغیب دیتا ہے اور اس اختیار قول کی چند وجوہات ہیں :
(1) من جانب شرع نافذ کردہ ، عبادات اجتماعیہ کی حکمتوں پر غور کیا جائے تو بعد تکبر، رغبت نفوس، تنقید و گرفت خلق کے خوف کے باعث، عبادات پر حصول استقامت اور فضائے اتحاد و اتفاق قائم کرنا، جیسے امور سر فہرست نظر آئیں گے۔ چونکہ مذکورہ مسئلے میں، اختیار قول مرجوح کی صورت میں ان حکمتوں کا حصول واضح طور پر نظر آرہا ہے، لہذا اس کا اختیار کیا جانا ، انسب معلوم ہوتا ہے۔
(2) جماعت کی موافقت، شریعت اور اس کی اتباع میں اکابرین اسلام رضی اللہ عنہم کو ہمیشہ مطلوب ومحبوب، جب کہ اس کی مخالفت، معیوب و معتوب رہی ہے۔ قرآنِ عظیم میں [[arabic: وَارْكَعُوا مَعَ الرَّاكِعِينَ]]، حدیث میں رسول اکرم ﷺ کا منافقین کے جماعت سے پیچھے رہ جانے پر اظہار غضب ، فقہائے احناف رحمۃ اللہ علیہم کا صلوات مکتوبہ کی جماعت کے سلسلے میں ، 16 اقوال میں سے، واجب عین کا اختیار کرنا اور مسجد میں موجود مسلمان کے، آغاز وقت نماز کے بعد ، مسجد سے بلا عذر چلے جانے کو نا پسند فرمانا، اس کی نظائر صریحہ ہیں۔ چنانچہ وتر کے سلسلے میں اسی مزاج کی موافقت، انسب معلوم ہوتی ہے۔
(3) یہ دور عوام کی دین سے بے رغبتی کا دور ہے، چنانچہ بے حد ضروری ہے کہ جس طرح بھی ممکن ہو، انہیں مذہب اور مذہبی شخصیات کے قریب لایا جائے اور متنفر ہونے سے بچایا جائے ، چاہے وہ کسی مکروہ تنزیہی فعل کے ذریعے ہی کیوں نہ ہو۔ کیونکہ عند اتحقیق فعل مکروہ تنزیہی ، گناہ نہیں، چاہے اس کی عادت ہی کیوں نہ قائم ہو جائے ۔`
  },
  {
    pageNumber: 116,
    text: `اعلیٰ حضرت رحمۃ اللہ علیہ فرماتے ہیں کہ جان لو جو کچھ پہلے گزر چکا ہے اور اس پر ہم نے جزم اور بھروسا کیا، وہ یہ ہے کہ مکروہ تنزیہی پرصغیرہ، کبیرہ کوئی گناہ نہیں اور اس سے بندہ کسی قسم کی سزا کا ستحق نہیں ہوتا ، نہ زیادہ کا اور نہی کم کا، یہی واضح حق ہے، جس سے علیحدگی اختیار نہیں کی جاسکتی اور معتمد علماء نے اس کی تصریح کی ہے۔ ردالمحتار کے باب الحظر میں اما المكروه كراهة تنزیہ کے تحت ہے کہ بالا تفاق حلت کے زیادہ قریب ہے، یعنی اس کے مرتکب کو بالکل عذاب نہیں ہوگا لیکن تارک کو کچھ نہ کچھ ثواب ملے گا۔
( جلد 4 ، ص : 505 ، رضا فاؤنڈیشن )
اور مکروہ تنزیہی فعل کے باعث لوگوں کے دین کی جانب مائل ہونے اور اس سے روکنے کے بارے میں فرمایا:
اور عوام کو اللہ عزوجل کے ایسے ذکر سے منع کرنا جو شرعا گناہ نہ ہو، محض بدخواہی عام مسلمین ہے اور اس کا مرتکب نہ ہوگا، مگر متقشف کہ مقاصد شرع سے جاہل و نا واقف ہو یا متصلف کہ مسلمانوں میں اختلاف ڈال کر اپنی رفعت و شہرت چاہتا ہو، بلکہ ائمہ ناصحین تو یہاں تک فرماتے ہیں کہ منع کرنا اُس منکر سے ضرور ہے جو بالا جماع حرام ہو، بلکہ تصریحیں فرمائیں کہ عوام اگر کسی طرح یاد خدا میں مشغول ہوں ، ہر گز منع نہ کیے جائیں، اگر چہ وہ طریقہ اپنے مذہب میں حرام ہو، مثلاً سورج نکلتے وقت نماز حرام ہے اور عوام پڑھتے ہوں تو نہ روکے جائیں کہ کسی طرح وہ خدا کا نام تو لیں، اسے سجدہ تو کریں ، اگرچہ کسی دوسرے مذہب پر اس کی صحت ہو سکے ، ( جلد 9 صفحہ : 141 ، رضا فاؤنڈیشن)۔
مذکورہ مسئلے میں وتر کی جماعت کا ترک ، شائد نماز وتر کی ادائیگی میں بے رغبتی کا سبب تو نہ بنے لیکن اس سلسلے میں تنفر ضرور مشاہدہ کیا گیا ہے اور ازالہ فساد، جلب مصالح سے بہتر ہے کے تحت، اس کے ازالے یا سد باب کے سلسلے میں، مکروہ تنزیہی فعل کے ارتکاب کی اجازت دینا، غالباً عین مزاج شرع کے موافق ہوگا۔`
  },
  {
    pageNumber: 117,
    text: `(۴) بدگمانی، نا اتفاقی قلبی و زبانی غیبت و غیر با امور سے بچنا اور مسجد جیسی مقدس و محترم جگہ کو، ان گناہوں سے یکسر پاک وصاف رکھنا بھی از حد ضروری ہے۔ اگر غور کیا جائے تو جماعت وتر میں شرکت سے روکنا، مذکورہ امور میں ابتلاء کا سبب بن سکتا ہے، بلکہ بنتے دیکھا بھی گیا ہے، خصوصاً ان مقامات پر جہاں، ایک امام نے عوام کو قول ثانی پر عمل کی اجازت دی تھی، لیکن جب امام تبدیل ہوا اور اس نے قول اول کے نفاذ میں مبالغے سے کام لینے کی کوشش کی۔ یونہی یورپی ممالک کی نئی نسل، اس طرح کے اختلافات سے سخت متنفر دیکھی گئی ہے۔
(۵) ہر نیا دور، دین سے دوری کے لحاظ سے پہلے سے بڑھ کر ہوتا ہے اور یہ علماء کی ذمہ داری ہے کہ اہلِ زمانہ کی بدلتی ہوئی کیفیات وعادات پر گہری نظر رکھتے ہوئے، بوقتِ ضرورت، سابقہ مسائل میں ضروری تبدیلی پیدا کریں۔ یہی وجہ ہے کہ کبھی ایک زمانے کا مفتی بہ قول کسی دوسرے زمانے میں ، ضرورت صحیحہ کی بنا پر، غیر مفتی بہ ہو جاتا ہے۔ ظاہر الرواایہ کے برخلاف، دیگر شرائط کے ساتھ ، فقط بشہوت چھونے سے حکم حرمت ابدیہ کا اجراء اور عاقلہ بالغہ کی جانب سے، بلا اجازت ولی غیر کفو میں کیے گئے نکاح کو موقف کے بجائے، غیر نافذ ماننا، اس کی بہترین مثالیں ہیں۔ بلکہ بعض مواقع پر قول امام اعظم رحمۃ اللہ علیہ ترک کر کے کسی دوسرے امام کے قول پر فتوی دینا بھی روا رکھا گیا ہے ۔ الہندا اعلیٰ حضرت رحمۃ اللہ علیہ بھی اکابرین رحمۃ اللہ علیہم کی اسی سنت پر عمل پیرا ر ہے۔ فتاوی رضویہ میں اس کی بکثرت امثلہ ملاحظہ کی جاسکتی ہیں۔ موقع کی مناسبت سے صرف ایک مثال پیش خدمت ہے۔ سابقہ ادوار میں جنازے کے ساتھ بلند آواز سے ذکر کو مکروہ لکھا گیا۔ لیکن دورِ اعلیٰ حضرت رحمۃ اللہ علیہ میں، جب اس کے بارے میں مسلمانوں کے عمل مخالف کو ذکر کر کے وضاحت طلب کی گئی ، تو آپ نے فرمایا:
ہاں کتب حنفیہ میں جنازے کے ساتھ ذکر جہر کو مکر وہ لکھا ہے، جس طرح خود نفس ذکر جہر کو بکثرت کتب حنفیہ میں مکروہ بتایا، حالانکہ وہ اطلاعات قرآن عظیم و احادیث حضور سید المرسلین ﷺ سے ثابت ہے اور عند اتحقیق کراہت کا عروض نظر بعوارض خارجہ غیر لازم ہے۔ جیسا کہ علامہ خیر الدین رحمۃ اللہ علیہ استاد صاحب در مختار وغیرہ محققین نے تحقیق فرمایا اور ہم نے اپنے فتوئی میں اسے مفتح کیا، یہاں`
  },

  {
    pageNumber: 118,
    text: `بھی اس کا منشاء عوارض ہی ہیں ۔ قلب ہمراہیاں کا مشوش ہونا، یادموت سے دوسری طرف توجہ کرنا۔ انصاف کیجیے تو یہ حکم اس زمان خیر کے لیے تھا، جبکہ ہمراہیان جنازہ تصور موت میں ایسے غرق ہوتے تھے کہ گویا میت ان میں ہر ایک کا خاص اپنا کوئی جگر پارہ ہے، بلکہ گو یا خود ہی میت ہیں، ہمیں کو جنازہ پر لیے جاتے ہیں اور اب قبر میں رکھیں گے، والہذا علماء نے سکوت محض کونا پسند کیا تھا کہ کلام اگر چہ ذکر ہی ہو، اگر چہ آہستہ ہو، اس تصور سے کہ ( بغایت نافع اور مفید اور برسوں کے زنگ دل سے دھو دینے والا ہے ) روکے گا یا کم از کم دل بٹ تو جائے گا، تو اس وقت محض خاموشی ہی مناسب تر ہے، ورنہ حاش الله ذکر خدا عز و جل و رسول ﷺ نہ کسی وقت منع ہے۔ اب کہ زمانہ منقلب ہوا، لوگ جنازہ کے ساتھ اور دفن کے وقت اور قبروں پر بیٹھ کر لغویات و فضولیات اور دنیوی تذکروں بلکہ خندہ ولہو میں مشغول ہوتے ہیں، تو انہیں ذکر خدا اور رسول عز وجل وصل ﷺ کی طرف مشغول کرنا ، عین صواب و کار ثواب ہے ، مع ہذا جنازہ کے ساتھ ذکر جہر کی کراہت میں اختلاف ہے کہ تحریمی ہے یا تنزیہی ہے اور ترجیح بھی مختلف آئی۔ قنیہ میں کراہت تنزیہ کو ترجیح دی اور اسی پر فتاوی تتمہ میں جزم فرمایا اور یہی تجرید مجتبی و حاوی و بحر الرائق وغیر ہا کے لفظ ینبغی کا مفاد ہے اور ترک اولی اصلاً گناہ نہیں ، [[arabic: كَمَا نَصُّوْا عَلَيْهِ وَحَقَّقْنَاهُ فِي جُمَل مجلية]] ( جیسا کہ علماء نے اس کی صراحت فرمائی اور ہم نے رسالے جمل مجلية [[arabic: أَنَّ الْمَكْرُوهَ تَنْزِيهَا لَيْسَ بِمَعْصِيَةِ]]“ میں اس کی تحقیق کی ہے )۔`
  },
  {
    pageNumber: 119,
    text: `(ج: 9 ، ص: 140.141 ، رضا فاؤنڈیشن )
چونکہ ہمارے زمانے میں علمی اختلافات سے ناواقف اور صحبت علماء سے محروم عوام الناس کے لیے جماعت وتر میں شرکت ، تنہا نماز پڑھنے سے افضل، فوائد کثیرہ کی حامل اور کئی نقصانات سے حفظ کا سبب بھی ہے، لہذا مکروہ تنزیہی ہونے کو نظر انداز کرتے ہوئے، اس کی اجازت دینا ہی بہتر وافضل گمان ہوتا ہے، واللہ اعلم بالصواب
(5) حضرت علامہ مولانا مفتی محمد اسماعیل نورانی زِيدَ مَجْدُه:
[[arabic: الْجَوَابُ حَقٌّ وَالْحَقُّ أَحَقُّ أَنْ يُتَّبَعَ]] ، (28 جولائی 2018ء)۔

[[heading: مقتدی کو سہو ہوا تو اس پر سجدہ سہو واجب نہیں ہے]]
سوال: 
مقتدی امام کے ساتھ تکبیر اولیٰ سے شامل تھا، مقتدی نے غلطی سے دوسری رکعت میں التحیات کے بعد درود ابراہیمی پڑھ لیا، جس کی وجہ سے اس پر سجدہ سہو واجب ہو گیا ، اب وہ سجدہ سہو کیسے کرے گا، کیونکہ وہ امام کے ساتھ پہلی رکعت سے شامل ہے اور کیا اس کی نماز سجدہ سہو کے بغیر مکمل ہو جائے گی؟ ، (محمد ناظم ، ظفر وال )۔
جواب:
اگر امام کی اقتدا میں نماز پڑھتے ہوئے مقتدی سے نماز میں سہو واقع ہو جائے، تو اُس پر سجدہ سہو نہیں ہے، حدیث پاک میں ہے:
[[arabic: إِنَّ الْإِمَامَ يَكْفِي مَنْ وَرَائَهُ ، فَإِنْ سَهَا الْإِمَامُ فَعَلَيْهِ سَجْدَنَا السَّهْوِ وَ عَلَى مَنْ وَرَاثَهُ أَنْ يَسْجُدُوا مَعَهُ وَإِنْ سَهَا أَحَدٌ مِّمَّنْ خَلْفَهُ فَلَيْسَ عَلَيْهِ أَنْ يَسْجُدَ، وَالْإِمَامُ يَكْفِيهِ]]۔
ترجمہ: بے شک امام اپنے مقتدیوں کو کفایت کرتا ہے، پس اگر امام سے سہو واقع ہو تو اس پر سہو کے دو سجدے لازم ہیں اور اس میں مقتدی اُس کی پیروی کریں گے ، جماعت میں شامل کسی مقتدی سے انفرادی طور پر سہو ہو تو اس پر سجدہ سہو لازم نہیں ہے، امام ( کی نماز کی صحت ) اس کے لیے کافی ہے، (السنن الكبرى للبيهقي : 3884)۔`
  },
  {
    pageNumber: 120,
    text: `مراقی الفلاح میں ہے:
[[arabic: قَالَ : الْإِمَامُ لَكُمْ ضَامِنْ يَرْفَعُ عَنْكُمْ سَهْوَكُمْ وَقِرَ انَتَكُمْ]]
ترجمہ: رسول الله ﷺ نے فرمایا : امام ( نماز کی صحت کے لیے ) تمہارا ضامن ہے، وہ`
  },
{
  pageNumber: 121,
  text: `تمہارے سہو اور قراء ت کی ذمہ داری کو پورا کرلیتاہے ،(حاشیہ طحطاوی علی مراقی الفلاح، جلد2،ص:64)‘‘۔
علامہ علاءالدین کاسانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَأَمَّاالْمُقْتَدِیْ إذَاسَہَا فِی صَلَاتِہٖ فَلَا سَہْوَعَلَیْہِ،لِأَنَّہٗ لَا یُمْکِنُہُ السُّجُودُ،لِأَنَّہٗ إنْ سَجَدَ قَبْلَ السَّلَامِ کَانَ مُخَالِفًا لِلْإِمَامِ، وَإِنْ أَخَّرَہٗ إلٰی مَابَعْدَسَلَامِ الْإِمَامِ یَخْرُجُ مِنَ الصَّلَاۃِ بِسَلَامِ الْإِمَامِ]]‘‘۔
ترجمہ:’’ پس اگر مقتدی نماز میں بھول جائے تواس پر سجدۂ سہو لازم نہیں ہے،کیونکہ اس کے لیے سجدہ کرنا ممکن نہیں ہے،اس لیے کہ مقتدی نے اگرامام کے سلام پھیرنے سے پہلے سجدۂ سہو کیا تو امام کی مخالفت ہوگی اور اگر امام کے سلام پھیرنے کے بعد سجدہ کیاتو وہ امام کے سلام پھیرتے ہی نماز سے نکل جاتا ہے،(بدائع الصنائع، جلد1،ص:260)‘‘۔

[[heading: مقتدیوں کا بھول کر سلام پھیرنا]]
سوال: 
جس نمازی کی ایک یا چند رکعات جماعت سے رہ گئی ہوں اور وہ امام کے ساتھ سلام پھیردے تو کیا حکم ہے ،(ہارون الرشید، کراچی)

جواب:
مسبوق مقتدی کے سلام پھیرنے کی چند صورتیں ہیں: (۱) اس نے یہ گمان کرتے ہوئے دانستہ سلام پھیرا کہ اُسے امام کے ساتھ سلام پھیرنا ہے، تو اس کی نماز فاسد ہوجائے گی۔(۲)اُس نے بھول کر امام سے پہلے یا امام کے ساتھ سلام پھیرا ،تو اس پر سجدۂ سہو لازم نہیں ہے ،کیونکہ وہ ابھی امام کی اقتدا سے خارج نہیں ہوا اوراقتدا میں رہتے ہوئے مقتدی سے ایسی خطا ہوجائے ،جو سجدۂ سہو کا موجب ہے ،تو اس پر سجدۂ سہو لازم نہیں ہے ، بشرطیکہ اس نے نماز کو فاسد کرنے والا کوئی عمل نہ کیا ہو۔
(۳) اس نے بھول کر امام کے سلام پھیرنے کے بعد سلام پھیرا ،تو اس پر سجدۂ سہو لازم`
},
{
  pageNumber: 122,
  text: `ہوگا، کیونکہ امام کے سلام پھیرتے ہی وہ امام کی اقتدا سے باہر آگیا اور اب وہ منفرد کے حکم میں ہے ، فقہی دلائل درج ذیل ہیں:
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَلَوْ سَلَّمَ سَاہِیًا إنْ بَعْدَ إمَامِہٖ لَزِمَہُ السَّہْوُ وَإِلَّا ،لَا]]‘‘۔
ترجمہ:’’اور اگر( مسبوق نے)بھول کر سلام پھیردیاتواگر اس نے امام کے سلام پھیرنے کے بعد سلام پھیراہے، تو اس پر سجدۂ سہو لازم ہے اور اگراس نے بھول کرامام کے ساتھ سلام پھیرا ہے ، تواس پر سجدۂ سہو لازم نہیں ہے ‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وَلَوْ سَلَّمَ سَاہِیًا]]:قَیَّدَبِہٖ لِأَنَّہٗ لَوْ سَلَّمَ مَعَ الْإِمَامِ عَلٰی ظَنِّ أَنَّہٗ عَلَیْہِ السَّلَامُ مَعَہٗ، فَہُوَ سَلَامٌ عَمْدٌ، فَتَفْسُدُ، کَمَا فِی ’’الْبَحْرِ‘‘ عَنِ’’ الظَّہِیْرِیَّۃِ‘‘۔قَوْلُہٗ :’’[[arabic: لَزِمَہُ السَّہْوُ]]‘‘: لِأَنَّہٗ مُنْفَرِدٌ فِی ہٰذِہِ الْحَالَۃِ۔قَوْلُہٗ :’’[[arabic: وَإِلَّا، لَا]]‘‘:أَیْ وَإِنْ سَلَّمَ مَعَہٗ أَوْ قَبْلَہٗ لَا یَلْزَمُہٗ، لِأَنَّہٗ مُقْتَدٍ فِی ہَاتَیْنِ الْحَالَتَیْنِ، وَفِیْ ’’شَرْحِ الْمُنْیَۃِ‘‘ عَنِ ’’الْمُحِیْطِ‘‘: إنْ سَلَّمَ فِی الْاُوْلٰی مُقَارِنًا لِسَلَامِہٖ فَلَا سَہْوَ عَلَیْہ، لِأَنَّہٗ مُقْتَدٍ بِہٖ، وَبَعْدَہٗ یَلْزَمُ لِاَنَّہٗ مُنْفَرِدٌ‘‘۔
ترجمہ:’’اور اگر مسبوق نے بھول کر سلام پھیرا، یہاں بھولنے کی قید لگائی ہے ،کیونکہ اگر اس نے یہ گمان کر کے سلام پھیرا کہ اُسے امام کے ساتھ ہی سلام پھیرنا چاہیے ،تو یہ قصداً سلام پھیرنا ہے ،تو اس سے اُس مسبوق مقتدی کی نمازفاسد ہوجائے گی ، جیساکہ ’’البحرالرائق ‘‘ میں ’’ظہیریہ‘‘کے حوالے سے ہے۔ علامہ حصکفی کا یہ کہنا کہ مسبوق مقتدی اگر امام کے سلام پھیرنے کے بعد بھول کرسلام پھیرتاہے ،تواُس پر سجدۂ سہو اس لیے لازم آئے گا کہ اب وہ  منفردکے حکم میں ہے ۔علامہ حصکفی کا یہ کہنا کہ اگرمقتدی نے بھول کر امام کے ساتھ یا اس سے پہلے سلام پھیراہے ، تو اس پر سجدۂ سہو لازم نہیں ہے، کیونکہ ان دونوں حالتوں میں وہ بدستور مقتدی ہے(اور مقتدی کی خطا سے سجدہ سہو لازم نہیں آتا) ۔’’شرح المنیہ‘‘ میں ’’محیط‘‘کے حوالے سے ہے :’’ اگر مسبوق مقتدی نے بھول کر امام کے ساتھ سلام پھیراتو`
},
{
  pageNumber: 123,
  text: `اُس پر سجدہ سہو لازم نہیں ہے، کیونکہ وہ حالتِ اقتدا میں ہے ،اور اگراس نے امام کے بعد سلام پھیراتواس پر سجدۂ سہو لازم ہوگا ،کیونکہ اب وہ منفرد ہے(یعنی امام کے سلام پھیرتے ہی اقتدا سے باہر آچکا ہے)،(جلد3، ص:651، دمشق)‘‘۔

[[heading: نمازِ عید سے پہلے نفل پڑھنا]]
سوال:
کیا عید کے دن نمازِ عید سے پہلے نفل پڑھ سکتے ہیں ،(محمد حذیفہ جمشید، کوٹ ادو)۔
جواب:
نمازِ عید سے پہلے نفل پڑھنا مطلقاً مکروہ ہے ،خواہ گھر میں پڑھے یا عیدگاہ میں ،حتیٰ کہ عورت بھی گھر میں نفل پڑھنا چاہے تو نمازِ عید کے بعد پڑھے،نماز عید کے بعد صرف عیدگاہ میں نفل پڑھنا منع ہے ،گھر آکر پڑھ سکتے ہیں ،حدیث پاک میں ہے: ’’نبی صلی اللہ علیہ وسلم نے عیدالفطر کی نماز دو رکعت پڑھائی ،نہ اُس سے پہلے نماز پڑھی اور نہ اُس کے بعد (عیدگاہ میں)نماز پڑھی، (صحیح البخاری:964)‘‘۔ البتہ اگر کسی نے بدقسمتی سے عید کے دن فجر کی نماز اپنے وقت پر ادا نہ کی ہو اور سورج نکل آیا ہو ،تو وہ نمازِ عید سے پہلے فجر کی نماز قضا پڑھ سکتا ہے،کیونکہ فرض کی قضا فرض ہے ۔

[[heading: اذان سے پہلے صلوٰۃ وسلام پڑھنا منع نہیں ہے]] 
سوال: 
ایک شخص اذان سے پہلے صلوٰۃ وسلام پڑھنے کو گناہ کبیرہ قرار دے رہاہے ، رہنمائی فرمائیں،(سردارریاض احمد عباسی ، آزادکشمیر )۔
جواب:
حدیث پاک میں ہے :’’[[arabic: عَنْ عَبْدِ اللّٰہِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّہٗ سَمِعَ النَّبِیَّ ﷺیَقُوْلُ: إِذَا سَمِعْتُمُ الْمُؤَذِّنَ فَقُوْلُوْا مِثْلَ مَا یَقُوْلُ، ثُمَّ صَلُّوْا عَلَیَّ،فَإِنَّہٗ مَنْ صَلّٰی عَلَیَّ صَلَاۃً صَلَّی اللّٰہُ عَلَیْہِ بِہَا عَشْرًا،ثُمَّ سَلُوا اللّٰہَ لِیَ الْوَسِیلَۃَ،فَإِنَّہَا مَنْزِلَۃٌ فِی الْجَنَّۃِ،لَا تَنْبَغِی إِلَّا لِعَبْدٍ مِنْ عِبَادِ اللّٰہِ وَأَرْجُوْ أَنْ أَکُوْنَ أَنَا ہُوَ،فَمَنْ سَأَلَ لِی الْوَسِیلَۃَ]]`
},
{
  pageNumber: 124,
  text: `[[arabic: حَلَّتْ لَہُ الشَّفَاعَۃُ]]‘‘۔
ترجمہ:’’حضرت عبد اللہ بن عمرو بن العاص رضی اللہ عنہما بیان کرتے ہیں :رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب مؤذن کو اذان دیتے ہوئے سنو تو جیسے کلمات وہ کہتا ہے ،ویسے ہی کہو (یعنی کلمات ِ اذان کو دہراؤ)،پھر تم مجھ پر درود پڑھو ،کیونکہ جو شخص مجھ پر ایک بار درود پڑھے گا، اللہ تعالیٰ اس پر دس رحمتیں نازل فرمائے گا ،پھر میرے لیے جنت میں مقام وسیلہ(نمایاں مقام)کی دعا کرو ،کیونکہ یہ جنت میں ایک ایسا مقام ہے جو اللہ تعالیٰ اپنے صرف ایک (خاص) بندے کو عطا فرمائے گا اور مجھے یقین ہے کہ وہ ایک بندہ میں ہی ہوں ،تو جو (مومن ) میرے لیے مقام وسیلہ کی دعا مانگے گا، اس کی شفاعت مجھ پر لازم ہے‘‘۔
(صحیح مسلم : 384) 
اس حدیث مبارک کی رو سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:’’ جب مؤذن اذان دے رہاہو تو دوکلمات کے درمیان جو وہ سکتہ کرتاہے، اس میں ان کلمات کو دہراؤ اور اذان کے اختتام پر مجھ پر درود بھیجو ،کیونکہ جو مجھ پر درود بھیجے ، اللہ اس پر دس رحمتیں نازل فرماتاہے ، پھر وہ اللہ تعالیٰ سے میرے لیے مقامِ وسیلہ (جنت میں ایک نمایاں مقام جو آپ صلی اللہ علیہ وسلم کے لیے خاص ہے) کی دعاکرے ،وہ شفاعت کا حق دار بن گیا،(صحیح مسلم : 384)‘‘۔
پس اتّبا عِ سنّت کا تقاضا یہ ہے کہ اذان کے بعد درود شریف پڑھے ،لیکن اذان سے پہلے درود شریف پڑھنے کی ممانعت نہیں ہے ، درود شریف کسی وقت بھی پڑھا جاسکتاہے ۔ لہٰذا جو شخص اذان سے پہلے درود شریف پڑھنے کو گناہ کبیرہ یا بدعت قراردے ،یہ اپنی طرف سے شریعت وضع کرنے کے مترادف ہے، ایسے شخص کو اللہ تعالیٰ سے توبہ کرنی چاہیے ۔

[[heading: زوال وغروب کے وقت اذکار وتسبیحات پڑھنا بہتر ہے]] 
سوال: 
زوال اور غروبِ آفتاب کے وقت قرآن پاک کی تلاوت اور دیگر اذکار وتسبیحات`
},
{
  pageNumber: 125,
  text: `پڑھنا جائز ہے یا نہیں ؟،(ایم۔عدنان، کراچی)۔
جواب: 
زوالِ آفتاب کے وقت اور غروبِ آفتاب سے قبل کے بیس منٹ ، ان دونوں اوقات میں کسی بھی قسم کی نماز پڑھنا مکروہ و ممنوع ہے ، سوائے اس کے کہ جنازہ عین اُسی وقت آئے، تو پڑھاجاسکتاہے ،لیکن پہلے سے موجود جنازے کو تاخیر کرکے ان اوقات میں پڑھنا مکروہ ہے اورقراءت نماز کا رکن ہے اس لیے  بہتر یہ ہے کہ ان مکروہ اوقات میں قرآن مجید کی تلاوت نہ کی جائے، البتہ اَذکار اور تسبیحات و درود شریف پڑھ سکتے ہیں ۔
علامہ زین الدین ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَفِی الْبُغْیَۃِ:اَلصَّلَاۃُ عَلَی النَّبِیِّ ﷺ فِی الْاَوْقَاتِ الَّتِی تُکْرَہٗ فِیہَاالصَّلَاۃُ وَالدُّعَآءُ وَالتَّسْبِیْحُ أَفْضَلُ مِنْ قِرَائَۃِ الْقُرْآنِ ۔وَلَعَلَّہٗ لِاَنَّ الْقِرَائَۃَ رُکْنُ الصَّلَاۃِ وَہِیَ مَکْرُوہَۃٌ فَالْاَوْلٰی تَرْکُ مَا کَانَ رُکْنًا لَہَا]]‘‘۔
ترجمہ:اور ’’بُغْیَہ‘‘میں ہے :اُن اوقات میں جن میں نماز پڑھنا مکروہ ہے، نبی صلی اللہ علیہ وسلم پر درود پڑھنا ، دعا کرنا اور تسبیح پڑھنا قرآن کی تلاوت کرنے سے افضل ہے ،اِس کا سبب یہ ہے کہ قراء ت نماز کا رکن ہے اورنماز مکروہ اوقات میں مکروہ تحریمی ہے ،پس بہتریہ ہے کہ نماز کے رکن کو بھی( ان اوقات میں)ترک کیاجائے،(البحر الرائق،ج:1، ص: 437)‘‘۔پس ان اوقات میں اگرچہ قراء ت کرسکتے ہیں لیکن یہ خلافِ اَولیٰ ہے  اور اگر اس وقت قراءت کی اور دورانِ قراءت آیتِ سجدہ آگئی تو سجدہ کی تلاوت بھی کرسکتے ہیں۔ 

[[heading: نماز باجماعت کی صف بندی میں بچوں کی رعایت]]  
سوال:
آپ کے اس مفید اور علمی صفحے کے ذریعے میں آپ کی توجہ دو اہم مسائل کی طرف دلانا چاہتا ہوں ۔پہلایہ کہ آج کل بزرگوں کو نئی نسل سے یوں تو بہت شکایات ہیں، لیکن بڑی شکایت یہ ہے کہ نئی نسل اپنے دین سے بیگانہ ہے اور مساجد ویران ہیں، لیکن کیا کبھی`
},
{
  pageNumber: 126,
  text: `ہم نے اس کے اسباب پر غور کیاہے ۔ اس سلسلے میں ایک خاص بات جو میں نے نوٹ کی ہے وہ یہ کہ بڑوں کا رویہ اس معاملے میں مناسب نہیں ہے۔ خاص طور پر جمعے کے دن بچے سب سے پہلے تیار ہوکر مسجد میں آجاتے ہیں، بڑے لوگ عام طور پر آخری وقت میںآتے ہیں۔ جماعت کھڑی ہونے کے وقت امام صاحب یہ اعلان کردیتے ہیں کہ تمام بچے پچھلی صف میں چلے جائیں تو عام طور پر ہمارے جیسے چھوٹے علاقے کی مسجد کی آخری صف دراصل مسجد کے باہر ہوتی ہے، اس اعلان پر لوگ فوری طور پر عمل کرتے ہیں اور گرمی ہو یا سردی  بچوں کو اگلی صفوں سے نکال کر پیچھے کردیتے ہیں، جس کی وجہ سے بڑی خوشی سے نمازکے لیے آنے والے بچوںکے دل ٹوٹ جاتے ہیں۔ عام نمازوں میں بھی یہ ہوتا ہے کہ بچے جو کہ بڑے نمازیوں کی صف چھوڑ کر ان سے پچھلی صف میں کھڑے ہوتے ہیں بعد میں آنے والے بڑے ان کو نیت بندھی حالت میں کھسکاتے ہوئے پیچھے پہنچادیتے ہیں، جس سے اُن کے دل و دماغ پر مسجد میں باجماعت نماز پڑھنے کے بارے میں کوئی زیادہ اچھا اثر نہیں پڑتا۔ ہونا تو یہ چاہیے کہ خاص طور پر جمعے کے دن بڑے نمازی وقت سے پہلے پہنچنے کی کوشش کریں اور جب جماعت کھڑی ہو تو چھوٹے بچوں کو صفوں کے دائیں بائیں کھڑا کیا جائے نہ کہ سب سے پیچھے یا مسجد سے باہر ۔ ازراہِ کرم بتائیں کہ ہمارا دین تو آسانیاں پہنچانے والا اور انتہا پسندی سے روکنے والا مذہب ہے، وہ اس بارے میں کیا کہتا ہے،(ایس این اقبال، سرجانی ٹائون، کراچی)۔
جواب :
سب سے پہلے چند احادیث مبارکہ ملاحظہ ہوں: 
(۱) ’’[[arabic: قَالَ أَبُوْمَالِکٍ الْأَشْعَرِیُّ:أَلَا أُحَدِّثُکُمْ بِصَلَاۃِ النَّبِیِّ ﷺقَالَ:فَاَقَامَ الصَّلَاۃَ وَصَفَّ الرِّجَالَ وَصَفَّ خَلْفَہُمُ الْغِلْمَانَ،ثُمَّ صَلّٰی بِہِمْ فَذَکَرَ صَلَاتَہٗ،ثُمَّ قَالَ: ہٰکَذَا صَلَاۃٌ ،قَالَ عَبْدُ الْاَعْلَی: لَا أَحْسَبُہٗ إِلَّا قَالَ:صَلَاۃُ أُمَّتِیْ]]‘‘۔
ترجمہ:’’ابومالک اشعری بیان کرتے ہیں: میں تمہیں نبی صلی اللہ علیہ وسلم کی نماز کے بارے میں نہ`
},
{
  pageNumber: 127,
  text: `بتاؤں ؟،انہوںنے کہا: (نبی صلی اللہ علیہ وسلم نے) نماز کی اقامت کا حکم دیا ، پہلے مردوں کی صفیں بنائیں ، پھر ان کے پیچھے باشعور لڑکوں کی صفیں بنائیں ، پھر آپ صلی اللہ علیہ وسلم نے انہیں نماز پڑھائی ، پھرابومالک نے رسول اللہ صلی اللہ علیہ وسلم کی نماز کی کیفیت بیان کی اورکہا: نماز اس طرح ہوتی ہے  ، عبدالاعلیٰ کہتے ہیں : میں گمان کرتاہوں کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ’’ میری اُمّت کی نماز اس طرح ہے،(سنن ابودائود:677)‘‘۔
(۲)’’[[arabic: عَنْ أَبِیْ مَسْعُوْدٍ قَالَ: کَانَ رَسُوْلُ اللّٰہِ ﷺ یَمْسَحُ مَنَاکِبَنَا فِی الصَّلَاۃِ، وَیَقُوْلُ: اِسْتَوُوْاوَلَا تَخْتَلِفُوْا، فَتَخْتَلِفَ قُلُوبُکُمْ، لِیَلِنِیْ مِنْکُمْ أُولُوْ الْأَحْلَامِ وَالنُّہٰی ثُمَّ الَّذِینَ یَلُوْنَہُمْ، ثُمَّ الَّذِیْنَ یَلُوْنَہُمْ قَالَ أَبُوْ مَسْعُوْدٍ: فَأَنْتُمُ الْیَوْمَ أَشَدُّ اخْتِلَافًا]]‘‘۔
ترجمہ:’’ عبداللہ بن مسعود رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نماز میں صف بندی کے وقت ہمارے کندھے چھوتے اورفرماتے: برابر ہوجاؤاور (صفوں میں) فرق نہ کرو کہ اس کے سبب تمہارے دل جداہوجائیں گے ،تم میں سے میرے قریب بالغ اورعقلمند لوگ کھڑے ہوں، پھر وہ جو درجے میں ان کے قریب ہیں، پھر وہ جو درجے میں ان کے قریب ہیں، ابومسعود نے کہا: (صف بندی میں لاپرواہی کے سبب ) آج تم میں بہت اختلافات در آئے ہیں ،(صحیح مسلم:432)‘‘۔
کتب ِفقہ میں نماز کی صفوں کی ترتیب اس طرح درج ہے:
’’[[arabic: وَیَصُفُّ الرِّجَالُ،ثُمَّ الصِّبْیَانُ،ثُمَّ النِّسَاءُ،لِقَوْلِہٖ عَلَیْہِ السَّلَامُ: لِیَلِینِیْ مِنْکُمْ أُولُوالْاَحْلَامِ وَالنُّھٰی]]‘‘۔
ترجمہ:’’اور پہلے مردوں کی صفیں ہوں، پھر(باشعور) بچوں کی اور پھر عورتوں کی، کیونکہ رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے:(جماعت میں)تم میں سے میرے قریب بالغ اور عقلمند ہونے چاہییں، (ہدایہ،جلد1، صفحہ:239)‘‘۔
تنویر الابصار مع الدرالمختار  میں ہے:
’’[[arabic: (الرِّجَالُ) ظَاہِرُہٗ یَعُمُّ الْعَبْدَ (ثُمَّ الصِّبْیَانُ) ظَاہِرُہٗ تَعَدُّدُہُمْ، فَلَوْ وَاحِدًا دَخَلَ]]`
},
{
  pageNumber: 128,
  text: `[[arabic: الصَّفَّ]]‘‘۔
ترجمہ:’’(نماز کی صفوں کی ترتیب میںپہلے) مرد ہوں گے، پھر بچے، بظاہر یہ اس صورت میں ہے کہ ان کی تعداد زیادہ ہو اور اگر ایک ہی بچہ ہو تو (مردوں کی) صف میں شامل ہوجائے گا۔‘‘
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: ذَکَرَہٗ فِی الْبَحْرِ بَحْثًا،قَالَ:وَکَذَا لَوْکَانَ الْمُقْتَدِیْ رَجُلًاوَصَبِیًّا یَصُفُّہُمَاخَلْفَہٗ لِحَدِیثِ أَنَسٍ، فَصَفَفْت أَنَاوَالْیَتِیْمُ وَرَائَہٗ وَالْعَجُوزُ مِنْ وَرَائِنَا وَہٰذَا بِخِلَافِ الْمَرْأَۃِ الْوَاحِدَۃِ فَإِنَّہَا تَتَاَخَّرُ مُطْلَقًا کَالْمُتَعَدِّدَاتِ لِلْحَدِیثِ الْمَذْکُورِ]]‘‘۔
ترجمہ:’’البحرالرائق‘‘ میں اس مسئلے پر بحث کرتے ہوئے فرمایا: اور اسی طرح اگر مقتدی صرف ایک مرد اور ایک بچہ ہوں تو وہ دونوں امام کے پیچھے اکٹھے صف بناکے کھڑے ہوں گے، کیونکہ حضرت انس رضی اللہ عنہ سے روایت ہے :میں نے اور یتیم نے آپ کے پیچھے صف بنائی اور بڑھیا ہمارے پیچھے تھیں، اور ایک بچے کا مسئلہ ایک عورت کے مسئلے سے مختلف ہے، کیونکہ عورتیں ایک ہوں یا زیادہ حدیث مذکور کی بناء پر ہر صورت میں پیچھے الگ صف میں کھڑی ہوں گی‘‘۔
(ردالمحتار علی الدرالمختار ، جلد :2 ،صفحہ:269-270،داراحیاء التراث العربی بیروت)
حدیث پاک کی روشنی میں پہلی صف میں امام کے پیچھے وسط ِصف میں ایسے عاقل وبالغ اور متشرع افراد ہونے چاہییں جو کسی ہنگامی صورت میں امام کی نیابت کرسکیں۔ باقی ترجیحی ترتیب تو یہی ہے کہ پہلے مردوں کی صفیں ہوں اور پھر بچوں کی، لیکن مذکورہ بالا فقہی عبارت سے ظاہر ہے کہ بوقت ِضرورت جب کہ اگلی صفیں نامکمل ہوں تو بچے بڑوں کے ساتھ کھڑے ہوسکتے ہیں۔ اگر اگلی صفیں نامکمل تھیں اور بچے درمیان میں آکر شامل ہوگئے تو بعد میں انہیں نکال کر پیچھے بھیجنا مروت کے خلاف ہے۔
آج کل عام طور پر مشاہدے میں آیا ہے کہ بچوں کوبالکل الگ تھلگ کرکے آخری`
},
{
  pageNumber: 129,
  text: `صف میں کھڑا کردیا جائے تو وہ دورانِ نماز شرارتیں کرتے ہیں اور اس طرح سارے نمازیوں کی یکسوئی اور حضورِ قلبی میں خلل واقع ہوتا ہے، اگر انہیں بڑوں کے درمیان کھڑا کیا جائے تو زیادہ باادب ہوکر پڑھتے ہیں اور بڑوں سے سیکھتے بھی ہیں اور جب بچے نیت باندھ کر آگے کی صف میں کھڑے ہوجائیں تو انہیں گھسیٹ کر پیچھے کرنا آدابِ نماز کے منافی ہے اور اگر اس کا سینہ قبلے سے پھرگیاتو اس کی نماز فاسد ہوجائے گی۔ لیکن یہاں ایسے بچے مراد ہیں جو باشعور ہوں، نماز اور مسجد کے آداب کو سمجھتے ہوں۔
الشیخ عبدالقادر الرافعی مُتوفّٰی 1323؁ھ لکھتے ہیں: 
[[arabic: قَالَ الرَّحمَتِی:رُبَمَا یَتعَیَّنُ فِی زَمَانِنَا اِدْخَالُ الصِّبْیَانِ فِیْ صُفُوْفِ الرِّجَالِ،لاَِنَّ الْمَعْہُوْدَ مِنْہُمْ اِذَا اجْتَمَعَ صَبِیَّانِ فَاَکْثَرُ تُبْطِلُ صَلَاۃُ بَعْضِہِمْ بِبَعْضٍ،وَرُبَّمَاتَعَدّٰی ضَرَرُہُمْ اِلٰی اِفْسَادِ صَلَاۃِ الرِّجَالِ،اِنْتَھٰی]]۔
ترجمہ:’’علامہ رحمتی نے کہا: ہمارے زمانے میں بچوں کو اکثر مردوں کے درمیان کھڑا کیاجاتاہے ،کیونکہ مشاہدے میں آیاہے کہ جب (نمازمیں) بچے ایک ساتھ جمع ہوجائیں تو (چھیڑچھاڑ کرکے) ایک دوسرے کی نماز فاسد کردیتے ہیں اوربعض صورتوں میںان کا ضرر مردوں کی نماز فاسد کرنے تک پہنچ جاتا ہے‘‘۔
(تقریرات الرافعی علی الردالمحتار علی الدرالمختار ، جلد1،ص:100)
بعض لوگ ایسے کم عمر اور ناسمجھ شرارتی بچوں کو اپنے ساتھ مسجد میں لے آتے ہیں، جو مسجد میں اِدھر اُدھر دوڑتے ہیں، نمازیوں کے آگے سے بے دھڑک گزرتے ہیں، شور مچاتے ہیں، کبھی جماعت کے دوران رونے  یا  ہنسنے لگتے ہیں، کبھی پیشاب بھی کرلیتے ہیں اور آج کل مساجد میں بالعموم قالینیں بچھی ہوتی ہیں، جن کو پاک کرنا کافی دشوار ہوتا ہے، تو ایسے بچوں کو مسجد میں لانا ہی شرعاً منع ہے،حدیث شریف میں ہے:
’’[[arabic: جَنِّبُوْا مَسَاجِدَکُمْ صِبْیَانَکُمْ وَمَجَانِیْنَکُمْ وَشِرَاءَکُمْ وَبَیْعَکُمْ وَخُصُوْمَاتِکُمْ وَرَفْعَ أَصْوَاتِکُمْ وَإِقَامَۃَ حُدُوْدِکُمْ وَسَلَّ سُیُوْفِکُمْ، وَاتَّخِذُوْا عَلٰی أَبْوَابِہَا الْمَطَاہِرَ وَجَمِّرُوْہَا فِی]]`
},
{
  pageNumber: 130,
  text: `[[arabic: الْجُمَعِ]]‘‘۔
ترجمہ:’’اپنی مسجدوں کو (ناسمجھ) بچوں، پاگلوں، لین دین کے معاملات،آپس کے جھگڑوں ، شعور وشغب، حدودِ شرعی کے قیام اور (ایک دوسرے پر)تلواریں سونتنے سے بچاکر رکھو اور جمعہ کے دن مسجد کے دروازوں پر صفائی کے لیے برتن رکھ دیاکرو اورکسی خوشبودار چیز کی دھونی دو، (سُنن ابن ماجہ:750)‘‘۔
تنویر الابصار مع الدرالمختار میں ہے:
’’[[arabic: وَیَحْرُمُ إدْخَالُ صِبْیَانٍ وَمَجَانِیْنَ حَیْثُ غَلَبَ تَنْجِیْسُہُمْ وَإِلَّا فَیُکْرَہٗ]]‘‘۔
ترجمہ:’’اور بچوں اور فاترالعقل لوگوں کا مسجد میں داخل کرنا حرام ہے، کیونکہ اکثر وہ ناپاک ہوتے ہیں، اور اگر ناپاک نہ ہوں تو مکروہِ تنزیہی ہے، (جلد:2 ص: 371)‘‘ ۔ 
یہاں حرام سے مراد مکروہِ تحریمی ہے۔ ہمیں بچوں کے معاملے میں افراط و تفریط سے بچنا چاہیے، ناسمجھ اورآدابِ مسجد کا شعور نہ رکھنے والے کم عمر  بچوں کو مسجد میں لے کر نہیں آناچاہیے اور باشعورو باادب بچوں کی حوصلہ شکنی بھی نہیں کرنی چاہیے، اگر وہ صفوں کے درمیان پہلے سے موجود ہیں تو انہیں گھسیٹ کرپیچھے نہیں کرنا چاہیے، یہ مروت اور بزرگانہ شفقت کے خلاف ہے، وہ بڑوں کے درمیان کھڑے ہوں گے تو باادب رہیں گے اور بڑوں سے سیکھیں گے۔

[[heading: معذور بیٹھ کر نماز پڑھ سکتاہے]] 
سوال:
بسا اوقات میں شدید تھک جاتا ہوں ،ہمت جواب دے جاتی ہے اور بڑی مشکل سے مسجد تک جاتا ہوں تو کیا ایسی صورت میں میرے لیے بیٹھ کر نماز ادا کرنا درست ہے، (حسنین احمد ،لاہور) ۔ 
جواب: 
اگر آپ مسجد تک جانے سے اتنے تھک جاتے ہیں کہ جماعت کے ساتھ کھڑے ہوکر`
},
{
  pageNumber: 131,
  text: `نماز نہیں پڑھ سکتے ،مگر گھر پر کھڑے ہوکر پڑھ سکتے ہیں ،تو گھر پر نماز پڑھ لیاکریں ۔لیکن ایساشخص جو قیام پر قادرہی نہیں، اُس کے لیے حکم یہ ہے کہ وہ زمین پر بیٹھ کر نماز پڑھے ،اگر زمین پر سر رکھ کر سجدہ نہیں کرسکتا تو حکم یہ ہے کہ وہ اشارے سے سجدہ کرے اور رکوع کی بہ نسبت سجدے کے لیے سر کو تھوڑا زیادہ نیچے جھکائے ۔ایسا معذور شخص اگر کرسی پر بیٹھ کر بھی نماز ادا کرے تو جائز ہے اوراس صورت میں رکوع اور سجود اشارے سے کرے ۔زمین پر رکھی ہوئی کسی شے پر سر رکھ کر سجدہ کرنے میں کوئی کراہت نہیں ،لیکن اُس شے کی بلندی موضع قدم (یعنی زمین سے )ایک یا دو اینٹوں کی مقدار(یعنی نوانچ) بلندی سے زائد نہ ہو ، علامہ کمال الدین ابن ہمام رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: فَلَوِارْتَفَعَ مَوْضِعَ السُّجُوْدِ عَنْ مَوْضِعِ الْقَدَمَیْنِ قَدْرَلَبِنَۃٍ أَوْلَبِنَتَیْنِ مَنْصُوْبَتَیْنِ جَازَ، لَا اِنْ زَادَ]]‘‘۔
ترجمہ:’’پس اگر سجدہ کی جگہ کوزمین سے ایک یا دو اینٹوں کی بلندی کی مقدار اٹھایا ہے تو (نماز ) جائز ہے اور اگر اِس مقدار سے زائد ہے تو جائز نہیں ہے ،(فتح القدیر ، ج:1، ص: 311،مطبوعہ:مرکز اہلسنّت برکات رضا ،ہند)‘‘۔کرسی اگرچہ زمین پر ہی رکھی ہوتی ہے ، لیکن اس کی اونچائی بیان کی گئی مقدار سے زیادہ ہوتی ہے ۔
علامہ بدرالدین عینی متوفی855؁ھ ’’البنایہ فی شرح الھدایہ‘‘میںلکھتے ہیں:
’’[[arabic: قَالَ: فَاِنْ لَّمْ یَسْتَطِعِ الرُّکُوْعَ وَالسُّجُوْدَأَوْمَاَ اِیْمَاءً یَعْنِیْ قَاعِدًالِأَنَّہٗ وَسِعَ مِثْلَہٗ، وَجَعَلَ سُجوْدَہٗ اَخْفَضَ مِنْ رُکُوْعِہٖ لِأَنَّہٗ قَائِمٌ مَّقَامَھُمَا،فَاَخَذَحُکمَھُمَا،وَلَایَرفَعُ اِلٰی وَجْھِہٖ شَیْءٌ یَسْجُدُعَلَیْہِ، لِقَوْلِہٖ عَلَیْہِ السَّلَامُ:وَاِنْ قَدَرْتَ أَنْ تَسْجُدَ عَلَی الْاَرْضِ فَاسْجُدْ وَاِلَّافَاَوْمِ بِرَأسِکَ وَاِنْ فَعَلَ ذٰلِکَ وَھُوَ یَخْفِضُ رَاْسَہٗ اَجْزَأَہٗ لِوُجُوْدِالْاِیْمَاءِ]]‘‘۔
ترجمہ:’’ (ماتن نے )کہا:اگرنمازی رکوع وسجود کی طاقت نہیں رکھتا،تو (رکوع وسجود) کے لیے بیٹھ کر اشارہ کرے ،کیونکہ وہ اسی کی طاقت رکھتاہے اور سجدوں کے لیے رکوع کی نسبت سرکو زیادہ جھکائے کیونکہ اشارہ ہی رکوع وسجود کے قائم مقام ہے ،تو اس کا حکم وہی ہوگااور سجدہ کرنے کے لیے اپنے چہرے کی طرف کوئی چیز نہ اٹھائے،کیونکہ رسول اللہ صلی اللہ علیہ وسلم کا یہی ارشاد ہے :’’اور اگرتم زمین پر سجدہ کرنے کی طاقت رکھتے ہو،تو سجدہ کرو ،ورنہ سر سے`
},
{
  pageNumber: 132,
  text: `اشارہ کرو‘‘اور اگر وہ سر کو جھکاکر اس طرح سجدہ کرتاہے تو یہ (ادائے فرض کے لیے) کافی ہے ، کیونکہ اشارہ پایاگیا‘‘۔(جلد3،ص:193تا196،مکتبۂ حقانیہ ،ملتان)
اگر کوئی شخص صف میں کھڑے ہوکر اشارے سے رکوع وسجود نہ کرسکتاہو اوربیٹھ بھی نہ سکتاہو تو گھر پر جیسا اس سے ہوسکے نماز پڑھ لے ،وہ جماعت سے معذور ہے ۔ باجماعت نمازوں میں صفوں کے درمیان کرسی رکھنے سے ’’تسویۃ الصف ‘‘یعنی صف کی برابری کی سنّت اداہوہی نہیں سکتی ۔ ہماری نظر میں جب تک بندہ بیٹھ کر،خواہ التحیات کی وضع میں ہو یا پاؤں دائیں جانب نکال کر یا آلتی پالتی مارکر بیٹھ سکتاہو، حتی الامکان بیٹھ کر نماز پڑھے۔

[[heading: دورانِ جماعت جب مقتدی جماعت میں شامل ہو]]
سوال: 
امام کے رکوع کے بعد پہلے یا دوسرے سجدے میں کوئی مقتدی شامل ہوا،نماز کے آخر میں اپنی بقیہ رکعت بھی پڑھ لی ،آٹھ سجدوں کے بجائے نو سجدے اداکرلیے تو کیانماز مکمل ہوجائے گی ،(محمد ناظم ،نارووال)۔
جواب:
حدیث پاک میں ہے :
’’[[arabic: عَنْ عَبْدِ اللّٰہِ بْنِ أَبِیْ قَتَادَۃَعَنْ أَبِیْہِ،قَالَ:بَیْنَمَا نَحْنُ نُصَلِّی مَعَ النَّبِیِّ ﷺ إِذْ سَمِعَ جَلَبَۃَ رِجَالٍ،فَلَمَّا صَلّٰی قَالَ:مَا شَاْنُکُمْ،قَالُوْا:اِسْتَعْجَلْنَا إِلَی الصَّلاَۃِ،قَالَ:فَلاَ تَفْعَلُوْا إِذَا أَتَیْتُمُ الصَّلاَۃَ فَعَلَیْکُمْ بِالسَّکِیْنَۃِ، فَمَا أَدْرَکْتُمْ فَصَلُّوْا وَمَا فَاتَکُمْ فَاَتِمُّوْا]]‘‘۔
ترجمہ:’’ حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں: جس وقت ہم نبی صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ رہے تھے ،اچانک آپ کو لوگوں کی آہٹیں اور آوازیں سنائی دیں ،آپ صلی اللہ علیہ وسلم نے نماز پڑھنے کے بعد فرمایا: تمہیں کیاہواتھا؟،انہوں نے عرض کی : ہم جماعت میں شامل`
},
{
  pageNumber: 133,
  text: `ہونے کے لیے جلدی کررہے تھے ،آپ صلی اللہ علیہ وسلم نے فرمایا: تم ایسانہ کرو ،جب تم نمازپڑھنے کے لیے آؤ توتم اطمینان اور سکون کے ساتھ آؤ ،تم کو(امام کے ساتھ) جتنی نماز مل جائے ،اس کو پڑھ لو اور جتنی نماز تم سے فوت ہوجائے ،اسے (آخر میں) پوری کرلو،(صحیح بخاری:635) ‘‘ ۔
اس حدیث کے مطابق مقتدی کو چاہیے کہ سکون واطمینان کے ساتھ جماعت میں شامل ہونے کے لیے آئے اور امام کے ساتھ نماز میں شامل ہوجائے اورامام کے سلام پھیرنے کے بعد اپنی بقیہ نماز پوری کرلے ۔جتنی نماز ملنے کا واضح مطلب یہ ہے کہ اگر امام پہلے یا دوسرے سجدے میں ہے ،تو سجدہ میں شامل ہوجائے ،یہ اضافی یا زائد سجدہ نماز کی تکمیل میں مانع نہیں ہوگا اور امام کے سلام پھیرنے کے بعد بقیہ نماز پوری کرنے پر نماز کامل شمار ہوگی ۔ مسبوق مقتدی مکمل رکعات کے علاوہ امام کی اقتدا میں جو اضافی سجدہ یا قعدہ کرے گا ،اس پر اسے اجرکی اُمید رکھنی چاہیے ۔بعض لوگ امام کو سجدے یا قعدے میں دیکھ کر کھڑے رہتے ہیں اور امام جب نئی رکعت کے لیے کھڑا ہوتاہے ،تو شامل ہوجاتے ہیں،  ایسا نہ کریں ،بلکہ امام جس مرحلے میں بھی ہو نیت کرکے جماعت میں شامل ہوجائیں ، آپ کے ہر سجدے ،تسبیح اور قعدے پر آپ کو اجر ملے گا ، ان شاء اللہ تعالیٰ۔
امام ترمذی نے اپنی سُنَن میں باب باندھا ہے :’’[[arabic: بَابُ مَا ذُكِرَ فِي الرَّجُلِ يُدْرِكُ الْإِمَامَ وَهُوَ سَاجِدٌ كَيْفَ يَصْنَعُ]]‘‘،ترجمہ:’’کوئی شخص امام کو سجدے کی حالت میں پائے تو کیا کرے‘‘، اس کے تحت انہوں نے حضرت معاذ بن جبل رضی اللہ عنہ کی یہ حدیث نقل کی ہے: 
’’[[arabic: قَالَ النَّبِيُّ ﷺ: إِذَا أَتٰى أَحَدُكُمُ الصَّلاَةَ وَالْإِمَامُ عَلٰى حَالٍ فَلْيَصْنَعْ كَمَا يَصْنَعُ الإِمَامُ]]‘‘۔
ترجمہ:’’نبی صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی نماز کے لیے آئے اور امام کسی حال میں ہو (یعنی حالتِ رکوع  یا قیام  یا سجدہ یا تشہدمیں ہو)تو وہی کرے جو امام کر رہا ہے، (ترمذی:591)‘‘۔ امام ابوعیسیٰ نے کہا ہے: ’’یہ حدیث غریب ہے اور صرف اسی طریق`
},
{
  pageNumber: 134,
  text: `سے مروی ہے ،لیکن اہلِ علم کا اس پر عمل ہے، انہوں نے کہا:کوئی شخص آئے اور امام کو سجدے میں پائے تو امام کے ساتھ سجدے میں شامل ہوجائےاوراگر امام کے ساتھ رکوع فوت ہوگیا ہے تو یہ رکعت ادا نہ ہوئی (یعنی مسبوق اس کو امام کے سلام پھیرنے کے بعد ادا کرے )اور عبداللہ بن مبارک نے بھی اسی کو اختیار کیا ہے کہ امام کے ساتھ سجدے میں شامل ہوجائے اور انہوں نے بعض ائمہ سے نقل کیا ہے :امید کی جاتی ہے کہ اس سجدے سے سر اٹھانے سے پہلے اس کی مغفرت کردی جائے گی‘‘۔ 

[[heading: نابینا کی امامت]] 
سوال:
کیا نابینا امام کے پیچھے نماز پنجگانہ اور نمازِ جنازہ ادا کی جاسکتی ہے، (عرفان احمد، آزاد کشمیر)۔
جواب:
نابینا شخص اگر احتیاط برتتا ہے یعنی کپڑوں یا بدن پر کوئی چیز لگ جائے تو کسی بینا شخص کو دکھا کر اطمینان کرلیتا ہے کہ کہیں نجاست تو نہیںلگی اور اگر نجاست لگ گئی ہو تو دھو لیتاہے ، ایسے نابینا کی امامت جائز ہے ،مگرمکروہ ِ تنزیہی ہے اور اگروہ حاضرین میں مسائل نمازکا سب سے زیادہ جاننے والا ہے، تو اس کی امامت بلا کراہت جائز ہے۔
امام ابو داؤد سجستانی رحمۃ اللہ علیہ اپنی سند کے ساتھ بیان کرتے ہیں :
’’[[arabic: عَنْ أَنَسٍ اَنَّ النَّبِیَّ ﷺ اِسْتَخْلَفَ ابْنَ أُمِّ مَکْتُوْمٍ یَؤ ُمُّ النَّاسَ وَھُوَ أَعْمیٰ]]‘‘ ۔
ترجمہ: ’’حضرت انس رضی اللہ عنہ بیان کرتے ہیں: نبی کریم صلی اللہ علیہ وسلم نے (غزوۂ تبوک کے موقع پرعبداللہ)بن اُمِّ مکتوم کو (مدینہ منورہ میں ) اپنا خلیفہ بنایا تاکہ وہ لوگوں کی امامت کریں،حالانکہ وہ نابینا تھے ، (سنن ابو داؤد : 595 )‘‘۔
اس کی شرح میں علامہ علی القاری الحنفی رحمۃ اللہ علیہ لکھتے ہیں : 
ابن الملک نے کہا :نابینا کی امامت کی کراہت اس صورت میں ہے کہ قوم میں اس کے`
},
{
  pageNumber: 135,
  text: `مقابلے میں تندرست شخص اس سے بڑا عالم یا اس کے برابر درجے کا عالم موجود ہو،علامہ ابن حجر نے کہا: اس میں نابینا کی امامت کا جواز ہے اور اس میں کوئی اختلاف نہیں ، اختلاف صرف اس بات میں ہے کہ بینا کی امامت اَولیٰ ہے یا نابینا کی (جبکہ دونوں دستیاب ہوں)، (مرقاۃ المفاتیح،جلد:3،ص :84مکتبۂ امدادیہ ،ملتان ) ‘‘ ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: (وَیَکْرَہٗ)تَنْزِیْہاً(اِمَامَۃَُأَعْمٰی)وَنَحْوِہِ الْاَعْشٰی’’نَہْرٌ‘‘(إلَّا أَنْ یَّکُوْنَ) أَیْ غَیْرُ الْفَاسِقِ (أَعْلَمَ الْقَوْمِ) فَہُوَ أَوْلٰی]]‘‘۔
ترجمہ: ’’نابینا اور ایسا شخص جسے رات کو نظر نہ آتا ہو ، اس کی امامت مکروہ تنزیہی ہے(بحوالہ النہر الفائق ) اور اگر یہ زیادہ صاحب علم ہوتو اس کی امامت بہتر ہے،  (جلد:2،ص: 254,255، بیروت )‘‘۔چونکہ علامہ حصکفی نے نابینا کا ذکر فاسق اور اَعرابی کے سیاق میں کیا ہے ، اس لیے اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَحَاصِلُہٗ:أَنَّ قَوْلَہٗ إلَّا أَنْ یَکُوْنَ أَعْلَمَ الْقَوْمِ خَاصٌّ بِالْأَعْمٰی،أَمَّا غَیْرُہٗ فَلَا تَنْتَفِیْ الْکَرَاہَۃُ بِعِلْمِہٖ]]‘‘۔
ترجمہ:’’اس بحث کا حاصل یہ ہے علامہ حصکفی کا یہ قول کہ’’اگر وہ پوری قوم سے زیادہ عالم ہو ‘‘(تووہ نابینا امامت کا زیادہ حق دار ہے ) نابینا کے ساتھ خاص ہے ،جہاں تک غیرِ نابینا (مثلاً فاسق کی امامت) کا تعلق ہے ، تو علم کی بنا پراس کی کراہت منتفی نہیں ہوگی ۔۔۔۔اور آگے چل کر لکھتے ہیں :کہ اگر نابینا دوسروں کے مقابلے میں زیادہ عالم ہے تو استحقاقِ امامت کا معاملہ بالکل برعکس ہوگا (یعنی نابینا عالم ہی زیادہ حق دار ہوگا )‘‘۔
 (ردالمحتار علی الدرالمختار ج:2، ص:255، بیروت)
امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْزسے سوال ہوا :’’ اندھے کے پیچھے نماز پڑھنا مکروہ تنزیہی یا تحریمی ہے یا نہیں اور یہ امامت کے واسطے سزاوار ہے یا نہیں‘‘، آپ جواب میں لکھتے ہیں :’’ اندھا اگر تمام موجودین میں سب سے زیادہ مسائل کا جاننے والا نہ ہو اور`
},
{
  pageNumber: 136,
  text: `اس کے سوا دوسرا صحیح القرا ء ت، صحیح العقیدہ ،غیر فاسقِ مُعْلِنْ حاضر جماعت ہے، تو اندھے کی امامت مکروہِ تنزیہی ہے اور اگر وہی سب سے زیادہ علم ِ نماز رکھتا ہے، تو اسی کی امامت افضل ہے،(فتاویٰ رضویہ ، جلد 6،ص:520رضا فاؤنڈیشن ،لاہور )‘‘۔
علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں : 
’’نابینا کی امامت مکروہ تنزیہی ہے ،جبکہ دوسرے لوگ مسائل طہارت ونماز میں اس سے زائد یا اس کے برابر ہوں اور اگر سب سے زائد یہی علم رکھتا ہو ، تو اس کی امامت میں اصلاً کراہت نہیں ، بلکہ اس صورت میں اسی کو امام بنانا بہتر ہے، بحرالرائق میں ہے :
’’[[arabic: وَقَيَّدَ كَرَاهَةَ إمَامَةِ الْاَعْمٰى فِي الْمُحِیْطِ وَغَيْرِهِ بِاَنْ لَا يَكُونَ أَفْضَلَ الْقَوْمِ، فَإِنْ كَانَ أَفْضَلَهُمْ فَهُوَ أَوْلٰى]]‘‘۔
ترجمہ:’’اندھے کی امامت کے مکروہ ہونے کو ’’المحیط‘‘ وغیرہ کتب میں اس بات کے ساتھ مقید کیا  ہے کہ وہ قوم (حاضرینِ جماعت) میں سب سے بڑھ کر افضل نہ ہو، ورنہ تو پھر اُسی کو امام بنانا اولیٰ ہے،(البحر الرائق،ج:۱، ص:۳۶۹)‘‘۔
مکروہ تنزیہی ناجائز نہیں ہوتا مگر اس سے بچنا بہتر ، اور کرنا برا ہے، مگر گناہ نہیں، (فتاویٰ امجدیہ جلد اول ص: 107مطبوعہ مکتبۂ رضویہ، آرام باغ ،کراچی )۔

[[heading: نمازِ تہجد کا افضل وقت]] 
سوال:
تہجد کا مقبول وقت کیا ہے؟،( مجیب خان ،احمدپورشرقیہ)۔
جواب:
عشاء کے بعد سو کر اٹھیں اور نوافل پڑھیں ،وہ تہجد ہیں ۔
صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں: 
’’ جو شخص تہائی رات سونا چاہے اور ایک تہائی عبادت کرنا ،اُس کے لیے افضل یہ ہے کہ پہلی اور پچھلی تہائی میں سوئے اوردرمیان کی تہائی میں عبادت کرے اور اگر نصف شب میں سونا`
},
{
  pageNumber: 137,
  text: `چاہتاہے اور نصف جاگنا تو پچھلی نصف میں عبادت افضل ہے ،حدیث پاک میں ہے : 
’’[[arabic: یَنْزِلُ رَبُّنَا تَبَارَکَ وَتَعَالٰی کُلَّ لَیْلَۃٍ إِلَی السَّمَاءِ الدُّنْیَا،حِینَ یَبْقٰی ثُلُثُ اللَّیْلِ الْاٰخِرِ، فَیَقُوْلُ: مَنْ یَّدْعُوْنِیْ فَأَسْتَجِیْبُ لَہٗ وَمَنْ یَّسْاَلُنِیْ فَاُعْطِیَہٗ وَمَنْ یَّسْتَغْفِرُنِیْ فَاَغْفِرَ لَہٗ]]‘‘۔
ترجمہ: ’’ رات کے پچھلے پہر جب ایک تہائی رات باقی رہ جاتی ہے ،تو اللہ تعالیٰ آسمانِ دنیاپر خاص تجلی فرماتاہے اورندا فرماتاہے :’’ہے کوئی دعا کرنے والا کہ اُس کی دعا قبول کروں ، ہے کوئی مانگنے والا کہ اُسے دوں ،ہے کوئی مغفرت چاہنے والا کہ اس کی بخشش کردوں‘‘۔
(صحیح مسلم: 758)، (بہارِ شریعت ،جلد اول،ص:678) 

[[heading: نمازِ عشاء کی بابت ایک سوال]] 
سوال:
اگر کوئی شخص عشاء کی نماز (فرض)پڑھے بغیر سو گیا اور وہ نماز فجر سے دو گھنٹے قبل اٹھ کر عشاء کی نماز ادا کرتا ہے اور تہجد پڑھتا ہے تو اس کی دونوں نمازیں ہو جائیں گی؟،( مجیب خان ،احمدپورشرقیہ)۔
جواب:
نمازِعشاء کی ادائیگی میں تہائی رات تک تاخیر کرنا مستحب ہے اور آدھی رات تک تاخیر مباح ،اتنی تاخیر کہ رات ڈھل گئی ،مکروہ ہے کیونکہ یہ جماعت کی تعداد کم ہونے کا سبب ہے۔  مذکورہ وقت میں نمازِ عشاء اور تہجد دونوں ادا ہوجائیں گے ،حدیث پاک میں ہے : 
(۱)’’[[arabic: عَنْ أَبِیْ بَرْزَۃَأَنَّ رَسُوْلَ اللّٰہِ ﷺ کَانَ یَکْرَہُ النَّوْمَ قَبْلَ الْعِشَاءِ وَالْحَدِیْثَ بَعْدَہَا]]‘‘۔
ترجمہ:’’ حضرت ابو برزہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم عشاء سے پہلے سونے کو ناپسند کرتے تھے اورعشاء کے بعد (فضول) باتیں کرنے کو، (صحیح بخاری:568)‘‘۔
(۲)’’[[arabic: حَدَّثَنَا عَبْدُ اللّٰہِ بْنُ عُمَرَ:أَنَّ رَسُوْلَ اللّٰہِ ﷺشُغِلَ عَنْہَا لَیْلَۃً،فَأَخَّرَہَاحَتّٰی]]`
},
{
  pageNumber: 138,
  text: `[[arabic: رَقَدْنَافِی الْمَسْجِدِ،ثُمَّ اسْتَیْقَظْنَا،ثُمَّ رَقَدْنَا،ثُمَّ اسْتَیْقَظْنَا،ثُمَّ خَرَجَ عَلَیْنَا النَّبِیُّ ﷺ،ثُمَّ قَالَ:لَیْسَ أَحَدٌ مِّنْ أَہْلِ الْاَرْضِ یَنْتَظِرُ الصَّلاَۃَ غَیْرُکُمْ وَکَانَ ابْنُ عُمَرَ:لاَ یُبَالِیْ أَقَدَّمَہَا أَمْ أَخَّرَہَاإِذَا کَانَ لاَ یَخْشٰی أَنْ یَّغْلِبَہُ النَّوْمُ عَنْ وَقْتِہَاوَکَانَ یَرْقُدُ قَبْلَہَا]]‘‘۔
ترجمہ:’’ حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں: ایک رات رسول اللہ صلی اللہ علیہ وسلم کسی کا م میں مشغول تھے ،تو آپ صلی اللہ علیہ وسلم نے عشاء کی نماز کو مؤخر کردیا ،حتیٰ کہ ہم مسجد میں سوگئے ،پھر ہم بیدار ہوئے ،پھر ہم سوگئے ،پھر ہم بیدار ہوئے،پھر آپ صلی اللہ علیہ وسلم ہمارے پاس نکل کر تشریف لائے،پھر آپ نے فرمایا:تمام روئے زمین پر اس نماز کا تمہارے سوااورکوئی انتظار نہیں کررہا اور حضرت ابن عمر رضی اللہ عنہما اس کی کوئی پرواہ نہیں کرتے تھے کہ عشاء کی نماز مقدّم کریں یا مؤخّر کریں جب کہ انہیں یہ خطرہ نہ ہو کہ نیند کے غلبہ کی وجہ سے عشاء کا وقت نکل جائے گا اوروہ عشاء پڑھنے سے پہلے سوجاتے تھے ،(صحیح بخاری: 570)‘‘ ۔ 
(۳)’’[[arabic: عَنْ أَبِیْ ہُرَیْرَۃَقَالَ:قَالَ النَّبِیُّ ﷺ:لَوْلَا أَنْ أَشُقَّ عَلٰی أُمَّتِی لَاَمَرْتُہُمْ أَنْ یُؤَخِّرُواالْعِشَاءَ إِلٰی ثُلُثِ اللَّیْلِ أَونِصْفِہٖ]]‘‘۔ 
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی صلی اللہ علیہ وسلم نے فرمایا: اگر میری اُمّت پر دشوار نہ ہوتا تو میں اُنہیں عشاء کی نماز تہائی رات یا نصف رات تک مؤخر کرنے کا حکم دیتا ، (سُنن ترمذی:168)‘‘۔
علامہ زین الدین ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: (قَوْلُہٗ:وَالْعِشَاءُ إلَی الثُّلُثِ)أَیْ نُدِبَ تَأْخِیرُہَاإلٰی ثُلُثِ اللَّیْلِ لِمَارَوَاہُ التِّرْمِذِیُّ وَصَحَّحَہٗ:لَوْلَاأَنْ أَشُقَّ عَلٰی أُمَّتِی لَأَخَّرْتُ الْعِشَاءَ إلٰی ثُلُثِ اللَّیْلِ أَوْنِصْفِہٖ وَفِی مُخْتَصَرِالْقُدُورِیِّ إلٰی مَا قَبْلَ الثُّلُثِ لِرِوَایَۃِ الْبُخَارِیِّ: کَانُوا یُصَلُّونَ الْعَتَمَۃَ فِیمَا بَیْنَ أَنْ یَّغِیْبَ الشَّفَقُ إلٰی ثُلُثِ اللَّیْلِ وَمُقْتَضَاہُ أَنَّہٗ لَا یُسْتَحَبُّ تَاْخِیْرُہَا إلٰی الثُّلُثِ بِخِلَافِ الْأَوَّلِ وَ وُفِّقَ بَیْنَہُمَا فِی شَرْحِ الْمَجْمَعِ لِابْنِ الْمَلِکِ بِحَمْلِ الْأَوَّلِ عَلَی الشِّتَاءِ]]`
},
{
  pageNumber: 139,
  text: `[[arabic: وَالثَّانِیْ عَلَی الصَّیْفِ لِغَلَبَۃِ النَّوْمِ.وَأَطْلَقَہٗ فَشَمِلَ الصَّیْفَ وَالشِّتَاءَ وَقِیْلَ:یُسْتَحَبُّ تَعْجِیْلُ الْعِشَاءِ فِی الصَّیْفِ لِئَلَّا تَتَقَلَّلَ الْجَمَاعَۃُ وَأَفَادَأَنَّ التَّاْخِیْرَ إلٰی نِصْفِ اللَّیْلِ لَیْسَ بِمُسْتَحَبٍّ وَقَالُوْا: إنَّہٗ مُبَاحٌ وَإِلٰی مَا بَعْدَہٗ مَکْرُوْہٌ وَقِیْلَ إلٰی مَا بَعْدَ الثُّلُثِ مَکْرُوْہٌ وَرَوَی الْإِمَامُ أَحْمَدُ وَغَیْرُہٗ أَنَّہٗ عَلَیْہِ الصَّلَاۃُ وَالسَّلَامُ کَانَ یَسْتَحِبُّ أَنْ یُؤَخِّرَ الْعِشَاءَ وَکَانَ یَکْرَہُ النَّوْمَ قَبْلَہَا وَالْحَدِیْثَ بَعْدَہَا وَقَیَّدَ الطَّحَاوِیُّ کَرَاہَۃَ النَّوْمِ قَبْلَہَا بِمَنْ خُشِیَ عَلَیْہِ فَوْتُ وَقْتِہَا أَوْ فَوْتُ الْجَمَاعَۃِ فِیْہَا وَإِلَّا فَلَا]]‘‘۔
ترجمہ:’’امام ابوالبرکات عبداللہ بن احمد بن محمود نسفی کا یہ قول:’’ عشاء کی نماز میں تہائی رات تک تاخیر مستحب ہے ‘‘، کیونکہ اس حدیث کو امام ترمذی نے روایت کیا اور صحیح کہاہے : ’’اگرمیں  اپنی امت کے لیے دشواری محسوس نہ کرتا تو میں نمازِ عشاء کو نصف شب یا تہائی شب تک مؤخر کرتا ‘‘اور’’ مختصر القدوری ‘‘میں صحیح بخاری کی روایت میں  تہائی رات سے قبل پڑھنے کا حکم ہے :’’عشاء کی نماز کو وہ شفق (کی سفیدی ) غائب ہونے کے بعد تہائی رات کے اول حصہ تک مؤخر کرتے تھے ‘‘۔ اس  روایت کاتقاضا یہ ہے کہ پہلے قول کے برعکس تہائی رات تک تاخیر کرنامستحب نہیں ہے ،’’ابن الملک ‘‘ کی ’’شرح المجمع‘‘ میں ان دونوں اقوال کے درمیان موافقت یوںبیان کی گئی ہے کہ پہلے قول کو موسمِ سرماپر محمول کریں گے اور دوسرے قول کو موسمِ گرما پر،کیونکہ اس موسم میں نیند کا غلبہ ہوتاہے اور بعض نے مطلق بات کی ہے ،پس یہ موسمِ گرما وسرما دونوں کو شامل ہے  اورایک قول یہ ہے کہ موسمِ گرما میں عشاء کی نماز جلد پڑھنا مستحب قرار دیاگیاہے ،کیونکہ تاخیر سے جماعت کی تعداد کم ہونے کا اندیشہ ہے ۔اس سے معلوم ہواکہ نصف رات تک تاخیر مستحب نہیں ہے،بعض فقہاء نے کہا: عشاء کی نماز نصف شب تک مؤخر کرنا مباح ہے اورنصف شب کے بعد تک مؤخرکرنا مکروہ ہے ، ایک قول کے مطابق تہائی رات کے بعد تاخیر کرنا مکروہ ہےاور امام احمد ودیگر مُحدّثین نے روایت کیاہے کہ آپ ﷺ عشاء میں تاخیر کو پسند فرماتے تھے اور عشاء سے پہلے سونے اورعشاء کے بعد باتیں کرنے کو ناپسند فرماتے تھے ۔  امام طحاوی نے عشاء سے پہلے سونے کو ان لوگوں`
},
{
  pageNumber: 140,
  text: `کے لیے مکروہ کہاہے ،جن کے لیے (نیند کے سبب) نماز یا جماعت فوت ہونے کا اندیشہ ہو ، ورنہ عشاء سے پہلے سونا مطلقاًمکروہ نہیں ہے ، (البحرالرائق ، جلد1،ص:430)‘‘۔
جماعت کے ساتھ نماز کی ادائیگی تنہانماز پڑھنے سے ستائیس درجہ افضل ہے،حدیث  میں ہے:
’’[[arabic: صَلَاۃُ الْجَمَاعَۃِ تَفْضُلُ صَلاَۃَ الْفَذِّ بِسَبْعٍ وَّعِشْرِیْنَ دَرَجَۃً]]‘‘۔
ترجمہ:’’جماعت کے ساتھ نماز پڑھنا تنہا نماز پڑھنے پر ستائیس درجہ فضیلت رکھتاہے ، (صحیح بخاری:645)‘‘۔
 مسجد کے لیے چل کر جانا ثواب کی زیادتی کا سبب ہے ۔
(۱)’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ قَالَ:قَالَ رَسُوْلُ اللّٰہِ ﷺ:مَنْ تَطَہَّرَ فِی بَیْتِہٖ،ثُمَّ مَشٰی إِلٰی بَیْتٍ مِّنْ بُیُوْتِ اللّٰہِ لِیَقْضِیَ فَرِیْضَۃً مِّنْ فَرَائِضِ اللّٰہِ،کَانَتْ خَطْوَتَاہُ إِحْدَاہُمَاتَحُطُّ خَطِیْئَۃً، وَالْأُخْرٰی تَرْفَعُ دَرَجَۃً]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اپنے گھر میں وضو کرے پھر اللہ تعالیٰ کے کسی گھر میں کوئی فریضہ اداکرنے جائے تو اس کاایک قدم ایک گناہ ساقط کرے گا اور دوسرا ایک درجہ بلند کرے گا،(صحیح مسلم:666)‘‘۔
(۲)’’[[arabic: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللّٰہِ،قَالَ:کَانَتْ دِیَارُنَا نَائِیَۃً عَنِ الْمَسْجِدِ، فَاَرَدْنَا أَنْ نَّبِیْعَ بُیُوْتَنَا، فَنَقْتَرِبَ مِنَ الْمَسْجِدِ، فَنَہَانَا رَسُوْلُ اللہِ ﷺ، فَقَالَ: إِنَّ لَکُمْ بِکُلِّ خَطْوَۃٍ دَرَجَۃً]]‘‘۔
ترجمہ:’’ حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں : ہمارے گھر مسجد سے دور تھے ،ہم نے ارادہ کیا کہ اپنے گھر بیچ کر مسجد کے قریب گھر خرید لیں ،رسول اللہ صلی اللہ علیہ وسلم نے اس سے منع کیا اورفرمایا: تمہارے ہر قدم کے عوض ایک درجہ ہے ، (صحیح مسلم:664)‘‘۔
(۳)’’[[arabic: مَنْ تَوَضَّاَ لِلصَّلَاۃِ فَاَسْبَغَ الْوُضُوْ ءَ،ثُمَّ مَشٰی إِلَی الصَّلَاۃِ الْمَکْتُوْبَۃِ فَصَلَّاہَامَعَ النَّاسِ أَوْمَعَ الْجَمَاعَۃِ أَوْ فِی الْمَسْجِدِغَفَرَ اللَّہُ لَہٗ ذُنُوبَہٗ]]‘‘۔
ترجمہ:’’ جس نے نماز کے لیے اچھی طرح وضو کیا ،پھر فرض نماز کے لیے گیا اور لوگوں کے`
},
{
  pageNumber: 141,
  text: `ساتھ  یا جماعت کے ساتھ مسجد میں نماز پڑھی ،اللہ تعالیٰ اُس کے گناہوں کو معاف فرمادے گا  ،(سُنن نسائی:856)‘‘۔
(۴)’’[[arabic: صَلاَۃُ الرَّجُلِ فِی الْجَمَاعَۃِ تُضَعَّفُ عَلٰی صَلاَتِہٖ فِی بَیْتِہٖ،وَفِی سُوْقِہٖ، خَمْسًا وَّعِشْرِیْنَ ضِعْفًا،وَذٰلِکَ أَنَّہٗ:إِذَا تَوَضَّاَ،فَاَحْسَنَ الْوُضُوْ ءَ،ثُمَّ خَرَجَ إِلَی المَسْجِدِ،لاَ یُخْرِجُہٗ إِلَّا الصَّلاَۃُ،لَمْ یَخْطُ خَطْوَۃً،إِلَّا رُفِعَتْ لَہٗ بِہَادَرَجَۃٌ،وَحُطَّ عَنْہُ بِہَا خَطِیئَۃٌ،فَإِذَا صَلّٰی لَمْ تَزَلِ المَلاَئِکَۃُ تُصَلِّی عَلَیْہِ،مَا دَامَ فِی مُصَلَّاہُ:،اَللّٰہُمَّ صَلِّ عَلَیْہِ،اَللّٰہُمَّ ارْحَمْہُ وَلاَ یَزَالُ أَحَدُکُمْ فِی صَلاَۃٍ مَا انْتَظَرَ الصَّلاَۃَ]]‘‘۔
ترجمہ:’’مرد کی (مسجدمیں)جماعت کے ساتھ نماز اس کی گھر میں اور بازار میں نمازپر پچیس درجہ افضل ہے کیونکہ جب وہ عمدہ طریقہ سے وضو کرتاہے ،پھر مسجد کی طرف نکلتاہے اور صرف نماز ہی اس کے نکلنے کا سبب ہے ،تو اس کے ہرقدم پر اس کا ایک درجہ بلند کردیاجاتا ہے اوراس کے ایک گناہ کو مٹادیاجاتا ہے اور جب وہ نماز پڑھتاہے توجب تک وہ نماز کی جگہ پر رہتاہے ،فرشتے اس کے لیے دعاکرتے رہتے ہیں :اے اللہ ! اس پر رحمت نازل فرما،اس پر رحم فرمااورتم میں سے کوئی شخص جب تک نماز کے انتظار میں رہتاہے ،اس کا نماز میں شمار ہوتارہتاہے ،(صحیح بخاری:647)‘‘۔

[[heading: عشاکی  نیت میں غلطی سے ظہر یا عصر کہہ دینا]] 
سوال:
اگر کوئی شخص عشاء کی جماعت میں غلطی سے ظہر ،عصر یا مغرب کی نیت کرکے شامل ہوجائے ،سلام پھیرنے سے پہلے یا سلام پھیرتے وقت یاد آیا تو اس نماز کا شرعی حکم کیاہے؟، (محمد اشرف قادری ،قصبہ کالونی کراچی)۔ 
جواب:
نیت دل کے ارادے کا نام ہے، زبان سے نیت کے کلمات کا اداکرنا ، جوہمارے ہاں معروف ہیں ،نہ حدیث سے ثابت ہیں،نہ شرعاً ضروری ہیں ۔ہمارے متاخرین فقہائے`
},
{
  pageNumber: 142,
  text: `کرام نے ذہنی استحضار یعنی ذہن کومُتوجہ رکھنے کے لیے زبانی نیت کو مستحب قراردیاہے ۔ فرض نماز میں یہ ضروری ہے کہ دل میں اُس خاص نماز کی نیت کرے ،مثلاً: آج کی ظہر ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: اَلْوَاجِبَاتُ وَالْفَرَائِضُ لَا تَتَاَدّٰی بِمُطْلَقِ النِّیَّۃِ إِجْمَاعًا.کَذَا فِی الْغِیَاثِیَّۃِ فَلَا بُدَّ مِنَ التَّعْیِیْنِ فَیَقُوْلُ: نَوَیْتُ ظُہْرَ الْیَوْمِ أَوْعَصْرَ الْیَوْمِ أَوْ فَرْضَ الْوَقْتِ أَوْ ظُہْرَ الْوَقْتِ کَذَا فِیْ شَرْحِ مُقَدِّمَۃِ أَبِی اللَّیْثِ وَلَا یَکْفِیْہِ نِیَّۃُ الْفَرْضِ وَإِذَا نَویٰ فَرْضَ الْوَقْتِ جَازَ إِلَّا فِی الْجُمُعَۃِ وَلَوْ نَویٰ الظُّہْرَ فِیْ غَیْرِ الْجُمُعَۃِ قِیْلَ یَجُوْزُ ہُوَالصَّحِیْحُ]]‘‘۔
ترجمہ:’’واجبات اور فرائض مطلق نیت سے ادا نہیں ہوںگے ،اس پر اجماع ہے ، جیسا کہ ’’غیاثیہ‘‘ میں ہے ،فرض نماز میں تعیین ضروری ہے ،پس یہ کہے: میں آج کے ظہر کی نیت کرتاہوںیا وقتی فرض کی یا وقتِ ظہر کی نیت کرتاہوں ،جیساکہ ’’مُقَدِّمہ ابو اللّیث ‘‘ کی شرح میں ہے اور(وقت کی تعیین کے بغیر مطلق) فرض کی نیت کافی نہیں ہے ،مگر جب فرض ِوقت کی نیت کی تو جائز ہے مگر جمعہ میں فرض وقت کی نیت کافی نہیں اور اگر جمعہ کے علاوہ ظہر کی نیت کی تو بعض نے جائز قرار دیا ،یہ صحیح ہے ،(فتاویٰ عالمگیری ، جلد1،ص:65)‘‘۔
صحتِ نیت کے لیے چند امور ضروری ہیں: 
(۱) نیت دل کے ارادے کو کہتے ہیں،محض جاننا نیت نہیں ہے ۔
(۲) نیت میں محض زبان سے اداکیے ہوئے الفاظ کا اعتبار نہیں ہے ،پس اگر دل میں ظہر کی نیت کی اور وقت بھی ظہر کاہے ، لیکن زبان سے لفظ عصر نکلا تونماز اداہوجائے گی۔
(۳) محتاط ترین بات یہ ہے کہ تکبیرِ تحریمہ کے وقت نیت حاضر ہو،اگرنیت  پہلے کرلی اور درمیان میں کوئی اجنبی فعل عارض نہیں ہوا (جیسے کھانا پینا کلام وغیرہ) توبھی صحتِ ادا کے لیے یہ نیت کافی ہے۔
(۴) نماز شروع کرتے وقت دل میں نیت حاضر نہیں ہے ،تودوران نماز کی نیت کا اعتبار نہیں ہے۔`
},
{
  pageNumber: 143,
  text: `(۵) صحیح یہ ہے کہ سنت اور نفل کے لیے مطلق نماز کی نیت کافی ہے ،وقت کی تعیین ضروری نہیں ہے، البتہ احتیاط کاتقاضا یہ ہے کہ تراویح کے لیے تراویح یا قیام اللیل کی نیت کرے ، البتہ فرض اور واجب نماز کے لیے بالترتیب فرض اور واجب کی نیت ضروری ہے۔
(۶) نیت حاضر ہونے کے معنیٰ یہ ہیں کہ اگرکوئی پوچھے، کون سی نماز پڑھ رہے ہو توکسی تردّد یا سوچ بچار کیے بغیر بتادے کہ مثلاً : ظہر کی نماز پڑھ رہاہوں،(بہارِ شریعت،جلدسوم ، ص:493، ملخصاً ) ‘‘ ۔

[[heading: مسبوق کی نماز اور سِرّی نماز میں ثناء پڑھنے کا مسئلہ]] 
سوال:
زید ظہر ،عصر یا عشا ء کی چوتھی رکعت میں شامل ہوا ،بقیہ رکعات اداکرنے کا کیا طریقہ ہے ؟،(محمد اشرف ،قصبہ کالونی کراچی )۔ 
جواب: 
امام کے ایک رکعت یا چند رکعات پڑھنے کے بعد جو شخص جماعت میں شامل ہوا اور آخر تک رہا ،اُسے ’’مسبوق‘‘ کہتے ہیں ۔مسبوق  امام کے سلام پھیرنے کے بعدجب اپنی نماز شروع کرے گا تویہ حقِ قراء ت میں اس کی پہلی رکعت قرار دی جائے گی اور اِس میں مسبوق ثناء (اگر پہلے نہ پڑھی ہو)، سورۂ فاتحہ اور سورت پڑھے گا ،رکوع وسجود کے بعد حقِ تَشہُّد میں یہ دوسری  یا تیسری یا چوتھی رکعت جوشمار میں آئے، قرار پائے گی ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَلَوْ أَدْرَکَ رَکْعَۃً مِّنَ الرُّبَاعِیَّۃِ فَعَلَیْہِ أَن یَقْضِیَ رَکْعَۃً یَقْرَأُ فِیْہَا الْفَاتِحَۃَ وَالسُّوْرَۃَ وَیَتَشَہَّدُ وَیَقْضِیَ رَکْعَۃً أُخْرٰی کَذٰلِکَ وَلَا یَتَشَہَّدُ وَفِی الثَّالِثَۃِ بِالْخِیَارِ وَالْقِرَائَۃُ أَفْضَلُ.ہٰکَذا فِی الْخُلَاصَۃِ]]‘‘۔
ترجمہ:’’اگر مسبوق نے چار رکعات والی نماز میں سے ایک رکعت پائی ،(امام کے سلام پھیرنے کے بعد) اس پر لازم ہے کہ پہلی رکعت اس طرح پوری کرے کہ سورۂ فاتحہ اور`
},
{
  pageNumber: 144,
  text: `سورت اور (قعدہ میں) تَشَہُّد پڑھے ،دوسری رکعت بھی اسی طرح پڑھے اور اس میں تَشَہُّد نہ پڑھے ،اور تیسری رکعت میں خیار ہے ،قرا ء ت کرناافضل ہے، ’’خلاصۃ الفتاویٰ‘‘ میں اسی طرح ہے ، (فتاویٰ عالمگیری ،جلد اول،ص:95)‘‘۔
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَیَقْضِیْ أَوَّلَ صَلَاتِہٖ فِی حَقِّ قِرَائَۃٍ،وَاٰخِرَہَا فِیْ حَقِّ تَشَہُّدٍ، فَمُدْرِکُ رَکْعَۃٍ مِّنْ غَیْرِ فَجْرٍ یَاْتِیْ بِرَکْعَتَیْنِ بِفَاتِحَۃٍ وَّسُوْرَۃٍ وَّتَشَہُّدٍ بَیْنَہُمَاوَبِرَابِعَۃٍ الرُّبَاعِیِّ بِفَاتِحَۃٍ فَقَطْ،وَلَا یَقْعُدُ قَبْلَہَا]]‘‘۔
ترجمہ:’’مسبوق اپنی فوت شدہ رکعت قراء ت کے حق میں اول اور تَشَہُّد کے حق میں آخر نماز تصورکرکے ادا کرے،فجر کے علاوہ ایک رکعت پانے والا دو رکعات کو فاتحہ اور سورت اور ان کے درمیان تَشہُّد کے ساتھ اداکرے اور چاررکعات نماز میں چوتھی رکعت کو صرف فاتحہ کے ساتھ پڑھے اور اس سے پہلے قعدہ نہ کرے ،(جلد 3،ص:644،دمشق )‘‘۔
آپ نے مسئلے کی جو صورت دریافت کی ہے ،اُس کا جواب یہ ہے : مُقتدی امام کے سلام پھیرنے کے بعد اللہ اکبر کہہ کر اٹھے اورثناو فاتحہ کے ساتھ سورت ملاکر رکعت مکمل کرے اور اَلتّحیات پر بیٹھ جائے کیونکہ امام کے ساتھ پڑھی جانے والی ایک رکعت کو ملاکر اب اُس کی دو رکعات ہوچکی ہیں ۔ اُس کے بعد تیسری رکعت کے لیے کھڑا ہو اور اُس میں فاتحہ کے ساتھ سورت ملاکر رکعت مکمل کرے اور آخر میں صرف فاتحہ پڑھ کر اپنی چوتھی رکعت پڑھے اور اس طرح نماز مکمل کرے ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’ [[arabic: اِلَّاإذَاشَرَعَ الْإِمَامُ فِی الْقِرَاءَۃِ سَوَاءٌ کَانَ مَسْبُوْقًاأَوْ مُدْرِکًاوَّسَوَاءٌ کَانَ إمَامُہٗ یَجْہَرُ بِالْقِرَاءَۃِأَوْ لَا، فَإنَّہٗ لَا یَاْتِی بِہٖ لِمَا فِی النَّہْرِ عَنِ الصُّغْرٰی:أَدْرَکَ الْإِمَامَ فِی الْقِیَامِ یُثْنِیْ مَا لَمْ یَبْدَأْ بِالْقِرَاءَۃِ، وَقِیْلَ فِی الْمُخَافَتَۃِ یُثْنِیْ]]‘‘۔
ترجمہ:’’ مگرجب امام قراء ت شروع کردے ،خواہ وہ جہری قراء ت کررہاہو یا سرّی ،`
},
{
  pageNumber: 145,
  text: `مقتدی ثناء (سُبْحَانَکَ اللّٰہُمَّ) نہیں پڑھے گا ، خواہ وہ مقتدی مسبوق ہو یا مُدرِک، ’’اَلنَّھْرُ الْفَائِق ‘‘ میں صغریٰ کے حوالے سے ہے: (مقتدی نے )امام کو قیام میں پایا ،توجب تک امام نے قراء ت نہ شروع کی ہو ،مقتدی ثناء پڑھ لے اور ایک قول یہ ہے کہ سرّی قراء ت کے دوران بھی ثناء پڑھ لے ‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ متعدد ثقہ حوالہ جات کے ساتھ بشمول امام قاضی خان رحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: وَلَوْ أَدْرَکَ الْإِمَامَ بَعْدَ مَا اشْتَغَلَ بِالْقِرَاءَۃِ،قَالَ ابْنُ الْفَضْلِ:لَا یُثْنِیْ وَقَالَ غَیْرُہٗ : یُثْنِیْ وَیَنْبَغِیْ التَّفْصِیْلُ:إِنْ کَانَ الْإِمَامُ یَجْہَرُ لَا یُثْنِیْ وَإِنْ کَانَ یُسِرُّ یُثْنِیْ وَہُوَ مُخْتَارُ شَیْخِ الْإِسْلَامِ خَوَاہَرْ زَادَہْ،وَعَلَّلَہٗ فِی الذَّخِیرَۃِ بِمَاحَاصِلُہٗ أَنَّ الْاِسْتِمَاعَ فِی غَیْرِحَالَۃِ الْجَہْرِلَیْسَ بِفَرْضٍ،بَلْ یُسَنُّ تَعْظِیمًالِلْقِرَاءَۃِ فَکَانَ سُنَّۃً غَیْرَ مَقْصُوْدَۃٍ لِذَاتِہَا،وَعَدَمُ قِرَائَۃِ الْمُؤْتَمِّ فِی غَیْرِ حَالَۃِ الْجَہْرِ لَا لِوُجُوْبِ الْإِنْصَاتِ،بَلْ لِأَنَّ قِرَائَۃَ الْإِمَامِ لَہٗ قِرَائَۃٌ۔ وَأَمَّا الثَّنَاءُ فَہُوَ سُنَّۃٌ مَقْصُوْدَۃٌ لِّذَاتِہَاوَلَیْسَ ثَنَاءُ الْإِمَامِ ثَنَاءً لِلْمُؤْتَمِّ،فَإِذَا تَرَکَہٗ یَلْزَمُ تَرْکُ سُنَّۃٍ مَّقْصُوْدَۃٍ لِذَاتِہَا لِلْإِنْصَاتِ الَّذِیْ ہُوَ سُنَّۃٌ تَبَعًابِخِلَافِ تَرْکِہٖ حَالَۃَ الْجَہْرِ،فَکَانَ الْمُعْتَمَدُ مَا مَشَی عَلَیْہِ الْمُصَنِّفُ،فَافْہَمْ]]‘‘۔
ترجمہ:’’اورجب مقتدی امام کے قراء ت میں مشغول ہونے کے بعد جماعت میں شامل ہوا،ابن فضل نے کہا: ثناء نہیں پڑھے گا اور دوسرے علماء نے کہا : پڑھے گا اور اس کے لیے تفصیل درکار ہے ،اگر امام جہری قراء ت کررہاہے ،تو ثناء(سُبْحَانَکَ اللّٰہُمَّ) نہ پڑھے اوراگر سرّی قراء ت کررہا ہے تو پڑھ لے ،شیخ الاسلام خواہر زادہ کا یہی مختار ہے اور’’ ذخیرہ‘‘ میںاس کی علت یہ بیان کی ہے ،قراء تِ سِرّی ہورہی ہو تو اِستماع ( توجہ سے سننا) فرض نہیں ہے ،بلکہ قراء ت کی تعظیم کے لیے یہ سنّت ہے ،سویہ ایسی سنت ہے جو مقصود بالذات نہیں ہے اور سرّی قراء ت کی صورت میں مقتدی کے قراء ت نہ کرنے کا حکم اس وجہ سے`
},
{
  pageNumber: 146,
  text: `نہیں کہ ( سِرّی قراء ت کے دوران )اس کا چپ رہنا واجب ہے، بلکہ اس لیے ہے کہ امام کی قراء ت ہی اس کی قراء ت ہے (یعنی باجماعت نماز میں امام کی جہری اور سرّی قراء ت کا حکم یکساں ہے)،جبکہ ثناء (سُبْحَانَکَ اللّٰہُمَّ) پڑھنا ’’ مقصود بالذات سنت ‘‘ہے اور امام کی ثناء مقتدی کے لیے کافی نہیں ہے، پس جب مقتدی(امام کی سرّی قراء ت کے دوران) ثناء کو چھوڑے گا تو (قراء ت کے دوران) انصات(خاموش رہنا)کی خاطرجوکہ تبعاًسنت ہے مقصودبالذات سنت ثناء کوچھوڑے گا۔ اس کے برعکس امام کی جہری قراء ت کے دوران چونکہ اِنصات واِستماع(خاموش رہنا اور توجہ سے سننا) واجب ہے ،لہٰذا مصنف کا قول ہی معتمد ہے، اسے سمجھیے ،(ردالمحتار علی الدرالمختار ، جلد  2،ص:167-168،بیروت )‘‘۔
الغرض جب مسبوق مقتدی امام کے ساتھ اس حال میں شامل ہوا کہ امام سرّی قراءت کررہاہے،تو مقتدی ثناء پڑھ لے ،کیونکہ امام کی سرّی قراء ت کے دوران مقتد ی کا انصات (خاموش رہنا) مقصود بالذات سنّت نہیں ہے، بلکہ تعظیم قراء ت کے لیے تبعاً سنت ہے ،جبکہ مقتدی کا ثناء پڑھنا مقصود بالذات سنّت ہے اور ثناء کوقراء ت پر قیاس نہیں کرسکتے، کیونکہ امام کی قراء ت مقتدی کے لیے کافی ہے ،جبکہ امام کی ثنا مقتدی کے لیے کافی نہیں ہے،بلکہ مقتدی کو اپنی ثناء پڑھنی ہوتی ہے ۔

[[heading: نماز کے لیے مقررہ وقت میں تاخیر کرنا]] 
سوال:
ہماری محلے کی مسجد میں پچھلے تقریباً 25 سال سے گیارہویں شریف کی محفل پاک چاند کی گیارہ کی نمازِ مغرب سے عشا تک بلا ناغہ ہو رہی ہے اور محفل کا کچھ حصہ نماز عشاکے بعد بھی جاری رہتا ہے، مثلاً ذکر شریف اور لنگر شریف وغیرہ ، اکثر نماز عشا لیٹ ہو جاتی ہے ۔ اس ضمن میں پیش امام صاحب کو کئی دفعہ انتظامیہ کی جانب سے باور کرایا گیا ہے کیونکہ نقیب محفل کے فرائض بھی امام صاحب ہی ادا کر رہے ہوتے ہیں، تقریباً پونے دو گھنٹے کی محفل میں عشا کی نماز دس سے پندرہ منٹ لیٹ ہونا معمول بن گیا ہے ۔ اس کے علاوہ نماز جمعہ بھی پانچ سے دس منٹ لیٹ ہونا معمول بن گیا ہے ۔ باقی نمازیں جو وقت پر پڑھانا اُن کی ذمہ`
},
{
  pageNumber: 147,
  text: `داری ہے ، ایک یا دو منٹ لیٹ پڑھاتے ہیں ۔ برائے مہربانی قرآن و سنت کی روشنی میں فرمائیے کہ اس عمل سے گنہگار ی تو نہیں ہو رہی اور اگر یہ گنہگاری والا عمل ہے، تو اس کا ذمہ دار کون ہے انتظامیہ یا امام صاحب اور یہ کہ فرض نماز پر نفلی عبادت کو ترجیح دی جا سکتی ہے؟، (محمد اعظم ظہیر، انتظامیہ مسجد )۔
جواب:
نماز کے حوالے سے ارشادِ باری تعالیٰ ہے :
’’[[arabic: إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا]]‘‘۔
ترجمہ:’’ بے شک نماز مومنوں پر وقت کی پابندی کے ساتھ فرض کی گئی ہے ، (نساء: 103)‘‘۔نمازِ فجر کا وقت صبحِ صادق سے طلوعِ آفتاب تک ہے ،نمازِ ظہر سورج ڈھلنے سے ہرچیز کا سایہ سایۂ اصلی کے علاوہ دو مثل ہونے تک ہے ،عصر کا وقت سایہ دومثل ہونے سے سورج ڈوبنے تک ہے ۔مغرب کا وقت غروبِ آفتاب سے غروبِ شفق تک ہے اور عشاء کا وقت غروبِ شفق سے طلوعِ فجر تک ہے ۔الغرض شریعت میں نمازوں کے اوقات کا اول وآخر وقت بیان کرکے تعین کردیاگیاہے، فقہ میں اس امرکا بھی بیان ہے کہ افضل وقت کون ساہے۔
ہمارے یہاں گھڑی کے اعتبار سے نمازوں کے اوقات کی تعیین ایک انتظامی امر ہے اوریہ آسانی کے لیےاورشریعت کی مُقررہ حد کے اندر رہتے ہوئے کرتے ہیں ،اس لیے اِس تعیین میں کوئی حرج نہیں ہے ،اللہ تعالیٰ کا ارشاد ہے :
(۱)’’ [[arabic: وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ]]‘‘۔
ترجمہ:’’ تمہارے لیے دین میں تنگی نہیں رکھی ، (الحج:78)‘‘ ۔
(۲)’’[[arabic: يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ]]‘‘۔
ترجمہ:’’ اللہ تعالیٰ تمہارے لیے آسانی چاہتاہے ، وہ تمہارے لیے دشواری نہیں چاہتا، (البقرہ:185 ) ‘‘۔`
},
{
  pageNumber: 148,
  text: `امام صاحب کو چاہیے کہ نمازوں کے مقررہ اوقات کی پابندی کریں تاکہ لوگ مُتنفّر نہ ہوں،رسول اللہ صلی اللہ علیہ وسلم کا ارشاد ہے:
’’ [[arabic: یَسِّرُوْاوَلَاتُعَسِّرُوْا وَبَشِّرُوْا وَلَاتُنَفِّرُوْا]]‘‘۔
 ترجمہ:’’ دین کو آسان کرکے پیش کرو ،مشکل کرکے پیش نہ کرواور لوگوں کو (اللہ کی رحمت کی) بشارت دو،اُنہیں (دین سے) مُتنفّر نہ کرو،(صحیح بخاری:69)‘‘۔
پانچوں نمازوں کے شرعی اوقات نماز کے لیے ظرفِ زمان ہیں ،کوئی بھی فرض نمازپورے وقت کو محیط نہیں ہوتی،البتہ شریعت میںافضل ومستحب اور مکروہ اوقات کے بارے میں رہنمائی کی ہے ۔مساجد میں نمازِ باجماعت کے لیے جو اوقات مقرر کیے جاتے ہیں، یہ تعیینِ شرعی نہیں ہے، بلکہ لوگوں کی آسانی کے لیے ہے۔تاہم اگر ان مُقررہ اوقات میں نماز کی ادائیگی میں کبھی کبھار تقدیم وتاخیر ہوجائے تو شرعاً مواخذہ نہیں ہے اور نہ  گنہگاری کا عمل ہے ، البتہ وقت کی پابندی اخلاقی فریضہ ہے ۔
ہمارے نزدیک افضل صورت تویہ ہے کہ اذان ونماز باجماعت مقررہ وقت پر ہو اور وقفۂ نماز کے لیے تقریب موقوف کرلی جائے ،نماز سے فراغت کے بعد اسے جاری رکھ سکتے ہیں ۔ہمارے ادارے جامعہ نعیمیہ کا سالانہ جلسۂ تقسیم اَسناد ودستارِ فضیلت اگر مسجد میں ہورہاہے ،توہم نظم اس طرح ترتیب دیتے ہیں کہ اذان ونماز باجماعت اپنے مقررہ وقت پر ہو ۔لیکن اگر تقریب کے منتظمین کا نظم یہ ہوکہ تقریب جاری رہے اور اس کے بعد اذان ونمازِ باجماعت ہوبشرطیکہ وقت میں گنجائش ہے ،تو اس کے لیے ایک دن پہلے نمازیوں کو مطلع کردیاجائے ۔جمعۃ المبارک کی نماز میں بھی وقت کی پابندی کرنی چاہیے ۔ ہم جب نماز کا فلسفہ اورحکمتیں بیان کرتے ہیں تو بتاتے ہیں کہ نماز پابندیٔ وقت سکھاتی ہے اور عمل اس کے برعکس کریں تویہ قول وفعل میں تضاد ہے جو اللہ تعالیٰ کو بہت ناپسند ہے۔ارشادِ باری تعالیٰ ہے :
’’[[arabic: يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ]]‘‘۔`
},
{
  pageNumber: 149,
  text: `ترجمہ:’’اے ایمان والو! تم ایسی بات کیوں کہتے ہو ،جن پر تم خود عمل نہیں کرتے ،اللہ کے نزدیک یہ بڑی ناراضی کی بات ہے کہ تم ایسی بات کہو ،جو خود کرتے نہیں ہو، (الصف: 2-3) ‘‘۔
رسول اللہ صلی اللہ علیہ وسلم باجماعت نمازوں میںلوگوں کے احوال کا لحاظ رکھتے تھے ،حدیث پاک میں ہے : 
(۱)’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ أَنَّ رَسُوْلَ اللَّہِ ﷺقَالَ: إِذَا صَلّٰی أَحَدُکُمْ لِلنَّاسِ فَلْیُخَفِّفْ، فَإِنَّ مِنْہُمُ الضَّعِیْفَ وَالسَّقِیْمَ وَالکَبِیْرَ،وَإِذَا صَلّٰی أَحَدُکُمْ لِنَفْسِہٖ فَلْیُطَوِّلْ مَا شَاءَ]]‘‘۔
ترجمہ:’’ حضرت ابو ہریرہ رضی اللہ عنہ سے روایت ہے : رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرمایا: جب تم میں سے کوئی شخص لوگوں کو نماز پڑھائے (یعنی امامت کرے ) تو اسے چاہیے کہ(مقدارِقرا ء ت میں ) تخفیف کرے ،کیونکہ اُن میں (یعنی جماعت میں شامل لوگوں میں) بعض لوگ کمزور ہوتے ہیںاوربعض بیمار یا بوڑھے ہوتے ہیں (یعنی زیادہ دیر تک نماز میں قیام اُن کے لیے دشوار ہوتا ہے ) اورجب تم میں سے کوئی شخص تنہانماز پڑھے تو وہ (اپنی استطاعت اور ذوق کے مطابق ) جتنی چاہے ،لمبی نماز پڑھے،(صحیح بخاری : 703)‘‘۔
(۲)’’[[arabic: أَخْبَرَنِیْ أَبُوْ مَسْعُوْدٍأَنَّ رَجُلًاقَالَ:وَاللّٰہِ یَارَسُولَ اللَّہِ!إِنِّی لَاَتَاَخَّرُ عَنْ صَلاَۃِ الْغَدَاۃِ مِنْ أَجْلِ فُلاَنٍ مِمَّا یُطِیْلُ بِنَا،فَمَا رَأَیْتُ رَسُوْلَ اللّٰہِ ﷺ فِی مَوْعِظَۃٍ أَشَدَّ غَضَبًا مِّنْہُ یَوْمَئِذٍ،ثُمَّ قَالَ:إِنَّ مِنْکُمْ مُنَفِّرِیْنَ،فَأَیُّکُمْ مَا صَلّٰی بِالنَّاسِ فَلْیَتَجَوَّزْ،فَإِنَّ فِیْہِمُ الضَّعِیْفَ وَالکَبِیْرَ وَذَا الْحَاجَۃِ]]‘‘۔
ترجمہ:’’ حضرت ابو مسعود رضی اللہ عنہ بیان کرتے ہیں :ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوکر عرض کی : یارسول اللہ صلی اللہ علیہ وسلم ! میںفلاں شخص کی وجہ سے نماز ِفجر سے رہ جاتا ہوں کیونکہ وہ ہمیں طویل نماز پڑھاتے ہیں ۔حضرت ابو مسعود کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اُس دن کے مقابلے میں کبھی وعظ ونصیحت کے موقع پراتنا غضبناک نہیں دیکھا، پھر آپ  صلی اللہ علیہ وسلم نے فرمایا: تم لوگوں کو (دین سے) متنفّرکرنے والے ہو، پس تم میں سے جو شخص لوگوں کو نماز پڑھائے (یعنی امامت کرے) ،تو اسے چاہئے کہ (مقدارِ`
},
{
  pageNumber: 150,
  text: `قراء ت میں) تخفیف کرے کیونکہ ان میں (یعنی جماعت میں شامل لوگوں میں سے) بعض لوگ کمزور یا بوڑھے یا کام کاج والے ہوتے ہیں،(یعنی زیادہ دیر تک نماز میں قیام اُن کے لیے دشوار ہوتا ہے)،(صحیح بخاری:702)‘‘۔
(۳)’’[[arabic: عَنْ أَبِیْ قَتَادَۃَعَنِ النَّبِیِّ ﷺقَالَ:إِنِّی لَاَقُوْمُ فِی الصَّلاَۃِ أُرِیْدُ أَنْ أُطَوِّلَ فِیْہَا، فَأَسْمَعُ بُکَاءَ الصَّبِیِّ،فَأَتَجَوَّزُ فِیْ صَلاَتِیْ کَرَاہِیَۃَ أَنْ أَشُقَّ عَلٰی أُمِّہٖ]]‘‘۔
ترجمہ:’’ حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نماز کے لیے کھڑا ہوتاہوں اورمیری خواہش ہوتی ہے کہ لمبی نماز پڑھوں کہ دریں اثنا ء میں بچے کے رونے کی آواز سنتاہوں، تومیں اس بات کو ناپسند کرتے ہوئے کہ اس کی ماں کو طول دشوار ہوگا ،میں نماز کو مختصر کردیتاہوں، (صحیح بخاری: 707)‘‘۔
الغرض اجتماعی عبادات میں مستحبات ومستحسنات کی سعادت کے حصول کے ساتھ ساتھ لوگوں کے احوال کی رعایت اور دشواریوں کا لحاظ رکھنا بھی ضروری ہے ،کیونکہ عبادت کے وقت خشوع وخضوع اور استحضار قلبی بھی ضروری ہے اور حتی الامکان کوشش کی جائے کہ لوگوں کی طبیعت پر گراں نہ گزرے ،جیساکہ حدیث پاک سے معلوم ہواکہ رحمۃ للعٰلمین صلی اللہ علیہ وسلم ایک بچے کے رونے پر اس کی ماں کے قلبی اضطراب کابھی پاس رکھتے تھے ۔

[[heading: صحت اقتدا کے لیے امام اور مقتدی کی نماز کا ایک ہونا ضروری ہے]] 
سوال:
اگر امامت کرانیوالا شخص مسافر ہواور اسکی مغرب کی نماز قضا ہو چکی ہو،عشاء کا وقت ہو۔ امام کہے کہ میں تین فرض مغرب کے پڑھ کر سلام پھیر دوں گا اورآپ اپنی عشاء کی نماز پوری کر لیجیے گا، اب امام اور مقتدیوں کی نیت میں تضاد آگیا،ایسی صورت میںکیا مقتدیوں کی نمازِ عشاء اداہو جائیگی ؟، (رائے فیصل پناہ،دبئی)۔
جواب: 
اقتدا کی شرائط میں سے ایک شرط یہ ہے کہ امام اور مقتدی دونوں کی نمازاس طورپر`
},
{
  pageNumber: 151,
  text: `ایک ہوکہ امام کی نماز مقتدی کی نماز کو مُتضمن ہو ۔
علامہ زین الدین ابن نجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں :
’’ [[arabic: اِنَّ اتِّحَادَ الصَّلَاتَیْنِ شَرْطٌ لِصِحَّۃِ الِاقْتِدَاءِ وَذٰلِکَ بِاَنْ یُّمْکِنَہُ الدُّخُوْلَ فِی صَلَاتِہٖ بِنِیَّۃِ صَلَاۃِ الْإِمَامِ فَتَکُوْنَ صَلَاۃُ الْإِمَامِ مُتَضَمِّنَۃً لِّصَلَاۃِ الْمُقْتَدِیْ وَہُوَ الْمُرَادُ بِقَوْلِہٖ عَلَیْہِ الصَّلَاۃُ وَالسَّلَامُ: اَلْإِمَامُ ضَامِنٌ أَیْ تَتَضَمَّنُ صَلَاتُہٗ صَلَاۃَ الْمُقْتَدِیْ]]‘‘۔
ترجمہ:’’صحتِ اقتدا کی ایک شرط یہ ہے کہ امام ومقتدی کی نمازایک ہو(یعنی دونوں ایک ہی وقت کی ادا یا قضا نمازپڑھ رہے ہوں)اوروہ اس طرح کہ مقتدی کے لیے امام کی نیت کے مطابق نماز میں داخل ہونا ممکن ہو،تاکہ امام کی نماز مقتدی کی نماز کو مُتضمن ہو ،نبی کریم صلی اللہ علیہ وسلم کے اس ارشاد کہ’’ امام ضامن ہے ،یعنی اس کی نماز مقتدی کی نماز کو مُتضّمن ہے‘‘ سے یہی مراد ہے ،(البحرالرائق،جلد1،ص:631-632)‘‘۔
مکمل حدیث یہ ہے : 
’’[[arabic: قَالَ رَسُوْلُ اللّٰہِﷺ:اَلْإِمَامُ ضَامِنٌ، وَالْمُؤَذِّنُ مُؤْتَمَنٌ،اَللّٰہُمَّ أَرْشِدِ الْاَئِمَّۃَ وَاغْفِرْ لِلْمُؤَذِّنِیْنَ]]‘‘۔
ترجمہ:’’ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: امام ضامن ہے اور مؤذن امین ہے ،اے اللہ ! اماموں کو ہدایت نصیب فرما اور مؤذنوں کی مغفرت فرما،(سُنن ترمذی: 207)‘‘۔
 ایک شرط یہ بھی ہے کہ امام کا مقیم یا مسافر ہونا معلوم ہو ،یہ شرط حقیقۃً صحتِ نماز کی شرط نہیں بلکہ صحتِ اقتدا کے لیے شرط ہے ،لہٰذا اگر نماز کے بعد حال معلوم ہو جائے ،نماز صحیح ہوجائے گی ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: لَا یَصِحُّ اِقْتَدَاءُ مُصَلِّی الظُّہرِ بِمُصَلِّی الْعَصْرِ وَمُصَلِّی ظُہْرَ یَومِہٖ بِمُصَلِّی ظُہْرِ أَمْسِہٖ وَبِمُصَلِّی الْجُمُعَۃِ وَکَذَا عَکْسُہٗ]]‘‘۔
ترجمہ:’’ ظہر کی نماز پڑھنے والے کی  عصر کی نماز پڑھنے والے کے پیچھے اقتداءدرست نہیں`
},
{
  pageNumber: 152,
  text: `ہے ،اسی طرح آج کی (ادا) ظہر پڑھنے والے کی کل کی قضائے ظہر یا جمعہ پڑھانے والے  کے پیچھے اقتداءدرست نہیں ہے اور اسی طرح اس کے برعکس صورت کا حکم ہے ،(فتاویٰ عالمگیری ،جلد1، ص:86)‘‘۔یعنی وقت اور ادا ء وقضا کے اعتبار سے امام اور مقتدی کی نیت ایک ہونی چاہیے ۔ صورتِ مسئولہ میں چونکہ امام اور مقتدیوں کی نماز میں اتحاد نہ ہونے کی وجہ سے امام کی نماز مقتدیوں کی نماز کو مُتضمن نہیں ہے، لہٰذا عشاء کی ادانماز پڑھنے والے مقتدیوں کی نماز وقت عشاء میں مغرب کی قضا پڑھنے والے امام کے پیچھے درست نہیں ہوگی، مقتدی اپنی ادا نماز تنہایا باجماعت پڑھیں اور اگر سوال میں بیان کی گئی صورت کے مطابق وہ نماز پڑھ چکے ہیں ، وہ نماز ادانہیں ہوئی ،اس کا اعادہ کریں۔

[[heading: امام کی اقتدا میں مقتدی کے لیے قراء ت کا حکم]] 
سوال:
باجماعت نماز میں تیسری اور چوتھی رکعت میں کہ جب امام با آواز بلند تلاوت نہ کر رہے ہوں،خود مقتدی کے لیے تلاوت کا کیا حکم ہے، نیز اگر یہ غلط ہے تو پچھلی ادا کردہ نمازوں کی صحت کا کیا حکم ہے؟،(محمددانیال احمد ،ملتان)۔
جواب: 
باجماعت نمازوں میں مقتدی امام کے پیچھے خاموش کھڑا رہے گا ،خواہ نماز سرّی (یعنی ظہر وعصرکی)ہو یا جہری(فجر ،مغرب اورعشاء کی) ۔ ہر نماز کی ہر رکعت میں مقتدی کو قراء ت اصلاً جائز نہیں ہے ،وہ خاموش کھڑا رہے ،تکبیرِ تحریمہ کے بعدصرف ثنا(سُبْحَانَکَ اللّٰہُمَّ)پڑھے ،جبکہ امام نے جہراً قراء ت شروع نہ کی ہو،تنویرالابصار مع الدرالمختار میں ہے :
’’[[arabic: وَالْمُؤْتَمُّ لَایَقْرَأُ مُطْلَقًاوَلَا الْفَاتِحَۃَ فِی السِّرِّیَّۃِ اتِّفَاقًا۔۔۔بَلْ یَسْتَمِعُ إذَا جَہَرَ وَیُنْصِتُ إذَا أَسَرَّلِقَوْلِ أَبِی ہُرَیْرَۃَ رَضِیَ اللّٰہُ عَنْہُ: کُنَّا نَقْرَأُ خَلْفَ الْإِمَامِ فَنَزَلَ:وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَہٗ وَأَنْصِتُوْا]]‘‘۔
ترجمہ:’’ مقتدی مُطلقاً(کسی بھی رکعت میں)قراء ت نہ کرے ،(نہ جہری نماز میں نہ سِرّی`
},
{
  pageNumber: 153,
  text: `نماز میں) اور نہ ہی سرّی نماز میں فاتحہ پڑھے ، اِس پر احناف کے ائمۂ ثلاثہ کا اتفاق ہے‘‘۔۔۔ آگے چل کر لکھتے ہیں: ’’بلکہ جب امام جہراً قراء ت کرے، تو مقتدی سُنے اور جب امام سرّاً پڑھے تو مقتدی چپ رہے ، حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : ہم امام کے پیچھے قراء ت کیاکرتے تھے ،پھریہ آیت نازل ہوئی:’’اورجب قرآن پڑھا جائے تو اس کو غور سے سنو اورخاموش رہو‘‘،(اعراف:204)‘‘۔
 (رَدُّالمحتار علی الدرالمختار ،جلد3،ص:475،دمشق)
حدیث کے الفاظ یہ ہیں:’’[[arabic: عَنْ أَبِیْ ہُرَیْرَۃَ،قَالَ:کَانُوْا یَتَکَلَّمُوْنَ فِی الصَّلَاۃِ، فَنَزَلَتْ:وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوْا لَہٗ وَأَنْصِتُوْا، قَالُوْا:ہٰذَا فِی الصَّلَاۃِ]]‘‘۔
ترجمہ:’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں : صحابہ نماز میں گفتگو کرلیاکرتے تھے ، پھریہ آیت نازل ہوئی:’’اورجب قرآن پڑھاجائے تو اس کو غور سے سنو اورخاموش رہو، (اعراف:204)‘‘،انہوں نے فرمایا:یہ حکم نماز کے بارے میںہے ،(مُصَنَّف ابن ابی شیبہ : 8380)‘‘۔

[[heading: ہرقعدے میں تَشَہُّد پورا پڑھنا واجب ہے]]
سوال:
التحیات کے آخر میں کلمہ شہادت پورا پڑھنا افضل ہے، کچھ حذف کرنے کا حکم کیاہے ؟، (محمددانیال احمد ،ملتان)۔
جواب: 
دونوں قعدوں میں پورا تَشَہُّد پڑھنا واجب ہے ،ایک لفظ بھی چھوڑا تو واجب ترک ہوگا اورسجدۂ سہو لازم ہوگا،علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَیَجِبُ التَّشَہُّدُ فِی الْقَعْدَۃِ الْاَخِیْرَۃِوَکَذَا فِی الْقَعْدَۃِ الْاُوْلٰی وَھُوَالصَّحِیْحُ ھٰکَذَافِی السِّرَاجِ الْوَہَّاجِ،وَھُوَ الْاَصَحُّ کَذَافِی مُحِیْطِ السَّرَخْسِیْ]]‘‘۔
ترجمہ:قعدۂ اخیرہ میں تَشَہُّد واجب ہے اور اسی طرح قعدۂ اُولیٰ میں بھی تَشَہُّد واجب ہے اور`
},
{
  pageNumber: 154,
  text: `یہی صحیح ہے ،جیساکہ ’’السراج الوہاج ‘‘ میںہے ،یہی صحیح ترین ہے ،محیط السرخسی میں اسی طرح ہے ،(فتاویٰ عالمگیری ،جلد 1،ص:71)‘‘۔
تنویرالابصار مع الدرالمختار میں ہے :
’’[[arabic: (وَالتَّشَہُّدَانِ)وَیَسْجُدُ لِلسَّہْوِ بِتَرْکِ بَعْضِہٖ کَکُلِّہٖ وَکَذَا فِی کُلِّ قَعْدَۃٍ فِی الْاَصَحِّ]]‘‘۔
ترجمہ:’’ دونوں قعدوں میں پورا تَشہُّدپڑھناواجب ہے اور تَشَہُّدکے بعض حصے کے ترک کرنے پر بھی سجدۂ سہو کرے گا جیساکہ پوری اَلتَّحیات ( تَشَہُّد)  کے ترک کرنے پر سجدۂ سہو لازم ہے،یہی حکم ہر قعدے کاہے ،یہی صحیح ترین ہے،(جلد3،ص:214،دمشق)‘‘۔ 

[[heading: امام کی پیروی میں مقتدی تکبیرات آہستہ کہے]] 
سوال:
باجماعت نماز کے دوران کون سے کلمات ہیںجو امام بآواز بلند پڑھےتومقتدی بھی پڑھے؟،(محمد دانیال احمد،ملتان)۔
جواب: 
دورانِ جماعت امام تکبیرِ تحریمہ،تکبیراتِ انتقال بلند آواز سے پڑھتاہے ،مقتدی بھی آہستہ پڑھے ،رکوع سے اٹھتے وقت جب امام ’’[[arabic: سَمِعَ اللّٰہُ لِمَنْ حَمِدَہٗ]]‘‘ پڑھے تو مقتدی ’’[[arabic: رَبّنَا لَکَ الْحَمْدُ]]‘‘آہستہ پڑھے اوراسی طرح نماز سے نکلنے کے لیے مقتدی ا مام کے سلام کہنے کے وقت  سلام بھی آہستہ کہے ۔
امام جہری نماز میں جہراً اور سِرّی نماز میں سِرًّاتلاوت کرتا ہے، لیکن مقتدی دونوں صورتوں میں خاموش رہے گا ،حدیث مبارک میں ہے : ’’[[arabic: مَنْ کَانَ لَہٗ اِمَامٌ فَقِرَائَتُہٗ لَہٗ قِراءَ ۃٌ]]‘‘، ترجمہ:’’ جس نے امام کی اقتدا میں نماز پڑھی ،تو امام کی قراء ت مقتدی کے لیے`
},
{
  pageNumber: 155,
  text: `کافی ہے،(مُصَنَّف ابن ابی شیبہ : 3779)‘‘۔ 

[[heading: نماز کے بعد وظائف پر شوہر کا اعتراض]] 
سوال:
میرے شوہر میری عبادت کی زیادتی پر اعتراض کرتے ہیں، خاص طور پر صبح کی نماز اور وظائف جو بیس منٹ پر مشتمل ہیں اور عشاء کی نماز اور وظائف جو تیس منٹ پر مشتمل ہیں۔ ان کا کہنا ہے کہ صرف فرض نماز ،سنت اور مختصر وظائف ہونے چاہئیں۔ان کا موقف صحیح ہے یا میں حق بجانب ہوں،  اس بارے میں شرعی حُکم کیا ہے، خاوند کی بات کو مانا جائے یا روزمرہ کی عبادت کوکم کیا جائے۔ برائے مہربانی تفصیلی جواب حوالہ جات کے ساتھ سے راہنمائی فرمائیں،(مدیحہ خان )۔
 جواب:  
اسلام میں فرائض وواجبات اورسُنن مؤکدہ پر تو اعتراض کی گنجائش ہی نہیں ہے ،البتہ ازدواجی تعلق استوار رکھنے اور حقوق وفرائض میں توازن پیداکرنے کے لیے نفلی عبادات میں اعتدال بہترہے ۔ذیل میں ہم دو اَحادیث مبارکہ پیش کررہے ہیں:
(۱) نبی صلی اللہ علیہ وسلم نے(مُواخاتِ انصار ومہاجرین کے موقع پر) حضرت سلمان اور حضرت ابوالدرداء کو ایک دوسرے کا بھائی بنایا، حضرت سلمان ،حضرت ابوالدرداء کی ملاقات کے لیے گئے۔ اُنہوں نے(اُن کی بیوی) حضرت اُم الدرداء کوخستہ حالت میں دیکھا توان سے پوچھا :یہ آپ نے اپنی کیاحالت بنارکھی ہے؟۔اُنہوں نے بتایاکہ تمہارے بھائی ابوالدرداء کو دنیامیں کوئی دلچسپی نہیں ہے۔پھر حضرت ابوالدرداء آئے توانہوں نے حضرت سلمان کو کھانا پیش کیا،حضرت سلمان نے کہا: آپ بھی کھائیں ،تو حضرت ابوالدرداء نے کہا: میں روزے سے ہوں ،حضرت سلمان نے کہا: میں اُس وقت تک نہیں کھاؤں گا ، جب تک کہ آپ نہیں کھائیں گے ، پھر حضرت ابوالدرداء نے(مہمان کی دلداری کے لیے نفلی روزہ توڑ کر) کھانا کھایا۔پھر جب رات ہوگئی تو حضرت ابوالدرداء(قیام اللیل کے)نوافل پڑھنے کے لیے کھڑے ہوگئے ،حضرت سلمان نے اُن سے کہا: آپ سوجائیں ،سو`
},
{
  pageNumber: 156,
  text: `وہ سو گئے۔ پھر(تھوڑی دیر بعد ) وہ نماز کے لیے اٹھے، حضرت سلمان نے پھرکہا: آپ سوجائیں ۔پھر جب رات کا آخری پہر ہواتو حضرت سلمان نے کہا: اب آپ اٹھیں ،پھر دونوں نے نماز پڑھی ،پھر اُن سے حضرت سلمان نے کہا:’’[[arabic: اِنَّ لِرَبِّکَ عَلَیْکَ حَقًّاوَلِنَفْسِکَ عَلَیْکَ حَقًّاوَلاَِہْلِکَ عَلَیْکَ حَقًّا، فَاَعْطِ کُلَّ ذِیْ حَقٍّ حَقَّہٗ،فَاَتَی النَّبِیَّ ﷺ فَذَکَرَ ذٰلِکَ لَہٗ،فَقَالَ النَّبِیُّ ﷺ:صَدَقَ سَلْمَانُ]]‘‘۔
ترجمہ:’’بے شک آپ کے رب کا آپ پر حق ہے ،آپ کے نفس کا آپ پر حق ہے اور آپ کے اہلِ خانہ کا آپ پر حق ہے،سو آپ ہر حق دار کو اُس کا حق (پورا پورا)دیں، پھر حضرت ابوالدرداء نبی صلی اللہ علیہ وسلم کے پاس حاضر ہوئے اور(شکایت کے انداز میں)آپ کو یہ ماجرا بیان کیا (کہ میرے بھائی سلمان نے رات مجھے قیام اللیل سے روکے رکھا)تونبی صلی اللہ علیہ وسلم نے فرمایا: سلمان نے سچ کہاہے ، (صحیح بخاری:1968)‘‘۔
(۲)’’[[arabic: سَمِعَ اَنَسَ بْنَ مَالِکٍ رَضِیَ اللّٰہُ عَنْہُ یَقُوْلُ: جَاءَ ثَلَاثَۃُ رَھْطٍ اِلٰی بُیُوْتِ اَزْوَاجِ النَّبِیِّ ﷺ یَسْاَلُوْنَ عَنْ عِبَادَۃِ النَّبِیِّ ﷺ ،فَلَمَّا اُخْبِرُوْا کَاَنَّھُمْ تَقَالُّوْھَا، فَقَالُوْا: وَاَیْنَ نَحْنُ مِنَ النَّبِیِّ ﷺ ،قَدْ غُفِرَلَہٗ مَا تَقَدَّمَ مِنْ ذَنْبِہٖ وَمَا تَاَخَّرَ، قَالَ اَحَدُھُمْ: اَمَّا اَنَا فَاِنِّیْ اُصَلِّیْ اللَّیْلَ اَبَدًا ،وَقَالَ اٰخَرُ: اَنَا اَصُوْمُ الدَّھْرَ وَلَا اُفْطِرُ، وَقَالَ اٰخَرُ: اَنَا اَعْتَزِلُ النِّسَاءَ فَلَا اَتَزَوَّجُ اَبَدًا،فَجَاءَ رَسُوْلُ اللّٰہِ ﷺ اِلَیْھِمْ،فَقَالَ: اَنْتُمُ الَّذِیْنَ قُلْتُمْ کَذَا وَکَذَا، اَمَا وَاللّٰہِ اِنِّیْ لَاَخْشَاکُمْ لِلّٰہِ وَاَتْقَاکُمْ لَہٗ لٰکِنِّیْ اَصُوْمُ وَاُفطِرُ وَاُصَلِّیْ وَاَرْقُدُ وَاَتَزَوَّجُ النِّسَاءَ فَمَن رَّغِبَ عَنْ سُنَّتِیْ فَلَیْسَ مِنِّیْ]]‘‘۔ 
ترجمہ:’’حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ: تین افرادنبی صلی اللہ علیہ وسلم کی ازواج کے گھروں پرگئے اور ان سے نبی صلی اللہ علیہ وسلم کی عبادت (کے معمولات) سے متعلق سوال کیا، پس جب انہیں(نبی صلی اللہ علیہ وسلم کی عبادت کے معمولات) بتائے گئے ، توگویا انہوں نے(اپنی دانست میںاس مقدارِ عبادت کو) کم سمجھا ۔ پھر انہوں نے کہا: کہاں ہم اورکہاں نبی صلی اللہ علیہ وسلم ؟،آپ کے تو تمام اگلے اور پچھلے بہ ظاہر خلافِ اولیٰ کاموں کی مغفرت کی (قرآن`
},
{
  pageNumber: 157,
  text: `کریم میں قطعی) نوید دی گئی ہے،تو ان میں سے ایک نے کہا:’’میں تو ہمیشہ پوری رات نوافل پڑھتے ہوئے گزاروں گا‘‘، دوسرے نے کہا:’’ میں ہمیشہ (نفلی)روزے رکھاکروں گا اور روزہ کبھی نہیں چھوڑوں گا‘‘، تیسرے نے کہا: ’’میں ہمیشہ عورتوں سے اجتناب کروں گااور کبھی نکاح نہیں کروں گا(تاکہ نہ بیوی بچے ہوں اورنہ خانگی ذمے داریوں کا جھنجھٹ)‘‘ ۔دریں اثنا رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے ،تو آپ ﷺ نے (اُن کی باتوں کو سن کر ) فرمایا: تو تم وہ لوگ ہو جنہوں نے ایسا ایسا کہا تھا؟،سنو! اللہ کی قسم! بے شک میں تم سب سے زیادہ متقی ہوں اور میرے دل میں اللہ کی خَشیَت سب سے زیادہ ہے، لیکن میں (نفلی)روزے رکھتا بھی ہوں اورکبھی چھوڑبھی دیتا ہوں اوررات کو(نوافل) پڑھتاہوں اور(کچھ دیر کے لیے) سوبھی جاتا ہوں اور میں نے عورتوں سے نکاح بھی کیے ہوئے ہیں،سو جس نے میری سنت سے اِعراض کرکے(تقوے کا من پسند طریقہ اختیار کیا) تو وہ میرے (پسندیدہ)طریقے پر نہیں ہے،(بخاری: 5063)‘‘۔
سطور بالا میں ہم نے عام ضابطہ بیان کیاہے ،لیکن آپ نے نماز فجر کے بعد بیس منٹ اور نمازِ عشاء کے بعد تیس منٹ کے وظائف کاجومعمول بتایاہے ،یہ بہت زیادہ وقت نہیں ہے۔اگر ان اوقات میں آپ کے شوہر کے کسی کام کاحرج نہ ہورہاہو یا صبح بچوں کے اسکول کی تیاری یا رات کو چھوٹے بچوں کے سلانے میں حرج نہ ہورہاہو ،تو شوہر کو دل بڑا رکھنا چاہیے ،کیونکہ گھر میں عبادت ،تلاوت اور اَذکار برکت کا سبب ہوتے ہیں اوراگروظائف کسی کام میں حرج کا سبب ہوں تو آپ اپنی سہولت کے مطابق وقت تبدیل کرلیں ۔نفلی عبادت کے معاملے میںخاوند سے مطابقت پیداکرنا بہتر ہے، خاوند کی رضامندی کے لیے نفلی عبادات میں تخفیف کی جاسکتی ہے ، یہاں تک کہ خاوند کے کہنے پر نفلی روزہ بھی چھوڑا جاسکتاہے۔

[[heading: ادا بہ نیتِ قضا یا قضا بہ نیتِ ادا پڑھنا]] 
سوال:
ایک شخص نمازِ ظہراخیروقت میں پڑھنے کے لیے کھڑا ہوا ،اُس نے گمان کیا کہ نماز قضا`
},
{
  pageNumber: 158,
  text: `ہوچکی ہے ،لہٰذا آج کی نمازِ ظہر قضا کی نیت کرلی ،بعد میں معلوم ہواکہ جس وقت اس نے نماز پڑھی ،ظہر کا وقت باقی تھا ،کیا اس کی نماز اداہوگئی ؟،(سید عمیر الحسن برنی ،کراچی ) ۔
جواب: 
فقہی مسئلہ یہی ہے کہ وقتی نماز پڑھ رہاہے تو قضا یا اداکی نیت کی ضرورت نہیں ، مطلق نیت کافی ہے اور زیادہ بہتر یہ ہے کہ آج کی (ظہر یا عصر) کی نیت کرلے ۔ اگر قضا نمازبہ نیتِ ادا پڑھی یا ادا بہ نیتِ قضا پڑھی ،تو نماز ہوجائے گی ،مثلاً وقتِ ظہر ابھی باقی ہے اور اس نے گمان کیا کہ وقت ختم ہوگیا اور اس دن کی نمازِ ظہر قضا کی نیت سے پڑھی یا وقت نکل جانے کے بعد اس نے اس گمان کے ساتھ کہ وقت باقی ہے ،اداکی نیت سے پڑھی ، نماز ہوگئی یہی مختار قول ہے ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: فَالْاَوْلٰی نِیَّۃُ ظُہْرِالْیَوْمِ لِجَوَازِہٖ مُطْلَقًا لِصِحَّۃِ الْقَضَاءِ بِنِیَّۃِ الْاَدَاءِ کَعَکْسِہٖ ہُوَ الْمُخْتَارُ]]‘‘۔
ترجمہ:’’بہتر یہ ہے کہ آج کی نیت کرے کیونکہ اس کا مطلقاً جواز ہے کیونکہ اداکی نیت سے قضا نماز صحیح ہے جیساکہ قضا کی نیت سے ادانماز صحیح ہے ،یہی مختار قول ہے ‘‘۔
’’[[arabic: قَوْلُہٗ لِصِحَّۃِ الْقَضَاءِ بِنِیَّۃِ الْاَدَاءِ]]‘‘ کی شرح میں علامہ ابن عابدین شامی لکھتے ہیں: 
’’[[arabic: ہٰذَا التَّعْلِیْلُ إنَّمَا یَظْہَرُ إِذَا نَوٰی الْاَدَاءَ،أَمَّاإذَا تَجَرَّدَتْ نِیَّتُہٗ فَلَا، وَالْمُنَاسِبُ مَا فِی الْأَشْبَاہِ عَنِ الْفَتْحِ:لَوْ نَوٰی الْاَدَاءَ عَلٰی ظَنِّ بَقَاءِ الْوَقْتِ فَتَبَیَّنَ خُرُوْجُہٗ أَجْزَأَہٗ وَکَذَا عَکْسُہٗ،ثُمَّ مَثَّلَ لَہٗ نَاقِلًا عَنْ کَشْفِ الْاَسْرَارِ بِقَوْلِہٖ: کَنِیَّۃِ مَنْ نَوٰی أَدَاءَ ظُہْرِ الْیَوْمِ بَعْدَخُرُوجِ الْوَقْتِ عَلٰی ظَنِّ أَنَّ الْوَقْتَ بَاقٍ،وَکَنِیَّۃِ الْاَسِیْرِ الَّذِی اشْتَبَہَ عَلَیْہِ رَمَضَانُ فَتَحَرّٰی شَہْرًا وَصَامَہٗ بِنِیَّۃِ الْاَدَاءِ فَوَقَعَ صَوْمُہٗ بَعْدَ رَمَضَانَ وَعَکْسُہٗ کَنِیَّۃِ مَنْ نَوٰی قَضَاءَ الظُّہْرِعَلٰی ظَنِّ أَنَّ الْوَقْتَ قَدْ خَرَجَ وَلَمْ یَخْرُجْ بَعْدُ، وَکَنِیَّۃِ الْاَسِیْرِ الَّذِیْ صَامَ رَمَضَانَ بِنِیَّۃِ الْقَضَاءِ عَلٰی ظَنِّ أَنَّہٗ قَدْ مَضٰی وَالصِّحَّۃُ فِیْہِ بِاعْتِبَارِ أَنَّہٗ أَتٰی بِاَصْلِ النِّیَّۃِ،وَلٰکِنْ أَخْطَاَ فِی الظَّنِّ وَالْخَطَاُ فِی مِثْلِہٖ مَعْفُوٌّ عَنْہٗ.أَقُوْلُ:وَمَعْنَی کَوْنِہِ أَتٰی بِاَصْلِ]]`
},
  {
    pageNumber: 159,
    text: `[[arabic: النِّیَّۃِ أَنَّہٗ قَدْ عَیَّنَ فِی قَلْبِہٖ ظُہْرَ الْیَوْمِ الَّذِیْ یُرِیْدُ صَلَاتَہٗ فَلَا یَضُرُّ وَصْفُہٗ لَہٗ بِکَوْنِہٖ أَدَاءً أَوْ قَضَاءً،بِخِلَافِ مَا إذَانَوٰی صَلَاۃَ الظُّہْرِ قَضَاءً وَہُوَ فِی وَقْتِ الظُّہْرِ وَلَمْ یَنْوِ صَلَاۃَ ہٰذَا الْیَوْمِ لَا یَصِحُّ عَنِ الْوَقْتِیَّۃِ لِأَنَّہٗ بِنِیَّۃِ الْقَضَاءِصَرَفَہٗ عَنْ ہٰذَا الْیَوْمِ وَلَمْ تُوجَدْ مِنْہُ نِیَّۃُ الْوَقْتِیَّۃِ حَتّٰی یَلْغُوَ وَصْفُہٗ بِالْقَضَاءِ فَلَمْ یُوجَدِالتَّعْیِیْنُ،وَکَذٰا لَوْ نَوَاہٗ أَدَاءً وَکَانَتْ عَلَیْہِ ظُہْرٌ فَائِتَۃٌ لَا یَصِحُّ عَنْہَا وَإِنْ کَانَ قَدْ صَلَّی الْوَقْتِیَّۃَ لِمَا قُلْنَا]]‘‘۔
ترجمہ:’’یہ تعلیل اس وقت ظاہر ہوتی ہے ،جب اداکی نیت کرے ،جب نیت خالی ہو تو صحیح نہیں ہوگی ،مناسب وہ ہے ،جو ’’الاشباہ ‘‘ میں ’’فتح القدیر ‘‘ کے حوالے سے ہے : اگر اس گمان پرادا کی نیت کی کہ وقت ابھی باقی ہے ،پھر معلوم ہواکہ وقت نکل چکاتھا ،تو نماز جائز ہوگی اور اسی طرح اس کا عکس ہے (یعنی اس گمان پر نماز قضا ء کی نیت کرکے پڑھی کہ وقت نکل چکاہے اور پھر معلوم ہوا کہ ابھی وقت باقی تھا)۔پھر ’’کشف الاسرار ‘‘ سے نقل کرتے ہوئے اس قول سے مثال دی: اس شخص کی نیت جس نے وقت نکلنے کے بعد یہ گمان کرتے ہوئے کہ ابھی وقت باقی ہے ،آج کی ظہر کی اداکی نیت کی ،اور اسی طرح ایسا قیدی،جس پر رمضان مشتبہ ہوگیاہو ،اس نے ایک مہینے کے لیے تحرّی کی اور اداکی نیت سے روزے رکھے پھر اس کے روزے رمضان کے بعد واقع ہوئے اور اس کے برعکس اس شخص کی نیت جس نے ظہر کی نماز کی قضا کی نیت یہ گمان کرتے ہوئے کی کہ وقت نکل چکا ہے ،حالانکہ ابھی ظہر کا وقت باقی تھااور اس قیدی کی نیت جس نے قضا کی نیت سے یہ گمان کرتے ہوئے روزے رکھے کہ رمضان گزر چکاہے (لیکن پھر معلوم ہوا کہ یہ رمضان تھا)۔اس میں صحت اس اعتبار سے ہے کہ وہ نیت کی اصل کولایا ،لیکن گمان میں غلطی کی اوراس کی مثل میں خطا معاف ہے ۔میں کہتاہوں: ’’وہ اصل نیت کو لایا ،اس کا معنیٰ یہ ہے کہ اس نے دل میں آج کی ظہر کی تعیین کی ،جس کی نماز کا اس نے ارادہ کیا۔پس اس کے لیے اس کا وصف ادا یا قضا ہونے کے ساتھ مضر نہیں ، بخلاف اس صورت کے جب اس نے ظہر کی نماز کی قضا کی نیت کی ،جبکہ وہ ظہر کے وقت میں تھا اور اس نے اس آج کی نماز کی نیت نہیں کی تھی ،تو وقتی نمازکی`
  },
  {
    pageNumber: 160,
    text: `طرف سے یہ نماز صحیح نہ ہوگی ۔کیونکہ قضا کی نیت سے اس نے اسے اس دن سے پھیردیا ہے اور اس سے وقتی نمازکی نیت نہیں پائی گئی حتّٰی کہ قضا کے ساتھ اس کا وصف لغو ہو،پس تعیین نہیں پائی گئی اور اسی طرح اگر اس نے ظہر کی اداکی نیت کی اور اس پر فوت شدہ ظہر تھی تویہ نماز اس کی طرف سے صحیح نہ ہوگی اگرچہ وہ وقتی نمازپڑھ چکاتھا ،اس وجہ سے جو ہم نے بیان کی ہے ،(حاشیہ ابن عابدین شامی ،جلد3، ص: 74 79، دمشق)‘‘۔
	اس ساری بحث کا خلاصہ یہ ہے : 
(الف)	 مطلقاً نماز کی نیت کافی ہے ، قضا یا اداکی تعیین ضرروی نہیں ہے یازیادہ بہتر یہ ہے کہ آج کی (ظہر یا عصر) کی نیت کرلے ۔ 
(ب) 	مثلاًکسی نے یہ گمان کرتے ہوئے کہ وقت نکل چکاہے، ظہرکی نماز بہ نیت قضا پڑھی، جبکہ ابھی وقت باقی تھا ،تو نماز اداہوجائے گی ۔
(ج)	کسی نے یہ گمان کرتے ہوئے کہ ابھی وقت باقی ہے ،نمازِظہر بہ نیت اداپڑھی ، پھر معلوم ہوا کہ وقت نکل چکاتھا ،تب بھی نماز صحیح طورپر ادا ہوگئی، اِن دونوں صورتوں کا مستفاد یہ ہے کہ ادا بہ نیتِ قضا اور قضا بہ نیتِ اداپڑھ لی تونماز درست ہے،جبکہ خطا نیت میں نہ ہو ،وقت کے حوالے سے گمان میں ہو۔ 
(د) 		نماز ظہر کا وقت ہے اور اس نے قضائے ظہر پڑھی (اور اس کے ذمے ظہر کی قضا باقی تھی) ،تو اس سے وقتی ادا نماز سے بری الذمہ نہیں ہوگا ، کیونکہ اس نے قضا کی نیت کرکے نماز کو وقتی فرض سے پھیردیا اور اس سے وقتی نمازکی نیت نہیں پائی گئی کہ اسے قضا سے پھیر کر وقتی نماز کی طرف لے آئے ۔
(ہ) 		ظہر کی نماز اداکی نیت سے پڑھی ،جبکہ اس کے ذمے قضائے ظہر بھی باقی تھی تو اس طرح قضاء سے بری الذمہ نہیںہوگا ،خواہ وقتی ظہر پڑھ چکاہو۔
صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں : 
’’قضا یا ادا کی نیت کی کچھ حاجت نہیں، اگرقضا بہ نیت ادا پڑھی یا ادا بہ نیت قضا، تو نماز ہوگئی، یعنی مثلاً وقت ظہر باقی ہے اور اس نے گمان کیا کہ جاتا رہا اور اس دن کی نماز ظہر بہ نیت قضا پڑھی یا وقت جاتا رہا اور اس نے گمان کیا کہ باقی ہے اوربہ نیت ادا پڑھی، ہوگئی اور اگر یوں نہ کیا، بلکہ وقت باقی ہے اور اس نے ظہر کی قضا پڑھی، مگر اس دن کے ظہر کی نیت نہ کی تو نہ`
  },
  {
    pageNumber: 161,
    text: `ہوئی، یوہیں اس کے ذمہ کسی دن کی نماز ظہر تھی اور بہ نیت ادا پڑھی نہ ہوئی،(بہارِ شریعت ، ج:1،ص:495)‘‘۔ 

علامہ زین الدین بن ابراہیم المعروف ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: قَوْلُہٗ:وَلِلْفَرْضِ شَرْطُ تَعْیِیْنِہٖ کَالْعَصْرِ مَثَلًا لِاِخْتِلَافِ الْفُرُوْضِ فَلَا بُدَّ مِنَ التَّعْیِیْنِ لِقَوْلِہٖ عَلَیْہِ الصَّلَاۃُ وَالسَّلَامُ:وَإِنَّمَا لِکُلِّ امْرِئٍ مَّا نَوٰی،أَطْلَقَہٗ فَشَمِلَ ]]‘‘۔
ترجمہ:’’ علامہ شیخ عبداللہ بن احمد نسفی کایہ قول:’’فرض کے لیے تعیین ضروری ہے ،مثلاً یوں کہے: عصر کی نماز ‘‘،کیونکہ فرضوں میں اختلاف ہوتاہے ،پس تعیین ضروری ہے ،کیونکہ نبی صلی اللہ علیہ وسلم کافرمان ہے: ہرشخص کے لیے وہی ہے ،جس کی اس نے نیت کی ،(حدیث مبارک میں) اسے مطلق رکھا ہے، پس یہ اس کو بھی شامل ہے ،(البحرالرائق ، ج:1، ص:485)‘‘۔

[[heading: فرض کے بعد والی سنتیں پہلے اداکرنے، سنتوں اورفرض کے درمیان نوافل پڑھنے کا حکم]] 
سوال:
	 ظہر کی سنتیں ادا کرنے کے بعد بھی جماعت میں ابھی وقت کافی ہے۔ تو کیا جماعت کے ساتھ فرض ادا کرنے کے بعد جو دو نفل ادا کرتے ہیں، کیا فرضوں سے پہلے میں اس خالی وقت میں ادا کر سکتا ہوں؟ اور اس طرح فرضوں کے بعد والی دو سنتیں بھی پڑھ سکتا ہوں یا نہیں۔ جامع سوال یہ ہوا کہ تمام نمازوں کے فرض، سنت اور نفل میں جو ترتیب ہے کیا بوقت ضرورت یا کافی وقت میسر ہونے کی وجہ سے یہ ترتیب بدلی جا سکتی ہے یا نہیں؟، اس ضمن میں نفلوں کے بارے میں وضاحت اور رہنمائی فرمائیں،(سید محمد علی گیلانی،ایڈووکیٹ سپریم کورٹ آف پاکستان،19ٹیپو سلطان روڈ ملتان کینٹ)۔`
  },
  {
    pageNumber: 162,
    text: `جواب:
	سنت اورفرض کے درمیان نوافل اور قضانمازیں پڑھی جاسکتی ہیں ،البتہ فرض کے بعد والی سنتیں فرض سے پہلے ادانہیں کی جاسکتیں ۔ظہر کے فرض سے پہلے اور بعدکی سنتیں اپنے اپنے مقام پر پڑھی جائیں ،تاہم اگر فرض کی جماعت میں شمولیت کے سبب پہلی چار سنتیں رہ جائیں ،توفرض کے بعد بہتریہ ہے کہ پہلے بعد والی دو سنتیں اپنے مقام پر پڑھ لیں اورپھر فرض سے پہلے رہ جانے والی چارسنتیں اداکریں ،کیونکہ پہلے کی چار سنتیں اپنی جگہ سے ہٹ چکی ہیں، توبعد کی دو سنتوں کو اپنے مقام پر پڑھاجائے اور اُس کے بعد پہلے والی چارسنتیں پڑھی جائیں ،حدیث پاک میں ہے: 
’’[[arabic: عَنْ عَائِشَۃَقَالَتْ: کَانَ رَسُوْلُ اللّٰہِ ﷺ إِذَا فَاتَتْہُ الْأَرْبَعُ قَبْلَ الظُّہْرِ،صَلَّاہَا بَعْدَ الرَّکْعَتَیْنِ بَعْدَ الظُّہْرِ]]‘‘۔
ترجمہ:’’ حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں : جب کبھی رسول اللہ صلی اللہ علیہ وسلم کی ظہر کے فرض سے پہلے والی چار سنتیں رہ جاتیں ،تو آپ صلی اللہ علیہ وسلم اُن کو فرض کے بعد والی سنتوں کے بعد پڑھتے تھے ، (سُنن ابن ماجہ:1158)‘‘۔
’’اَلْمَوْسُوْعَۃُ الْفِقْہِیَۃُ الْکُوَیْتِیَّہ‘‘ میں ہے :
’’[[arabic: اَلسُّنَنُ الرَّوَاتِبُ مُقْتَرِنَۃٌ بِالْفَرَائِضِ، فَمِنْہَا مَا یُصَلّٰی قَبْلَ الْفَرِیْضَۃِ، مِثْلُ سُنَّۃِ الْفَجْرِ وَسُنَّۃِ الظُّہْرِ الْقَبْلِیَّۃِ،وَمِنْہَا مَا یُصَلّٰی بَعْدَ الْفَرِیْضَۃِ مِثْلُ سُنَّۃِ الظُّہْرِ الْبَعْدِیَّۃِ  وَسُنَّۃِ الْمَغْرِبِ وَالْعِشَاء ِ وَالْوِتْرِ وَقِیَامِ رَمَضَانَ]]‘‘۔
ترجمہ:’’سُنَنِ مُؤکَّدہ فرائض کے ساتھ ہی ہوتی ہیں،بعض کو فرض سے پہلے اداکیاجاتاہے ، جیسے فجر اور ظہر کی پہلے والی سنتیں، اوربعض کو فرض کے بعد ادا کیا جاتا ہے، جیسے:ظہر کی بعد والی سنتیں، اور مغرب و عشاء کی سنتیں، وتر اور قیام رمضان(یعنی نمازِ تراویح)‘‘۔
مزید لکھتے ہیں: 
’’[[arabic: وَمَا کَانَ مِنْ ہٰذِہٖ السُّنَنِ قَبْلَ الْفَرِیْضَۃِ فَوَقْتُہَا یَبْدَأُ مِنْ دُخُوْلِ وَقْتِ الْفَرِیْضَۃِ]]`
  },
  {
    pageNumber: 163,
    text: `[[arabic: وَیَنْتَہِیْ بِإِقَامَۃِ الصَّلاَۃِ إِذَا کَانَتْ تُؤَدّٰی فِی جَمَاعَۃٍ، لِاَنَّہٗ إِذَا أُقِیْمَتِ الصَّلاَۃُ فَلاَ صَلاَۃَ إِلاَّ الْمَکْتُوْبَۃُ]]‘‘۔
ترجمہ:’’پس جو فرض سے پہلے کی سنتیں ہیں، تو وقتی (فرض) داخل ہوتے ہی ان کا وقت شروع ہو جاتاہے اور نماز باجماعت ہونے کی صورت میں اقامت کہنے تک رہتا ہے ، اس لیے جب نماز کی اقامت کہہ دی جائے تو فرض نماز کے علاوہ کوئی نماز نہیں ہوتی ‘‘۔
آگے چل کر لکھتے ہیں:
’’[[arabic: أَمَّا السُّنَنُ الْبَعْدِیَّۃُ:مِثْلُ سُنَّۃِ الظُّہْرِالْبَعْدِیَّۃِ وَالْمَغْرِبِ وَالْعِشَاءِ،فَوَقْتُ کُلٍّ مِنْہَا مِنْ بَعْدِ الْاِنْتِہَاءِ مِنَ الْفَرِیْضَۃِ إِلٰی خُرُوْجِ وَقْتِ الْمَکْتُوْبَۃِ وَدُخُوْلِ وَقْتِ الْاُخْرٰی،فَإِذَا خَرَجَ الْوَقْتُ وَلَمْ یُؤَدِّ السُّنَنَ الْبَعْدِیَّۃَ فَإِنَّہَاتُعْتَبَرُفَائِتَۃً]]‘‘۔
ترجمہ:’’ رہی بعد والی سنتیں: جیسے ظہر ، مغرب، اور عشاء کے بعد  کی، ان کا وقت فرض ادا کرنے کے بعد سے لیکراُس نماز کا وقت ختم ہونے اور دوسری نماز کا وقت شروع ہونے تک جاری رہتا ہے،پس اگر نماز کا وقت نکل گیا تو بعد والی سنتیں ادانہیں کی جائیں گی،انہیں فوت شدہ مانا جاتا ہے(یعنی ان کا وقت نکل چکا ہے)، (جلد25،ص:280)‘‘ ۔لہٰذا اگر کسی شخص نے ظہر یاعشاء کے بعد والی سنتیں پہلے ادا کیں ، تو گویا کہ اس نے سنتیں وقت سے پہلے ادا کرلیں اور یہ اس کی سُنَنِ مؤکَّدہ شمار نہیں ہونگی بلکہ یہ نفل ہوںگے ، جن پر نفل کا اجرملے گا۔نفل نماز کے لیے کوئی وقت مقررنہیں ہے ،اس لیے نفل کے لیے مطلق نماز کی نیت کافی ہے ،اس میں وقت کے تعین کی ضرورت نہیں ہوتی ۔ نوافل کے مکروہ اوقات کے بارے میں ہم ’’تفہیم المسائل‘‘ جلد دہم میں تفصیل کے ساتھ لکھ چکے ہیں۔ 

[[heading: نمازِ وتر میں دعائِ قنوت پڑھے بغیر رکوع میں چلا گیا]] 
سوال:
	 وتر کی تیسری رکعت میں دعائے قنوت پڑھنا بھول گیا ،رکوع میں یاد آیا ،قیام کی طرف لوٹااور دعائے قنوت پڑھ کر رکوع کا اعادہ کیے بغیر سجدۂ سہو کرکے سلام پھیردیا ،کیا نماز درست  ہوگئی ؟،(محمد رمیز ،مُتعلّم: جامعہ انوار القرآن ،گلشن اقبال ،کراچی )۔`
  },
  {
    pageNumber: 164,
    text: `جواب:
	ضابطہ یہ ہے کہ اگر نمازِ وتر میں دعائے قنوت پڑھنا بھول گیا تو رکوع کی قیام کی طرف نہ لوٹے بلکہ آخر میں سجدۂ سہو کرکے سلام پھیردے ،نماز درست ہوجائے گی کہ دعائے قنوت واجب ہے اور واجب کے ترک پر سجدۂ سہو لازم ہوتا ہے ۔لیکن اگر قیام کی طرف لوٹ آیا اورقنوت پڑھا ،رکوع نہیں کیا تو نماز فاسد نہیں ہوگی ،البتہ گنہگار ہوگا ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَلَونَسِیَ القُنُوْتَ فَتَذَکَّرَ فِی الرُّکُوْعِ فَالصَّحِیْحُ أَنّہٗ لَا یَقنُتُ فِی الرُّکُوْعِ وَلَا یَعُوْدُ إِلَی الْقَیَامِ.ہٰکَذَا فِی التَّتَارخَانِیَّۃ فَإِنْ عَادَ إِلَی الْقَیَامِ وَقَنَتَ وَلَمْ یُعِدِ الرُّکُوْعَ لَمْ تَفْسُدْ صَلَاتُہٗ کَذَا فِی الْبَحْرِ الرَّائِق]]‘‘۔
ترجمہ:’’ اگر دعائے قنوت پڑھنا بھول گیا اور رکوع میں یاد آیا ،پس درست (عمل) یہ ہے کہ نہ رکوع میں قنوت پڑھے اور نہ ہی قیام کی طرف لوٹے ، ’’تاتارخانیہ ‘‘میں اسی طرح ہے،  پس اگر قیام کی طرف واپس آیا ،دعائے قنوت پڑھی اور رکوع کا اعادہ نہیں کیا ،تو نماز فاسد نہیں ہوگی ،’’البحرالرائق ‘‘ میں اسی طرح ہے ‘‘۔
مزید لکھتے ہیں:
’’ [[arabic: اَلْإِمَامُ إِذَا تَذَکَّرَ فِی الرُّکُوْعِ فِی الْوِتْرِ أَنَّہٗ لَمْ یَقْنُتْ لَا یَنْبَغِیْ أَنْ یَّعُوْدَ إِلَی الْقِیَامِ وَمَعَ ہٰذَا إِنْ عَادَ وَقَنَتْ لَا یَنْبَغِیْ أَن یُّعِیْدَ الرُّکُوعَ وَمَعَ ہٰذَا إِنْ أَعَادَ الرُّکُوْعَ وَالْقَوْمَ مَا تَابَعُوْہُ فِی الرُّکُوعِ الْاَوَّلِ وَإِنَّمَا تَابَعُوْہٗ فِی الرُّکُوْعِ الثَّانِیْ أَوعَلَی الْقَلْبِ لاَ تَفْسُدُ صَلَاتُہُمْ.کَذَا فِی الْخُلَاصَۃِ]]‘‘۔
ترجمہ:’’ امام کو نمازِ وتر کے رکوع میں یاد آیا کہ دعائے قنوت نہیں پڑھی ،تواسے قیام کی طرف واپس نہیںآناچاہیے ،اس کے باوجوداگر لوٹ آیا اور دعائے قنوت پڑھی تواسے رکوع کا اعادہ نہیں کرنا چاہیے اور اس کے باوجوداگر رکوع کا اعادہ کرلیا اور مقتدیوں نے پہلے رکوع`
  },
  {
    pageNumber: 165,
    text: `میں امام کا ساتھ نہیں دیا تھا اور دوسرا رکوع امام کے ساتھ کیا  یا  پہلا رکوع امام کے ساتھ کیا اور دوسرا رکوع امام کے ساتھ نہ کیا ،دونوں صورتوں میں اُن کی نماز فاسد نہیں ہوگی ،’’خلاصہ‘‘ میں اسی طرح ہے ،(فتاویٰ عالمگیری ، جلد 1،ص:111)‘‘۔ 

صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں:
  ’’اگر دعائے قنوت پڑھنا بھول گیا اور رکوع میں چلا گیا تو نہ قیام کی طرف لوٹے نہ رکوع میں پڑھے اور اگر قیام کی طرف لوٹ آیا اور قنوت پڑھا اور رکوع نہ کیا، تو نماز فاسد نہ ہوگی، مگر گنہگار ہو گا اور اگر صرف الحمد پڑھ کر رکوع میں چلا گیا تھا تو لوٹے اور سورت و قنوت پڑھے پھر رکوع کرے اور آخر میں سجدہ سہو کرے۔ یوہیں اگر الحمد بھول گیا اور سورت پڑھ لی تھی تو لوٹے اور فاتحہ و سورت و قنوت پڑھ کر پھر رکوع کرے۔امام کو رکوع میں یاد آیا کہ دعائے قنوت نہیں پڑھی تو قیام کی طرف عود نہ کرے، پھر بھی اگر کھڑا ہوگیا اور دُعا پڑھی تو رکوع کا اعادہ نہ چاہیے اور اگر اعادہ کر لیا اور مقتدیوں نے پہلے رکوع میں امام کا ساتھ نہ دیا اور دوسرا امام کے ساتھ کیایا پہلا رکوع امام کے ساتھ کیا دوسرا نہ کیا، دونوں حال میں ان کی نماز بھی فاسد نہ ہوگی،(بہارِ شریعت ،جلداول،ص:656)‘‘۔ 

[[heading: عید کی نماز میں درمیان میں شامل ہونے والا تکبیرات کس طرح کہے]] 
سوال:
	 نمازعید شروع ہوگئی ،پہلی رکعت میں امام تکبیرات کہہ چکا ،اس کے بعد کوئی مقتدی جماعت میں شامل ہوا یا دوسری رکعت میں آکر شامل ہوا تووہ عید کی زائد تکبیرات کس طرح کہے؟(منور احمد ،ملیر کراچی)۔
جواب: 
	جونمازی نمازِ عید کی پہلی رکعت میں امام کے تکبیرات ِ عید کہنے کے بعد شامل ہوا تووہ نیت باندھ کر نماز میں شامل ہو اور تکبیرِ تحریمہ کے بعد تین زائد تکبیریں کہہ کر خاموش ہوجائے اور اگر اس نے امام کو پہلی رکعت کے رکوع میں پایا تو تکبیرِ تحریمہ کہہ کر رکوع میں امام`
  },
  {
    pageNumber: 166,
    text: `کے ساتھ شامل ہوجائے اورہاتھ اٹھائے بغیر تین تکبیریں کہہ دے ،پھر اگر امام بدستور رکوع میں ہے تو رکوع کی تسبیحات پڑھ لے ،ورنہ اگر امام رکوع سے کھڑا ہوگیاہے تو تسبیحات رکوع چھوڑ دے اور امام کی اتّباع کرے ۔اگر مسبوق مقتدی نے امام کو دوسری رکعت میں پایا تو اس کی پیروی میں وہ رکعت مکمل کرے اور پھر امام کے سلام پھیرنے کے بعد اپنی بقیہ نماز کے لیے کھڑاہو اور فاتحہ وسورت پڑھنے کے بعد تین زائد تکبیرات کہے اورپھر رکوع میں چلاجائے اور اگر مسبوق مقتدی دوسری رکعت کے رکوع کے بعد جماعت میں شامل ہوا توامام کے سلام پھیرنے کے بعد کھڑاہو اور ثناء پڑھنے کے بعد تین زائد تکبیرات اپنے مقام پر کہے اور پھر دوسری رکعت میں قراء ت کے بعد اوررکوع سے پہلے تین زائد تکبیریں کہے اور حسبِ ترتیب نماز مکمل کرلے۔

[[heading: نماز ِ عید میں سجدۂ سہو ترک کیاجاسکتاہے]] 
سوال:
	 نمازعیدمیں امام دوسری رکعت میں تین زائد تکبیریں کہے بغیر رکوع میں چلا گیاتو اب کیاکرے؟،(منوراحمد ،ملیر، کراچی )۔
جواب:
	یاد آنے پر رکوع ہی کی حالت میں ہاتھ اٹھا ئے بغیر تین زائد تکبیریں پڑھ لے اور پھر رکوع کی تسبیحات پڑھ کر رکوع سے کھڑاہو ،مقتدی بھی اس کی اتّباع کریں ۔لیکن اگرامام جلد بازی میں گھبرا کر رکوع سے کھڑا ہوگیا اور حالتِ قیام میں تین تکبیریں کہیںاورپھر رکوع کرکے نماز مکمل کی تو نماز ہوجائے گی ۔فقہی اصول کے مطابق اس صورت میں اسے سجدۂ سہو کرنا چاہیے ،لیکن جمعہ وعیدین میں جماعت کافی بڑی ہو ،تو فسادوانتشار سے بچنے کے لیے سجدۂ سہو ترک کیاجاسکتا ہے۔جماعت کثیر کے سبب معاف ہے ۔
	اسی طرح اگرامام نے دوسری رکعت کی تین زائد تکبیریں نہ رکوع سے پہلے کہیں ،نہ رکوع میں کہیں ،نہ رکوع سے اٹھ کر کہیں تواگرچہ فقہی اصول کے ضابطے کے مطابق ترکِ واجب`
  },
  {
    pageNumber: 167,
    text: `سے سجدۂ سہو لازم آتاہے ،لیکن اگرسجدۂ سہو نہ کیاتو جماعت کثیر کے سبب نماز ہوجائے گی ،نماز کے اعادے کی ضرورت نہیں ہے ۔ایسے مواقع پر فقہی مسائل سے ناواقف لوگ شورمچانا شروع کردیتے ہیں اور امام گھبرا جاتے ہیں ،اس لیے یہ مسئلہ لکھاگیا ہے۔اَئمۂ کرام کوبھی نماز کے مسائل کا وقتاً فوقتاً مطالعہ کرتے رہنا چاہیے تاکہ اعتماد کے ساتھ لوگوں کو بتاسکیں ۔

[[heading: اگر کسی کی نماز عید رہ جائے توکیا کرے]] 
سوال:
	بعض اوقات بشری کوتاہی ،تساہل اور سستی کی بناپر کسی کی عید کی نماز رہ جاتی ہے ، تووہ کیاکرے،(محمد رمیز، سرجانی ٹاؤن)۔
جواب:
	عید کی نمازصرف باجماعت اداکی جاتی ہے ،اگر کسی کی نماز رہ گئی ہے، تو انفرادی طورپر اس کی قضا نہیں ہے ، اللہ تعالیٰ سے اپنی اس تقصیر پر توبہ کرے ۔البتہ اگر زیادہ تعداد میں کچھ لوگوں کی نماز رہ گئی ہے اور ان میں نماز کی امامت کا اہل ہے تووہ کسی کھلے میدان میں زوال آفتاب یعنی نصف النہار شرعی سے پہلے باجماعت پڑھ سکتے ہیں۔ 

[[heading: خطبے اور نماز کے درمیان چندہ]] 
سوال:
	 ہمارے محلے کی مسجد کے اخراجات اہل محلہ کے تعاون سے پورے کیے جاتے ہیں ، جمعۃ المبارک کے اجتماع میں بھی چندہ ہوتاہے ۔چند ہفتوں سے انتظامیہ نے خطبے اور نماز کے درمیان چندہ جمع کرنا شروع کردیاہے ،جس میںتقریباً پانچ /دس منٹ لگتے ہیں ،معلوم یہ کرنا ہے کہ خطبہ کے بعد نمازِ جمعہ کو روک رکھنا شرعاً کیساہے اور جماعت میں تاخیر کا حکم کیاہوگا ؟،(قاری محمد حیات ،شاہ فیصل کالونی ،کراچی)۔
جواب:
	خطبہ اور نماز کے درمیان اگر فاصلہ طویل ہوجائے تو یہ مکروہ ہے اورپہلا خطبہ کافی`
  },
  {
    pageNumber: 168,
    text: `نہیں، دوبارہ پڑھاجائے گا ،دُرّمختار میں ہے :
’’[[arabic: فَإِذَا أَتَمَّ أُقِیْمَتْ وَیُکْرَہُ الْفَصْلُ بِاَمْرِ الدُّنْیَا ذَکَرَہُ الْعَیْنِیُّ]]‘‘۔
  ترجمہ:’’ جب امام خطبہ مکمل کرلے تو اقامت کہی جائے اور دنیاوی امور کے لیے (خطبہ اور نماز کے درمیان) فاصلہ کرنا مکروہ ہے ،’’عینی ‘‘ نے اسے ذکر کیاہے ‘‘ ۔ 
علامہ ابن عابدین شامی رحمۃ اللہ علیہ اس کی شرح میں لکھتے ہیں:
’’[[arabic: قَوْلُہٗ:فَإِذَا أَتَمَّ أَیِ الْإِمَامُ الْخُطْبَۃَ قَوْلُہٗ:أُقِیْمَتْ بِحَیْثُ یَتَّصِلُ أَوَّلُ الْإِقَامَۃِ بِآخِرِ الْخُطْبَۃِ وَتَنْتَہِی الْإِقَامَۃُ بِقِیَامِ الْخَطِیْبِ مَقَامَ الصَّلَاۃِ]]‘‘۔
ترجمہ:’’ جب امام خطبہ مکمل کرلے ،تو اقامت کا آغاز خطبہ کے آخر کے ساتھ مُتصل ہو اور خطیب جب نماز کی جگہ کھڑا ہو ،اس کے کھڑا ہونے کے ساتھ اقامت ختم ہو ‘‘۔ آگے چل کر لکھتے ہیں:
’’[[arabic: قَوْلُہٗ بِاَمْرِالدُّنْیَا:اَمَّا بِنَہْیٍ عَنْ مُّنْکَرٍ أَوْ أَمْرٍ بِمَعْرُوْفٍ فَلَا وَکَذٰا بِوُضُوْ ءٍ أَوْ غُسْلٍ لَوْ ظَہَرَ أَنَّہٗ مُحْدِثٌ أَوْ جُنُبٌ کَمَا مَرَّ بِخِلَافِ أَکْلٍ أَوْ شُرْبٍ حَتّٰی لَوْ طَالَ الْفَصْلُ اسْتَاْنَفَ الْخُطْبَۃَ کَمَا مَرَّ فَافْہَمْ ]]‘‘۔
ترجمہ:’’جہاں تک’’ نَہی عن المنکر‘‘  یا ’’ امر بالمعروف‘‘کے ساتھ فاصلہ ہوتو یہ مکروہ نہیں ہے ،اسی طرح وضو یا غسل کے ساتھ فاصلہ ہے ،اگر یہ ظاہر ہوکہ وہ محدث یا جنبی ہے ، جس طرح گزرچکاہے ۔کھانے یا پینے کا معاملہ مختلف ہے ،یہاں تک کہ اگر فاصلہ طویل ہوجائے تو نئے سرے سے خطبہ دے ،جس طرح گزر چکاہے ،پس اس مسئلے کو سمجھنا چاہیے ، (حاشیہ ابن عابدین شامی ،جلد 5،ص: 84، دمشق)‘‘۔مزید لکھتے ہیں: 
’’[[arabic: وَلَوْ فَصَلَ بِاَجْنَبِیٍّ فَإِنْ طَالَ بِاَنْ رَجَعَ لِبَیْتِہٖ فَتَغَدّٰی أَوْ جَامَعَ وَاغْتَسَلَ اسْتَقْبَلَ خُلَاصَۃ:أَیْ لُزُوْمًا لِبُطْلَانِ الْخُطْبَۃِ سِرَاجٌ]]‘‘۔
ترجمہ:’’ اگر وہ خطبہ اور نماز کے درمیان اجنبی عمل کا فاصلہ کرے ،اگر وہ فاصلہ طویل ہو ،اس طرح کہ وہ اپنے گھر کی طرف لوٹے اورکھانا کھائے  یا جماع کرے اور غسل کرے ،تووہ`
  },
  {
    pageNumber: 169,
    text: `نئے سرے سے خطبہ دے ،(بحوالہ :خلاصۃ الفتاویٰ)یعنی لازمی طورپر وہ نئے سرے سے خطبہ دے کیونکہ خطبہ باطل ہوجاتا ہے ،بحوالہ:’’ سراج‘‘،(حاشیہ ابن عابدین شامی ، ج: 5، ص: 48، دمشق)‘‘۔
	مندرجہ بالا فقہی حوالوں سے معلوم ہوا کہ کسی ضرورت کے تحت خطبے اور اقامت میں معمولی فصل کی گنجائش ہے اور چندہ جمع کرنے میں پانچ دس منٹ نہیں لگتے ،اگر ہر صف میں ایک آدمی مقررکردیاجائے توایک دو منٹ میں یہ کام ہوسکتا ہے ،مسجد کے مصارفِ جاریہ کے لیے یہ شِعار ہمارے ہاں رائج ہے۔ اگر کہیں ایساہوتا ہوکہ ایک ہی آدمی پوری مسجد اورتمام نمازیوں کے درمیان چکر لگائے اور مسجد بڑی ہو تو اس میں پھر زیادہ وقفہ ہوسکتا ہے ، اس سے اجتناب کیا جائے اور ہر صف کے لیے ایک آدمی مقرر کردیاجائے ،میں نے یورپ اور امریکا کی مساجد میں اسی طرح دیکھا ہے، اس کی گنجائش ہے، ایک دومنٹ تو بعض اوقات صف بندی میں بھی لگ جاتے ہیں۔ 

[[heading: معذور کے لیے نماز کا طریقہ]] 
سوال:
	گھٹنے کی وجہ سے ایک آدمی بیٹھ نہیں سکتا اور سجدہ نہیںکر سکتا وہ کرسی پر بیٹھ کر رکوع کی طرح جھک کر سجدہ کرتا ہے اور التحیات کرسی پر بیٹھ کر پڑھ لیتا ہے مگر وہ قیام بھی کر سکتا ہے اور رکوع بھی کھڑے ہو کر کر سکتا ہے۔ لیکن کیا وہ پوری نماز بیٹھ کر پڑھ سکتا ہے یا جتنی نماز وہ کھڑے ہو کر پڑھ سکتا ہے اس کیلئے وہ کھڑا ہوجائے اور باقی نماز کرسی پر بیٹھ کر پڑھے اور کیا تھکاوٹ یا طبیعت کی خرابی کی وجہ سے کسی وقت وہ پوری نماز بیٹھ کر پڑھنا چاہے تو ایسا کرنے کی اجازت ہے یا نہیں؟،(سید محمد علی گیلانی،ایڈووکیٹ سپریم کورٹ آف پاکستان،19ٹیپو سلطان روڈ ملتان کینٹ)۔
جواب:
	ایساشخص جو قیام پر قادرہے، سجدہ نہیں کرسکتا ، اُس کے لیے حکم یہ ہے کہ وہ زمین پر بیٹھ`
  },
  {
    pageNumber: 170,
    text: `کر نماز پڑھے ،اگر زمین پر سر رکھ کر سجدہ نہیں کرسکتا تو حکم یہ ہے کہ وہ اشارے سے سجدہ کرے اور رکوع کی بہ نسبت سجدے کے لئے سر کو تھوڑا زیادہ نیچے جھکائے ۔
	ایسا معذور شخص اگر کرسی پر بیٹھ کر بھی نماز ادا کرے تو جائز ہے اوراس صورت میں رکوع اور سجود اشارے سے کرے ۔البتہ باجماعت نمازوں میں صفوں کے درمیان کرسی رکھنے سے ’’تَسْوِیَۃُ الصَّف ‘‘یعنی صف کی برابری کی سنّت اداہوہی نہیں سکتی ۔ ہماری نظر میں جب تک بندہ بیٹھ کر (خواہ التحیات کی وضع میں یا پاؤں دائیں جانب نکال کر یا آلتی پالتی مارکر بیٹھ کر) نماز پڑھ سکتاہو تو کرسی پر نہ پڑھے ،مسجدوں میں کرسیوں پر نماز پڑھنے والے صفوں کے اطراف میں کھڑے ہوں۔
تنویرالابصار مع الدرالمختار میں ہے :
’’[[arabic: فَلَوْ قَدَرَ عَلَیْہِ دُوْنَ السُّجُوْدِ نُدِبَ إیمَاؤُہٗ قَاعِدًا]]‘‘۔
ترجمہ:’’ جو شخص قیام پر قادر ہو اور سجدہ پر قادرنہ ہو ،تو بیٹھ کر اشارہ سے نمازپڑھنا مستحب ہے ‘‘،اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: أَیْ عَلَی الْقِیَامِ وَحْدَہٗ أَوْ مَعَ الرُّکُوْعِ کَمَا فِی الْمُنْیَۃِ ۔قَوْلُہٗ: نُدِبَ إیمَاؤُہٗ قَاعِدًا : أَیْ لِقُرْبِہٖ مِنَ السُّجُوْدِ،وَجَازَ إیْمَاؤُہٗ قَائِمًا کَمَا فِی الْبَحْرِ.وَأَوْجَبَ الثَّانِیَ زُفَرُ وَالْاَئِمَّۃُ الثَّلَاثَۃُ لِاَنَّ الْقِیَامَ رُکْنٌ فَلَا یُتْرَکُ مَعَ الْقُدْرَۃِ عَلَیْہِ.وَلَنَا أَنَّ الْقِیَامَ وَسِیْلَۃٌ إلَی السُّجُوْدِ لِلْخُرُوْرِ،وَالسُّجُوْدُ أَصْلٌ لِاَنَّہٗ شُرِعَ عِبَادَۃً بِلَا قِیَامٍ کَسَجْدَۃِ التِّلَاوَۃِ وَالْقِیَامُ  لَمْ یُشْرَعْ عِبَادَۃً وَحْدَہٗ،حَتّٰی لَوْ سَجَدَ لِغَیْرِ اللّٰہِ تَعَالٰی یُکْفَرُ بِخِلَافِ الْقِیَامِ وَإِذَا عَجَزَ عَنِ الْاَصْلِ سَقَطَتِ الْوَسِیْلَۃُ کَالْوُضُوْ ءِ مَعَ الصَّلَاۃِ وَالسَّعْیِ مَعَ الْجُمُعَۃِ،وَمَا أَوْرَدَہٗ ابْنُ الْہُمَامِ أَجَابَ عَنْہٗ فِی شَرْحِ الْمُنْیَۃِ ،ثُمَّ قَالَ:وَلَوْ قِیْلَ إنَّ الْإِیْمَاءَ أَفْضَلُ لِلْخُرُوجِ مِنَ الْخِلَافِ لَکَانَ مُوَجَّہًا وَلٰکِنْ لَمْ أَرَ مَنْ ذَکَرَہٗ]]‘‘۔
ترجمہ:’’یعنی صرف قیام پر قادرہویا رکوع کے ساتھ قیام پر قادرہو ،جیساکہ ’’مُنْیَۃُ الْمُصَلِّی‘‘  میں ہے ۔کیونکہ یہ سجدہ کی قریب ہے اور کھڑے ہوکر اشارہ سے نماز پڑھنا بھی جائز ہے جیساکہ ’’البحرالرائق ‘ ‘ میں ہے ۔امام زفر اور اَئمۂ ثلاثہ نے دوسرے قول کوواجب کیاہے ،کیونکہ قیام رکن ہے ،پس اس پر قدرت ہوتے ہوئے اُسے ترک نہیں کیاجائے گا اور ہماری دلیل یہ ہے کہ قیام سجدے کے لیے جھکنے کا ذریعہ ہے اور سجدہ اصل ہے ،کیونکہ یہ قیام کے بغیر  بطور عبادت مشروع ہے، جیسے سجدۂ تلاوت اورقیام علیحدہ بطورعبادت مشروع نہیں ،حتّٰی کہ اگرکوئی غیر اللہ کو سجدہ کرے گا تو کافر ہوجائے گا بخلاف قیام کے(کہ غیر اللہ کے لیے قیام سے کفر لازم نہیں آتا) اور جب اصل سے عاجز ہوا تو ذریعہ بھی ساقط ہوگیا جیسے نماز کے ساتھ وضو اورجمعہ کے ساتھ سعی ہے۔ ’’ابنِ ہُمام‘‘ نے جواعتراض کیاہے ، ’’شرح المُنیۃ‘‘ میں اس کا جواب دیا ہے ،پھرفرمایا: اگریہ کہاجاتاہے کہ اختلاف سے نکلنے کے لیے اشارہ کرنا افضل ہے تو بھی ایک وجہ بنتی ہے ،لیکن میں نے کوئی عالم نہیں دیکھا جس نے یہ ذکر کیا ہو‘‘۔نیز علامہ علاء الدین حصکفی نے لکھا:’’[[arabic: فَلَوْ قَدَرَ عَلَیْہِ دُوْنَ السُّجُوْدِ نُدِبَ إیْمَاؤُہٗ قَاعِدًا، وَکَذَا مَنْ یَّسِیْلُ جُرْحُہُ لَوْ سَجَدَ]]‘‘۔
ترجمہ:’’اور اسی طرح جس زخمی شخص کے سجدہ کرنے سے اس کے زخم سے خون یا پیپ رِستاہو ، اس کا بھی بیٹھ کر اشارے سے سجدہ کرنا مستحب ہے ‘‘۔
  اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: أَیْ یَنْدُبُ إیْمَاؤُہٗ قَاعِدًا مَعَ جَوَازِ إیْمَائِہٖ قَائِمًا لِعَجْزِہٖ عَنِ السُّجُوْدِ حُکْمًا لِاَنَّہٗ لَوْ سَجَدَ لَزِمَ فَوَاتُ الطَّہَارَۃِ بِلَا خَلَفٍ،وَلَوْأَوْمَاَ کَانَ الْإِیْمَاءُ  خَلَفًا عَنِ السُّجُوْدِ ]]‘‘۔
ترجمہ:’’ یعنی اس کے باوجود کہ حکماً سجدے سے عاجز ہونے کی بناپر اُس کا کھڑے ہوکر اشارے سے سجدہ کرنا جائز ہے ،مگر اس کا بیٹھ کر اشارے سے سجدہ کرنا مستحب ہے ،کیونکہ اگروہ سجدہ کرے گا تو کسی قائم مقام کے بغیر طہارت کا فوت ہونا لازم آئے گا اور اگر وہ اشارے سے سجدہ کرے گا تویہ سجدے کے قائم مقام ہوجائے گا ،(حاشیہ ابن عابدین شامی ، جلد3،ص:153،دمشق)‘‘۔
نوٹ: اگر غیر اللہ کو معبود مان کر سجدہ کیا جائے تو کفر ہے،ورنہ تعظیماً کیا جائے تو حرام ہے، اسی`
  },
  {
    pageNumber: 172,
    text: `طرح کسی مذہب میں غیر اللہ کی عبادت حالتِ قیام میں کی جاتی ہے،تو اس صورت میں عبادت کی نیت سے قیام بھی کفر ہوگا، ورنہ تعظیماً قیام جائز ہے۔
	پس آپ اگر کسی بھی طرح سے بیٹھ سکتے ہیں،خواہ اَلتّحیّات کی ہیئت میں یا دونوں پاؤں ایک طرف نکال کر یا آلتی پالتی مارکر یا قبلے کی جانب ٹانگیں پھیلاکر ،تو زمین پر بیٹھ کر نماز پڑھیں ،اشارے سے رکوع اور سجود کریں اوراگر یہ قدرت نہیں ہے تو دونوں صورتیں اختیار کرسکتے ہیں ،کھڑے ہوکر قراء ت کریں ،پھر رکوع کریں اور کرسی پر بیٹھ کر یا کھڑے کھڑے اشارے سے سجدہ کریں اور سجدہ کے لیے رکوع سے زیادہ جھکنا ہوگا ۔

[[heading: غیر مسلم ممالک میں نمازِ جمعہ کی دوسری جماعت کا مسئلہ]]
سوال: 
	آپ نے تفہیم المسائل جلد7،ص:92پر لکھاہے کہ ایک مسجد میں جمعہ کی ایک سے زائد جماعتیں نہیں ہوسکتیں ،جبکہ غیر مسلم ممالک میں بعض جگہ اس کا رواج ہے، ان کے بارے میں کیاحکم ہے،(علامہ نصیر اللہ نقشبندی ،اولڈہم ،یو۔کے)۔
جواب:	
	ہم نے ایک مسجد میں دو جمعوں کے عدمِ جواز کافتویٰ فقہی اصولوں اور بلادِ اسلامیہ میں جاری وساری سُنتِ مُتوارثہ کے مطابق فقہی حوالہ جات کے ساتھ لکھا تھا۔لیکن اب یورپ ،امریکا ،کینیڈا ، آسٹریلیا اور دیگر غیر مسلم ممالک میں بالعموم نہ جمعۃ المبارک اور عیدین پر سرکاری چھٹی ہوتی ہے اورنہ نمازِ جمعہ کی ادائیگی کے لیے ملازمت کے اوقاتِ کار میں وقفے کا التزام ہے۔نیز لندن جیسے شہروںمیں بعض علاقوں کی مسجدیں چھوٹی ہیں اور نمازی بیک وقت اُن میں سما نہیں سکتے ،اس لیے بعض مساجد میں باقاعدہ انتظامات کے تحت دو دو جمعوں اور عیدین کی دویا تین جماعتوں کا اہتمام ہوتا ہے۔ امریکا میں پاکستانیوں کی مساجد میں بعض جگہ ایک جمعے میں خطاب اردو میں ہوتاہے اور دوسرے میں انگریزی میں ، کیونکہ نئی نسل اردو خطاب کو سمجھنے سے قاصر ہے۔ اس لیے ہماری رائے میں ایسے ممالک میں`
  },
  {
    pageNumber: 173,
    text: `ضرورت کی بناپر ایک ہی مسجد میں جمعوں اور عیدین کی ایک سے زیادہ جماعتوں کی اجازت دی جانی چاہیے اور عملاً رائج بھی ہے ۔نیز یہ بات مُسلّم ہے کہ جمعوں اور عیدین کی ایک سے زیادہ جماعتوں میں نمازوں کی امامت ایک ہی شخص نہیں کرتا بلکہ الگ الگ ا مام کرتے ہیں،البتہ ایک شخص متعدد خطابات کرسکتاہے ۔
	ریلوے اسٹیشن ، ایر پورٹ ،بس اڈہ ،موٹر وے کے سروس سینٹر کی مسجد اور مارکیٹ کی مسجدوں کے سوا ،کیونکہ ان مقامات پر لوگوں کا گروہوں کی شکل میں آنا جانا لگارہتاہے، محلوں کی مساجد میں عام نمازوں میں بھی ہمارے فقہائے کرام نے ایک سے زائد جماعتوں کی ممانعت اس لیے کی ہے کہ اسے انتشار اور تفریق کا ذریعہ نہ بنالیاجائے ، جبکہ غیرمسلم ممالک میں بعض جگہ جمعہ اور عیدین میںواقعی اس کی ضرورت ہوتی ہے اور فقہی اصول ہے: ’’[[arabic: اَلضَّرُورَاتُ تُبِیْحُ الْمَحْظُوْرَات ]]‘‘ضرورتیں ممنوعات کو مباح کردیتی ہے  ، (المجلّۃ الاحکام العدلیہ ،مادہ:21)‘‘۔

[[heading: قراء ت کی غلطی کی شکایت]] 
سوال:
	امام صاحب عمر کے تقاضے کے سبب تلاوتِ قرآن میں تلفظ کی ادائیگی اور قواعد ِ تجوید میں غلطیاں کرتے ہیں ، یہ شکایت مسجد میں نماز اداکرنے والے طالب علم علماء اور دیگر نمازی صاحبان کی ہے ،اس صورت میں مسجد کمیٹی کا کیاکردار ہونا چاہیے ؟،(جنرل سیکریٹری جامع مسجد خضریٰ ،نیوکراچی )۔
جواب: 
	قراء ت نماز کے فرائض میں سے ایک فرض ہے ،قرآن کو قواعدِ تجوید کے مطابق درست پڑھنا اور حروف کو ان کے مخارج سے صحیح اداکرنا ضروری ہے،تاہم اس کا فیصلہ عام مقتدی نہیں کرسکتے۔آپ نے لکھاہے:’’ طالب علم علماء نے شکایت کی ‘‘،اس کا بہترین حل یہ ہے کہ کسی مستند ادارے میں قواعدِ تجوید وقراء ت سے واقف قاری صاحب کوامام صاحب`
  },
  {
    pageNumber: 174,
    text: `کی قراء ت سنوائی جائے اور اُن کے فیصلے کو تسلیم کیاجائے ، کیونکہ ’’لِکُلِّ فَنٍّ رِجَالٌ‘‘ہرفن کے ماہر موجود ہوتے ہیں۔

[[heading: طالبات کا مدرسہ بنانا]] 
سوال:
	بلاک17فیڈرل بی ایریا میں ST-3گورنمنٹ نقشے میں مسجد ہے ۔40سال سے چہار دیواری کے اندر جامع مسجد غوثیہ ایک بڑے ہال اور صحن پر مشتمل ہے،اطراف میں ایک بڑا رقبہ خارجِ مسجد ہے ،جس میں پیچھے کی طرف وضوخانہ اورشمالی جانب بچوں کا مدرسہ ہے ،جبکہ بائیں جانب پچھلے حصے میں استنجاء خانہ اور اسٹاف کی رہائش ہے ۔ مسجد کے سامنے جنوبی حصہ پورا خالی ہے ،جوکہ خارجِ مسجد ہے ، ہم اس خالی حصے میں بچیوں کے لیے مدرسہ بنانا چاہتے ہیں ۔کیا اس جگہ بچیوں کا مدرسہ قائم کیاجاسکتا ہے ؟،(عارف علی ، جنرل سیکریٹری، مسجد غوثیہ ،بلاک17،ایف۔بی ایریا ،کراچی )۔
جواب:
	اگرمذکورہ جگہ اصلِ مسجد سے ہٹ کر یا فنائے مسجد میں ہے اوراس کا داخلی وخارجی راستہ مسجد سے باہر کیاجاسکتا ہے ، تووہاں طالبات کے لیے مدرسہ بنانے میں حرج نہیں ہے۔ تعلیم وتعلّم دراصل مسجد اور مقاصدِ مسجد سے تعلق رکھتے ہیں ،البتہ مسجد کے آداب ملحوظ رکھنا ضروری ہے ۔بچوں یا بچیوں کا شور نمازیوں کی نماز میں خلل اندازنہ ہو یا نماز کے اوقات میں درس وتدریس کا سلسلہ موقوف کردیاجائے ،رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے : 
’’[[arabic: جَنِّبُوْامَسَاجِدَکُمْ صِبْیَانَکُمْ وَمَجَانِیْنَکُمْ وَشِرَائَکُمْ وَبَیْعَکُمْ وَخُصُوْمَاتِکُمْ وَرَفْعَ أَصْوَاتِکُمْ وَاِقَامَۃَ حُدُوْدِکُمْ وَسَلَّ سُیُوفِکُمْ ]]‘‘۔
ترجمہ:’’ اپنی مساجد کو بچوں ، پاگلوں ،خرید وفروخت کے معاملات ،باہمی جھگڑوں ، شور وشغب ،(مجرموں پر) حدودِ الٰہی قائم کرنے اورایک دوسرے پر تلواریںسونتنے(یعنی آپس کے لڑائی جھگڑوں) سے بچاؤ،(سُنن ابن ماجہ:750)‘‘۔دارالفکر کے مطبوعہ نسخے میں`
  },
  {
    pageNumber: 175,
    text: `’’شراء ‘‘ کی بجائے ’’شرار‘‘ (شریر کی جمع) کا لفظ ہے ، ممکن ہے یہ کمپوزنگ کی غلطی ہو ۔
فنائے مسجد کے بارے میں امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْزلکھتے ہیں:
’’[[arabic: اَقُوْلُ:وَبِا للّٰہِ التَّوْفِیْقُ:اِعْلَمْ وَفَّقَنَااللّٰہُ تَعَالٰی وَ اِیَّاکَ اَنّ لِلْمَسْجِدِ اِطْلَاقَیْنِ : اَحَدُھُمَا مَوْضِعُ الصَّلوٰۃِ مِنَ الْاَرْضِ الْمَوْقُوْفَۃِ لَھَاوَھُوَالْاَصْلُ وَبِھٰذَاالْمَعْنٰی لَایَدْخُلُ فِیْہِ الْبنَاءُ فَاِنَّ الْبنَاءَ مِنَ الْاَوْصَافِ کَا لْاَطرَافِ فَالْبَابُ وَالْجِدَارُ خَارِجٌ عَنِ الْمَسْجِدِ، وَکَذَا ا لدَّکَّۃُ وَالْمَنَارُ وَالْحِیَاضُ وَالْاٰبَارُوَ اِنْ کَانَتْ فِی حُدُوْدِہٖ بَل فِی جَوْفِہٖ اِذَا بُنِیَتْ قَبْلَ تَمَامِ الْمَسْجِدِیَّۃِ،اَمَّابَعْدَہٗ فَلاَ یَجُوْزُ تَغْیِیْرُ شَیْءٍ مِّنَ الْاَوْقَافِ عَنْ ھَیْئَتِہٖ اِلَّابِشَرطِ الْوَاقِفِ لِحَاجَۃِ الْوقفِ وَمَصْلَحَتِہٖ ]]‘‘۔
  ترجمہ:’’میں اللہ تعالی کی توفیق سے کہتاہوں ،اللہ تعالیٰ ہم سب کو حق سمجھنے کی توفیق عطافرمائے : مسجد کی دو اطلا قا ت ہیں (ا)زمین کا وہ حصہ جو نما ز کے لیے وقف کیا گیا ہے ، وہی اصلِ مسجد ہے،اِس اطلاق میں مسجد کی بنیا دیں مسجد میں داخل نہیں کہ بنیا دیں اوصا ف کے حکم میں ہیں جیسے کہ اطرا ف( و حد ود)، پس مسجد کا دروازہ او ر دیو اریں مسجد سے خارج ہیں، اسی طر ح اذا ن کے چبو تر ے ،منار ،حو ض اور کنو یں(وغیرہ) ،خواہ وہ حد ود مسجد یا مسجد کے وسط ہی میں  ہوں،بشرطیکہ مسجد کے مکمل ہونے سے پہلے بنا ئے گئے (تو مسجد سے خا ر ج ہیں) ۔البتہ مسجد مکمل ہو جا نے کے بعد اگر ان چیزوں کو مسجد میں بنایا تو یہ جائز نہیں کیونکہ یہ وقف کو بد لنا ہوگا ۔ہاں! اگر واقف نے وقف کی ضرورت اور اس کے فائدے کے لیے شروع میں اس کی اجازت دے رکھی ہو ،تو جائز ہے ، (فتاویٰ رضویہ ، جلد 28، ص:136)‘‘۔

[[heading: شہر کی مسجد میں نمازِ جمعہ کا اجرا]] 
سوال:
	120گز پلاٹ پر ایک مسجد گراؤنڈ+فرسٹ فلور بنی ہوئی ہے ،گراؤنڈ فلور پر پانچ دکانیں ، وضو خانہ اور امام ومؤذن کی رہائش گاہ ہے اور فرسٹ فلور پر مسجد ہے۔مسجد میں پانچ نمازیں باجماعت ہوتی ہیں ،جمعہ نہیں ہوتا ،کیا اس مسجد میں نمازِ جمعہ قائم کی جاسکتی`
  },
  {
    pageNumber: 176,
    text: `ہے؟،  (حافظ محمد شہباز ،کراچی)۔
جواب:
	شہر میں متعدد مقامات پر نمازِ جمعہ اداکی جاسکتی ہے ،تنویرالابصار مع الدرالمختار میں ہے:
’’ [[arabic: وَتُؤَدّٰی فِیْ مِصْرٍ وَّاحِدٍ بِمَوَاضِعَ کَثِیْرَۃٍمُّطْلَقًاعَلَی الْمَذْہَبِ وَعَلَیْہِ الْفَتْوٰی شَرْحُ الْمَجْمَعِ لِلْعَیْنِیِّ وَإِمَامَۃُ فَتْحِ الْقَدِیْرِدَفْعًا لِلْحَرَجِ]]‘‘۔
ترجمہ:’’اورجمعہ ایک شہر میں متعد جگہ مطلقاً پڑھا جاسکتاہے ،یہی(مختار) مذہب ہے اور علامہ عینی کی تصنیف ’’شَرحُ الْمَجْمَع‘‘ اور امام ابن ہمام کی ’’فتح القدیر‘‘ کے ’’بَابُ الْاِمَامَۃ‘‘میں اسی کو مُفتیٰ بہٖ قراردیاگیاہے ،یہ حرج کو دور کرنے کے لیے ہے ‘‘۔اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: قَوْلُہٗ:مُطْلَقًا:أَیْ سَوَاءٌ کَانَ الْمِصْرُ کَبِیْرًا أَوْ لَا۔۔۔وَسَوَاءٌ کَانَ التَّعَدُّدُ فِیْ مَسْجِدَیْنِ اَوْ أَکْثَرَ ہٰکَذَا یُفَادُ مِنَ الْفَتْحِ]]‘‘۔
ترجمہ:’’ یعنی خواہ شہر بڑا ہو یا چھوٹا ،۔۔۔۔ایک سے زیادہ جمعے کے اجتماعات دو مسجدوں میں ہوں یا زیادہ میں، ’’فتح القدیر‘‘ سے اسی طرح مُستفاد ہے‘‘۔آگے چل کر لکھتے ہیں:
’’[[arabic: قَوْلُہٗ عَلَی الْمَذْہَبِ:فَقَدْ ذَکَرَ الْإِمَامُ السَّرَخْسِیُّ أَنَّ الصَّحِیحَ مِنْ مَذْہَبِ أَبِیْ حَنِیفَۃَ جَوَازُ إقَامَتِہَا فِی مِصْرٍ وَاحِدٍ فِی مَسْجِدَیْنِ اَوْأَکْثَرَ بِہٖ نَاْخُذُ لِإِطْلَاقٍ لَا جُمُعَۃَ إلَّا فِی مِصْرٍ،شَرَطَ الْمِصْرَ فَقَطْ،وَبِمَا ذَکَرْنَا انْدَفَعَ مَا فِی الْبَدَائِعِ مِنْ أَنَّ ظَاہِرَ الرِّوَایَۃِ جَوَازُہَا فِی مَوْضِعَیْنِ لَا فِی أَکْثَرَ وَعَلَیْہِ الِاعْتِمَادُ اہـ فَإِنَّ الْمَذْہَبَ الْجَوَازُ مُطْلَقًا بَحْرٌ۔۔۔۔قَوْلُہٗ وَعَلٰی الْمَرْجُوحِ: ہُوَ مَا مَرَّ عَنِ الْبَدَائِعِ مِنْ عَدَمِ الْجَوَازِ فِی أَکْثَرَ مِنْ مَوْضِعَیْنِ ]]‘‘۔
ترجمہ:’’ امام سرخسی نے ذکر کیا ہے : امام ابو حنیفہ کا صحیح مذہب یہ ہے کہ ایک شہر میںدو یازیادہ مساجد میںنمازِ جمعہ ادا کرنا جائز ہے ،ہم اسی کو اختیار کرتے ہیں اور جو ہم نے ذکر کیا ، اس کی رو سے بدائع الصنائع کا یہ قول : ’’ لَا جُمُعَۃَ إلَّا فِی مِصْرٍ‘‘(جمعہ صرف شہر میں جائز ہے)مطلق ہے ،کیونکہ ظاہر الروایہ کے مطابق ایک شہر میں صرف دومقامات پر جمعہ جائز ہے ،دوسے زائد مقامات پر نہیں ،رد ہوگیا اور اسی پر اعتماد ہے،پس مذہب مطلق جواز ہے (بحوالہ:  البحرالرائق)۔۔۔بدائع الصنائع کا جو قول گزرا ہے کہ ’’ایک شہر میں دو جگہوں سے زیادہ جگہوں پر نمازِ جمعہ پڑھنا جائز نہیں ہے ،یہ مرجوح قول ہے`
  },
  {
    pageNumber: 177,
    text: `،(حاشیہ ابن عابدین ، جلد5،ص:28-29،دمشق)‘‘۔
صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں:
  ’’شہر میں مُتعدد جگہ جمعہ ہوسکتاہے ،خواہ شہر چھوٹا ہو یا بڑا اور جمعہ دومسجدوں میں ہو یا زیادہ ، (درمختار)۔ مگر بلا ضرورت بہت سی جگہ جمعہ قائم نہ کیاجائے کہ جمعہ شعائرِاسلام سے ہے اور جامع جماعات ہے اوربہت سی مسجدوں میں ہونے سے وہ شوکت اسلامی باقی نہیں رہتی ،جو اجتماع میںہوتی ،نیز دفع حرج کے لیے تعدد جائز رکھاہے توخوامخواہ جماعت پراگندہ کرنا اور محلہ محلہ جمعہ قائم کرنانہ چاہیے ۔ نیز ایک بہت ضروری امر جس کی طرف عوام کو بالکل توجہ نہیں، یہ ہے کہ جمعہ کو اورنمازوں کی طرح سمجھ رکھاہے کہ جس نے چاہا نیاجمعہ قائم کرلیا اور جس نے چاہا پڑھا دیا ،یہ ناجائز ہے، اس لیے کہ جمعہ قائم کرنا بادشاہِ اسلام یا اس کے نائب کاکام ہے اور جہاں سلطنتِ اسلامی نہ ہو ،وہاں جوسب سے بڑا فقیہ سُنّی صحیح العقیدہ ہو ، اَحکام شرعیہ جاری کرنے میں سلطان اسلام کے قائم مقام ہے، لہٰذا وہی جمعہ قائم کرے ، بغیر ا س کی اجازت کے نہیں ہوسکتا اوریہ بھی نہ ہوتو عام لوگ جس کو امام بنائیں ،عالم کے ہوتے ہوئے عوام بطور خود کسی کو امام نہیں بناسکتے، نہ یہ ہوسکتا ہے کہ دوچار شخص کسی کو امام مقررکرلیں ، ایسا جمعہ کہیں سے ثابت نہیں،(بہارِ شریعت ،جلداول،ص:764)‘‘۔
امام اہلسنّت امام احمد رضا قادریقُدِّسَ سِرُّہُ الْعَزِیْز سے سوال ہوا:
’’ایک قصبہ میں جامع مسجد ہے کہ ہمیشہ اُس میں جمعہ ہوتا ہے اب ایک مسجد بنا ہوئی اُس کو جامع مسجد بنانا اور قدیم کی جامع مسجد کو ترک کردینا یا دونوں جگہ جمعہ پڑھنا جائز ہے یا نہیں؟‘‘۔آپ نے جواب میں لکھا: ’’قصبہ وشہر جہاں جمعہ جائز ہے، وہاں نماز جمعہ متعدد جگہ ہونابھی جائز ہے اگر چہ افضل حتّی الوسع ایک جگہ ہوتا ہے اور اگلی مسجد جامع کو ترک کر`
  },
  {
    pageNumber: 178,
    text: `دینے کے اگر یہ معنی کہ اُس میں نماز ہی چھوڑدی جائے ، تو قطعاً نا جائز کہ مسجد کا ویران کرنا ہے او راگر یہ مراد کہ نماز تو وہاں ہوا کرے مگر جمعہ وہاں کے بدلے اب اس مسجد جدید میں ہو، اس میں اگر وہاں کے اہل اسلام کوئی مصلحتِ شرعیہ قابل قبول رکھتے ہوں تو کیا مضائقہ ، ورنہ مسجد جامع وہی مسجد قدیم ہے او راس میں نماز جمعہ کا ثواب زائد، (فتاویٰ رضویہ ، جلد8،ص:312)‘‘۔
	خلاصۂ کلام یہ ہے کہ فی نفسہٖ شہر میں مُتعدد مقامات پر جمعے کے اجتماعات جائز ہیں ، البتہ امام اہلسنّت امام احمد رضا قادری اور صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہم کی تصریحات کے مطابق اگر مذکورہ مسجد میں جمعہ کی نماز قائم کرنے کی ضرورت نہیں ہے یا قرب وجوار کی مساجد میں پہلے سے قائم جمعے کااجتماع متاثر ہوتاہے توآپ اپنی مسجد میں جمعہ قائم نہ کریں ۔

[[heading: کمیونٹی ہال میں نمازِ تراویح کا اہتمام کرنا]] 
سوال:
	ہماری کالونی میں ساڑھے تین سو فلیٹ ہیں ، ایک کمیونٹی ہال ہے ،جس میں شادی کی تقریبات بھی ہوتی ہیں اور کالونی میں رہنے والے ہندو مذہب کے لوگ بھی شادی اور دوسری مذہبی رسومات اس ہال میں کرتے ہیں ۔کالونی میں مسجد بھی ہے ،رمضان المبارک میں کچھ لوگ تیرہ روزہ تراویح کی جماعت اس ہال میں کرتے ہیں ۔کیا ہال میں تراویح پڑھنا جائز ہے ؟،(رؤف خان ، گارڈن کراچی) ۔ 
جواب:
	عموماً سہ روزہ ،پانچ روزہ ،دس روزہ یا اسی طرح مختصر دنوں کے لیے نمازِ تراویح کا اہتمام پارک، میدان ، ہال وغیرہ میں کیاجاتا ہے، اگر قرآن صحیح پڑھا جائے ،الفاظ کی ادائیگی صحیح ہو اور سننے والے کی سمجھ میں آئے ،تو شرعی طورپر کوئی قباحت نہیں ہے،لیکن شاہراہِ عام پر نہ پڑھی جائے ،البتہ مسجد کا ثواب حاصل نہیں ہوگا ۔`
  },
  {
    pageNumber: 179,
    text: `علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَإِنْ صَلّٰی بِجَمَاعَۃٍ فِی الْبَیتِ اخْتلَفَ فِیہِ الْمَشَایِخُ وَالصَّحِیْحُ أَنّ لِلْجَمَاعَۃِ فِی الْبَیْتِ فَضِیْلَۃٌ وَلِلْجَمَاعَۃِ فِی الْمَسْجِدِ فَضِیْلَۃٌ أُخْریٰ فَإِذَا صَلّٰی فِی الْبَیْتِ بِجَمَاعَۃٍ فَقَدحَازَ فَضِیْلَۃُ أَدَائِہَا بِالْجَمَاعَۃِ وَتَرَکَ الْفَضِیْلَۃُ الْاُخْریٰ،ہٰکَذَا قَالَہُ الْقَاضِی الْإِمَامُ أَبُوْعَلِی النَّسَفِیْ،وَالصَّحِیْحُ اَنَّ أَدَائَہَابِالْجَمَاعَۃِ فِی الْمَسْجِدِ أَفْضَلُ]]‘‘۔
ترجمہ:’’ اگر اپنے گھر میں جماعت کے ساتھ تراویح پڑھے ، تو اس میں مشایخ کا اختلاف ہے اور صحیح یہ ہے کہ گھر میں جماعت کی فضیلت ہے اور مسجد میں (جماعت سے )پڑھنا دوسری فضیلت ہے ،پس اگر گھر میں جماعت سے تراویح پڑھے گا تو جماعت سے اداکرنے کی فضیلت مل جائے گی اور دوسری(یعنی مسجد کی) فضیلت چھوٹ جائے گی ،امام ابوعلی نسفی کا بھی یہی قول ہے اور صحیح یہ ہے کہ تراویح کامسجد میںبا جماعت ادا کرنا افضل ہے ، (فتاویٰ عالمگیری ، جلد1،ص:116)‘‘۔
	مذکورہ کمیونٹی ہال میں نمازِ تراویح پڑھنے میں شرعاً قباحت نہیں ہے،لیکن جب قریب مسجد موجودہے اوروہاں تراویح کا اجتماع ہوتا ہے ،تو مسجد کی فضیلت کھونا اور مسجد میں نمازیوں کی تعداد کم ہوجانا دونوں ثواب سے محرومی کا باعث ہیں ۔تراویح پورے ماہِ رمضان کی سنّت ہے ، ختمِ قرآن خواہ کسی دن ہوجائے ،بقیہ دنوں کی تراویح بھی باقاعدگی سے پڑھنا سنت مؤکدہ ہے ۔تاہم اگر ہال کی صفائی کرکے وہاں نماز باجماعت پڑھی جائے ،تو نماز صحیح طورپر اداہوجائے گی ،غیر مسلموں کے وہاں تقریبات منعقد کرنے سے نماز کے جواز پر کوئی اثر مرتب نہیں ہوتا۔پوری زمین اگر خشک ہے اور اس پر کوئی ظاہری اور محسوس ومُبْصر (نظر آنے والی) نجاست نہیں ہے ،تو وہ زمین پاک ہے ، رسول اللہ صلی اللہ علیہ وسلم نے دیگرانبیاء کرام علیہم السلام پر اپنے چھ فضائل بیان فرمائے ،ان فضائل کابیان کرتے ہوئے آپ صلی اللہ علیہ وسلم نے فرمایا:’’[[arabic: جُعِلَتْ لِی الاَرْضُ مَسْجِدًا وَطَہُوْرًا،وَأَیُّمَا رَجُلٍ مِنْ أُمَّتِی أَدْرَکَتْہُ الصَّلاَۃُ فَلْیُصَلِّ]]‘‘،ترجمہ:’’ میرے لیے پوری زمین مسجد اورآلۂ طہارت بنادی گئی ہے،سومیری`
  },
  {
    pageNumber: 180,
    text: `اُمّت میں جس شخص کے لیے نماز کا وقت آجائے ،وہ (جہاں کہیں بھی ہو) نمازپڑھ لے ، (صحیح بخاری:436)‘‘۔زمین پر مسلم کافر الغرض انسان حیوانات سب چلتے ہیں ،تو محض ان کے چلنے سے زمین ناپاک نہیں ہوتی ، بلکہ خشک زمین پاک کے حکم میں ہے تاوقتیکہ اس پر کوئی نظر آنے والی نجاست نہ ہو ۔فرض کریں زمین پر کسی نے کسی جگہ پیشاب کیا اور دھوپ پڑنے سے وہ بخارات بن کر اُڑگیا یازمین میں جذب ہوگیا اور زمین خشک ہوگئی ،تو زمین پاک ہے ۔

[[heading: عورتوں کی نماز کا طریقہ]]
سوال:
	 نماز میں عورت کے لیے سجدے کا طریقہ کیاہے ؟،(سید سعد ،نارتھ کراچی)۔
جواب:
	خواتین کے لیے نماز میں مردوں کی بنسبت زیادہ ستر کا اہتمام کرنا اور سمٹ کر نماز ادا کرنا مستحب ہے۔
(۱)حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں : نبی کریم صلی اللہ علیہ وسلم نے فرمایا:
’’[[arabic: إِذَا جَلَسَتِ الْمَرْاَۃُ فِی الصَّلَاۃِ وَضَعَتْ فَخِذَہَا عَلٰی فَخِذِہَا الْاُخْرٰی، وَإِذَا سَجَدَتْ اَلْصَقَتْ بَطْنَہَا فِی فَخِذَیْہَا کَاَسْتَرِ مَا یَکُونُ لَہَا، وَإِنَّ اللہَ تَعَالٰی یَنْظُرُ إِلَیْہَا وَیَقُوْلُ: یَا مَلَائِکَتِی اُشْہِدُکُمْ اَنِّی قَدْ غَفَرْتُ لَہَا]]‘‘۔
ترجمہ:’’جب عورت نماز میں بیٹھے تو ایک ران کودوسری ران کے اوپر رکھے اور جب سجدہ کرے تواپنے پیٹ کو اپنی دونوں رانوں سے ملائے کہ جس سے زیادہ سے زیادہ ستر ہو، اللہ تعالیٰ اس کی طرف دیکھتا ہے اور فرماتا ہے: اے میرے فرشتو! تم گواہ رہو ، میں نے اسے بخش دیا ہے ،(سنن بیہقی:3199)‘‘۔
(۲)حضرت یزید بن ابی حبیب بیان کرتے ہیں:
’’[[arabic: اِنَّ رَسُوْلَ اللَّہِ ﷺمَرَّ عَلَی امْرَاَتَیْنِ تُصَلِّیَانِ فَقَالَ: :إِذَا سَجَدْتُّمَا فَضُمَّا بَعْضَ]]`
  },
  {
    pageNumber: 181,
    text: `[[arabic: اللَّحْمِ إِلَی الْاَرْضِ فَإِنَّ الْمَرْاَۃَ لَیْسَتْ فِی ذٰلِکَ کَالرَّجُل]]‘‘۔
ترجمہ: ’’رسول اللہ صلی اللہ علیہ وسلم مَرَّ دو عورتوں پر ہوا جو نماز پڑھ رہی تھیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم سجدہ کرو تو اپنا جسم زمین کے ساتھ ملا دو، کیونکہ عورت کے سجدے کی ہیئت مرد کی طرح نہیں ہے ،(المراسیل للامام ابی داوٗد:87)‘‘۔
(۳)حارث الاعور بیان کرتے ہیں : حضرت علی رضی اللہ عنہ نے فرمایا:’’[[arabic: إِذَا سَجَدَتِ الْمَرْاَۃُ فَلْتَضُمَّ فَخِذَیْہَا]]‘‘۔ترجمہ:’’جب عورت سجدہ کرے تو اُسے چاہیے کہ وہ اپنی دونوںرانوں کو آپس میں ملالے،(سنن بیہقی:3197)‘‘۔
(۴)حضرت ابراہیم نخعی بیان کرتے ہیں:’’[[arabic: کَانَتِ الْمَرْاَۃُ تُوْمَرُ إِذَا سَجَدَتْ اَنْ تَلْزِقَ بَطْنَہَا بِفَخِذَیْہَا کَیْلَا تَرْتَفِعَ عَجُزَتُہَا وَلَا تُجَافِیَ کَمَا یُجَافِی الرَّجُلُ]]‘‘۔
ترجمہ:’’عورت کو اس بات کا حکم دیا جاتا تھا کہ جب وہ سجدہ کرے تو اپنا پیٹ اپنی رانوں کے ساتھ ملائے،تاکہ اُس کی سرین بلند نہ ہو اور وہ اپنے پیٹ اور رانوں کے درمیان مردوں کی طرح خلا نہ چھوڑے،(سنن بیہقی،ج:2،ص:314)‘‘۔

[[heading: مسافر امام کی اقتدا میں مقیم کی نماز]] 
سوال:
	 اگر امام مسافر ہو اور مقتدی مقیم ،امام دو رکعت پڑھ کر سلام پھیر لے ،تو مقیم حضرات اپنی نماز باقی کیسے اداکریں گے ؟،(عبدالرحمن ،لاہور)۔
جواب:
	 ایسی صورت میں مقیم مقتدی اپنی بقیہ نماز ثناء اور قراء ت کے بغیر خاموش کھڑے رہ کر اداکرے گا، البتہ رکوع اور سجود کی تسبیحات اور تکبیراتِ انتقال کہے گا ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَإِنْ صَلَّی الْمُسَافِرُبِالْمُقِیْمِیْنِ رَکْعَتَیْنِ سَلَّمَ وَأَتَمّ الْمُقِیْمُوْنَ صَلاَتَہُمْ، کَذَافِی الْہِدَایَۃ وَصَارُوْا مُنْفَرِدِیْنَ کَالْمَسْبُوْقِ إِلَّا اَنَّہُمْ لَا یَقرَئُونَ فِی الأَصَحّ، ہٰکَذَا فِی]]`
  },
  {
    pageNumber: 182,
    text: `[[arabic: التِّبْیِیْن،وَیُسْتَحَبُّ لِلْإِمَامِ أَنْ یَقُوْلَ:أَتِمُّوْا صَلَاتَکُمْ فَاِنَّا قَومٌ سَفَر،کَذَا فِی الْہِدَایَۃِ]]‘‘۔
ترجمہ:’’ اگر مسافر نے مقیم حضرات کو نماز پڑھائی ، امام دو رکعت پر سلام پھیردے گا اورمقیم حضرات اپنی نماز پوری کریں گے ،جیساکہ ’’ہدایہ ‘‘ میں ہے اور یہ مقیم نمازی مسبوق کے مثل ہوں گے مگر صحیح ترین قول کے مطابق قرا ء ت نہیں کریں گے ،’’تبیین ‘‘ میں اسی طرح ہے اور امام کے لیے مستحب یہ ہے کہ وہ کہے: اپنی نماز پوری کرو میں مسافر ہوں ،’’ہدایہ‘‘ میں اسی طرح ہے ، (فتاویٰ عالمگیری ،جلد1،ص:142)‘‘۔
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَصَحَّ اقْتِدَاءُ الْمُقِیْمِ بِالْمُسَافِرِ فِی الْوَقْتِ وَبَعْدَہٗ فَإِذَا قَامَ الْمُقِیْمُ إلَی الْإِتْمَامِ لَا یَقْرَأُ]]‘‘۔
ترجمہ:’’ مقیم کا مسافر کی اقتدا کرنا وقت میں اوروقت کے بعد صحیح ہے ،جب مقیم نماز مکمل کرنے کے لیے کھڑا ہوگا ،وہ قراء ت نہیں کرے گا ،(حاشیہ ابن عابدین شامی ، جلد4،ص:640، دمشق )‘‘۔
	 مقیم کو چاہیے کہ مسافر کے پیچھے دو رکعت نماز ادا کرے اور جب امام سلام پھیردے تو مقیم مقتدی کھڑا ہو جائے اور اپنی باقی دو رکعتیں پڑھ لے، ان دو رکعتوں میں قراء ت بالکل نہ کرے بلکہ اتنی دیر خاموش کھڑا رہے جتنی دیر سورۃ فاتحہ پڑھی جاتی ہے، اس کی وجہ یہ ہے کہ حکماً وہ امام ہی کی اقتداء میں ہوتا ہے اور امام کی اقتداء میں مقتدی پر قراءت نہیں ہے ۔

[[heading: مسافر مقیم کے پیچھے نماز پوری پڑھے گا]] 
سوال:
	 اگر مسافر نے مقیم امام کی اقتداء کی اوروہ چوتھی رکعت میں امام کے ساتھ شامل ہوتو اپنی`
  },
  {
    pageNumber: 183,
    text: `بقیہ نماز کی تکمیل کیسے کرے گا ؟

جواب:
	 مسافر جب مقیم امام کے پیچھے باجماعت نماز اداکرے گا تو پوری نمازپڑھے گا ، خواہ تکبیرِ اَولیٰ سے شامل ہواہو یا درمیان میں اقتداء کی ہو ، حدیث پاک میں ہے :’’ [[arabic: إِنَّمَا جُعِلَ الْإِمَامُ لِیُؤْتَمَّ بِہٖ]]‘‘،ترجمہ:’’امام اس لیے بنایاجاتاہے کہ اُس کی اقتداء کی جائے ،(صحیح بخاری:688)‘‘۔
	مسافر کے لیے مقیم امام کی اقتدا میں نماز قصر کرنا جائز نہیں، کیونکہ نبی صلی اللہ علیہ وسلم کے فرمان کے عموم کا یہی تقاضا ہے:’’[[arabic: مَا اَدْرَکْتُمْ فَصَلُّوْا وَمَا فَاتَکُمْ فَاَتِمُّوْا]]‘‘، ترجمہ:’’ پس نماز کا جو حصہ پا لو اسے پڑھ لو اور جو فوت ہو جائے اسے مکمل کر لو،(صحیح البخاری:636)‘‘۔چنانچہ مسافر جب مقیم امام کے ساتھ آخری دو رکعتیں پائے تو اس کے لیے واجب ہے کہ امام کے سلام پھیرنے کے بعد دو رکعتیں اور پڑھے اور اس کے لیے یہ جائز نہیں کہ وہ دو رکعتوں پر اکتفا کر کے امام کے ساتھ سلام پھیر دے۔
تنویر الابصار مع الدرالمختار میں ہے : 
’’[[arabic: وَأَمَّا اقْتِدَاءُ الْمُسَافِرِ بِالْمُقِیْمِ فَیَصِحُّ فِی الْوَقْتِ وَیُتِمُّ]]‘‘۔
ترجمہ:’’ جہاں تک مسافر کی مقیم کی اقتداء کا معاملہ ہے تویہ وقت میں صحیح ہے اوروہ اپنی نماز مکمل کرے گا ،(حاشیہ ابن عابدین شامی ،جلد4،ص:643 دمشق)‘‘۔
مزید لکھتے ہیں:
’’[[arabic: وَلَا مُسَافِرٍ بِمُقِیْمٍ بَعْدَ الْوَقْتِ فِیمَا یَتَغَیَّرُ بِالسَّفَرِکَالظُّہْرِ،سَوَاءٌ أَحْرَمَ الْمُقِیمُ بَعْدَ الْوَقْتِ أَوْ فِیْہِ، فَخَرَجَ فَاقْتَدَی الْمُسَافِرُ بَلْ إنْ أَحْرَمَ فِی الْوَقْتِ فَخَرَجَ صَحَّ وَأَتَمَّ تَبَعًا لِإِمَامِہٖ]]‘‘۔
ترجمہ:’’ اوروقت گزرنے کے بعد مقیم کے پیچھے مسافر کی اقتدا درست نہیں ،ان نمازوں میں جن میں سفرکی وجہ سے تغیر ہوتاہے،جیسے ظہر کی نماز خواہ مقیم نے  وقت کے بعدیا وقت کے اندر تکبیر کہی پھر وقت نکل گیا تو مسافر نے اقتداء کی بلکہ اگر وقت میں تکبیر`
  },
  {
    pageNumber: 184,
    text: `کہی پھر وقت نکل گیاتو صحیح ہے اور مسافر امام کی اتباع کے سبب اپنی نماز کو مکمل کرے ،(حاشیہ ابن عابدین شامی ،جلد3،ص:599 دمشق)‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: أَیْ وَلَا یَصِحُّ اقْتِدَاءُ مُسَافِرٍ بِمُقِیْمٍ إلَخْ،وَبَیَانُ ذٰلِکَ أَنَّ صَلَاۃَ الْمُسَافِرِ قَابِلَۃٌ لِلْإِتْمَامِ مَا دَامَ الْوَقْتُ بَاقِیًا، بِاَنْ یَّنْوِیَ الْإِقَامَۃَ أَوْ بِاَنْ یَّقْتَدِیَ بِمُقِیْمٍ فَیَصِیْرَ تَبَعًا لِإِمَامِہٖ وَیُتِمُّ لِبَقَاء ِ السَّبَبِ وَہُوَ الْوَقْتُ ۔أَمَّا إذَا خَرَجَ الْوَقْتُ فَقَدْ تَقَرَّرَتْ فِی ذِمَّتِہٖ رَکْعَتَیْنِ فَلَا یُمْکِنُ إتْمَامُہَا بِإِقَامَۃٍ أَوْ غَیْرِہَا، حَتّٰی إنَّہٗ یَقْضِیْہَا فِی بَلَدِہٖ رَکْعَتَیْنِ، فَإِذَا اقْتَدِیْ بَعْدَ الْوَقْتِ بِمُقِیْمٍ أَحْرَمَ بَعْدَ الْوَقْتِ أَوْ فِیْہِ لَا یَصِحُّ]]‘‘۔
ترجمہ:’’ یعنی مسافر کا مقیم کی وقت کے بعد اقتدا کرنا صحیح نہیں۔اس کابیان یہ ہے کہ مسافر کی نماز مکمل کرنے کے قابل ہے جب تک وقت باقی ہے اس طرح کہ مسافر اقامت کی نیت کرے یا وہ مقیم کی اقتداء کرلے ۔پس وہ اپنے امام کے تابع ہوگا اوروہ سبب کے بقا کی وجہ سے نماز کو مکمل کرے گا اورسبب وقت ہے ۔ جب وقت نکل جائے گا تو مسافر کے ذمہ دورکعتیں ہی مقرر ہوگئیں ۔پس اقامت یا اس کے علاوہ کسی طرح نماز کو مکمل کرنا ممکن نہیں ، حتّٰی کہ وہ اپنے شہر میں اس نماز کی قضا  دورکعتیں ہی کرے گا اورجب وقت کے بعد مقیم کی اقتداء کرے گا تو اس نے وقت کے بعد یا وقت کے اندر تکبیر کہی  ہوتو صحیح نہیں ہے ،(حاشیہ ابن عابدین شامی ،جلد3،ص:599 دمشق)‘‘۔

[[heading: فو ج کا جنگل میں پڑاؤ شرعی اقامت نہیں ہے]] 
سوال:
	 ہم نے اپنی چھاؤنی سے سوکلومیٹر دور ایک جنگل میں بیس دن قیام کیا ، کیا اس دوران نماز پوری پڑھیں گے ؟،(عبداللہ ضیائی ،کورنگی)۔
جواب:
	اقامت کی نیت صحیح ہونے کے لیے چھ شرائط ہیں : `
  },
  {
    pageNumber: 185,
    text: `(۱)چلنا ترک کرے اگرچلنے کی حالت میں اقامت کی نیت کی تو مقیم نہیں۔ 
(۲)وہ جگہ اقامت کی صلاحیت رکھتی ہو، جنگل یا دریا غیر آباد ٹاپُو میں اقامت کی نیت کی مقیم نہ ہوا۔
 (۳)پندرہ دن ٹھہرنے کی نیت ہو اس سے کم ٹھہرنے کی نیت سے مقیم نہ ہوگا۔
 (۴)یہ نیت ایک ہی جگہ ٹھہرنے کی ہو اگر دوجگہوں میں پندرہ دن ٹھہرنے کا ارادہ ہو، مثلاً ایک میں دس دن دوسرے میں پانچ دن کا تو مقیم نہیں ہوگا۔
 (۵)اپنا ارادہ مستقل رکھتا ہویعنی کسی کا تابع نہ ہو۔ 
(۶)اس کی حالت اس کے ارادہ کے منافی نہ ہو۔ 
وہ جگہ اقامت کی صلاحیت رکھتی ہو ،درمختار میں ہے:
’’[[arabic: أَوْ یَنْوِیَ وَلَوْ فِی الصَّلَاۃِ إذَا لَمْ یَخْرُجْ وَقْتُہَا وَلَمْ یَکُ لَاحِقًاإقَامَۃَ نِصْفِ شَہْرٍحَقِیقَۃً أَوْ حُکْمًا لِمَا فِی الْبَزَّازِیَّۃِ وَغَیْرِہَا:لَوْ دَخَلَ الْحَاجُّ الشَّامَ وَعَلِمَ أَنَّہٗ لَا یَخْرُجُ إلَّا مَعَ الْقَافِلَۃِ فِی نِصْفِ شَوَّالٍ أَتَمَّ لِأَنَّہٗ کَنَاوِی الْإِقَامَۃِ بِمَوْضِعٍ وَّاحِدٍصَالِحٍ لَہَامِنْ مِّصْرٍ أَوْ قَرْیَۃٍ أَوْ صَحْرَاء ِ دَارِنَا وَہُوَ مِنْ أَہْلِ الْاَخْبِیَۃِ فَیَقْصُرُ إنْ نَوَی الْإِقَامَۃَ]]‘‘۔
ترجمہ:’’یا وہ حقیقۃً یا حکماً نصف ماہ اقامت کی نیت کرلے ،اگرچہ وہ نماز میں ہو ،بشرطیکہ جب نماز کا وقت نہ نکلا ہو اور وہ لاحق نہ ہو ،کیونکہ ’’بزازیہ‘‘ میں ہے : اگر حاجی شام میں داخل ہو اور اسے علم ہے کہ وہ قافلہ کے ساتھ نصف شوال کو روانہ ہوگا تووہ اپنی نماز کو مکمل کرے گا کیونکہ وہ اقامت کی نیت کرنے والے کی طرح ہے ،ایسی جگہ میںجو اقامت کے قابل ہے،وہ شہر ہو یا دیہات ہویاہمارے دارالاسلام کا صحرا ہو جبکہ وہ خانہ بدوش ہو ، (حاشیہ ابن عابدین شامی ، جلد4،ص:626-629، دمشق)‘‘۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: قَالَ شَمْسُ الْاَئِمَۃِ الْحُلوَانِی: عَسْکَرُالْمُسْلِمِیْنَ اِذَا قَصَدُوْا مَوْضِعًا وَمَعَھُمْ اَخْبِیَتُھُمْ وَخِیَامُھُمْ وَفَسَاطِیْطُھُمْ فَنَزَلُوْا مَفَازَۃً فِی الطَّرِیقِ وَنَصَبُوا الْاَخْبِیَۃَ وَالْفَسَاطِیْطَ وَعَزَمُوْا]]`
  },
  {
    pageNumber: 186,
    text: `[[arabic: فِیْھَا عَلٰی اِقَامَۃٍ خَمْسَۃَ عَشَرَ یَوْمًا لَّمْ یَصِیْرُوْا مُقِیْمِیْنَ لِاَنَّھَا حَمُوْلَۃ ٌوَلَیْسَتْ بِمَسَاکِنَ کَذَافِی الْمُحِیْط]]‘‘۔
ترجمہ:’’شمس الائمہ حلوانی نے فرمایا : مسلمانوں کالشکر اگر کسی جگہ جائے او ران کے خیمے کا سامان ان کے ساتھ ہو، انھوں نے راہ جنگل میں پڑاؤ ڈالا اور وہاں خیمے وغیرہ نصب کیے اورپندرہ دن ٹھہرنے کا ارادہ کرلیا تو وہ مقیم نہیں ہوں گے کیونکہ وہ سامان اٹھانے والے ہیں،وہاں ان کے گھر نہیں ہیں،’’محیط‘‘ میں اسی طرح ہے ، (فتاویٰ عالمگیری ،جلد1، ص: 139)‘‘۔
	سپاہی /ملازم کی اپنی نیت معتبر نہیںہوتی بلکہ وہ اپنے افسر یا مالک کاتابع ہوتا ہے،بشرطیکہ وہ اپنے افسر اور مالک کے ساتھ ہوورنہ خود اس کی نیت معتبر ہے ۔
تنویر الابصار وردالمحتار میں ہے :
’’[[arabic: وَالْمُعْتَبَرُ نِیَّۃُ الْمَتْبُوْعِ لِأَنَّہُ الْأَصْلُ لَا التَّابِعِ کَامْرَأَۃٍ وَفَّاہَا مَہْرَہَا الْمُعَجَّلَ وَعَبْدٍغَیْرِ مُکَاتَبٍ وَجُنْدِیٍّ إذَا کَانَ یَرْتَزِقُ مِنَ الْاَمِیْرِ أَوْ بَیْتِ الْمَالِ وَأَجِیرٍوَأَسِیْرٍ وَغَرِیْمٍ وَتِلْمِیْذٍ مَعَ زَوْجٍ وَمَوْلیً وَأَمِیْرٍ وَمُسْتَاْجِرٍ]]‘‘۔
ترجمہ:’’ متبوع کی نیت معتبر ہے ،کیونکہ وہ اصل ہے ،تابع کی نیت کا اعتبار نہیں ،جس طرح ایسی عورت جس کے شوہر نے مہرِ معجل دے دیا ،وہ شوہر کے تابع ہے اور ایساغلام جو مکاتب نہ ہوا،اپنے آقا کے تابع ہے اور سپاہی جب وہ امیر یا بیت المال سے وظیفہ لیتاہو ،اپنے کمانڈر کے تابع ہے اور مزدور مستاجرکے تابع ، قیدی قید کرنے والے کے تابع ،(اسی طرح)مقروض اور شاگرد(کا معاملہ ہے کہ وہ بالترتیب قرض خواہ اور استاد کے تابع ہیں ، (حاشیہ ابن عابدین شامی ، جلد4،ص:652-657، دمشق)‘‘۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَہٰؤُلٓاءِ لَا یَصِیْرُوْنَ مُقِیْمِیْنَ بِنِیَّۃِ أَنْفُسِہِمْ فِی ظَاہِرِالرِّوَایَۃِ،کَذَا فِی الْمُحِیْط]]‘‘۔
ترجمہ:’’پس ظاہر روایت کے مطابق یہ تمام (سپاہی ،مزدور ،مقروض ،شاگرد،بیوی وغیرہ) اپنی نیت سے مقیم نہیں ہوں گے ،جیساکہ ’’محیط ‘‘ میں ہے ، (فتاویٰ عالمگیری ،جلد 1، ص:141)‘‘۔`
  },
  {
    pageNumber: 187,
    text: `[[heading: فجر کی جماعت کے بعد نماز کی ادائیگی]] 
سوال: 
	اگر فجر کی نماز ہوچکی ہو تو جماعت کے بعد نماز کی ادائیگی اور رکعات ادا کرنے کا طریقہ بتادیں ،اسی طرح قضا نماز کی ادائیگی کا طریقہ بتادیں، (آصف خلیل )۔
جواب:
	 نمازِ فجر کی جماعت ہوجانے کے بعد سورج طلوع ہونے سے پہلے پہلے فجر کی نماز اداکرلی جائے تو یہ ادا ہی کہلائے گی اور دو سنّت اور دو فرض پوری نماز پڑھی جائے گی ۔سورج طلوع ہوتے ہی مکروہ وقت کا آغاز ہوجاتاہے ،جو تقریباً بیس منٹ رہتاہے ، لہٰذا طلوعِ آفتاب کے بیس منٹ گزرنے کے بعد فجر کی نماز قضا پڑھی جائے گی اور وہی چار رکعات پوری پڑھی جائیں گی،حدیث پاک میں ہے :
’’[[arabic: وَإِنَّ أَوَّلَ وَقْتِ الفَجْرِ حِیْنَ یَطْلُعُ الفَجْرُ، وَإِنَّ اٰخِرَ وَقْتِہَا حِیْنَ تَطْلُعُ الشَّمْسُ]]‘‘۔
ترجمہ:’’نمازِ فجر کا اول وقت جب فجریعنی صبحِ صادق طلوع ہوجائے اور اس کا آخری وقت(یعنی اختتام) جب سورج طلوع ہوجائے، (سُنن ترمذی:151)‘‘۔
علامہ ابوالحسین احمد بن محمد بن احمد بغدادی قدوری رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: أَوَّلُ وَقْتِ الْفَجْرِ إِذَا طَلَعَ الْفَجْرُالثَّانِی:وَہُوَ الْبَیَاضُ الْمُعْترِضُ فِی الْاُفُقِ وَاٰخِرُ وَقْتِہَا مَا لَمْ تَطْلُعِ الشَّمْسُ]]‘‘۔
ترجمہ:’’ فجر کا اول وقت فجرِ ثانی (یعنی صبحِ صادق)طلوع ہونا ہے اوروہ سفیدی جو اُفق پر پھیل جاتی ہے اور فجر کا آخر وقت آفتاب طلوع ہونا ہے ،(مختصرالقدوری ،ص: 57)‘‘۔
	قضانمازیں مکروہ اوقات (طلوع ِآفتاب کے بعد احتیاطاً بیس منٹ تک، نصف النہار شرعی( زوال ) اور غروبِ آفتاب سے قبل کے بیس منٹ ) کے علاوہ جب بھی فرصت ملے ،`
  },
  {
    pageNumber: 188,
    text: `ادا کرتے رہنا چاہیے اور ہر وقت کی نماز کے ساتھ یعنی وقتی نمازسے پہلے یا بعد میں اس وقت کی نماز کی کم از کم ایک قضا پڑھ لیں اور نیت اس طرح کریں مثلاً فجر یا ظہر یا عصر یا مغرب یا عشاء اور وتر کی پہلی یا آخری نماز جو میرے ذمے باقی ہے ،اُسے بطور قضا اداکرتا ہوں ۔ نیت زبانی کرنا ضروری نہیں ہے، دل میں ارادہ کافی ہے۔

[[heading: شیشے کا دروازہ نمازی کا سُترہ بن سکتاہے]] 
سوال:
	 4جنوری کو  روزنامہ جنگ کے اسلامی صفحے پرایک مسئلہ (مسجد میں محرابی دیوار پرشیشے لگانا) کے بارے میں آپ نے نہایت مفصّل اور مدلّل جواب دیا تھا،اسی سلسلے میں میرا سوال ہے کہ آج کل مسجد کے ہال اوربرآمدوں میں ٹرانسپیرنٹ شیشے کے دروازے لگائے جاتے ہیںجن کے آر پار لوگ واضح نظرآتے ہیں،کیا ایسے شیشوں والے دروازے کو نمازی کے لیے’’  سُترہ‘‘بنایا جاسکتا ہے،(اظفرصدّیقی، لاہور) ۔ 
جواب:
	 شیشہ خود ایک ٹھوس چیز ہے ،جو سُترہ بننے کی صلاحیت رکھتاہے اور اس کے آر پار نظر آنا گزرنے والے کے لیے ممانعت کا سبب نہیں بن سکتا ۔ حدیث پاک میں سُترہ کی کم ازکم مقدار  ایک ہاتھ لمبااور ایک انگلی کے برابرموٹا ہونے کی تعلیم فرمائی گئی ہے اور زیادہ سے زیادہ لمبائی تین ہاتھ ہے،تو اگر آپ نماز پڑھ رہے ہیں اور ایک ذراع لمبی اورایک انگلی موٹی لکڑی یا اس کی بھی ڈبل آپ کے سامنے سُترے کے طورپر رکھی ہوئی ہو توکیا آپ کو سامنے سب کچھ نظر نہیں آرہا ہوتا ، سویہ ایک علامتی آڑ ہے ، حدیث پاک میں ہے: 
’’[[arabic: عَنْ عَائِشَۃَ اَنَّ رَسُوْلَ اللّٰہﷺسُئِلَ فِیْ غَزْوَۃِ تَبُوْکَ عَنْ سُتْرَۃِ الْمَصَلِّی، فَقَالَ:: کَمُؤخِرَۃِ الرَّحْلِ ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں: غزوۂ تبوک میں رسول اللہ صلی اللہ علیہ وسلم سے سُترہ (Cover)کے بارے میں دریافت کیاگیا ،تو آپ صلی اللہ علیہ وسلم نے فرمایا: پالان کی پچھلی لکڑی`
  },
  {
    pageNumber: 189,
    text: `کے برابر ہو،(صحیح مسلم: 500)‘‘۔
تنویر الابصار مع الدرالمختار ہے:
’’[[arabic: سُتْرَۃً بِقَدْرِذِرَاعٍ طُولاًوَغِلْظِ أِصبَعٍ لِتَبْدُوَلِلنَّاظِرِبِقُرْبِہٖ دُونَ ثَلَاثَۃِ أَذْرُعٍ]]‘‘۔
ترجمہ:’’ سُترہ کی لمبائی کی مقدار ایک ہاتھ اور موٹائی ایک انگلی کے برابر ہونی چاہیے تاکہ قریب سے دیکھنے والے پر ظاہر ہوکہ سترہ اور نمازی کے درمیان فاصلہ زیادہ سے زیادہ تین ہاتھ ہو  ‘‘۔
	سُترے کا بچھا کر رکھنایا نصب کرنا لازم نہیں ہے ،مُعلّق شے بھی بطور سُترہ استعمال ہوسکتی ہے ، علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَصُوْرَتُہٗ:أَنْ تَکُوْنَ السِّتَارَۃُ مِنْ ثَوْبٍ أَوْنَحْوِہٖ مُعَلَّقَۃٌ فِیْ سُقُفٍ مَثَلاً ثُمَّ یُصَلِّیْ قَرِیْباً مِّنْہُ،فَاِذَا سَجَدَ تَقَعُ عَلٰی ظَہْرِہٖ وَیَکُوْنُ سُجُوْدُہٗ خَارِجاًعَنْھَاوَاِذَاقَامَ أَوْقَعَدَ سَبَلَتْ عَلَی الْاَرْض وَسُتْرَتُہٗ]]‘‘۔ 
ترجمہ:’’ اس کی صورت یہ ہے:کپڑے کا پردہ یا اُس کے جیسی کوئی شے چھت سے مُعَلّق(لٹکی ہوئی) ہے، پھر اس کے قریب کوئی نمازپڑھ رہاہو،پس جب سجدہ کرے تو پردہ اُس کی پشت پر ہوگا اور سجدہ اُس(پردے) کے خارج میں اور جب نمازی قیام یا قعدہ کرے گا تو پردہ زمین پر لٹک رہاہوگا اور سترہ ہوگا ، (حاشیہ ابن عابدین شامی، جلد4، ص: 123-125-126،دمشق)‘‘۔
 
[[heading: تیمُّم کا حکم]] 
سوال:
	 سفر کے دوران ٹرین یا بس وغیرہ میں اگر پانی دستیاب نہ ہو ،`
  },
  {
    pageNumber: 190,
    text: `تیمم کس طرح کیاجاسکتا ہے ،نیز یہ کہ اگر پانی اور پاک مٹی دونوں دستیاب نہ ہوں  یا پاک مٹی تو دستیاب ہو لیکن استعمال پر قدرت نہ ہو تو پھر کیا حکم ہے،(یحییٰ ، کراچی )۔
جواب:
	 ٹرین ،بس وغیرہ کی دیواریں عموماً لکڑی ،لوہے یاپلاسٹک وغیرہ کی ہوتی ہیں ،اُن سے تیمم کرنا درست نہیں ہے ۔البتہ اگر سفر کے دوران اُن پر کچھ گرد و غبار وغیرہ جم جاتاہے ،امام اعظم ابوحنیفہ رحمہ اللہ تعالیٰ کے نزدیک گرد وغبار سے بھی تیمم کیاجاسکتا ہے۔
علامہ ابو الحسن علی بن ابو بکر فرغانی حنفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وَیَجُوْزُ التَّیَمُّمُ عِنْدَ أَبِی حَنِیْفَۃَ وَمُحَمَّدٍ رَحِمَہُمَا اللّٰہ بِکُلّ مَا کَانَ مِنْ جِنْس الْاَرْضِ کَالتُّرَابِ وَالرَّمْلِ وَالْحَجَرِ وَالْجَصِّ۔۔۔۔۔۔ وَکَذَا یَجُوْزُ بِالْغُبَارِ مَعَ الْقُدْرَۃِ عَلَی الصَّعِیْدِ  عِنْدَ أَبِیْ حَنِیْفَۃَ وَمُحَمَّدٍ رَحِمَہُمَا اللّٰہُ،لِاَنَّہٗ تُرَابٌ رَقِیْقٌ]]‘‘۔
ترجمہ:’’ امام ابوحنیفہ اور امام محمد رحمہما اللہ کے نزدیک ہر وہ چیز جو زمین کی جنس سے ہو ،اُس سے تیمم جائز ہے ،جیسے مٹی ، ریت ، پتھر اور چونا ‘‘۔۔۔۔اسی طرح  امام ابو حنیفہ رحمۃ اللہ علیہ کے نزدیک غبار سے تیمُّم کرنا بھی جائز ہے ،اگرچہ مٹی سے تیمُّم کرنے پر قادرہو ، کیونکہ غبار  باریک مٹی ہی ہوتا ہے ، (ہدایہ، جلد1، ص:88ـ)‘‘۔
صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں:
 ’’ جو چیز آگ سے جل کر راکھ ہوجاتی ہوجیسے: لکڑی ،گھاس وغیرہ یا پگھل جاتی ہو یا نرم ہوجاتی ہو جیسے: چاندی ،سونا،تانبا ،پیتل ،لوہا وغیرہ دھاتیں ،وہ زمین کی جنس سے نہیں ،ایسی چیزوں  سے تَیَمُّم جائز نہیں ۔ہاں یہ دھاتیں اگرکان سے نکال کر پگھلائی نہ گئیں کہ ان پر مٹی کے اجزا ہنوز باقی ہیں ،توان سے تَیَمُّم جائز ہے اور اگر پگھلاکر صاف کرلی گئیں اور ان پر اتنا غُبار ہے کہ ہاتھ مارنے سے اس کا اثر ہاتھ میں ظاہر ہوتاہے ،تو اس غُبار سے تَیَمُّم جائز ہے ، ورنہ نہیں، (بہارِ شریعت ،جلد اول ،ص:358)‘‘۔
	آج کل ریل گاڑیوں میں پانی کا انتظام ہوتاہے اور وضو کیاجاسکتا ہے ،لیکن اگر پانی دستیاب نہیں ہے اور خدشہ ہے کہ اگلے اسٹیشن پہنچنے تک نماز کا وقت نکل جائے گا ،تو  تیمُّم کرکے نمازپڑھ سکتے ہیں ،جیساکہ فقہی عبارات کے حوالے سے بتایاگیا ہے کہ گردپر ہاتھ`
  },
  {
    pageNumber: 191,
    text: `مار کر بھی تیمُّم ہوسکتاہے اوراحتیاطاً  مناسب سائز کا پتھر یا ڈھیلا بھی ساتھ رکھ سکتے ہیں، اس پر ہاتھ  پھیرنے سے بھی تَیمّم ہوسکتاہے ۔
	ریل میں مشکل یہ ہے کہ اسے اسٹیشن کے علاوہ ہر جگہ حسبِ منشا رکوایانہیں جاسکتا ،البتہ اگربس میں سفر کرتے ہوئے نماز کے وقت کے اندر اگلا اسٹاپ آنے کی اُمید ہے ،تو اس کا انتظار کریں ،ورنہ اسے مناسب جگہ نماز کے لیے رکوایابھی جاسکتا ہے۔ موٹر وے پر سروس سینٹر کے لیے جگہیں متعین ہیں ، وہاں دیگر ضروریات کے علاوہ استنجاخانے اور وضوخانے سمیت مسجد بھی ہوتی ہے ،آج کل عام شاہراہوں پر بعض پٹرول پمپوں کے ساتھ  مسافروں کے لیے چھوٹی مسجدیں بھی بنی ہوتی ہیں اور بعض مقامات پر تو بہت عمدہ اور صاف ستھری ہوتی ہیں اور مسافر مل کر باجماعت نماز بھی پڑھ لیتے ہیں اور بعض مقامات پر مین شاہراہ کے قریب مستقل مساجد ہوتی ہیں۔
سطورِ ذیل میں ہم نماز کے وقت کے اندر طہورین یعنی پانی اور پانی کے دستیاب نہ ہونے کی صورت میں تیمم کے لیے پاک مٹی یاجنسِ ارض سے کوئی چیز یا  غُبار وغیرہ پر قدرت نہ ہونے کی صورت میں نماز کے احکام پر تفصیلی گفتگو کر رہے ہیں:
امام مسلم اپنی سند کے ساتھ روایت کرتے ہیں:
(1)’’[[arabic: عَنْ عَائِشَةَ، أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلَادَةً فَهَلَكَتْ، فَاَرْسَلَ رَسُوْلُ اللهِ ﷺ نَاسًا مِنْ أَصْحَابِہٖ فِي طَلَبِهَا، فَاَدْرَكَتْهُمُ الصَّلَاةُ، فَصَلَّوْا بِغَيْرِ وُضُوْ ءٍ، فَلَمَّا أَتَوُا النَّبِيَّ ﷺ شَكَوْا ذٰلِكَ إِلَيْهِ، فَنَزَلَتْ آيَةُ التَّيَمُّمِ، فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ::جَزَاكِ اللهُ خَيْرًا، فَوَاللهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ، إِلَّا جَعَلَ اللهُ لَكِ مِنْهُ مَخْرَجًا وَجَعَلَ لِلْمُسْلِمِينَ فِيْهِ بَرَكَةً]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں: انہوں نے حضرت اسماء رضی اللہ عنہا سے ایک ہار عاریۃً لیا اور وہ (سفر میں) گم ہوگیا تھا، رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ میں سے بعض کو ہار ڈھونڈنے کے لیے بھیجا، اسی اثنامیں نماز کا وقت آگیا اور انہوں نے بغیر وضو کے نماز پڑھ`
  },
  {
    pageNumber: 192,
    text: `لی، جب وہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تو انہوں نے آپ سے اس بات کی شکایت کی، اسی وقت آیت تیمم نازل ہوئی اور اُسید بن حُضیر نے حضرت عائشہ سے کہا: اللہ تعالیٰ آپ کو جزائے خیر دے، آپ پر کوئی پریشانی نہیں آئی، لیکن اللہ تعالیٰ نے اس پریشانی کو آپ سے زائل کردیا اور مسلمانوں کے لیے اس میں برکت رکھ دی، (صحیح مسلم:367)‘‘۔
امام ابودائود اپنی سند کے ساتھ حضرت عائشہ رضی اللہ عنہا سے روایت کرتے ہیں:
(2)’’[[arabic: بَعَثَ رَسُوْلُ اللَّهِ ﷺ أُسَيْدَ بْنَ حُضَيْرٍ وَأُنَاسًا مَعَهٗ فِي طَلَبِ قِلَادَةٍ أَضَلَّتْهَا عَائِشَةُ،فَحَضَرَتِ الصَّلَاةُ فصَلَّوْا بِغَيْرِ وُضُو ءٍ، فَاَتَوُا النَّبِيَّ ﷺ فَذَكَرُوْا ذٰلِكَ لَهٗ، فَاُنْزِلَتْ آيَةُ التَّيَمُّمِ]]‘‘۔
ترجمہ: ’’رسول اللہ صلی اللہ علیہ وسلم نے اُسَید بن حُضَیر اور اُن کے ساتھ کچھ افراد کو حضرت عائشہ رضی اللہ عنہا کے گم کردہ ہار کی تلاش کے لیے بھیجا، اس دوران نماز کا وقت آگیا تو انہوں نے بغیر وضو کے نماز پڑھ لی ، پھر وہ نبی صلی اللہ علیہ وسلم کے پاس حاضر ہوئے اور آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آیتِ تیمم نازل ہوئی، (ابودائود:317)‘‘۔
علامہ ابن قدامہ حنبلی لکھتے ہیں:
’’ [[arabic: وَإِنْ عَدِمَ بِكُلِّ حَالٍ صَلّٰى عَلٰی حَسَبِ حَالِهٖ. وَهٰذَا قَوْلُ الشَّافِعِيِّ، وَقَالَ أَبُو حَنِيفَةَ وَالثَّوْرِيُّ وَالْاَوْزَاعِيُّ:: لَا يُصَلِّي حَتّٰى يَقْدِرَ، ثُمَّ يَقْضِيَ، لِاَنَّهَا عِبَادَةٌ لَا تُسْقِطُ الْقَضَاءَ، فَلَمْ تَكُنْ وَاجِبَةً، كَصِيَامِ الْحَائِضِ.، وَقَالَ مَالِكٌ:: لَا يُصَلِّي وَلَا يَقْضِي، لِاَنَّهٗ عَجَزَ عَنِ الطَّهَارَةِ، فَلَمْ تَجِبْ عَلَيْهِ الصَّلَاةُ، كَالْحَائِضِ.، وَقَالَ ابْنُ عَبْدِ الْبَرِّ: :هٰذِهِ رِوَايَةٌ مُنْكَرَةٌ عَنْ مَالِكٍ. وَذَكَرَ عَنْ أَصْحَابِهٖ قَوْلَيْنِ:: أَحَدُهُمَاكَقَوْلِ أَبِي حَنِيفَةَ، وَالثَّانِي يُصَلِّي عَلٰی حَسَبِ حَالِهٖ، وَيُعِيدُ. ،وَلَنَا مَا رَوَى مُسْلِمٌ فِي ’’ صَحِيحِهِ‘‘  أَنَّ النَّبِيَّ ﷺ بَعَثَ أُنَاسًا لِطَلَبِ قِلَادَةٍ أَضَلَّتْهَا عَائِشَةُ، فَحَضَرَتِ الصَّلَاةُ، فَصَلَّوْا بِغَيْرِ وُضُو ءٍ، فَاَتَوُا النَّبِيَّ ﷺ فَذَكَرُوا ذٰلِكَ لَهٗ، فَنَزَلَتْ آيَةُ التَّيَمُّمِ. وَلَمْ يُنْكِرِ النَّبِيُّ ﷺذٰلِكَ وَلَا أَمَرَهُمْ]]`
  },
  {
    pageNumber: 193,
    text: `[[arabic: بِإِعَادَةٍ۔
	فَدَلَّ عَلٰى أَنَّهَا غَيْرُ وَاجِبَةٍ، وَلِاَنَّ الطَّهَارَةَ شَرْطٌ، فَلَمْ تُؤَخَّرِ الصَّلَاةُ عِنْدَ عَدَمِهَا، كَالسُّتْرَةِ وَاسْتِقْبَالِ الْقِبْلَةِ. وَإِذَا ثَبَتَ هٰذَا، فَإِذَا صَلّٰى عَلٰى حَسَبِ حَالِهٖ، ثُمَّ وَجَدَ الْمَاءَ أَوِ التُّرَابَ، لَمْ يَلْزَمْهُ إعَادَةُ الصَّلَاةِ فِي إحْدَى الرِّوَايَتَيْنِ، وَالْاُخْرَى عَلَيْهِ الْإِعَادَةُ. وَهُوَ مَذْهَبُ الشَّافِعِيِّ، لِأَنَّهٗ فَقَدَ شَرْطَ الصَّلَاةِ، أَشْبَهَ مَا لَوْ صَلّٰى بِالنَّجَاسَةِ۔
	وَالصَّحِيحُ الْاَوَّلُ، لِمَا ذَكَرْنَا مِنَ الْخَبَرِ، وَلِاَنَّهٗ أَتٰى بِمَا أُمِرَ، فَخَرَجَ عَنْ عُهْدَتِهٖ، لِاَنَّهٗ شَرْطٌ مِنْ شَرَائِطِ الصَّلَاةِ ،فَيَسْقُطُ عِنْدَ الْعَجْزِ عَنْهُ، كَسَائِرِ شُرُوْطِهَا وَأَرْكَانِهَا، وَلِاَنَّهٗ أَدّٰى فَرْضَهٗ عَلٰى حَسَبِهٖ، فَلَمْ يَلْزَمْهُ الْإِعَادَةُ، كَالْعَاجِزِ عَنْ السُّتْرَةِ إذَا صَلّٰى عُرْيَانًا، وَالْعَاجِزِ عَنِ الْاِسْتِقْبَالِ إذَا صَلّٰى إلٰى غَيْرِهَا، وَالْعَاجِزِ عَنِ الْقِيَامِ إذَا صَلّٰى جَالِسًا، وَقِيَاسُ أَبِي حَنِيفَةَ عَلَى الْحَائِضِ فِي تَاْخِيْرِ الصِّيَامِ لَا يَصِحُّ، لِاَنَّ الصَّوْمَ يَدْخُلُهُ التَّاْخِيْرُ، بِخِلَافِ الصَّلَاةِ، بِدَلِيْلِ أَنَّ الْمُسَافِرَ يُؤَخِّرُ الصَّوْمَ دُوْنَ الصَّلَاةِ، وَلِاَنَّ عَدَمَ الْمَاءِ لَوْ قَامَ مَقَامَ الْحَيْضِ لَاَسْقَطَ الصَّلَاةَ بِالْكُلِّيَّةِ، وَلِاَنَّ قِيَاسَ الصَّلَاةِ عَلَى الصَّلَاةِ أَوْلٰى مِنْ قِيَاسِهَا عَلَى الصِّيَامِ، وَأَمَّا قِيَاسُ مَالِكٍ فَلَا يَصِحُّ، لِاَنَّ النَّبِيَّ ﷺ قَالَ: : إذَا أَمَرْتُكُمْ بِاَمْرٍ فَاْتُوا مِنْهُ مَا اسْتَطَعْتُمْ۔وَقِيَاسُ الطَّهَارَةِ عَلٰی سَائِرِ شَرَائِطِ الصَّلَاةِ أَوْلٰى مِنْ قِيَاسِهَا عَلَى الْحَائِضِ، فَإِنَّ الْحَيْضَ أَمْرٌ مُعْتَادٌ يَتَكَرَّرُ عَادَةً، وَالْعَجْزُ هَاهُنَا عُذْرٌ نَادِرٌ غَيْرُمُعْتَادٍ، فَلَا يَصِحُّ قِيَاسُهٗ عَلَى الْحَيْضِ، وَلِاَنَّ هٰذَا عُذْرٌ نَادِرٌ فَلَمْ يُسْقِط الْفَرْضَ، كَنِسْيَانِ الصَّلَاةِ وَفَقْدِ سَائِرِ الشُّرُوطِ. ]]‘‘۔
ترجمہ:’’اوراگر وضو اور تیمم پر کسی صورت میں قدرت نہ ہو ،تو جس حال میں ہو نماز پڑھے اور یہ امام شافعی کا قول ہےاور امام ابوحنیفہ ،سفیان ثوری اور امام اوزاعی نے کہا: جب تک قدرت حاصل نہ ہو نماز نہ پڑھے ، پھر قضا کرلے ،کیونکہ یہ عبادت ہے اور( عدمِ قدرت ) قضا کو ساقط نہیں کرتی، پس اُسی حالت میں ادا کرنا واجب نہیں ہوگا ، جیسے حائض کے`
  },
  {
    pageNumber: 194,
    text: `لیے رمضان کے روزے(حالتِ حیض میں رکھنا واجب نہیں ہیں) ۔ امام مالک نے کہا:نہ اس حالت میں نماز پڑھے اور نہ قضا کرے، کیونکہ وہ طہارت سے عاجز ہے تو اس پر نماز واجب نہیں ہے، جیسے حائض پر واجب نہیں ہے۔ اور ابن عبدالبر نے کہا: امام مالک سے یہ روایت مُنکَر ہے اور اصحابِ مالک سے دو روایتیں ہیں: (۱) امامِ ابوحنیفہ کے قول کے مطابق (کہ اس حالت میں نہ پڑھے جب تک کہ طہارت پر قدرت حاصل نہ ہوجائے،پھر قضا کرے)،(۲) اُسی حالت میں نماز پڑھ لے اور اعادہ کرے۔ امام ابن قدامہ نے کہا: ہماری دلیل امام مسلم کی روایت ہے(نفسِ مسئلہ کے بارے میں صحیح مسلم اور سنن ابودائود کے الفاظ متقارب ہیں)،نبی صلی اللہ علیہ وسلم نے نہ اُن کے اس عمل کو رد کیا اور نہ نماز کا اعادہ کرنے کا حکم فرمایا۔
	 یہ حدیثِ( تقریری )دلالت کرتی ہے کہ(ایسی حالت میں پڑھی گئی نماز کا) اعادہ واجب نہیں ہے ، کیونکہ طہارت شرط ہے اور عدمِ طہارت کی صورت میں نماز مؤخر نہیں کی جائے گی ،جیسے سُترہ کے بغیریا قبلہ رُخ ہوئے بغیر نماز پڑھ لی تو اس صورت میں نماز کا اعادہ نہیں ہوگا اور جب یہ بات ثابت ہوگئی اور جب اُسی حالت پر نماز پڑھ لی ،پھر پانی یا مٹی دستیاب ہوگئےتو دومیں سے ایک روایت کے مطابق نماز کا اعادہ لازم نہیں ہے اور دوسری روایت کے مطابق اعادہ لازم ہے اور یہ امام شافعی کا مذہب ہے ،کیونکہ اس نے نماز کی شرط کو نہ پایا ، یہ صورت اُس کے مشابہ ہے کہ نجاست کے ساتھ نماز پڑھ لی ہو۔
	 صحیح پہلی روایت ہے ،جیساکہ ہم نے حدیث بیان کی اور اس لیے بھی کہ اس نے امرِ شرعی پر عمل کیا اور اس سے بری الذمہ ہوگیا ، کیونکہ طہارت نماز کی شرائط میں سے ایک شرط ہے تو عَجز کی صورت میں ساقط ہوجائے گی ، جیسے باقی شرائط اور ارکان ساقط ہوجاتے ہیں اور اس لیے کہ اس نے فرض کو حسبِ حال ادا کیا تو اس پر اعادہ لازم نہیں ہے ، جیسے برہنہ نماز پڑھنے والا سترِ عورت سے عاجز ہوتا ہے اور استقبالِ قبلہ (کے تعین ) سےعاجز شخص جب غیرِ قبلہ کی طرف رُخ کر کے نماز پڑھ لے اور قیام سے عاجز شخص جب بیٹھ کر نماز پڑھ لے اور امام ابوحنیفہ کا حائض کے روزوں کو مؤخر کرنے پر قیاس کرنا صحیح نہیں ہے، کیونکہ روزے`
  },
  {
    pageNumber: 195,
    text: `میں( عذرکی بنا پر) تاخیر ہوسکتی ہے بخلاف نماز کے (کہ اس میں تاخیر نہیں ہوسکتی)اور اس کی دلیل یہ بھی ہے کہ مسافر روزے کو مؤخر کرلے گا(مگر) نماز کو نہیں کرسکتااور اس لیے کہ اگر پانی پر عدمِ قدرت حیض کے قائم مقام ہو تو یہ نماز کو بالکلیہ ساقط کردے گی (کیونکہ حائض سے نماز ساقط ہوجاتی ہے)اور اس لیے بھی کہ نماز کو نماز پر قیاس کرنا روزے پر قیاس کرنے کی نسبت اولیٰ ہے اور امام مالک کا قیاس صحیح نہیں ہے،کیونکہ نبی صلی اللہ علیہ وسلم نے فرمایا: جب میں تمہیں کسی بات کا حکم دوں تو اپنی استطاعت کے مطابق اس پر عمل کرواور طہارت کا نماز کی باقی شرائط پر قیاس کرنا حائض کے روزے پر قیاس کرنے سے اولیٰ ہے ، کیونکہ حیض خواتین کے لیے ایک عادتِ جاریہ (Routine Matter)ہے اور اپنے مقررہ وقت پر اس کا اعادہ ہوتا رہتا ہے اور عَجز وہاں عذر بنتا ہے جہاں امرِ غیر معتاد ہو، لہٰذا حائض کے روزے پر اس کا قیاس کرنا درست نہیں ہے اور اس لیے بھی کہ یہ عذرِ نادر ہے، لہٰذا فرض کو ساقط نہیں کرے گا،جیسے نماز کی ادائی کو بھول جانا اور باقی شرائط کا فقدان ، (المغنی ،ج:۱،ص:۱۸۴)‘‘۔
	 نماز کی ادائیگی کو بھول جانے کے بارے میں رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے:
(1) ’’[[arabic: مَنْ نَسِيَ الصَّلَاةَ فَلْيُصَلِّهَا إِذَا ذَكَرَهَا]]‘‘،ترجمہ:’’جب کوئی( وقت پر )نماز پڑھنا بھول جائے تو جوں ہی یاد آئے پڑھ لے،(صحیح مسلم:680)‘‘۔
(2)’’[[arabic: عَنْ أَبِي قَتَادَةَ، قَالَ: :ذَكَرُوا لِلنَّبِيِّ ﷺ نَوْمَهُمْ عَنِ الصَّلاَةِ، فَقَالَ:: إِنَّهٗ لَيْسَ فِي النَّوْمِ تَفْرِيْطٌ، إِنَّمَا التَّفْرِيطُ فِي الْيَقَظَةِ، فَإِذَا نَسِيَ أَحَدُكُمْ صَلاَةً أَوْ نَامَ عَنْهَا، فَلْيُصَلِّهَا إِذَا ذَكَرَهٗ]]‘‘۔
ترجمہ:’’ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں: صحابہ نے نبی صلی اللہ علیہ وسلم سے عرض کی: (بعض اوقات) سوتے ہوئے نماز رہ جاتی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تفریط (کوتاہی) سونے میں نہیں ہے، کوتاہی جاگتے ہوئے (نماز کو ترک کرنے میں)ہے، پس جب تم میں سے کوئی نماز کو بھول جائے یا سوتا رہ جائے ، تو جوں ہی یاد آئے نماز پڑھ لے، (سنن ترمذی:177)‘‘۔`
  },
  {
    pageNumber: 196,
    text: `علامہ علاء الدین حصکفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: بِاَنْ حُبِسَ فِي مَكَانٍ نَجِسٍ وَلَا يُمْكِنُهٗ إخْرَاجُ تُرَابٍ مُطَهِّرٍ، وَكَذَا الْعَاجِزُ عَنْهُمَا لِمَرَضٍ ]]‘‘۔
ترجمہ: ’’کسی کو ناپاک جگہ میں بند کیا جائے کہ اس کے لیے پاک مٹی نکالنا ممکن نہ ہو، اسی طرح اگر مرض کی وجہ سے وہ پانی اور مٹی کے استعمال پر قادر نہ ہو (تو یہ دونوں فاقد الطہورین کی صورتیں ہیں)،(الدُّرُّ المختار ،ج:1،ص:252)‘‘۔’’فَقْدُ الطَّھُوْرَیْن‘‘کے معنی ہیں:’’پاک کرنے والی دو چیزوں یعنی پانی اور پاک مٹی کا دستیاب نہ ہونا‘‘۔
 ڈاکٹر وہبہ زحیلی’’فَقْدُ الطَّھُوْرَیْن‘‘ کی صورتیں بیان کرتے ہوئے لکھتے ہیں:
’’[[arabic: کَاَنْ حُبِسَ فِیْ مَکَانٍ لَیْسَ فِیْہِ وَاحِدٌ مِّنْھُمَااَوْفِیْ مَوْضِعٍ نَجِسٍ لَا یُمْکِنُہُ اِخْرَاجُ تُرَابٍ مُطَھِّرٍ اَوْ کَاَنْ وَجَدَ مَاءًھُوَ مُحْتَاجٌ اِلَیْہِ لِنَحْوِ عَطَشٍ اَوْ وَجَدَ تُرَابًا نَدِیًّا وَلَمْ یَقْدِرْ عَلٰی تَجْفِیْفِہٖ بِنَحْوِ نَارٍ وَمِثْلُہُ الْمَصْلُوْبُ وَرَاکِبُ سَفِیْنَۃٍ لَا یَصِلُ اِلَی الْمَآءِ]]‘‘۔
ترجمہ:’’(۱)کسی کو ایسی جگہ میں قید کیا جائے کہ وہاں پانی اور مٹی دونوں میسر نہ ہوں،(۲) کسی کو کسی نجس مکان میں قید کیا جائے کہ وہ پاک مٹی کے اخراج پر قادر نہ ہو، (۳) پانی ہے، لیکن پیاس بجھانے کے لیے کفایت کرتاہے ،گیلی مٹی ہو اور اسے خشک کرنے کی کوئی صورت نہ ہو، جیسے : آگ پر گرم کر کے خشک کرنا وغیرہ، (۴) کسی کو سولی پر لٹکایا جائے کہ جس کی وجہ سے وہ طہارت پر قادر نہ ہو، (۵) کوئی شخص کشتی میں سوار ہو اور سمندر کا پانی اس کی دسترس میں نہ ہو، (اَلْفِقْہُ الْاِسْلَامِیْ وَاَدِلَّتُہٗ، ج:1،ص:606)‘‘۔ 
	ایسے شخص پر وجوب وعدمِ وجوب صلوٰۃ کے بارے میں اختلاف ہے، فقہائے کرام کے اس مسئلے میں مختلف مذاہب ہیں: 
(۱)’’ امام احمد بن حنبل فرماتے ہیں: ایسے شخص پر طہارت کے بغیر نماز ادا کرنا واجب ہے، بعد میں اعادہ واجب نہیں ہے ،(۲) امام مالک فرماتے ہیں: ایسے شخص پر نماز معاف ہے، اُس سے ادا اور قضا دونوں ساقط ہیں،(۳)امام شافعی فرماتے ہیں: ایسے شخص پر ادا اور قضا`
  },
  {
    pageNumber: 197,
    text: `دونوں واجب ہیں،(۴) امام ابویوسف اور امام محمد کے نزدیک ایسے شخص پر وقت کے اندر تشبُّہ بالمصلّین واجب ہے، لیکن تشبُّہ کی صورت میں نہ نماز کی نیت کرے گا، نہ قرا ءت کرے گااور طہارت پر قادر ہونے کے بعد نماز کا اعادہ کرے گا،’’تَشَبُّہْ بِالصَّلٰوۃ‘‘سے مراد یہ ہے کہ نمازی جیسی حرکات کرے، جیسے قیام، قراءت کے لیے ہونٹوں کو ہلانا، رکوع وسجود اور تشہد وغیرہ،(۵) امام ابوحنیفہ کا مفتیٰ بہ مذہب وہی ہے جو کہ صاحبین کا ہے، (الفقہ الاسلامی وادلتہ،ج:1،ص:606-609)‘‘۔
	ہمارے علماء نے صاحبین کے مذہب کو ترجیح دی ہے، کیونکہ شریعت میں اس کی نظیریں موجود ہیں، جیسے:(۱) تَشَبُّہْ بِالصَّائِمِیْن، یعنی رمضان کے مہینے میں اگر حیض ونفاس والی عورت دن کے کسی حصے میں پاک ہوجائے یا مسافر مقیم ہوجائے یا نابالغ ،بالغ ہوجائے یا کوئی کافر مسلمان ہوجائے ،تو دن کے باقی حصے میں وہ روزے کے مُنافی افعال (جیسے کھانا پینا وغیرہ)سے اجتناب کرے گا،(۲) تَشَبُّہْ بِالْحُجَّاج:اسی طرح اگر کسی کا حج رکنِ اعظم ادا نہ کرنے کے سبب فوت ہوجائے تو وہ دوسرے حجاج کی طرح حج کے افعال ادا کرتا رہے گا، لیکن بعد میں اس حج کی قضا کرے گا۔ 
	ہمارے شیخ الحدیث علامہ احمد علی سعیدی اپنی زیرِ تصنیف ’’شرح سنن ابی داود‘‘ میں لکھتے ہیں:
 ’’اس مسئلے میں امام احمد بن حنبل کے مذہب کو ترجیح دینا اولیٰ ہے، کیونکہ نماز کے مسائل کو نماز کے مسائل پر ہی قیاس کرنا چاہیے، طہارت کی طرح استقبال قبلہ بھی نماز کی شرائط میں سے ہے، لیکن ہمارے فقہائے کرام فرماتے ہیں: ’’جو شخص کسی عذر کی بنا پر استقبال قبلہ سے عاجز ہو، وہ جس سمت پر نماز پڑھنے پر قادر ہو، اسی طرف منہ کر کے نماز پڑھے گا اور بعد میں اس پر اعادہ نہیں ہے، (درمختار مع رد المحتار، ج:1،ص: 290)‘‘۔ 
	اسی طرح سترِ عورت بھی نماز کی شرائط میں سے ،لیکن اگر کسی نمازی کے پاس سترِ عورت کے لیے کپڑے نہ ہوں تو اس کے لیے حکم یہ ہے کہ وہ بغیر کپڑوں کے بیٹھ کر`
  },
  {
    pageNumber: 198,
    text: `اشارے سے نماز پڑھے گا، اگر اس کے کپڑے کسی نے غصب نہیں کیے تھے تو بالاتفاق وہ نماز کا اعادہ نہیں کرے گا، (البحر الرائق،ج:1،ص:275)‘‘، نماز کے انہی مسائل پر قیاس کرتے ہوئے فاقد الطہورین کی نماز بھی بغیر طہارت کے جائز ہونی چاہیے اور اس پر اعادہ واجب نہیں ہے‘‘۔ 
	علامہ ابن قدامہ حنبلی نے یہ موقف اختیار کیا کہ نماز کو نماز پر قیاس کرنا چاہیے ،نہ کہ روزوں پر کہ حائض کی ایامِ حیض کی نمازیں معاف ہیں، جبکہ حائض پر ایامِ حیض کےچھوٹے ہوئے روزوں کی قضا واجب ہے ۔لیکن مذکورہ بالا سطور میں یہ درج کیا جاچکا ہے کہ ’’فَاقِدُ الطَّھُورَین‘‘ کی صورت میں صاحبین اور امام ابوحنیفہ کا مختار مذہب یہی ہے کہ نماز کی قضا واجب ہوگی ، ہمارے نزدیک یہی قابلِ ترجیح ہے۔ 
	ہمارے استاذِ حدیث علامہ محمد عبداللہ ضیائی نے بھی اس مسئلے پر تفصیلی بحث لکھی ہے،وہ لکھتے ہیں:
شیخ ابن حزم ظاہری متوفی ۴۵۶ ہجری لکھتے ہیں:
’’وہ شخص جو وضو اور تیمم کرنے پر قادر نہ ہو اور نماز کا وقت ہوجائے تو وہ اُسی حال میں نماز پڑھے گا ، اس کی نماز جائز ہوگی ، وہ نماز کا اعادہ نہیں کرے گا، خواہ وہ وقت کے اندر پانی پر قادر ہوجائے یا وقت کے بعد ، اس کی دلیل یہ ہے: اللہ تعالیٰ نے فرمایا:
(1) ’’[[arabic: فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ ]]‘‘، ترجمہ: ’’تم جتنی استطاعت رکھتے ہو،اتنا اللہ تعالیٰ سے ڈرو، (التغابن:16)‘‘۔
 (2)’’[[arabic: لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ]]‘‘ ، ترجمہ: ’’اللہ تعالیٰ کسی نفس کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا، (البقرہ:286)‘‘۔ 
(3)’’[[arabic: وَ قَدْ فَصَّلَ لَكُمْ مَّا حَرَّمَ عَلَيْكُمْ إِلَّا مَا اضْطُرِرْتُمْ إِلَيْهِ]] `
  },
  {
    pageNumber: 199,
    text: `ترجمہ:’’اللہ تعالیٰ نے وہ چیزیں تمہارے لیے تفصیل سے بیان کردی ہیں جو اُس نے تم پر حرام کی ہیں، اِلَّا یہ کہ تم اس کی طرف مجبور ہوجائو، (الانعام:119)‘‘۔
	نبی صلی اللہ علیہ وسلم نے فرمایا: ’’[[arabic: اِذَا أَمَرْتُکُمْ بِاَمْرٍ فَافْعَلُوْا مِنْہُ مَا اسْتَطَعْتُمْ]]‘‘، ترجمہ: ’’جب میں تمہیں کسی چیز کا حکم دوں تو اُسے حسبِ استطاعت کرو‘‘۔
	مذکورہ بالا نصوص کی روشنی میں یہ بات ثابت ہوتی ہے کہ اللہ تعالیٰ اور اس کے رسول صلی اللہ علیہ وسلم نے ہمیں ہماری استطاعت اور طاقت کے بقدر احکامِ شرعیہ کا مکلف بنایا ہے، لہٰذا ہم پر اپنی استطاعت اور قوت کے بقدر شریعت کے احکام کی پابندی لازم اور ضروری ہے اور جو حکم ہماری استطاعت اور قدرت سے باہر ہے، ہم اس کے مکلف نہیں ہیں اور یہ بات بالکل صحیح ہے کہ اللہ تعالیٰ نے ہمارے لیے بغیر طہارت کے نماز پڑھنے کو حرام کردیا ہے ،اِلَّا یہ کہ ہم طہارت کی استطاعت اور قدرت نہ رکھیں اور وہ شخص جو پانی سے وضو کرنے یا مٹی سے تیمم کرنے پر قادر نہیں ہے، وہ نماز کے لیے طہارت کو ترک کرنے پر مجبور ہے، لہٰذا ایسے شخص پر سے طہارت کے بغیر نماز پڑھنے کی حرمت ساقط ہے اور چونکہ وہ نماز پڑھنے پر قادر ہے، لہٰذا اس پر نماز کی ادائیگی واجب ہوگی اور وہ اس حال میں نماز پڑھے گا تو وہ اُسی طرح نماز پڑھنے والا کہلائے جیسے اللہ تعالیٰ نے حکم دیا ہے اور جب وہ اللہ تعالیٰ کے حکم کے مطابق نماز پڑھنے والا کہلایا تو پھر نہ تو اس پر کوئی گناہ ہے اور نہ نماز کا اعادہ واجب ہے۔
	 وہ علماء جنہوں نے یہ کہا ہے کہ ایسا شخص نماز نہیں پڑھے گا تو انہوں نے اس بات سے استدلال کیا ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا: بے وضو شخص کی نماز قبول نہیں کی جاتی اور نبی صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ بغیر طہارت کے نماز قبول نہیں فرماتا۔
شیخ ابن حزم لکھتے ہیں:
’’اگر اللہ تعالیٰ اور اس کے نبی صلی اللہ علیہ وسلم نے ہم سے اُن چیزوں کو ساقط نہ کیا ہوتا جن پر ہم قادر نہیں ہیں اور اُن چیزوں کو باقی نہ رکھا ہوتا جن پر ہم قادر ہیں، تو یہ قول تمام اقوال کے مقابلے میں صحیح ہوتا، لیکن اللہ تعالیٰ نے ہم سے اُن چیزوں کو ساقط کردیا ہے جو ہماری استطاعت میں نہیں ہیں اور اُن چیزوں کا ہمیں مکلف بنایا ہے جن کی ہم استطاعت رکھتے ہیں، اس بناپر نبی صلی اللہ علیہ وسلم نے جو فرمایا کہ بغیر طہارت کے نماز قبول نہیں کی جاتی، یہ حکم اس`
  },
  {
    pageNumber: 200,
    text: `شخص کے لیے ہوگا جو وضو یا تیمم کر کے طہارت حاصل کرنے پر قادر ہو، نہ کہ اُس شخص کے لیے جو ان دونوں چیزوں پر قادر نہ ہو۔ 
	نیز اس بارے میں حضرت عائشہ رضی اللہ عنہا سے صحیح وصریح حدیث بھی مروی ہے، وہ بیان فرماتی ہیں:
’’[[arabic: عَنْ عَائِشَةَ قَالَتْ:بَعَثَ رَسُوْلُ اللَّهِﷺ أُسَيْدَ بْنَ حُضَيْرٍ وَنَاسًا يَطْلُبُونَ قِلَادَةً كَانَتْ لِعَائِشَةَ نَسِيَتْهَا فِي مَنْزِلٍ نَزَلَتْهُ، فَحَضَرَتِ الصَّلَاةُ وَلَيْسُوْا عَلٰى وُضُو ءٍ،وَلَمْ يَجِدُوْا مَاءً فَصَلّوْا بِغَيْرِ وُضُو ءٍ، فَذَكَرُوْا ذٰلِكَ لِرَسُوْلِ اللَّهِ ﷺ فَاَنْزَلَ اللَّهُ عَزَّ وَجَلَّ آيَةَ التَّيَمُّمِ، قَالَ: أُسَيْدُ بْنُ حُضَيْرٍ: :جَزَاكِ اللَّهُ خَيْرًا، فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ تَكْرَهِينَهُ إِلَّا جَعَلَ اللَّهُ لكِ وَلِلْمُسْلِمِينَ فِيهِ خَيْرًا]]‘‘۔
ترجمہ:’’رسول اللہ صلی اللہ علیہ وسلم نے حضرت اُسید بن حضیر اور دیگر کچھ لوگوں کو اس ہار کی تلاش میں بھیجا جسے وہ ایک پڑائو کی جگہ میں بھول گئی تھیں، پس نماز کا وقت ہوگیا اور وہ لوگ وضو کی حالت میں بھی نہیں تھے اور وہ پانی کو بھی نہ پاسکے، پس انہوں نے بے وضو نماز پڑھ لی، پھر انہوں نے اس بات کا ذکر نبی صلی اللہ علیہ وسلم سے کیا تو اللہ تعالیٰ نے تیمم کی آیت کو نازل فرمادیا۔ حضرت اسید بن حضیر نے فرمایا: اللہ تعالیٰ تمہیں جزائے خیر عطا فرمائے، جب بھی تمہارے اوپر کوئی ایسی بات آئی ہے جسے تم ناپسند کرتی ہو، تو اللہ تعالیٰ اس میں تمہارے لیے اور مسلمانوں کے لیے بھلائی رکھ دیتا ہے، (سنن نسائی: ۳۲۳، صحیح البخاری: ۳۳۶، صحیح مسلم:۳۶۷، سنن ابودائود:۳۱۷، سنن ابن ماجہ: ۵۶۸)‘‘۔
(اَلْمُحَلّٰی بِالْآثَار،رقم المسئلہ: 246،ج:1،ص:362)‘‘۔ 
	اس حدیث میں بیان ہے کہ بعض صحابہ کرام نے پانی پر قادر نہ ہونے کی وجہ سے بغیر وضو کے نماز پڑھی، اس سے معلوم ہوتا ہے کہ اُن صحابہ کرام کا یہ نظریہ تھا کہ جو شخص طہارت پر قادرنہ ہو تو وہ بغیر طہارت کے نماز پڑھ سکتا ہے اور یہ اُس وقت کی بات تھی جب تیمم کا حکم نازل نہیں ہوا تھا، گویا کہ اس وقت تیمم کا مشروع نہ ہونا اسی طرح تھا جس طرح تیمم کے`
  },
  {
    pageNumber: 201,
    text: `مشروع ہونے کے بعد پاک مٹی کا مفقود ہونا اور پھر جب انہوں نے یہ بات نبی صلی اللہ علیہ وسلم کے سامنے ذکر فرمائی تو آپ صلی اللہ علیہ وسلم نے اُن پر کوئی اعتراض نہیں فرمایا، لہٰذا اگر یہ ممنوع ہوتا تو نبی صلی اللہ علیہ وسلم ضرور صحابہ کرام پر انکار فرماتے، نیز نبی صلی اللہ علیہ وسلم نے انہیں نماز دہرانے کا حکم بھی نہیں دیا، یہ اس بات کی دلیل ہے کہ فاقد الطہورین پر نماز کا اعادہ بھی لازم نہیں ہے۔
علامہ ابوالحسن محمد بن عبدالہادی ٹھٹوی سندھی متوفی ۱۱۳۸ ہجری لکھتے ہیں:
’’نبی صلی اللہ علیہ وسلم نے فرمایا: ’’جب میں تمہیں کسی چیز کا حکم دوں تو اُسے حسبِ استطاعت کرو‘‘، اس حدیث کی روشنی میں ہم دیکھتے ہیں کہ جو شخص فاقد الطہورین ہو ، وہ نماز پڑھنے پر تو قادر ہوتا ہے، البتہ طہارت کے حصول پر قادر نہیں ہوتا، لہٰذا جس چیز کی وہ استطاعت رکھتا ہے اس کی بجا آوری اس پر لازم ہوگی اور جس چیز کی وہ استطاعت نہیں رکھتا، وہ اس سے ساقط ہوگی اور طہارت کی استطاعت نہ ہونے کی وجہ سے نماز ساقط نہیں ہوگی، کیونکہ وہ نماز کی استطاعت رکھتا ہے، اِلَّا یہ کہ اس پر کوئی دلیل موجود ہو اور یہی بات قیاس اور اصول کے موافق ہے، کیونکہ شرط کی تکلیف کے ساقط ہونے کو مشروط کی تکلیف کا ساقط ہونا لازم نہیں ہے، مثلاً وہ شخص جو اتنی مقدار کپڑوں پر بھی قادر نہ ہو جو اُس کے ستر کو چھپادے یا اس کے پاس کپڑے موجود ہوں لیکن وہ ناپاک ہوں یا جگہ ناپاک ہو، تو ان امور کی وجہ سے اس پر سے نہ تو نماز کی ادائیگی ساقط ہوتی ہے اور نہ مؤخر، بلکہ ایسے شخص پر اسی حال میں نماز فرض ہوتی ہے اور اس پر اعادہ بھی لازم نہیں ہوتا، لہٰذا یہی حکم طہارت کا بھی ہوگا۔ 
	اور شرط تو اپنی جگہ رہی،ایک رکن کی ادائیگی کا متعذر ہونا باقی ارکان کی ادائیگی کے لزوم کو ساقط نہیں کرتا، لہٰذا شرط کس طرح ساقط کرسکتی ہے، مثلاً: جس شخص کے اعضاء وضو میں سے کوئی عضو کٹا ہوا ہو تو اس پر باقی اعضا کو دھونا فرض ہے اور اس سے وضو ساقط نہیں ہوتا۔ اسی طرح جو شخص نماز میں قراءت کرنے سے عاجز آجائے یا قیام سے عاجز آجائے تو اس سے قراءت اور قیام تو ساقط ہوجاتے ہیں، البتہ باقی ارکان کی ادائیگی ساقط نہیں ہوتی۔ 
	بلکہ ہم دیکھتے ہیں کہ بعض صورتوں میں طہارت کی شرط بھی ساقط ہوجاتی ہے، مثلاً:`
  },
  {
    pageNumber: 202,
    text: `جس شخص کو پیشاب کے قطرے آنے یا ہوا کے خارج ہونے کا عذر ہو تو ایسے شخص پر اسی حال میں نماز پڑھنا فرض ہے اور اس پر نماز کا اعادہ لازم نہیں ہے، لہٰذا اسی طرح جو شخص فاقد الطہورین ہو ،وہ بھی اسی حال میں بغیر طہارت کے نماز پڑھے گا اور اس پر نماز کی قضالازم نہیں ہوگی،(حاشیہ سنن نسائی، ج:1،ص:172)‘‘۔
	راقم الحروف کی رائے یہ ہے کہ شیخ ابن حزم اور علامہ سندھی نے اس مسئلہ کے متعلق جو تحقیق فرمائی ہے، یہ نقلی وعقلی دونوں قسم کے دلائل سے مزین ہے اور باقی اقوال کے مقابلے میں دلائل کے اعتبار سے مضبوط اور قوی ہے، (شرح جامع ترمذی، ج: 1، ص: 56-58)‘‘۔ 

[[heading: مسافر پر جمعہ فرض نہیں ہے]]
سوال:
	مسافر کے لیے نماز جمعہ کا کیا حکم ہے ؟ اور اگر وہ نماز جمعہ ادا کرنا چاہے تو وہ کتنی رکعت ادا کرے گا ، اگر اس کو جماعت ملے تو کتنی رکعت ادا کرے  اور اگر جماعت نہ مل سکے تو پھر کیسے نماز ادا کرے گا ،(ایچ ۔اے، لاہور)۔
جواب:
	مسافر پر جمعہ کی نماز فرض نہیں ،علامہ برہان الدین ابوالحسن علی بن ابی بکر لکھتے ہیں: 
’’[[arabic: وَلَا تَجِبُ الْجُمُعَۃُ عَلٰی مُسَافِرٍ]]‘‘۔
ترجمہ:’’مسافر پر نمازِ جمعہ واجب نہیں ہے ، (ہدایہ،جلد1،ص:377)‘‘۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اَلْقَرَوِیُّ إذَا دَخَلَ الْمِصْرَ یَوْمَہَا وَ نَوٰی اَنْ یَمْکُثَ یَوْمَ الْجُمُعَۃ لَزِمتْہُ الْجُمُعَۃُ،لِاَنَّہٗ صَارَ کَوَاحِدٍ مِّنْ أَہْلِ الْمِصْرِ فِی حَقِّ ہٰذَا الْیَوْمِ وَإِنْ نَوٰی أنْ یَّخْرُجَ فِیْ یَوْمِہٖ ذٰلِکَ قَبْلَ دُخُوْلِ الْوَقْتِ أَوْ بَعْدَالدُّخُوْلِ لَاجُمُعَۃَ عَلَیْہِ  وَلَوْ صَلّٰی مَعَ ذٰلِکَ کَانَ مَاجُوْرًا،کَذَا فِیْ’’فَتَاوٰی قَاضِیْ خَان‘‘وَ’’التَّجْنِیْسِ‘‘ وَ’’الْمُحِیْط]]‘‘۔
ترجمہ:’’ گاؤں کا رہنے والا شہر میں آیا اور جمعہ کے دن یہیں ٹھہرنے کا ارادہ ہے ،تواس پر`
  },
  {
    pageNumber: 203,
    text: `جمعہ فرض ہے،اس لیے کہ وہ اُس دن کے اعتبار سے وہ اہل شہر میں سے ہوگیا اوراگر اسی دن جمعے کاوقت داخل ہونے سے پہلے واپسی کا ارادہ ہو ،(یعنی زوال سے پہلے یا زوال کے بعد)تواس پر جمعہ فرض نہیں ہے ،لیکن اگر پڑھے گا تو ثواب پائے گا ، ’’فتاویٰ قاضی خان ، تجنیس اور محیط ‘‘ میں اسی طرح ہے ،(فتاویٰ عالمگیری ،جلد1،ص:145)‘‘۔
	مسافر کے لیے شہر میں ہوتے ہوئے جمعہ کی نماز ادا کرنا افضل ہے ،جماعت کے ساتھ شامل ہوکر پوری نماز اداکرے اور اگر فوری سفر درپیش نہ ہو تو پہلے اور بعد کی سنتیں بھی پڑھ لے، تاہم اگر وہ جمعہ کی نماز کے لیے حاضر نہ ہو اور اپنی قیام گاہ میں ظہر کی نماز قصر(دو رکعات) ادا کرلے تو شرعاًاسے اس کی اجازت ہے۔ قصر کا حکم صرف ظہر، عصر اور عشاء کی فرض نمازوں میں ہے، ان کے علاوہ بقیہ نمازوں میں قصر نہیں ہے، مسافر پر جمعہ واجب نہ ہونے کے باوجود اگر اس نے اداکرلیاتو نمازِ ظہر اس سے ساقط ہوجائے گی ۔

[[heading: قصر نماز کا مسئلہ]] 
سوال:
	 عبداللہ اپنی بیوی کے ساتھ برطانیہ منتقل ہوگیا ،بچے وہیں پیداہوئے ۔اس دوران عبداللہ پاکستان اپنے والدین سے ملنے آتارہا ،اب عبداللہ والدین کے انتقال کے بعد پاکستان منتقل ہوگیاہے ۔عبداللہ کے بیٹے جن کی پیدائش برطانیہ میں ہوئی ،جب پاکستان اپنے والد کے پاس آئیں گے تو نماز پوری پڑھیں گے یا قصر؟،(محمد کمال الدین ، گجرات)۔
جواب:
	ایسا بالغ شخص جس کے والدین کسی دوسرے شہر میں رہتے ہیں اور وہ شہر اُس شخص کی جائے پیدائش نہیں اورنہ ہی اس کے بیوی بچے وہاں ہوں ،  تو وہ اس کے لیے وطن اصلی نہیں ہوگا،لہٰذاوہاں اگر پندرہ دن سے کم قیام کا رادہ ہوتو نماز قصر کرے گا ۔
علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: فَلَوْ کَانَ لَہٗ أَبَوَانِ بِبَلَدٍ غَیْرِ مَوْلِدِہٖ وَہُوَ بَالِغٌ وَلَمْ یَتَاَہَّلْ بِہٖ فَلَیْسَ ذٰلِکَ وَطَنًا لَہٗ إلَّا]]`
  },
  {
    pageNumber: 204,
    text: `[[arabic: إذَا عَزَمَ عَلَی الْقَرَارِ فِیْہِ وَتَرَکَ الْوَطَنَ الَّذِیْ کَانَ لَہٗ قَبْلَہٗ ’’شَرْحُ الْمُنْیَۃِ‘‘]]۔
ترجمہ:’’ اگر اس کے والدین ایسے شہر میں ہوں ،جہاں اس کی پیدائش نہیں ہوئی اوروہ بالغ ہے اور اس کی وہاں شادی نہیں ہوئی تو وہ اس کا وطن ِ اصلی نہیں ہوگا ،مگر جب وہ اس میں سکونت اختیار کرلے اور اس وطن کو ترک کرنے کا عزم کرے جہاں وہ پہلے رہائش پذیر تھا ، بحوالہ : ’’شرح المنیہ‘‘،(حاشیہ ابن عابدین شامی ، جلد4،ص:648، دمشق )‘‘۔
	صورتِ مسئولہ میں عبداللہ کے بیٹے پاکستان میں پندرہ دن سے کم ٹھہرتے ہیں تو نماز قصرکریں گے اورامام کے ساتھ باجماعت نماز اداکرنے کی صورت میں نمازمکمل پڑھیں گے ۔`
  },

{
  pageNumber: 205,
  text: `[[heading: مساجدکے مسائل]]`
},

  {
    pageNumber: 207,
    text: `[[heading: امام مسجد کا مشاہرہ اور دیگر مصارف]]
سوال:
امریکہ اور یو۔کے میں ہرملازم کو ٹیکس دینا پڑتا ہے ،یہاں مساجد میں امامت وخطابت کے لیے بیرون ملک سے علماء بلائے جاتے ہیں ، ان کے لیگل ویزا لگنے میں وقت اور اخراجات کافی لگتے ہیں ۔معلوم یہ کرناہے :
1۔ اگر مسجد فنڈ سے امام کے ویزا اور لیگل کاروائی کا خرچہ دیا جائے جبکہ یہ بات پہلے سے طے ہوئی ہو تواس کا شرعی حکم کیاہے ؟۔
2۔ مسجد انتظامیہ اور امام صاحب کے درمیان یہ طے پایاکہ تنخواہ کے ساتھ جو سال بھر کا ٹیکس بنتاہے ، وہ بھی مسجد انتظامیہ اداکرے گی ،کیاایساکرنا جائز ہے ؟۔
3۔ مُتولیٔ مسجد نے کہا :ہم بھی مسجد کی بہت ڈیوٹی کرتے ہیں ، توکیاہم اپنے بل مسجد کے فنڈ سے لے لیں ؟، ان کا امام پر ایساقیاس کرنا کیساہے ،( علامہ مدثر حسین قادری ،نیویارک ، امریکہ)۔
جواب:
مساجد کے عطیات کا ایک بڑا حصہ صدقاتِ نافلہ سے ہوتاہے یا مسجد پر وقف سے حاصل ہونے والی آمدنی سے ۔مساجد کے عطیات میں یہ امرمعروف ہے کہ یہ مسجد کے مصارفِ جاریہ کے لیے ہیں ۔اُن مصارفِ جاریہ میں مسجد کی تعمیر ومرمت ،توسیع، مسجد کے یوٹیلیٹی بلز(بجلی ،گیس اورپانی وغیرہ کے) ، ضرورت کے وقت رنگ وروغن ،دریاں ،قالین ، ٹیوب لائٹس ،پنکھے ،پانی وسیوریج کا نظام ،عملے کی تنخواہ اوردیگر مصارف شامل ہوتے ہیں ۔ اگر مسجد انتظامیہ نے بیرونِ ملک سے آنے والے مسجد کے امام کے لیے شرائطِ ملازمت طے کر رکھی ہیں ،جن میں اُن کی ویزا فیس اورویزے کے حصول کے لیے قانونی کارروائی کے اخراجات وغیرہ شامل ہیں اور مسجد فنڈ میں گنجائش بھی موجود ہے اور عطیات دینے`
  },
  {
    pageNumber: 208,
    text: `والوں پر بھی یہ مقاصد واضح ہیں،توجائز ہے ۔
اگر مسجد انتظامیہ نے امام کے ساتھ اجارہ کرتے وقت امام کو اداکردہ مشاہرے پر سرکاری ٹیکس کی ادائی اپنے ذمے لی ہے ،تومسجد فنڈ سے اس کا اداکرنا جائز ہے، اس کی دو صورتیں ہوسکتی ہیں : ایک یہ کہ ٹیکس کے مساوی رقم امام کی تنخواہ میں شامل کرلی جائے اور امام خود اپنا ٹیکس اداکرے اور دوسری یہ کہ مسجد انتظامیہ براہ راست خود ٹیکس اداکرے،جیساکہ بعض کمپنیوں میں مجموعی تنخواہ(Gross Salary)اور اداکردہ تنخواہ (Taken Home Salary) میں فرق ہوتاہے ،بہت سے ادارے اپنے ملازمین کے مشاہروں سے ٹیکس وضع کر کے اسے حکومت کے خزانے میں جمع کراتے ہیں ۔ انتظامیہ اپنے صوابدیدی اختیارات سے اضافہ کرسکتی ہے ،تنویرالابصار مع الدرالمختار میں ہے :
’’[[arabic: تَجُوْزُ الزِّیَادَۃُ مِنَ الْقَاضِیْ عَلٰی مَعْلُوْمِ الْإِمَامِ إذَا کَانَ لَا یَکْفِیْہِ وَکَانَ عَالِمًا تَقِیًّا]]‘‘۔
ترجمہ:’’ وقف سے امام کی جو تنخواہ مقرر ہے ،اگر وہ ناکافی ہے اور امام مُتقی عالم ہے ، تو قاضی اس میں اضافہ کرسکتا ہے ، (جلد13، ص:659،دمشق ) ‘‘۔
صدرالشریعہ علامہ امجدعلی اعظمی رحمۃ اللہ علیہ لکھتے ہیں: 
’’ اوقاف سے جو ماہوار وظائف مقررہوتے ہیں ،یہ من وجہ اُجرت ہے اور من وجہ صلہ،اُجرت تویوں ہے کہ امام وموذن کی اگر اثنائے سال میں وفات ہوجائے توجتنے دن کام کیاہے ،اُس کی تنخواہ ملے گی اورمحض صلہ ہوتاتو نہ ملتی اور اگر پیشگی تنخواہ ان کو دی جاچکی ہے ، بعدمیں انتقال ہوگیا یا معزول کردیے گئے توجو کچھ پہلے دے چکے ہیں ،وہ واپس نہیں ہوگا اور محض اُجرت ہوتی توواپس ہوتی ،(بہارِ شریعت ، جلداول ، ص:545)‘‘۔
مُتولی نے اگر اپنی ذاتی آمدنی سے وقف قائم کیاہے اور اس کی آمدنی کے ذرائع بھی اسی نے قائم کیے ہیں اور وقف کرتے وقت یہ شرط لگائی تھی کہ وہ اپنے مصارف (جو بھی اس نے طے کیے ہوں) وقف کی آمدنی سے وصول کرے گا تو وہ ایسا کرسکتاہے، البتہ اگر عوام کے چندے اور عطیات سے مسجد کے مصارف چلتے ہیں تواُن سے اِس کی عمومی اجازت لینا`
  },
  {
    pageNumber: 209,
    text: `ضروری ہے، ورنہ جائز نہیں ہے ۔ وقف کرنے والے کو شریعت نے یہ حق دیا ہے کہ وہ مصارفِ وقف کا تعیّن کرے اور اس سلسلے میں اسلامی فقہ کا مسلّمہ اصول ہے:’’ [[arabic: شَرْطُ الْوَاقِفِ کنَصِّ الشَّارِعِ]]‘‘،’’یعنی واقف کی مقررہ شرائط شارع  کی نَصّ کی طرح شرعاً مؤثر ہوتی ہیں،( ردالمحتار علی الدرالمختار، جلد13،ص:651، دمشق)‘‘۔   

[[heading: مسجد کے سامان کا حکم]] 
سوال:
مسجد کے پنکھے ،چٹائیاں ،ٹوپیاں وغیرہ کسی دوسری جگہ لے جاکر استعمال کرنا کیساہے ، اگرچہ پھر لا کر واپس رکھ دی جائیں ؟۔جوچیز مسجد میں دے دی جائے ،تویہ وقف ہے ، وقف کا کیاحکم ہے ؟،(سجادعلی ،کراچی)۔			
جواب:
’’وَقْف لِلّٰہ‘‘ کے شرعی معنیٰ ہیں: کسی چیز کو اپنی مِلک سے نکال کر اللہ تعالیٰ کی مِلک کردینا،مساجد اور اوقاف کی ہر شے انسانوں کی ملکیت سے نکل کرخالص اللہ تعالیٰ کی ملکیت ہوجاتی ہے اور جب وقف ہوتاہے تو وقف کرنے والا اپنی ملکیت سے نکال کر رضائے الٰہی کے لیے مصارفِ متعینہ میں صرف کرنے کے لیے اللہ کے سپر کردیتاہے،تو پھر وقف کی کسی چیز کو کوئی شخص اپنے ذاتی استعمال میں نہیں لاسکتا اور متولی یا کمیٹی کو بھی یہ اختیار نہیں ہے کہ وہ وقف کی کسی چیز کو اپنے ذاتی کام میں استعمال کریں یا کسی کو استعمال کرنے کی اجازت دیں ،علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: مُتَوَلِّی الْمَسْجِدِ لَیْسَ لَہٗ اَنْ یَّحْمِلَ سِرَاجَ الْمَسْجِدِ اِلٰی بَیْتِہٖ ]]‘‘۔
ترجمہ:’’  مسجد کے متولی کے لیے جائز نہیں ہے کہ وہ مسجد کا چراغ اپنے گھر لے جائے ، (فتاویٰ عالمگیری ، جلد1،ص:462)‘‘۔لہٰذا کسی کویہ حق نہیں ہے کہ مُتولی کی اجازت سے یااس کی اجازت کے بغیر مسجد کی اشیاء پنکھے ،چٹائیاں وغیرہ اپنے گھر لے کر جائے اور اپنے ذاتی استعمال میں لائے ،مسجد کی انتظامیہ کو مسجد کے سامان کی نگرانی کرنی چاہیے ۔`
  },
  {
    pageNumber: 210,
    text: `[[heading: مسجد میں محرابی دیوار پر شیشے لگانا]] 
سوال: 
ہماری مسجد میں سامنے کی جانب جو کھڑکیاںہیں ،اُن کے شیشے میں انتہائی واضح عکس نظر آتا ہے ،جیسے آئینہ کے سامنے کھڑے ہوں ۔ اکثر نمازیوں کا کہنا ہے کہ عکس کی وجہ سے ہماری نماز نہیں ہوتی ،شرعی حکم بیان فرمائیں ،(ڈاکٹر طارق چغتائی ،صدر :جامع مسجد غفران،  راچی)۔
جواب:	
نمازی کے سامنے شیشے کے دروازے یا کھڑکیاں ہوں تو نماز تو ہوجائے گی، البتہ اگر شیشے کی وجہ سے نمازی کی نماز میں خلل ہوتا ہو اور نمازی کی توجہ اس جانب جاتی ہو،تو نماز مکروہِ تنزیہی ہوگی یعنی نماز دہرانے کی ضرورت نہیں،ان شیشوں میں جو عکس نظر آتا ہے ، اس کا حکم تصویر کا نہیں ہے۔
ہمارے فقہائے کرام نے قبلہ کی جانب دیوار اور محراب میں نقش ونگار کو مکروہ فرمایا ، سبب یہ ہے کہ نمازی کا دھیان بٹے گا ، علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَکَرِہَ بَعْضُ مَشَایِخِنَا النَّقْشَ عَلَی الْمِحْرَابِ وَحَائِطِ الْقِبْلَۃِ لِاَنَّ ذٰلِکَ یَشْغَلُ قَلْبَ الْمُصَلِّی ]]‘‘۔
ترجمہ:’’ ہمارے بعض مشایخ نے محراب اور قبلہ کی جانب دیوار پر نقش کو مکروہ جانا ہے کیونکہ یہ نمازی کے دل کوغافل کرتاہے ،(فتاویٰ عالمگیری ، جلد5، ص:319)‘‘۔
تنویرالابصار مع الدرالمختار میں ہے : 
’’[[arabic: وَلَابَاْسَ بِنَقْشِہٖ خَلَا مِحْرَابِہٖ فَإِنَّہٗ یُکْرَہُ لِاَنَّہٗ یُلْہِی الْمُصَلِّی.وَیُکْرَہُ التَّکَلُّفُ بِدَقَائِقِ النُّقُوْشِ وَنَحْوِہَا خُصُوْصًا فِی جِدَارِ الْقِبْلَۃِ قَالَہُ الْحَلَبِیُّ.وَفِی حَظْرِ الْمُجْتَبٰی وَقِیْلَ: یُکْرَہُ فِی الْمِحْرَابِ دُوْنَ السَّقْفِ وَالْمُؤَخَّرِ انْتَہٰی. وَظَاہِرُہٗ أَنَّ الْمُرَادَ بِالْمِحْرَابِ جِدَارُ الْقِبْلَۃِ فَلْیَحْفَظْ]]‘‘۔`
  },
  {
    pageNumber: 211,
    text: `ترجمہ:’’ اور محراب کے علاوہ مسجد میں نقش ونگار بنانے میں کوئی حرج نہیں ہے ،محراب میں نقش ونگار بنانا مکروہ ہے کیونکہ یہ نمازی کو غافل کردیتے ہیں اور باریک بینی پر مشتمل نقش ونگار کا اہتمام کرنا مکروہ ہے ،خصوصاً قبلہ کی دیوار میں ایساکرنا مکروہ ہے ،یہ ’’حلبی‘‘ کا قول ہے ۔’’المجتبیٰ‘‘ کے باب الحظرمیں ہے: ایک قول یہ کیاگیا ہے :محراب میں ایسا کرنا مکروہ ہے ،چھت اور پچھلی دیوارپر ایساکرنا مکروہ نہیں ،اس کا ظاہر معنی یہ ہے کہ محراب سے مراد قبلہ کی دیوار ہے ،پس اسے یادرکھا جانا چاہیے ،(حاشیہ ابن عابدین شامی ،جلد4، ص: 202-203،دمشق)‘‘۔ 
صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ سے سوال ہوا: ’’جس مکان میں آیئنے قد آدم چار طرف لگے ہوں ،اُس مکان میں نماز ہوجائے گی یا نہیں؟‘‘ ، آپ نے جواب میں لکھا:’’ آئینہ سامنے ہو تو نماز میں کراہت نہیں کہ سببِ کراہت تصویر ہے اوروہ یہاں موجود نہیں اور اگر اسے تصویر کاحکم دیں تو آئینہ کارکھنا بھی مثل تصویر ناجائز ہوجائے، حالانکہ بالاجماع جائز ہے اور حقیقت امر یہ ہے کہ وہاں تصویر ہوتی ہی نہیں بلکہ خطوط شعاعی آئینہ کی صقالت(شفافیت) کی وجہ سے لوٹ کر چہرہ پر آتے ہیں ،گویا یہ شخص خود اپنے کو دیکھتاہے نہ یہ کہ آئینہ میں اس کی صورت چھپتی ہو،(فتاویٰ امجدیہ ،ج:1، ص:184) ‘‘ ۔
مفتی وقارالدین رحمۃ اللہ علیہ سے سوال کیاگیا:’’ اگر محراب کے اندر شیشے جڑے ہوں اور محراب کی دیوار پر نمازیوں کی تصویر دکھائی دیتی ہو ں ، توکیا ایسی صورت میں نماز ہوجاتی ہے یانہیں؟‘‘، آپ نے جواب میں لکھا:’’ محراب یاقبلہ کی جانب دیوار میں شیشے اتنی اونچائی پر لگائے جاسکتے ہیں کہ خاشعین (عاجزی کے ساتھ نماز پڑھنے والے) کی نظر رکوع سے اٹھتے اور سجدے میں جاتے وقت ،ان پر نہ پڑے اوراگر نیچے لگادیے ہیں تویہ لگانا ناجائز ہے اور اس وجہ سے نماز میں کراہت ِ تنزیہی ہوتی ہے کہ ان پر نظر پڑنے کی وجہ سے خشوع میں فرق آئے گا۔ لیکن آئینہ میں آنے والے عکس کا حکم تصویر کا نہیں ہے ، (وقارالفتاویٰ ، ج:2،ص:73)‘‘۔
مزید ایک سوال ہوا:’’ مسجد کے برآمدے میں دروازوں پر شیشے لگے ہوئے ہیں ،اس میں`
  },
  {
    pageNumber: 212,
    text: `مقتدی اور بعض اوقات امام کی بھی پوری تصویر نظر آتی ہے ،اس صورت میں نمازپڑھنا کیساہے اور اگر نماز پڑھی جائے توکیا اسے لوٹانا ضروری ہے یانہیں؟‘‘،آپ نے جواب میں لکھا: ’’ نمازیوں کے آگے اتنی اونچائی تک کہ خاشعین کی طرح نماز پڑھنے میں جہاں تک نظر آجاتاہے ،شیشے لگانا یاکوئی ایسی چیز لگانا جس سے نمازی کا دھیان اور التفات ادھر جاتاہو ،مکروہ ہے۔لہٰذا اتنی اونچائی تک کے شیشے ہٹالینا چاہئیں،ان شیشوں میں اپنی شکل جونظر آتی ہے ،اس کے احکام تصویر کے نہیں ،لہٰذا نماز مکروہ تحریمی نہ ہوگی مگر مکروہ تنزیہی ہے،(وقارالفتاویٰ ، ج:2 ،ص:258)‘‘۔لیکن اگر کوئی خشوع وخضوع کے ساتھ نماز پڑھ رہاہے اور اس کی نظر حالتِ قیام میں مقامِ سجدہ ،حالتِ رکوع میں اپنے قدموں اور حالتِ قعدہ میں اپنی گود پر مرکوز ہوتو اس کے لیے کوئی مسئلہ نہیں رہے گا ،ہماری کُتبِ فقہ میں آدابِ نماز یہی بتائے گئے ہیں ۔

[[heading: سرد علاقوں کی مساجد میں نمازیوں کے سامنے گیس ہیٹر کا جواز]] 
سوال:
ہمارے علاقے میں سردی شدید ہوتی ہے ،برف باری بھی ہوتی ہے ،پہلے لوگ مسجد کو گرم رکھنے کے لیے انگیٹھی میں لکڑیاں جلاتے تھے ، اب گیس آگئی ہے تو گیس کے ہیٹر جلاتے ہیں ،جو قبلے کی جانب والی دیوار میں نمازیوں کے سامنے  لٹکا کر یا زمین پر رکھے جاتے ہیں اور نمازی اس جانب سجدہ کرتے ہیں ،کیا آتش پرستوں سے مشابہت کی بناپر اس کی ممانعت ہوگی یاایساکرنا جائز ہے اور اس میں کوئی حرج نہیں ہے، (محمد علی ،ایبٹ آباد) ۔
جواب :
مجوسی عبادت کے وقت آگ کو تنور یا آتشدان (کانون)میں سامنے رکھتے ہیں ،جسے ہماری کُتب فقہ وفتاویٰ میں ’’کانون‘‘ سے تعبیرکیاگیا ہے، گیس /بجلی کے ہیٹر سامنے رکھ کر یا دیوار پر لٹکا کر نماز پڑھنے میں مجوسیوں کے ساتھ مشابہت نہیں ہے ۔ اگرنمازی کے سامنے آگ جل رہی ہو تب بھی نماز ہو جائے گی، فقط کراہت ہے،لیکن جہاں سردی ناقابل`
  },
  {
    pageNumber: 213,
    text: `برداشت ہو ،بالخصوص ضعیف اور معمر نمازیوں کے لیے وہاں بربنائے ضرورت کراہت مرتفع ہوجائے گی ۔ لیکن مخصوص طریقے سے انتظام کیا گیا ہو تو مکروہ نہیں ہے، مثلاً : ہیٹر وغیرہ۔
 علامہ نظا م الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنْ تَوَجَّہَ فِیْ صَلَاتِہٖ إِلٰی تَنُّوْرٍفِیْہِ نَارٌتَتَوَقَّدُأَوْکَانُوْنٍ فِیْہِ نَارٌیُکْرَہُ وَلَوْتَوَجَّہَ إِلٰی قِنْدِیْلٍ أَوْ إِلٰی سِرَاجٍ لَمْ یُکْرَہْ.کَذَا فِی مُحِیْطِ السَّرَخْسِیِّ ،وَہُوَ الأَصَحُّ کَذَافِی خِزَانَۃِ الفَتَاویٰ ]]‘‘۔
ترجمہ:’’اور جس شخص نے نماز کے دوران تندور کی طرف رُخ کیا، جس میں آگ بھڑک  رہی تھی یا آتشدان کی طرف رخ کیا جس میں آگ تھی، تو یہ مکروہ ہے اور اگر قندیل یا چراغ کی طرف رُخ کیا، تو کراہت نہیں ہے ،جیساکہ ’’محیط السرخسی‘‘ میں ہے ،یہی قول زیادہ صحیح ہے ، (فتاویٰ عالمگیری ،جلد1، ص:108)‘‘۔
ہمارے فقہائے کرام نے اس کی بابت یہ ضابطہ بیان کیا ہے کہ آگ کے سامنے نماز پڑھناصرف اس صورت میں مکروہ ہے ، جب آگ اس انداز سے نمازی کے سامنے رکھی ہو جس انداز سے مجوسی لوگ اس کی عبادت کرتے ہوئے اپنے سامنے رکھتے ہیں اور اگر آگ نماز ی کے سامنے مجوسیوں کے عبادت کے انداز سے رکھی ہوئی نہ ہو تو نماز مکروہ نہیں ہوگی۔پس اگر آگ نمازی کے سامنے تنور یا آتشدان میں اس طرح رکھی ہو، جیسے مجوسی رکھتے ہیں تو نماز مکروہ ہوگی ورنہ نہیں ۔لہٰذا مساجد یا گھروں میں سرد ی کی وجہ سے ہیٹر سامنے لگا کر نماز پڑھنا مکروہ نہیں ہے ، تاہم بہتر یہ ہے کہ ہیٹر کو سامنے رکھنے کے بجائے دائیں بائیں رکھ لیا جائے ،یا سامنے کی دیوار میں ذرا اونچی جگہ پر نصب کر لیا جائے تاکہ اس میں کسی قسم کی کراہت کا شائبہ نہ رہے، اس صورت میں ہیٹر کا رُخ حسبِ ضرورت نیچے کی طرف رکھاجاسکتا ہے ۔
علامہ زین الدین ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: قَوْلُہٗ أَوْشَمْعٍ أَوْ سِرَاجٍ:لِأَنَّہُمَا لَا یُعْبَدَانِ وَالْکَرَاہَۃُ بِاعْتِبَارِہَا وَإِنَّمَا یَعْبُدُہَا الْمَجُوسُ]]`
  },
  {
    pageNumber: 214,
    text: `[[arabic: إذَا کَانَتْ فِی الْکَانُوْنِ وَفِیْہَا الْجَمْرُ أَوْ فِی التَّنُّوْرِ فَلَا یُکْرَہُ التَّوَجُّہُ إلَیْہَا عَلٰی غَیْرِ ہٰذَا الْوَجْہِ وَذُکِرَ فِیْ غَایَۃِ الْبَیَانِ اخْتِلَافُ الْمَشَایِخِ فِی التَّوَجُّہِ إلَی الشَّمْعِ أَوْ السِّرَاجِ وَالْمُخْتَارُ أَنَّہٗ لَا یُکْرَہُ وَیَنْبَغِیْ أَنْ یَکُوْنَ عَدَمُ الْکَرَاہَۃِ مُتَّفَقًا عَلَیْہِ فِیمَا إذَا کَانَ الشَّمْعُ عَلٰی جَانِبَیْہِ کَمَاہُوَالْمُعْتَادُ فِیْ مِصْرَ الْمَحْرُوسَۃِ فِیْ لَیَالِیْ رَمَضَانَ لِلتَّرَاوِیْحِ]]‘‘۔
ترجمہ:’’علامہ ابوالبرکات احمد بن محمود نسفی کایہ قول: ’’اگرنمازی کے سامنے شمع یا چراغ رکھا ہوتو نماز جائز ہے ‘‘،کیونکہ یہ عبادت کی نیت سے نہیں رکھے ہوتے اور کراہت کاحکم اس پر محمول ہے کہ عبادت کی نیت سے رکھے ہوں اور آگ کی عبادت مجوس (آتش پرست ) کانون (آتش دان )میں رکھ کر کرتے ہیںاور اس میں چنگاری ہوتی ہے یا تنور میں رکھاجاتاہے ،لہٰذا اس سے ہٹ کر کسی طریقے سے رکھاجائے تو اس میں بالاتفاق کراہت نہیں ہے، جبکہ شمع اطراف میں ہو جیساکہ رمضان کی راتوں میں مصر میں رکھنے کی عادت ہے ، (البحرالرائق ، جلد2، ص:56)‘‘ ۔علامہ عثمان بن علی زیلعی نے تبیین الحقائق ، جلد1، ص: 167 میں مِنْ وعَنْ یہی مسئلہ لکھاہے ۔ 
 تاہم اگر اس میں کراہت ہونے کو تسلیم بھی کر لیا جائے تو بھی سردی کے موسم میں ضرورت کی بنا پر اس کی گنجائش ہے،جیسا کہ  فقہائے کرام نے نمازمیں چہرہ چھپانے کو مجوسیوں سے مشابہت کی وجہ سے مکروہ بتایا ہے اور بوقتِ ضرورت اس کی اباحت کی گنجائش رکھی ہے ۔
علامہ علاء الدین کاسانی حنفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وَیُکْرَہٗ أَنْ یُغَطِّیَ فَاہُ فِی الصَّلَاۃِ، لِاَنَّ النَّبِیَّ ﷺ نَہٰی عَنْ ذٰلِکَ،وَلِاَنَّ فِی التَّغْطِیَۃِ مَنْعًا مِنَ الْقِرَاءَ ۃِ وَالْاَذْکَارِ الْمَشْرُوْعَۃِ،وَلِاَنَّہٗ لَوْ غَطّٰی بِیَدِہٖ فَقَدْ تَرَکَ سُنَّۃَ الْیَدِ،وَقَدْ قَالَ ﷺ:کُفُّوْا أَیْدِیَکُمْ فِی الصَّلَاۃِوَلَوْ غَطَّاہٗ بِثَوْبٍ فَقَدْ تَشَبَّہَ بِالْمَجُوْسِ، لِأَنَّہُمْ یَتَلَثَّمُوْنَ فِیْ عِبَادَتِہِمُ النَّارَ وَالنَّبِیُّ ﷺنَہٰی عَنِ التَّلَثُّمِ فِی الصَّلَاۃِ إلَّا إذَا کَانَتِ]]`
  },
  {
    pageNumber: 215,
    text: `[[arabic: التَّغْطِیَۃُ لِدَفْعِ التَّثَاؤُبِ فَلَا بَاْسَ بِہٖ لِمَا مَرَّ]]‘‘۔
ترجمہ:’’اورنماز میں منہ کا ڈھانپنا مکروہ ہے ،کیونکہ نبی صلی اللہ علیہ وسلم نے اس سے منع فرمایا ہے اور اس لیے کہ منہ ڈھانپنے میں قراء ت اور اَذکارِ مشروعہ پڑھنے میں رکاوٹ پیداہوتی ہے اور اس لیے کہ اگر اپنے ہاتھ سے منہ ڈھانپے گا توہاتھ باندھنے کی سنّت ترک ہوگی اور نبی صلی اللہ علیہ وسلم نے فرمایا: ’’اپنے ہاتھوں کو نمازمیں روکو اور اگر کپڑے سے ڈھانپے گا تویہ مجوس سے مشابہ ہے ،کیونکہ وہ آگ کی عبادت کرتے وقت منہ کو لپیٹتے ہیں اور نبی صلی اللہ علیہ وسلم نے نمازمیں منہ لپیٹنے سے منع فرمایاہے، سوائے اس کے کہ جمائی روکنے کے لیے منہ کو ڈھانپا جائے ،تو اس میں کوئی حرج نہیں ،جیساکہ گزرا،(بدائع الصنائع ،جلد 1،ص:320)‘‘۔
سوئی گیس کے ہیٹر استعمال کرنے میں یہ احتیاط بھی برتی جائے کہ ہیٹر آن کرنے سے پہلے ہی اگر آگ گیس کی نوزل کے قریب رکھی جائے، تو گیس کی بو نہیں پھیلے گی ۔

[[heading: خُدّام مسجد کے لیے چندہ]] 
سوال:
ہماری مسجد کے امام وخطیب بارہ سال سے امامت فرمارہے ہیں ،موجودہ مسجدکمیٹی چار سال پہلے منتخب ہوئی ۔امام صاحب عیدین کی نمازوں میں مسجد کی صفوں میں بطور عیدی یا مسجد کے خادمین کو عمرہ کرانے کے لیے رقم جمع کرتے ہیں ،جبکہ خادمین صاحبِ حیثیت ہیں، اُن کا یہ رقم جمع کرنا کیساہے اور جمع شدہ رقم کا مصرف کیا ہے ؟،نیز مسجد کمیٹی کے اراکین بھی خادمین میں شامل ہیں یا نہیں ؟،(جنرل سیکریٹری جامع مسجد خضریٰ ، نیوکراچی )۔
 جواب:
ہمارے ہاںبعض اداروں میں رمضان المبارک اور عید کے موقع پر ملازمین کو بونس یعنی ایک اضافی تنخواہ دینے کا رواج ہے اور بعض مساجد کے منتظمین بھی اپنے عملے کو رمضان وعید کے موقع پر بونس دیتے ہیںاور یہ اچھی بات ہے ،شاید اسی کے پیشِ نظر بعض مساجد میں`
  },
  {
    pageNumber: 216,
    text: `خادمین یا عملے کے لیے الگ سے چندہ کرنے کا رواج رہاہے ،اس لیے اسے اُس سوال پر محمول نہیں کیاجاسکتا ، جس کی احادیثِ مبارکہ میں ممانعت آئی ہے ، کیونکہ اس کا مصداق وہ لوگ ہیں،جو اپنے آپ کو فقیر ومسکین اور مفلس ظاہر کرکے سوال کرتے ہیں ،بعض اپنی ہیئت کذائی (وضع قطع) ایسی بناتے ہیں کہ لوگوں کو ان پر ترس آئے اوروہ انہیں کچھ نہ کچھ دیدیں، ان میں سے بعض حقیقی مستحقین بھی ہوسکتے ہیں اور بعض پیشہ ور مانگنے والے ہوتے ہیں۔تاہم نہ مسجد کے عملے کے لیے جمع کیے جانے والے چندے پراس کا اطلاق ہوتا ہے ، نہ عملے کے لوگ مفلسانہ وضع اختیار کرکے سوال کرتے ہیں ،بلکہ وہ اسے ایک طرح سے ملازمت سے حاصل مالی سہولت کا ایک حصہ سمجھتے ہیں۔ ہمارے ہاں مساجد میں عملے کی تنخواہیں بالعموم عوام کے چندے سے ہی پوری کی جاتی ہیں اوریہی عرف ہے ،پس بہتریہ ہے کہ مسجد کے عمومی فنڈ سے ہی مسجد کے عملے کو بونس دیاجائے، الگ سے مسجد کے عملے کے لیے جھولی پھیلانا باوقار طریقہ نہیں ہے۔ہمارے ہاں خیراتی اسپتالوں میںڈاکٹر صاحبان سمیت تمام عملے ( یعنی میڈیکل وپیرا میڈیکل اسٹاف) کو تنخواہیں عوام کے عطیات کی رقم ہی سے دی جاتی ہیں،یہ تاثر درست نہیں کہ ایک شعبے میں ہم ایک شِعار کو درست اور دوسرے شعبے میں نادرست سمجھیں ۔
مسجد کی انتظامی کمیٹی ،خواہ انجمن ہو یا ٹرسٹ ہو، مسجد کی مُتولی ہوتی ہے او ر چندہ دینے والوں کی امین ہوتی ہے ،اس لیے اُس کے ارکان کو مسجد کا چندہ اپنے اوپر استعمال کرنے کی اجازت نہیں ہے ۔ہاں !اگرکسی نے خود مسجد کے لیے زمین وقف کی ہو اور اس میں آمدنی کا کوئی مستقل ذریعہ بھی قائم کیا ہو اور وقف کرتے وقت قراردیاہو کہ وہ خود مُتولی ہوگا ،مسجد کی انتظامی خدمت بجالائے گا اور مسجد کی آمدنی سے معروف طریقے سے اپنی ضروریات کے لیے بھی لے گا ،تویہ جائز ہے ،لیکن ایسی صورتیں ہمارے ہاں کمیاب بلکہ نایاب ہیں۔عمرے کے نام پر جھولی پھیلا کر چندہ جمع کرنا درست نہیں ہے ، وقار اور عزتِ نفس کے بھی خلاف ہے۔عمرہ صاحبِ استطاعت کے لیے سنت ہے ،اگرکوئی شخص مسجد کے امام یا مؤذن یا خادم کو عمرے پر بھیجنا چاہتاہے ، تو وہ کسی تشہیر کے بغیر ایساکرے ، تشہیر میں ریا کا شائبہ`
  },
  {
    pageNumber: 217,
    text: `ہوتاہے ۔اب ہمارے ہاں تَنزُّل کاعالم یہ ہے کہ سیاست دان اور حکمران بیت اللہ شریف اور روضۂ رسول پر حاضری کی تشہیر ضروری سمجھتے ہیں ،اس کی فلمیں بناکر میڈیا پر دکھائی جاتی ہیں اور بعض مذہبی رہنما بھی ایساہی کرتے ہیں،کاش کہ ایسانہ ہوتا ۔

[[heading: مسجد میں مانگنے کا رواج]] 
سوال:
عموماً نمازِ جمعہ کے اجتماعات میں فرض نماز کا سلام پھیرتے ہی بعض لوگ مختلف صفوں میں بیک وقت کھڑے ہوجاتے ہیں اور روتے گڑگڑاتے ہوئے انتہائی دلسوز آوازمیں سوال کرتے ہیں ،سلام پھیرتے ہی اچانک یہ آوازیں کسی اُفتاد سے کم محسوس نہیں ہوتیں، اس سے نماز ودعا میں لوگوں کی ذہنی حضوری اور یکسوئی میں خلل واقع ہوتاہے ۔کیایہ طرزعمل جائز ہے اور ایسے گداگروں کو دینا کیساہے ؟،(محمد جہانگیر عالم ، سائٹ سپرہائی وے ، انڈسٹریل ایریا، کراچی)۔
جواب:
شریعتِ مطہرہ میں بلاضرورت سوال کرنے کو حرام قرار دیاگیاہے،حدیث پاک میں ہے :
(۱)حضرت قَبیصہ رضی اللہ عنہ بیان کرتے ہیں:رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:
’’ [[arabic: یَا قَبِیْصَۃُ!إِنَّ الْمَسْاَلَۃَ لَا تَحِلُّ إِلَّا لِاَحَدِ ثَلَاثَۃٍ:رَجُلٌ تَحَمَّلَ حَمَالَۃً،فَحَلَّتْ لَہُ الْمَسْاَلَۃُ حَتّٰی یُصِیْبَہَا، ثُمَّ یُمْسِکُ،وَرَجُلٌ أَصَابَتْہُ جَائِحَۃٌ اجْتَاحَتْ مَالَہٗ،فَحَلَّتْ لَہُ الْمَسْاَلَۃُ حَتّٰی یُصِیْبَ قِوَامًا مِنْ عَیْشٍ أَوْ قَالَ سِدَادًا مِنْ عَیْشٍ وَرَجُلٌ أَصَابَتْہُ فَاقَۃٌ حَتّٰی یَقُوْمَ ثَلَاثَۃٌ مِنْ ذَوِی الْحِجَامِنْ قَوْمِہٖ:لَقَدْ أَصَابَتْ فُلَانًا فَاقَۃٌ،فَحَلَّتْ لَہُ الْمَسْاَلَۃُ حَتّٰی یُصِیْبَ قِوَامًا مِنْ عَیْشٍ أَوْ قَالَ سِدَادًا مِنْ عَیْشٍ فَمَا سِوَاہُنَّ مِنَ الْمَسْاَلَۃِ یَا قَبِیْصَۃُ سُحْتًا یَاْکُلُہَا صَاحِبُہَا سُحْتًا]]‘‘۔
ترجمہ:’’ اے قبیصہ!سوال کرنا صرف تین اشخاص کے لیے جائز ہے :ایک وہ شخص جوبارِقرض تلے دبا ہواہو،اس کے لیے اتنی مقدار کا سوال کرنا جائز ہے ، جس سے اس کا قرض`
  },
  {
    pageNumber: 218,
    text: `اداہوجائے ،اس کے بعد وہ سوال سے رک جائے ، دوسرا وہ شخص جس کا تمام مال کسی آفت کی وجہ سے ضائع ہوگیا ہو،اس کے لیے اس قدر سوال کرنا جائز ہے کہ وہ گزارے کے قابل ہوجائے اور تیسرا وہ شخص جو فاقہ سے ہو اور اس کی قوم میں سے تین عقل مند آدمی یہ گواہی دیں کہ یہ فاقہ سے ہے تو اس کے لیے بھی اتنی مقدار کا سوال کرنا جائز ہے کہ اس کا گزارہ ہوجائے اور اے قَبیصہ! ان تین شخصوں کے علاوہ کسی کے لیے سوال کرنا حرام ہے  اور ایساسائل حرام کھاتا ہے ، (صحیح مسلم: 1044)‘‘۔
(۲)’’[[arabic: عَنْ حَمْزَۃَ بْنِ عَبْدِ اللّٰہِ بْنِ عُمَرَ،أَنَّہٗ سَمِعَ أَبَاہُ یَقُوْلُ:قَالَ رَسُوْلُ اللّٰہِﷺ:مَا یَزَالُ الرَّجُلُ یَسْاَلُ النَّاسَ،حَتّٰی یَاْتِیَ یَوْمَ الْقِیَامَۃِ وَلَیْسَ فِی وَجْہِہٖ مُزْعَۃُ لَحْمٍ]]‘‘۔
ترجمہ:’’حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں : نبی صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی شخص سوال کرتارہے گا حتّٰی کہ وہ اللہ تعالیٰ سے اس حال میں ملاقات کرے گا کہ اس کے چہرے پر گوشت کا ایک ٹکڑا بھی نہیں ہوگا ،(صحیح مسلم:1040)‘‘۔
(۳)نبی کریم صلی اللہ علیہ وسلم نے فرمایا:’’[[arabic: مَنْ تَکَفَّلَ لِیْ أَنْ لَّا یَسْاَلَ النَّاسَ شَیْئًاأَتَکَفَّلُ لَہٗ بِالْجَنَّۃِ]]‘‘۔
ترجمہ:’’جو مجھے اس بات کی ضمانت دے کہ وہ لوگوں سے سوال نہیں کرے گا ،میں اسے جنت کی ضمانت دیتاہوں ،(الدرالمنثور ،جلد2،ص:94)‘‘۔
مسجدکے قیام کا مقصد باجماعت نماز کو فروغ دینا اورلوگوں کو احکامِ شرعیہ بتانا ہے،اس کے علاوہ جن کاموں کی دین میں منفعت ہو ،ا ن کا مسجد میں کرنا جائز ہے۔
 علامہ ابوالحسن علی بن خلف ابن بطال مالکی لکھتے ہیں:
’’[[arabic: قَالَ الْمُہَلَّبُ:اَلْمَسْجِدُ مَوْضُوعٌ لِّاَمْرِجَمَاعَۃِ الْمُسْلِمِیْنَ، فَمَاکَانَ مِنَ الْاَعْمَالِ مِمَّا یَجْمَعُ مَنفَعَۃَ الدِّیْنِ وَاَہْلِہٖ،فَہُوَجَائِزٌ  فِی الْمَسْجِدِ]]‘‘۔
ترجمہ:’’ مہلب نے کہا: مسجد کو مسلمانوں کی نماز باجماعت کے لیے بنایاگیاہے اور جن کاموں میں دین اور اہلِ دین کا نفع ہو،اُن کا مسجد میں کرنا جائز ہے ، (شرح ابن بطال ،`
  },
  {
    pageNumber: 219,
    text: `ج:2،ص:104)‘‘۔
مسجد میں اپنی ذات کے لیے سوال کرنا حرام ہے اورایسے سائل کو دینا منع ہے ، درمختار میں ہے :’’[[arabic: وَیَحْرُمُ فِیْہِ السُّؤَالُ،وَیُکْرَہُ الْإِعْطَاءُ مُطْلَقًا]]‘‘۔
ترجمہ:’’مسجد میں سوال کرنا حرام ہے اور اس کو دینا مطلق منع ہے ،(حاشیہ ابن عابدین شامی،جلد4،ص:209،دمشق)‘‘۔
تنویر الابصار مع الدّرالمختار میں ہے :
’’[[arabic: وَلَا یَحِلُّ أَنْ یَسْاَلَ مِنَ الْقُوْتِ مَنْ لَہٗ قُوْتُ یَوْمِہٖ بِالْفِعْلِ أَوْ بِالْقُوَّۃِ کَالصَّحِیْحِ الْمُکْتَسِبِ وَیَاْثَمُ مُعْطِیْہِ إنْ عَلِمَ بِحَالِہٖ لِإِعَانَتِہٖ عَلَی الْمُحَرَّمِ وَلَوْ سَاَلَ لِلْکِسْوَۃِ أَوْ لِاشْتِغَالِہٖ عَنِ الْکَسْبِ بِالْجِہَادِ أَوْ طَلَبِ الْعِلْمِ جَازَلَوْ مُحْتَاجًا]]‘‘۔
ترجمہ:’’اس شخص کے لیے سوال کرنا جائز نہیں ہے ،جس کے پاس ایک دن کی خوراک ہویا وہ تندرست ہے اور محنت کرکے کماسکتا ہے اور اگر کوئی اس کے حال سے واقف ہے اور پھر بھی دیتاہے ،تووہ بھی گنہگار ہوگا ،کیونکہ وہ ایک ممنوع  کام پر اس کی مدد کررہاہے اور اگر اس کو کپڑے کی ضرورت ہوتو اس کاسوال کرنا جائز ہے یاایک شخص محتاج ہے، لیکن جہاد میں مشغول ہو نے یاعلمِ دین حاصل کرنے کے سبب کمانے کے لیے فارغ نہیںہے،تو اس کا سوال کرنا جائز ہے،(حاشیہ ابن عابدین شامی،جلد6،ص:124،دمشق)‘‘۔
علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: قَالَ فِی النَّہْرِ:وَالْمُخْتَارُأَنَّ السَّائِلَ إنْ کَانَ لَا یَمُرُّ بَیْنَ یَدَیِ الْمُصَلِّی وَلَا یَتَخَطّٰی الرِّقَابَ وَلَا یَسْاَلُ إلْحَافًا بَلْ لِاَمْرٍ لَا بُدَّ مِنْہُ فَلَا بَاسَ بِالسُّؤَالِ وَالْإِعْطَاءِوَمِثْلُہٗ فِی الْبَزَّازِیَّۃِ وَفِیْہَاوَلَا یَجُوْزُ الْإِعْطَاءُ إِذَا لَمْ یَکُوْنُوْا عَلٰی تِلْکَ الصِّفَۃِ الْمَذْکُوْرَۃِ.قَالَ الْإِمَامُ أَبُوْ نَصْرٍ الْعِیَاضِیُّ: أَرْجُوْ أَنْ یَغْفِرَ اللّٰہُ تَعَالٰی لِمَنْ یُخْرِجُہُمْ مِنَ الْمَسْجِدِ.وَعَنِ الْإِمَامِ خَلَفِ بْنِ أَیُّوبَ:لَوْ کُنْتُ قَاضِیًا لَمْ أَقْبَلْ شَہَادَۃَ مَنْ یَتَصَدَّقُ عَلَیْہِمْ]]‘‘۔
ترجمہ:’’’’النہرالفائق‘‘ میں ہے:مختار مذہب یہ ہے اگر سائل نمازی کے سامنے سے نہیں`
  },
  {
    pageNumber: 220,
    text: `گزرتا اور لوگوں کی گردنیں نہیں پھلانگتا اور گڑگڑا کر سوال نہیں کرتا بلکہ اس امر کے لیے سوال کرتاہے جس کے بغیر کوئی چارۂ کار نہ ہو، تواس کے سوال کرنے اوراسے دینے میں کوئی حرج نہیں،اس کی مثل ’’فتاویٰ بزازیہ‘‘ میں ہے ،لیکن جب سائل اس مذکورہ صفت پر نہ ہو تودینا جائز نہیں ،امام ابو نصرالعیاضی نے فرمایا: میں امید کرتاہوں اللہ تعالیٰ اسے بخش دے گا جو ایسے لوگوں کو مسجد سے نکالے،امام خلف بن ایوب سے مروی ہے : اگر میں قاضی ہوتا تو جوآدمی اُن پر صدقہ کرتا ہے ،میں اس کی شہادت قبول نہ کرتا ،(حاشیہ ابن عابدین شامی، جلد5،ص:91،دمشق)‘‘۔
علامہ ابن بزاز کردریرحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: اَلْمُتَصَدِّقُ عَلٰی مَسَاکِیْنَ یَأکُلُوْنَ اِسْرَافاً وَیَسْاَلُوْنَ اِلْحَافًامَاجُورٌ فِیْہِ اِلَّااِذَاعَلِمَ وَاحِداً بِعَیْنِہٖ اَنَّہٗ بِھٰذِہٖ  الصِّفَۃِ]]‘‘۔
ترجمہ:’’ جوشخص ایسے مساکین پر صدقہ کرتا ہے ،جو کھانے میں اسراف کرتے ہیں اور لوگوں سے گڑ گڑا کر مانگتے ہیں ،اسے تواجر ملے گا ،مگرجو کسی خاص گداگر کی اصل حالت کو جانتے ہوئے دیتاہے ،تو اسے اجر نہیں ملے گا ،(فتاویٰ بزازیہ علی ہامش الہندیہ ، جلد6، ص:357)‘‘۔
امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْزسے سوال ہوا:
’’جولوگ صحت مند اور جواں عمر ہیں ، مگر آرام طلب ہیں،محنت سے جی چراتے ہیں اور گداگری کو پیشہ بنالیا ہے، بعض نے چند دینی کتابیں پڑھ کر بزرگوں کا روپ دھارلیاہے ، یہ شہر شہر گھومتے ہیں ،معلومات حاصل کرکے کسی بااثر شخص کے در پر جاپہنچتے ہیں اور اسے قائل کرتے ہیں کہ لوگوں سے میری مالی مدد کرائیں ،بعض لوگ خود بھی متاثر ہوکر دیدیتے ہیں ،تو اُن کی مدد پر لوگوں کو آمادہ کرنے والے کو اس حدیث کے مصداق اجر ملے گا :’’نیکی پر رہنمائی کرنے والا اتناہی اجر پائے گا ، جتنا نیکی کرنے والے کو ملتا ہے ‘‘یا قرآن کریم کے اس فرمان : ’’اور گناہ اور حق سے تجاوز کرنے میں کسی کی مدد نہ کرو ‘‘کے مصداق گنہگار ہوگا،جبکہ ایسے بہروپیوں کی وجہ سے سوال کے اصل حق دار محروم رہ جاتے ہیں ، (ملخصاً)‘‘۔`
  },
  {
    pageNumber: 221,
    text: `آپ نے جواب میں لکھا: ’’ضرورتِ شرعی کے بغیر سوال کرنا حرام ہے اور جو لوگ کسبِ حلال کی طاقت کے باوجود (بلاضرورت) گداگری کو اپنا پیشہ بنالیتے ہیں ،اس ذریعے سے حاصل کی گئی ان کی کمائی ناپاک و خبیث ہے اورجو اُن کے حال پر مطلع ہونے کے باوجود دیتے ہیں ،یہ ناجائز وگناہ ہے اور گناہ پر مدد کرنا ہے  اور جب انھیں دینا نا جائز تو دلانے والا بھی ’’[[arabic: دَالٌّ عَلَی الْخَیْرِ ]]‘‘ نہیں بلکہ ’’[[arabic: دَالٌّ عَلَی الشَّرِّ]]‘‘ ہے۔ اس مسئلہ کی تفصیل میںنے اپنے مجموعہ فتاوٰی میں بیان کردی ہے، لیکن اگر سوال کے بغیر کوئی کسی کو کچھ دیدے جیسے لوگ علماء و مشایخ کی خدمت کرتے ہیں تو اس کے لے لینے میں کوئی حرج نہیں ،بلکہ نیت نیک ہوتو دینے اور لینے والے دونوں داخلِ ثواب ہیں، خصوصاً جبکہ لینے والا حاجت رکھتا ہو،حدیث پاک میں ہے: 
’’حضرت عمر فاروق رضی اللہ عنہ بیان کرتے ہیں: [[arabic: قَدْ کَانَ رَسُوْلُ اللّٰہِ ﷺیُعْطِیْنِیْ الْعَطَاءَ،فَاَقُوْلُ:أَعْطِہٖ أَفْقَرَ إِلَیْہِ مِنِّی،حَتّٰی أَعْطَانِی مَرَّۃً مَالًا،فَقُلْتُ:أَعْطِہٖ أَفْقَرَ إِلَیْہِ مِنِّی،فَقَالَ رَسُوْلُ اللّٰہِ ﷺخُذْہٗ،وَمَا جَاءَکَ مِنْ ہٰذَا الْمَالِ وَأَنْتَ غَیْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْہٗ،وَمَا لَا،فَلَا تُتْبِعْہٗ نَفْسَکَ]]‘‘۔
ترجمہ:’’رسول اللہ صلی اللہ علیہ وسلم مجھے کچھ مال عطا کرتے ،تو میں کہہ دیا کرتا تھا کہ جو مجھ سے زیادہ ضرورت مند ہو ، اسے دیدیں ،حتّٰی کہ ایک بار آپ نے مجھے کچھ مال دیا ، میں نے عرض کی: جو شخص مجھ سے زیادہ ضرورت مند ہو ،اسے دیدیں ،آپ صلی اللہ علیہ وسلم نے فرمایا: یہ لے لو اورجو مال تمہارے پاس طمع اور سوال کے بغیر آئے ،اسے لے لیاکرو اور جو اس طرح نہ آئے ،اس کا خیال نہ کیاکرو،(صحیح مسلم:1045)‘‘۔
نبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں:’’[[arabic: مَاالْمُعْطِیْ مِنْ سَعَۃٍ بِافْضَلَ مِنَ الْاٰخِذِ اِذَا کَانَ مُحْتَاجًا،رَوَاہُ الطَّبرَانِیُّ فِی الْکَبِیرعَنِ ابْنِ عُمَر َرَضِیَ اﷲتَعَالیٰ عَنْہُمَا وَشَاہدُہٗ عِنْدَہٗ فِی الْاَوْسَطِ کَاِبنِ حِبَّانَ فِی الضُّعَفَاءِ مِنْ حَدیثِ أَنَسٍ رَضِیَ اﷲتَعَالیٰ عَنْہُ،وَاﷲُتَعَالیٰ اَعْلَمُ]]‘‘۔`
  },
  {
    pageNumber: 222,
    text: `ترجمہ:’’ مالدار دینے والا حاجتمند لینے والے سے افضل نہیں ہے، جبکہ وہ حاجت مند ہو ، (اسے طبرانی نے المعجم الکبیر میں حضرت ابن عمر رضی اللہ عنہما سے روایت کیا اور اوسط میں ان کے ہاں اس کا شاہد بھی ہے جیسا کہ ابن حبان نے الضعفاء میں حضرت انس رضی اللہ عنہ سے حدیث روایت کی ہے)واﷲتعالیٰ اعلم،(فتاویٰ رضویہ ، جلد10،ص:303)‘‘۔
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ  لکھتے ہیں:
 ’’قرآن کریم میں ایسے مستحقین کو صدقات دینے کو ترجیح دی ہے ،جو فقر وفاقہ اور شدید احتیاج کے عالم میں بھی صبر کرتے ہیں ،فرمایا:’’[[arabic: يَحْسَبُهُمُ الْجَاهِلُ أَغْنِيَاءَ مِنَ التَّعَفُّفِ تَعْرِفُهُمْ بِسِيمَاهُمْ لَا يَسْأَلُونَ النَّاسَ إِلْحَافًا]]‘‘۔
ترجمہ:’’(ان کے حال سے)ناواقف شخص ان کے سوال نہ کرنے کی وجہ سے ان کومالدار سمجھتا ہے،(اے مخاطَب!)تم انہیں ان کی صورت سے پہچان لوگے ، وہ لوگوں سے گڑ گڑا کر سوال نہیں کرتے ،(البقرہ:273)‘‘۔اللہ تعالیٰ نے ان لوگوں کی تحسین فرمائی ،جو لوگوں سے گڑ گڑا کر سوال نہیں کرتے ، البتہ  اللہ تعالیٰ نے بندے کو اپنی مبارک ذات  سے گڑگڑا کر سوال کرنے کا حکم فرمایاہے: ’’[[arabic: اُدْعُوْا رَبَّکُمْ تَضَرُّعاً وَخُفْیَۃً ]]‘‘،ترجمہ:’’ اپنے رب سے گڑگڑا کر اور چپکے چپکے دعاکرو، (الاعراف:55)‘‘ ۔ہمارا حال یہ ہے کہ جب ہم اللہ تعالیٰ سے سوال کرتے ہیں،توہاتھ اٹھا کر بے توجہی سے سرسری طورپر چند کلمات پڑھ کر اٹھ جاتے ہیں، اس کے برعکس ہم دیکھتے ہیں کہ عموماً رمضان کے مہینے میں لوگ مساجد میں آکر نمازیوں کے سامنے اپنے مصائب بیان کرکے گڑ گڑا کر سوال کرتے ہیں اور آنسو بھی بہالیتے ہیں یاکم ازکم رونی صورت بنالیتے ہیں تاکہ لوگوں کے دل پسیج جائیں اور انہیں کچھ دیدیں ، جس عطا کرنے والی ذات کے سامنے گڑ گڑانا چاہیے ،اس کے سامنے نہیں گڑ گڑاتے اورمخلوق کے سامنے روتے ہیں اور گڑ گڑاتے ہیں ،(تبیان القرآن ،ج:12،ص:834)‘‘۔
خلاصہ یہ ہے کہ جوسائل مسجد میں نمازی کے آگے سے گزرے یا نمازیوں کی گردنیں پھلانگے یا گڑ گڑا کر سوال کرے یااس کے متعلق دینے والے کو معلوم ہو کہ یہ فضول خرچی`
  },
  {
    pageNumber: 223,
    text: `کرتاہے یااس کو معلوم ہے کہ اس کے پاس ایک دن کی خوراک ہے یا یہ شخص صحت مند ہے اور محنت مزدوری کرکے کماسکتا ہے ،اس کے سوال پر اس کو دینا جائز نہیں ہے اور اگر یہ موانع اور عوارض نہ پائے جائیں تو اس سائل کو مسجد میں دینا جائز ہے ۔
ان عبارات کا مقصد یہ ہے کہ ہم کسی کے بارے میں اس کے ظاہری حالات کو دیکھ کر رائے قائم کریںاوراس کے مطابق شرعی احکام پر عمل کریں، یہ ضروری نہیں کہ ہم اس کی کھوج میں لگ جائیں ، علامہ غلام رسول سعیدی رحمۃ اللہ علیہ شاید اسی کھوج کرید کے حوالے سے لکھتے ہیں:
’’بعض لوگ کہتے ہیں کہ جب کوئی سوال کرے تویہ دیکھنا چاہیے کہ وہ مستحق ہے یا نہیں ، مستحق کو دینا چاہیے اور غیر مستحق کو نہیں دینا چاہیے ،میں کہتاہوں کہ جس کوہم نے غیر مستحق سمجھ کررد کردیا وہ کسی اور دروازے پر جاکر گداکرلے گا، لیکن جب ہم اللہ تعالیٰ سے سوال کریں گے ،اگر اس نے بھی ہمیں عدمِ استحقاق کی بناپر رد کردیا تو اس کے بعد ہم کس دروازہ پر جاکر سوال کریں گے،(تبیان القرآن ،ج:12،ص:834)‘‘۔

[[heading: مسجد کے نام غیر موقوفہ جائیداد کی فروخت کا جواز]] 
سوال:
قادریہ مسجد گلبہار2کی منتظمہ کمیٹی کے خزانچی نے مسجد کے فنڈ سے 1968؁ء میں ایک مکان75/4 مبلغ آٹھ ہزار روپے میں مسجد قادریہ کے  لیے خریدا ، لیکن 1968 سے 2015؁ء تک مسجد یا مدرسہ کے لیے استعمال کرنے کی بجائے مسجد کی آمدنی کے لیے کرائے پر دے دیا ۔نئی منتظمہ کمیٹی نے 2015میں ایک بلڈر کو وہ جگہ70لاکھ روپے میں فروخت کردی ،تیرہ لاکھ ایڈوانس وصول کرلیے جو مسجد کے اکاؤنٹ میں جمع ہیں ۔بلڈر نے پانچ منزلہ عمارت تعمیر کرکے فلیٹوں کی صورت میں فروخت کردیے ہیں۔2016؁ء میں جب اہل محلہ کو معلوم ہواتو اس کمیٹی کو ختم کرکے نئی کمیٹی بنادی ۔اب بلڈر موجودہ کمیٹی سے اس مکان کے کاغذات کا مطالبہ کررہاہے کہ بقایا 57لاکھ روپے لے کر کاغذات اس کے حوالے کردیں۔ کیا ہم یہ رقم بلڈر سے لے لیں یا دوسری جگہ کا مطالبہ کریں ۔اس جگہ پر پانچ منزلہ عمارت تعمیر`
  },
  {
    pageNumber: 224,
    text: `ہوچکی ہے اور لوگ اس کے فلیٹ خرید چکے ہیں ، (جامع مسجد قادریہ گلبہار 2کراچی )۔
جواب: 
 علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَفِی الْفَتَاوَی النَّسَفِیَّۃِ سُئِلَ عَنْ أَھْلِ الْمَحَلَّۃِ:بَاعُوْا وَقْفَ الْمَسْجِدِلِاَجْلِ عِمَارۃِ الْمَسْجدِ ،قَالَ: لَایَجُوْزُ بِاَمْرِالْقَاضِی وَغَیْرِہٖ،کَذَافِی الذَّخِیْرَۃِ ،وَفِیْ فَوَائِدِ نَجْمِ الدِّیْن النَّسَفِیِّ رَحِمَہُ اللّٰہ تَعَالیٰ: أَہْلُ مَسْجدٍ اِشْتَرَوْا عِقَارًا بِغَلَّۃِ الْمَسْجِدِ ثُمَّ بَاعُوْا الْعِمَارَۃَ اِخْتَلَفَ الْمَشَایِخُ فِی جَوَازِ بَیْعِہِمْ وَالصَّحِیْحُ أَنَّہٗ یَجُوْزُ،کَذَافِی الْغِیَاثِیَّۃِ ]]‘‘۔ 
ترجمہ:’’ فتاویٰ نسفی میں ہے:آپ سے ایک اہل محلہ کی بابت سوال ہوا:انہوں نے وقف مسجد کو تعمیر مسجد کے لیے فروخت کردیا ،آپ نے فرمایا:قاضی یا کسی اور کے حکم سے (بھی ایساکرنا)جائز نہیں ہے ،’’ذخیرہ‘‘ میں بھی اسی طرح ہے ۔فوائد نجم الدین نسفی رحمہ اللہ تعالیٰ میں ہے: اہل مسجد نے مسجد کی آمدنی سے ایک جائیداد خریدی ،پھر اس عمارت کو بیچ دیا ،اس بیع کے جواز میں مشایخ کا اختلاف ہے اور صحیح یہ ہے کہ اُس کا فروخت کرنا جائز ہے ، جیساکہ ’’غیاثیہ ‘‘ میں ہے ، (فتاویٰ عالمگیری،جلد2،ص: 464،مکتبۂ رشیدیہ ،کوئٹہ)‘‘۔
امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْز لکھتے ہیں:
 ’’متولی نے زر وقف سے جو زمین یا جائداد وقف کے لیے خریدی وہ وقف نہیں ہوجاتی ،اس کی بیع جائز ہے۔ کتابوں میں جزئیہ کی تصریح ہے، ہاں! بیع کے لئے ایسا ذریعہ اطمینان ضرور ہے ،جس میں کسی کے تغلب کا احتمال نہ رہے، قاضی شرع تو یہاں کوئی نہیں، اہل محلہ وعالم دیندار و مسلمانان متدین کی دینداری سے یہ کام ہو،درمختار میں ہے:
’’[[arabic: اِشْتَری الْمُتَوَلِّی بِمَالِ الْوَقْفِ دَارًالِلْوَقْفِ لَاتُلْحَقُ بِالْمَنَازِلِ الْمَوْقُوْفَۃِ وَ یَجُوْزُ بَیْعُھَافِی الْاَصَحِّ،وَاللّٰہُ تَعَالٰی أَعْلَمُ]]‘‘۔
ترجمہ:’’متولی نے وقف مال سے کوئی مکان وقف کے طور پر خریدا ،تویہ مکان وقف شدہ جائداد شمار نہ ہوگا، اَصَح قول میں اس کو فروخت کرنا جائز ہوگا، واﷲتعالیٰ اعلم،(فتاویٰ`
  },
  {
    pageNumber: 225,
    text: `رضویہ جلد16،ص:117)‘‘۔
سوال میں بیان کی گئی صورت کے مطابق انتظامیہ نے اپنے عمل سے ثابت کیاہے کہ انہوں نے وہ جگہ مسجد یا مدرسہ کے نام پر وقف کرنے کی نیت سے نہیں لی تھی بلکہ مسجد یا مدرسہ کی منفعت کے لیے لی تھی ،چنانچہ پہلے اسے کرایہ پر دیا ،پھر فروخت کردیا ۔ مندرجہ بالا فقہی حوالہ جات سے واضح ہے کہ ایسی جائیداد کی فروخت کے بارے میں فقہائے کرام کا صحیح ترین قول جواز کا ہے ۔لہٰذا اب یہ جگہ خریدار سے بقیہ رقم لے کر ان کے نام کی جاسکتی ہے ، کیونکہ اب اس بیع کو فسخ کرنا عملاً ممکن نہیں ہے۔تاہم آئندہ اس طرح کا فیصلہ کمیٹی کاکوئی ایک رکن نہ کرے بلکہ پوری انتظامیہ کے اتفاقِ رائے سے اس طرح کے فیصلے ہونے چاہییںاور جیساکہ اعلیٰ حضرت امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْز  نے لکھا ہے :
کسی ثقہ دینی عالم اوراہل محلہ میں سے دین دار اصحابِ رائے کو بھی مشاورت میں شامل کرنا چاہیے ۔آپ نے لکھا ہے:’’اب ہم یہ رقم بلڈر سے لے لیں یا نئی جگہ کا مطالبہ کریں ‘‘،یہ آپشن آپ کو پلاٹ فروخت کرتے وقت ذہن میں رکھنا چاہیے تھا،بیع مکمل ہونے کے بعد آپ نئی شرائط عائد نہیں کرسکتے ۔اگر وہ بلڈر اتنا دین دار شخص ہے تو اچھی بات ہے ، آپ کو دوسرا پلاٹ خرید کر دیدے۔بصورتِ دیگر آپ اس رقم یعنی ستر لاکھ روپے سے کوئی اور پلاٹ خرید کر مسجد کی منفعت میں استعمال کرسکتے ہیں ۔

[[heading: مسجد میں دوڑنا مسجد کے احترام اور وقار کے منافی ہے]]
سوال:
 عام طور پر دیکھنے میں آیا ہے کہ جب جماعت کھڑی ہوجائے تو لوگ جماعت میں شامل ہونے یا رکوع پانے کے لیے دوڑ کر آتے ہیں ، کیا یہ طریقۂ کار درست ہے،(محمد شعیب ، ایف ۔بی ایریا ،کراچی)۔
جواب:
یہ طریقۂ کار درست نہیں ہے ،حدیث پاک میں ہے :`
  },
  {
    pageNumber: 226,
    text: `’’[[arabic: عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيْهِ قَالَ: بَيْنَمَا نَحْنُ نُصَلِّي مَعَ النَّبِيِّ ﷺ إِذْ سَمِعَ جَلَبَةَ رِجَالٍ، فَلَمَّا صَلّٰی قَالَ: مَا شَاْنُكُمْ، قَالُوْا: اِسْتَعْجَلْنَا إِلَى الصَّلاَةِ، قَالَ: فَلاَ تَفْعَلُوْا إِذَا أَتَيْتُمُ الصَّلاَةَ فَعَلَيْكُمْ بِالسَّكِيْنَةِ، فَمَا أَدْرَكْتُمْ فَصَلُّوْا وَمَا فَاتَكُمْ فَاَتِمُّوْا]]‘‘۔
ترجمہ:’’حضرت ابوقتادہ رضی اللہ عنہ بیان کرتے ہیں: دریں اثنا کہ ہم نبی صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ رہے تھے کہ کچھ افراد کا شور سنائی دیا،جب آپ صلی اللہ علیہ وسلم نماز پڑھانے سے فارغ ہوگئے تو آپ نے پوچھا: یہ شور کیوں تھا ،انہوں نے عرض کی: ہم نماز میںجلدی شامل ہونا چاہتے تھے ، آپ صلی اللہ علیہ وسلم نے فرمایا: ایسی عجلت نہ کیا کرو ،جب تم نماز کے لیے آئو تو سکون کے ساتھ آئو، تم (امام کے ساتھ ) نماز کا جو حصہ پالو وہ (امام کی اقتدا میں)پڑھ لواور جو حصہ رہ جائے ،وہ (امام کے سلام پھیرنے کے بعد) پورا کرو، (صحیح البخاری:635)‘‘۔ مسجد میں دوڑنا مسجد کے احترام اور وقار کے منافی ہے ،بعض اوقات انسان جلدی میں پھسل جاتا ہے یا ٹکر لگ جاتی ہے جو تکلیف کا باعث ہوتی ہے ،یہ شِعار بھی درست نہیں ہے کہ کسی نہ کسی طرح امام کو رکوع میں پالے تاکہ اُس رکعت کے پڑھنے سے بچ جائیں ،کسی بھی مرحلے میں امام کے ساتھ ملیں ،ان شاء اللہ جماعت کا ثواب مل جائے گا، لیکن نماز اور مسجد کا وقار قائم رہنا چاہیے۔نبی کریم صلی اللہ علیہ وسلم نے باجماعت نماز پڑھنے میں ترتیب سے صف بندی کی بہت تاکید فرمائی ہے ،جب کہ جماعت ہونے کے بعد عجلت میں آنے والے اس کی پابندی نہیں کر پاتے اور یہ دیکھے بغیر کہ صف میں دائیں یا بائیں کس طرف کمی ہے ،لوگ ایک رخ پر کھڑے ہوتے چلے جاتے ہیں اور صحیح طریقے سے صف بندی نہیں ہوپاتی ،جب کہ آپ صلی اللہ علیہ وسلم کا فرمان ہے:’’[[arabic: أَقِيْمُوا الصُّفُوْفَ وَحَاذُوْا بَيْنَ الْمَنَاكِبِ وَسُدُّوا الْخَلَلَ وَلِيْنُوا بِاَيْدِيْ إِخْوَانِكُمْ  وَلَا تَذَرُوْا فُرُجَاتٍ لِلشَّيْطَانِ وَمَنْ وَصَلَ صَفًّا وَصَلَهُ اللَّهُ، وَمَنْ قَطَعَ صَفًّا قَطَعَهُ اللَّهُ]]‘‘۔
ترجمہ: ’’(نماز میں)صفیں سیدھی رکھو، کندھوں کو ملا کر کھڑے ہو، (دو نمازیوں کے درمیان) خلا نہ چھوڑو اور صف میں نئے شامل ہونے والے بھائی کے لیے نرمی اختیار کرواور`
  },
  {
    pageNumber: 227,
    text: `شیطان کے (نفوذ )کے لیے خلا نہ چھوڑواور جو صف کو ملائے گا، اللہ اُسے ملا کر رکھے گا اور جو صف کو توڑے گا، اللہ اُسے (اجتماعیت سے) توڑ دے گا، (سنن ابودائود:666)‘‘۔

[[heading: مسجد کی تعمیرِ نو ]]
سوال:
 جامع مسجد بیت المکرم ،سیکٹر11،اورنگی ٹاؤن 480گز پر بنی ہے ،مسجد پرانی اور بوسیدہ  ہوگئی ہے اور آبادی بڑھنے کے سبب جگہ کم پڑ رہی ہے ، اوپر مزید تعمیر نہیں ہوسکتی کہ معلوم نہیں بنیادیں کتنی مضبوط ہیں ۔انتظامیہ مسجد ،علاقہ مکین اور نمازیوں کا ارادہ ہے کہ مسجد مکمل شہید کرکے دوبارہ تعمیر کی جائے۔ کیا مسجد مکمل شہید کرکے دوبارہ تعمیر کی جاسکتی ہے اور پہلے کی تعمیر کرنے والے حضرات کے ثواب کا کیاحکم ہے ؟،مسجد کے پرانے سامان کاکیاحکم ہے ؟،(انتظامیہ جامع مسجد بیت المکرم ، اورنگی ٹاؤن کراچی )۔
جواب:
 اگر طویل عرصہ گزرنے کی وجہ سے مسجد بوسیدہ ہوجائے یا نمازیوں کے لیے جگہ تنگ ہوجائے اور اُس کو اَزسرِ نو تعمیرکرنے کی ضرورت محسوس کی جارہی ہو ، تو اُسے شہید کرکے تعمیرِنو جائز ہے، لیکن نیچے سے اوپر تک اُس کی مسجد کی حیثیت ہی بحال رکھی جائے گی۔ اگراَہلِ محلہ اپنے پیسے سے مسجد دوبارہ تعمیر کرانا چاہتے ہیں ،تو کراسکتے ہیں ، وقف کی رقم سے صرف نہیں کرسکتے ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’ [[arabic: فَرْعٌ:أَرَادَ أَہْلُ الْمَحَلَّۃِ نَقْضَ الْمَسْجِدِ وَبِنَائَہٗ أَحْکَمَ مِنَ الْاَوَّلِ أَنَّ الْبَانِیَ مِنْ أَہْلِ الْمَحَلَّۃِ لَہُمْ ذٰلِکَ وَإِلَّا،لَا، بَزَّازِیَّۃٌ ]]‘‘۔
ترجمہ:’’ اہلِ محلہ یہ چاہتے ہوں کہ مسجد کو گراکر پہلے سے زیادہ عمدہ ومستحکم بنائیں اگر وہ اسی محلے سے ہوں تو ایساکرسکتے ہیں ورنہ نہیں ،’’بزازیہ‘‘،(حاشیہ ابن عابدین شامی ،جلد 13، ص: 431-32)‘‘۔`
  },
  {
    pageNumber: 228,
    text: `علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: فِی الْکُبْرٰی:مَسْجِدٌ مَبْنِیٌّ أَرَادَ رَجُلٌ أَنْ یَّنْقُضَہٗ وَیَبْنِیَہٗ ثَانِیاً أَحکَمَ مِنَ البِنَاءِ الْاَوَّلِ لَیسَ لَہٗ ذٰلِکَ،لِاَنَّہٗ لَاوِلَایَۃَ لَہٗ کَذَافِی الْمُضْمَرَات وَفِی النَّوَازِلِ :إِلَّا أَنْ یَّخَافَ أَنْ یَّنْہَدِمَ،کَذَا فِی التَّتَارِخَانِیَۃ وَتَاْوِیْلُہٗ إِذَا لَمْ یَکُنِ البَانِی مِنْ أَہْلِ تِلْکَ الْمَحَلَّۃِ وَأَمَّا أَہْلُ تِلْکَ الْمَحَلَّۃِ فَلَہُمْ أَنْ یَہْدِمُوْہُ وَیُجَدِّدُوْا بِنَائَہٗ وَیَفْرِشُوا الْحَصِیْرَ،وَیُعَلِّقُوا الْقَنَادِیْلَ، لٰکِنْ مِنْ مَالِ أَنْفُسِہِمْ أَمّا مِنْ مَالِ الْمَسْجِدِ فَلَیْسَ لَہُمْ ذٰلِکَ إِلَّا بِاَمْرِ الْقَاضِیْ،کَذَا فِی الْخُلَاصَۃِ ]]‘‘۔
ترجمہ:’’ ’’کُبریٰ ‘‘ میں ہے : ایک مسجد بنی ہوئی ہے ،پھرکسی شخص نے اسے توڑ کر نئی مضبوط مسجد تعمیر کرنے کا ارادہ کیا ،تو وہ ایسانہیں کرسکتا ،اس لیے کہ اسے ولایت حاصل نہیں ہے،یہ ’’مُضمرات‘‘ میں ہے۔’’نوازل‘‘ میں ہے کہ اگر مسجد منہدم ہوجانے کا خوف ہو تو کرسکتاہے ،جیساکہ ’’تتارخانیہ ‘‘ میں ہے ،اس مسئلے کی تاویل یہ ہے کہ یہ حکم اس وقت ہے جب بنانے والا اس محلے کا نہ ہو ۔ محلے والوں کو اختیار ہے کہ وہ مسجد کو گراکر اُس کی جدید تعمیر کرائیں ،اُس میں فرش بچھائیں ،قندیل لٹکائیں ،لیکن یہ سب اپنے ذاتی مال سے کریں ، مسجد کے مال سے ایساکرنا چاہیں تو انہیں اختیار نہیں مگرجبکہ قاضی /حاکم انہیں اس کی اجازت دیدے ،جیساکہ ’’خلاصہ ‘‘ میں ہے ،(فتاویٰ عالمگیری ،جلد 2،ص:457)‘‘۔
پرانی مسجد کے تعمیر کرانے والوں کے اجر وثواب میں کمی واقع نہیں ہوگی ،اللہ تعالیٰ بے حساب اجرعطافرمانے پر قادرہے ،اللہ تعالیٰ کا ارشاد ہے:
’’[[arabic: مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ]]‘‘۔
ترجمہ:’’ جو لوگ اپنا مال اللہ کی راہ میں خرچ کرتے ہیں ،ان کی مثال اس دانے کی طرح ہے ،جس نے سات بالیں اگائیں ،ہر بالی میں سو دانے ہیں اور جس کے لیے چاہے ،اللہ بڑھادیتاہے اور اللہ بڑی وسعت والا بہت علم والاہے ،(البقرہ:261)‘‘۔`
  },
  {
    pageNumber: 229,
    text: `ہمارے قدیم فقہائے کرام کی عبارات اس پر مبنی ہیں کہ قُرونِ اُولیٰ ووسطیٰ میں بالعموم افراد مسجد کے لیے اپنی ملکیتی زمین وقف کرتے تھے اور بعض صورتوں میں تعمیر بھی خود کرتے تھے اور اس کو چلانے کے لیے وقف بھی قائم کرتے تھے۔آج کل خاص طورپر بڑے شہروں میں اہلِ محلہ میں سے چند افراد مل کر انجمن یا ٹرسٹ بناتے ہیں اور پھر عام چندے سے یہ کام کرتے ہیں ،وقت گزرنے کے ساتھ انجمن یاٹرسٹ کے ذمے داران بدلتے رہتے ہیں، لہٰذا تغیروتبدّل یا انہدام و تعمیرِ نویا توسیع و تزئین وتحسین کے حوالے سے انہیں یہ حق حاصل ہے ، چندہ دینے والے بھی ان تمام امور کو دیکھ کر چندہ دیتے ہیں ،سو یہ ان کی رضامندی کی دلیل ہے۔ مسجد کی تعمیرِ نو کی صورت میں بانی یا پہلے عمارت کے تعمیر کنندگان کو اجر ملتارہے گا ،کیونکہ ان کا فعل تعمیر نو یا مرمت یا توسیع کے لیے دالّ اور محرک ہے اور رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے : ’’[[arabic: إِنَّ الدَّالَّ عَلَی الخَیْرِ کَفَاعِلِہٖ]]‘‘ترجمہ:’’ نیکی کی راہ دکھانے والا نیکی کرنے والے کی طرح ہے (یعنی دونوں عنداللہ ماجورہیں)،(سُنن ترمذی: 2670)‘‘۔کسی بھی مسجد کی بنائے اول یا موجودہ عمارت کے لیے کوئی گارنٹی نہیں ہے کہ یہ عمارت قیامت تک قائم رہے گی ،حادثات وآفات بعید ازامکان نہیں ہیں ، طویل مدت گزر نے کے بعدعمارتیں بوسیدہ بھی ہوجاتی ہیں اوران کا اس حال پر قائم رکھنا خطرناک ہوجاتاہے ،پس تعمیرِنو، مرمت ، تغیروتبدُّل اور توسیع کے سلسلے چلتے رہیں گے ۔ لہٰذا آپ اپنی مسجد کو منہدم کرکے تعمیرِ نو کرسکتے ہیں ، پرانے سامان کے استعمال کی چار صورتیں ہیں : 
(۱) اگر نئی تعمیر شدہ مسجد میں استعمال ہوسکتا ہو تو ترجیح اول ہے ۔
(۲)اگر فروخت ہوسکتا ہے ،تو فروخت کرکے اس کی قیمت نئی تعمیر میں لگائیں ۔
(۳) اگریہ دونوں صورتیں قابلِ عمل نہیں ہیں اورکسی دوسری مسجد میں ضرورت ہوتو وہاں دیدیں ۔
(۴) اُسے مباح کردیں ،جس کے کام آسکتا ہو کام میں لے لے ، ورنہ ٹھکانے لگادیں ۔`
  },

{
  pageNumber: 231,
  text: `[[heading: جنازے کے مسائل]]`
},

{
  pageNumber: 233,
  text: `[[heading: سیدالمرسلین صلی اللہ علیہ وسلم کی نمازِ جنازہ]]
سوال: 
	سید المرسلین سیدنا محمد رسول اللہ صلی اللہ علیہ وسلم کا وصالِ مبارک ہوا، آپ نے حیاتِ ظاہری کے اعتبار سے پردہ فرمایا،سوال یہ ہے کہ آپ صلی اللہ علیہ وسلم کے جسدِ انور پر نمازِ جنازہ پڑھی گئی یا محض صلوٰۃ وسلام پڑھا جاتا رہا، اس سلسلے میں روایات کیا ہیں اور مختار قول کیا ہے ،(قاضی محمد اشرف ، قصبہ کالونی)۔
جواب:	اللہ تعالیٰ کا قانون ہے :
(1)’’ [[arabic: كُلُّ مَنْ عَلَيْهَا فَانٍ (26) وَيَبْقَى وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ (27)]]‘‘۔
ترجمہ:’’جو بھی زمین پر ہے ،وہ فنا ہونے والا ہےاور آپ کے رب کی ذات باقی ہے جو عظمت اور بزرگی والا ہے، (الرحمن:26-27)‘‘۔
(2)’’[[arabic: كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ثُمَّ إِلَيْنَا تُرْجَعُونَ]]‘‘۔
ترجمہ:’’ہرجان موت کا مزاچکھنے والی ہے ،پھر تم سب ہماری طرف لوٹائے جائو گے ، (العنکبوت:57)‘‘۔
(3)’’[[arabic: وَلَنْ يُؤَخِّرَ اللَّهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا]]‘‘۔
ترجمہ: ’’اور جب کسی جان (کی موت ) کا مقررہ وقت آجائے تو اللہ اُسے ہرگز مؤخر نہیں فرمائے گا، (المنافقون:11)‘‘۔
(4)’’[[arabic: وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا]]‘‘۔
ترجمہ:’’اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہی ہیں ،آپ سے پہلے بھی رسول (آئےاوراپنی حیاتِ ظاہری گزارنے کے بعد )وصال فرماگئے، پس اگر وہ فوت ہوجائیں یا (بفرضِ محال) شہید کردیے جائیں توتم ایڑیوں کے بل پلٹ جائو گے اور جو ایڑیوں کے بل پلٹ`
},
{
  pageNumber: 234,
  text: `جائے تو اللہ کاکچھ نقصان نہیں کرے گا، (آل عمران:144)‘‘۔
(5)’’ [[arabic: إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ]]‘‘۔
ترجمہ:’’بے شک آپ پر بھی (قانونِ قدرت کے تحت) موت آنی ہے اور بے شک یہ بھی مرنے والے ہیں ، (الزمر:30)‘‘۔
	عربی قاعدے کے مطابق آیۂ مبارکہ میں دونوں جگہ لفظ’’[[arabic: مَيِّتٌ]]‘‘ نکرہ آیا ہے اور ایک ہی جملے میں نکرے کا اعادہ ہو تو ثانی غیرِ اُولیٰ ہوتا ہے ، یعنی آپ صلی اللہ علیہ وسلم کی وفات قانونِ قدرت کے تحت ایک آن ، ایک لمحے اور محدود وقت کے لیے تھی ، جبکہ باقی سب کی وفات اپنے اپنے حال کے مطابق ہے۔ 
	جب سید المرسلین صلی اللہ علیہ وسلم کے وصالِ مبارک کے بعد صحابۂ کرام مضطرب تھے اور ذہنی طور پر اس حقیقت کو قبول کرنے کے لیے تیار نہیں تھے ، تو حضرت ابوبکر صدیق رضی اللہ عنہ نے خطبہ دیا اورحمد وصلوٰۃ کے بعد فرمایا:
(۱)’’[[arabic: اِنَّ عَائِشَةَ أَخْبَرَتْهُ: أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَقْبَلَ عَلٰى فَرَسٍ مِنْ مَسْكَنِهِ بِالسُّنْحِ، حَتّٰى نَزَلَ فَدَخَلَ الْمَسْجِدَ، فَلَمْ يُكَلِّمِ النَّاسَ حَتّٰى دَخَلَ عَلٰى عَائِشَةَ، فَتَيَمَّمَ رَسُوْلَ اللَّهِ ﷺ وَهُوَ مُغَشًّى بِثَوْبِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهٖ ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهٗ وَبَكٰى، ثُمَّ قَالَ: بِاَبِي أَنْتَ وَأُمِّي، وَاللَّهِ لَا يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ، فَقَدْ مُتَّهَا]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں: حضرت ابوبکر اپنے گھر سے جو ’’اَلسُّنْح‘‘میں تھا، گھوڑے پر سوار ہوکر آئے حتیٰ کہ گھوڑے سے اترکر مسجد میں داخل ہوئے، پھر لوگوں سے کلام کیے بغیر حضرت عائشہ کے پاس آئے اوررسول اللہ صلی اللہ علیہ وسلم کا قصد کیا، اس وقت آپ کا چہرۂ انور ایک یمنی چادر سے ڈھانپا ہوا تھا، پھر انہوں نے آپ کا چہرہ کھولااورجھک کر آپ کو بوسا دیااورروئے اور کہا: میرے ماںباپ آپ پر قربان ہوں، اللہ کی قسم! اللہ آپ پر دو موتوں کو جمع نہیں کرے گا،سو وہ موت جو(قانونِ قدرت کے تحت) آپ پر لکھ`
},
{
  pageNumber: 235,
  text: `دی گئی تھی،وہ آپ پر بیت چکی ،(بخاری:4452)‘‘۔ 
(۲)’’[[arabic: عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ أَبَا بَكْرٍ خَرَجَ وَعُمَرُ بْنُ الخَطَّابِ يُكَلِّمُ النَّاسَ، فَقَالَ: اِجْلِسْ يَا عُمَرُ، فَاَبٰى عُمَرُ أَنْ يَجْلِسَ، فَاَقْبَلَ النَّاسُ إِلَيْهِ وَتَرَكُوا عُمَرَ، فَقَالَ أَبُو بَكْرٍ: أَمَّا بَعْدُ! فَمَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا ﷺ، فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ مِنْكُمْ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَيٌّ لاَ يَمُوْتُ، قَالَ اللَّهُ: {وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ} إِلٰى قَوْلِهٖ: {الشَّاكِرِيْنَ}،وَقَالَ: وَاللَّهِ لَكَاَنَّ النَّاسَ لَمْ يَعْلَمُوا أَنَّ اللَّهَ أَنْزَلَ هٰذِهِ الآيَةَ حَتّٰى تَلاَهَا أَبُو بَكْرٍ، فَتَلَقَّاهَا مِنْهُ النَّاسُ كُلُّهُمْ، فَمَا أَسْمَعُ بَشَرًا مِنَ النَّاسِ إِلَّا يَتْلُوْهَا ، فَاَخْبَرَنِيْ سَعِيدُ بْنُ المُسَيَّبِ، أَنَّ عُمَرَ قَالَ: وَاللَّهِ مَا هُوَ إِلَّا أَنْ سَمِعْتُ أَبَا بَكْرٍ تَلاَهَا فَعَقِرْتُ، حَتّٰى مَا تُقِلُّنِيْ رِجْلاَيَ، وَحَتّٰى أَهْوَيْتُ إِلَى الْاَرْضِ حِيْنَ سَمِعْتُهُ تَلاَهَا، عَلِمْتُ أَنَّ النَّبِيَّ ﷺ قَدْ مَاتَ]]‘‘۔
ترجمہ: ’’حضرت عبداللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں: حضرت ابوبکر نکلے اور حضرت عمر بن خطاب لوگوں سے باتیں کر رہے تھے ،حضرت ابوبکر نے کہا:عمر! بیٹھ جائو، حضرت عمر نے بیٹھنے سے انکار کیا،تو لوگ حضرت عمر کو چھوڑ کر حضرت ابوبکر کی طرف متوجہ ہوگئے ، پھر حضرت ابوبکر نےحمد وصلوٰۃ کے بعد کہا: تم میں سے جو شخص سیدنا محمد صلی اللہ علیہ وسلم کی عبادت کرتا تھا، تو بے شک سیدنا محمد صلی اللہ علیہ وسلم وفات پاچکے ہیںاور تم میں سے جو شخص اللہ کی عبادت کرتا تھا تو اللہ یقیناًہمیشہ ہمیشہ زندہ ہے، اسے (ہرگز )موت نہیں آئے گی،پھر آپ نے یہ آیت پڑھی:’’وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلٰى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّاللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ‘‘، عبداللہ بن عباس بیان کرتے ہیں: اللہ کی قسم! ایسا لگا کہ لوگوں کو معلوم نہیں تھا کہ اللہ نے یہ آیت نازل فرمائی ہے ، حتیٰ کہ حضرت ابوبکر نے اس آیت کی تلاوت کی ،پھر تمام لوگوں نے اس آیت کو حضرت ابوبکر سے حاصل کیا، پس لوگوں میں سے جس بشر نے بھی اس آیت کو سنا، وہ اس کی تلاوت کر رہا تھا، (زہری  بیان کرتے ہیں:) مجھے سعید بن المسیب نے خبر`
},
{
  pageNumber: 236,
  text: `دی: حضرت عمر نے کہا: اللہ کی قسم! میں نے اس آیت کو صرف حضرت ابوبکر کی تلاوت سے سنا، پس میں بے ہوش ہوگیا، حتیٰ کہ میری ٹانگیں میرا بوجھ نہیں اٹھارہی تھیں یہاں تک کہ جب میں نے حضرت عمر کو اس آیت کی تلاوت کرتے ہوئے سنا کہ نبی صلی اللہ علیہ وسلم کی وفات ہوگئی ہے تو میں (بے قابو ہوکر)زمین پر گر گیا، (بخاری:4454)‘‘۔
(۳)[[arabic: فَحَمِدَ اللَّهَ أَبُو بَكْرٍ وَأَثْنٰى عَلَيْهِ، وَقَالَ: أَلا مَنْ كَانَ يَعْبُدُ مُحَمَّدًا ﷺ فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَيٌّ لاَ يَمُوتُ، وَقَالَ: {إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ}]]‘‘۔
ترجمہ:’’پھر حضرت ابوبکر نے اللہ تعالیٰ کی حمد وثنا کی اور کہا: سنو! جو (سیدنا)محمد صلی اللہ علیہ وسلم کی عبادت کرتا تھا تو بے شک (سیدنا)محمد صلی اللہ علیہ وسلم وفات پاگئے اور جو اللہ (عزوجل) کی عبادت کرتا ہے تو اللہ تعالیٰ ہمیشہ زندہ ہے ،اس کو(کبھی) موت نہیں آئے گی اور یہ آیت پڑھی: ’’بے شک آپ فوت ہونے والے ہیں اور یہ لوگ بھی مرنے والے ہیں ، (الزمر:30)‘‘، (صحیح البخاری: 3668)‘‘۔  
	پس قانونِ قدرت کے مطابق اپنے وقتِ مقررہ پر انبیائے کرام علیہم السلام پر بھی موت آئی ،اسے قرآنِ کریم اور احادیثِ مبارکہ میں موت ،وفات اور فنا سے تعبیر کیاگیا ہے۔لیکن انبیائے کرام ورُسل عظام علیہم السلام کی وفات ’’آنی ‘‘یعنی قانونِ قدرت کے مطابق ایک محدود وقت کے لیے آتی ہے اور پھر اُن کی حیات لوٹ آتی ہے ،جیساکہ اُن کی شان کے لائق ہے، معراج النبی صلی اللہ علیہ وسلم کے واقعے میں انبیائے کرام علیہم السلام کے ذی حیات ہونے کے شواہد مذکور ہیں۔ چونکہ قانونِ الٰہی کے مطابق آپ صلی اللہ علیہ وسلم نے حیاتِ ظاہری سے پردہ فرمایا ،اس لیے اُس پر ظاہری طور پر موت کے احکام نافذ ہوئے ،آپ کو غسل دیا گیا ، کفن پہنایا گیا ، آپ پر صلوٰۃ پڑھی گئی ، آپ کے لیے قبرِ انور تیار کی گئی اور اس میں آپ کی تدفین ہوئی اور آج بھی آپ کمالِ صفتِ حیات کے ساتھ اپنی قبرِ انور میں تشریف فرما ہیں۔ قرآنِ کریم قطعی الثبوت اور قطعی الدلالۃ آیات میں شہداء کی حیات کی شہادت دیتا ہے اور یہ بھی`
},
{
  pageNumber: 237,
  text: `بیان فرماتا ہے کہ انہیں عالمِ برزخ میں رزق دیا جاتا ہے ،تو انبیائے کرام علیہم السلام اور پھر امام الانبیاء والمرسلین سیدنا محمد رسول اللہ صلی اللہ علیہ وسلم کا درجہ تو تمام شہداء اور تمام انبیائے کرام سے بہت بڑا ہے، اس کی رفعتوں کی انتہا کسی کو نہیں معلوم ۔ 
	لہٰذا رسول اللہ صلی اللہ علیہ وسلم کاجسدِ مبارک حجرہ شریف میں رکھ دیاگیا ،لوگ جماعت کی صورت میں آتے ،تکبیرات کہہ کر درود شریف پڑھتے اور دعاکرتے ، بدھ کے روز حضرت سیدنا صدیقِ اکبر رضی اللہ عنہ نے نماز پڑھی اور اُس کے بعد تدفین کردی گئی ۔علامہ غلام رسول سعیدی رحمۃ اللہ علیہ نے اپنے مقالات میں ایک مُفصّل تحقیقی مقالہ لکھااور دلائل کے ساتھ یہ موقف اختیار فرمایاکہ آپ صلی اللہ علیہ وسلم کی نمازجنازہ معروف طریقے سے پڑھی گئی تھی، آپ نے لکھا:’’ بعض روایات میں یہ آیا ہے کہ صحابۂ کرام مختلف ٹولیوں اور جماعتوں کی شکل میں آکر آپ پر صرف صلوٰۃ وسلا م عرض کرتے ،لیکن جوچیز حدیث صحیح سے ثابت ہے اورجو معتمد اور محققین علمائے کرام کا مختار ہے اور جس چیز کی بکثرت کُتُبِ سِیَر میں صراحت ہے اور جو اَمر اصول حنفیہ اور اصولِ شافعیہ کے مطابق ہے ،وہ یہ ہے کہ آپ کی نمازِ جنازہ معروف طریقہ سے پڑھی گئی ،اِلّا یہ کہ اس نماز جنازہ میں کوئی شخص امام نہیں تھا اورنہ ہی اس میں ’’[[arabic: اَللّٰہُمَّ اغْفِرْ لِحَیِّنَاوَمَیِّتِنَا]]‘‘ والی معروف دعاپڑھی گئی ،بلکہ اس دعاکے قائم مقام حضور صلی اللہ علیہ وسلم کی تعریف وتوصیف میں کلمات طیبات عرض کیے گئے ،(مقالاتِ سعیدی ، ص:120)‘‘۔
	شمائلِ ترمذی (بَابُ مَاجَآءَ فِی وَفَاۃِ رَسُولِ اللّٰہ ﷺ ) میں ہے : رسول اللہ صلی اللہ علیہ وسلم کے وصال کے بعد لوگوں نے حضرت ابوبکر صدیق رضی اللہ عنہ سے پوچھا:’’[[arabic: یَا صَاحِبَ رَسُوْلِ اللّٰہِ ﷺ! أَیُصَلّٰی عَلٰی رَسُوْلِ اللّٰہِ، قَالَ:نَعَمْ، قَالُوْا: وَکَیْفَ، قَالَ: یَدْخُلُ قَوْمٌ فَیُکَبِّرُوْنَ وَیُصَلُّوْنَ وَیَدْعُوْنَ  ثُمَّ یَخْرُجُوْنَ،ثُمَّ یَدْخُلُ قَوْمٌ فَیُکَبِّرُوْنَ وَیُصَلُّوْنَ وَیَدْعُوْنَ،ثُمَّ یَخْرُجُوْنَ،حَتّٰی یَدْخُلَ النَّاسُ]]‘‘۔
ترجمہ:’’ اے رفیقِ مصطفیٰ صلی اللہ علیہ وسلم !کیا اللہ کے رسول صلی اللہ علیہ وسلم پر نمازِ جنازہ پڑھی جائے ،`
},
{
  pageNumber: 238,
  text: `آپ نے فرمایا: ہاں!،صحابہ نے دریافت کیا : کس طرح پڑھیں ، آپ نے فرمایا: ایک ایک جماعت حجرہ کے اندر جائے ،پس تکبیر کہیں ،درود پڑھیں اور دعا کریں پھر باہر آجائیں ،پھر دوسری جماعت جائے ،تکبیر کہیں ،درود پڑھیں اور دعا کریں پھر باہر آجائیں ، یہاں تک کہ تمام لوگ اسی طرح داخل ہوں ،(ص:474)‘‘۔
حافظ ابن کثیرد مشقی متوفّٰی774؁ھ لکھتے ہیں:
’’[[arabic: عَنِ ابْنِ عَبَّاسٍ قَالَ:لَمَّا مَاتَ رَسُوْلُ اللّٰہِ ﷺأُدْخِلَ الرِّجَالُ فَصَلَّوْا عَلَیْہِ بِغَیْرِ إِمَامٍ أَرْسَالًاحَتّٰی فَرَغُوا،ثُمَّ أُدْخِلَ النِّسَآءُ ، فَصَلَّیْنَ عَلَیْہِ،ثُمَّ أُدْخِلَ الصِّبْیَانُ ،فَصَلَّوْا عَلَیْہِ،ثُمَّ أُدْخِلَ الْعَبِیْدُ ،فَصَلَّوْا عَلَیْہِ أَرْسَالًا،لَمْ یَؤُمَّہُمْ عَلٰی رَسُوْلِ اللّٰہِ ﷺ أَحَدٌ]]‘‘۔
ترجمہ:’’حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں: جب رسول اللہ صلی اللہ علیہ وسلم کا وصال ہوگیا تو پہلےگروہ در گروہ مردوں نے جاکر آپ صلی اللہ علیہ وسلم کے جنازے پر بغیر کسی امام کے علیحدہ علیحدہ نماز پڑھی اور جب وہ فارغ ہوگئے تو عورتوں نے جاکر نماز پڑھی ،پھر(باشعور) بچوں نے ،پھر غلاموں نے ،الغرض کسی امام کے بغیرسب نے الگ الگ نماز پڑھی ، (اَلسِّیْرَۃُ النَّبَوِیَّہ ،جلد 4، ص: 527)‘‘۔ 
حضرت ابوبکر اور حضرت عمر کی نماز جنازہ پڑھنے کی کیفیت کو بیان کرتے ہو ئے حافظ ابن کثیر لکھتےہیں:
’’[[arabic: قَالَ الْوَاقِدِیُّ:حَدَّثَنِی مُوسَی بْنُ مُحَمَّدِ بْنِ إِبْرَاہِیمَ، قَالَ: وَجَدْتُ کِتَابًا بِخَطِّ أَبِی، فِیہِ أَنَّہٗ لَمَّا کُفِّنَ رَسُولُ اللَّہِ ﷺ وَوُضِعَ عَلٰی سَرِیرِہٖ، دَخَلَ أَبُو بَکْرٍ وَعُمَرُ رَضِیَ اللَّہُ عَنْہُمَا، وَمَعَہُمَا نَفَرٌ مِنَ الْمُہَاجِرِینَ وَالْاَنْصَارِ بِقَدْرِ مَا یَسَعُ الْبَیْتُ،فَقَالَا:اَلسَّلَامُ عَلَیْکَ أَیُّہَا النَّبِیُّ وَرَحْمَۃُ اللَّہِ وَبَرَکَاتُہُ، وَسَلَّمَ الْمُہَاجِرُونَ وَالْاَنْصَارُ کَمَا سَلَّمَ أَبُو بَکْرٍ وَعُمَرُ ،ثُمَّ صَفُّوا صُفُوفًا لَا یَؤُمُّہُمْ أَحَدٌ،فَقَالَ أَبُو بَکْرٍ وَعُمَرُ وَہُمَا فِی الصَّفِّ الْاَوَّلِ حِیَالَ رَسُولِ اللَّہِ ﷺ:اَللّٰہُمَّ إِنَّا نَشْہَدُ أَنَّہٗ قَدْ بَلَّغَ مَا أُنْزِلَ إِلَیْہِ وَنَصَحَ لِاُمَّتِہٖ، وَجَاہَدَ]]`
},
{
  pageNumber: 239,
  text: `[[arabic: فِیْ سَبِیْلِ اللہِ حَتّٰی أَعَزَّ اللہُ دِیْنَہٗ وَتَمَّتْ کَلِمَتُہٗ  وَأُوْمِنَ بِہٖ وَحْدَہٗ لَا شَرِیْکَ لَہٗ، فَاجْعَلْنَا إِلٰہَنَا مِمَّنْ یَتَّبِعُ الْقَوْلَ الَّذِیْ أُنْزِلَ مَعَہٗ، وَاجْمَعْ بَیْنَنَا وَبَیْنَہٗ حتّٰی تُعَرِّفَہٗ بِنَا وَتُعَرِّفَنَا بِہٖ، فَإِنَّہٗ کَانَ بِالْمُؤْمِنِیْنَ رَؤُوْفًا رَّحِیْمًا، لَا نَبْتَغِیْ بِالْإِیْمَانِ بِہٖ بدیْلًا، وَلَا نَشْتَرِی بِہٖ ثَمَنًا أَبَدًا،فَیَقُوْلُ النَّاسُ: آمِیْنَ آمِیْنَ وَیَخْرُجُوْنَ وَیَدْخُلُ آخَرُوْنَ حتّٰی صَلَّی الرِّجَالُ، ثُمَّ النِّسَاء ُ، ثُمَّ الصِّبْیَانُ ]]‘‘۔
ترجمہ:’’ واقدی نے کہا: مجھ سےموسیٰ بن محمد بن ابراہیم نےبیان کیا،انہوں نے کہا:مجھے اپنے باپ کی لکھی ہوئی ایک تحریر ملی،اس میں لکھا تھا: جب رسول اللہ صلی اللہ علیہ وسلم کو کفن دیا گیا اور آپ کو چارپائی پر رکھا گیا ،تو حضرات ابوبکر و عمر رضی اللہ عنہما داخل ہو ئے اور گھر میں جتنی گنجائش تھی اتنے مہاجرین اور انصار بھی ان کے ساتھ تھے، تو دونوں نے کہا:اے نبی صلی اللہ علیہ وسلم آپ پر سلام، اللہ کی رحمتیں اوراس کی برکات ہوںاور مہاجرین اور انصار نے بھی حضرت ابوبکر اور عمر کی طرح سلام کیا،پھر صفیں بنائی اور ان کا کوئی امام نہیں تھا تو ابوبکر اور عمررضی اللہ عنہما دونوں صفِ اول میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے تھے،انہوں نے یہ کلمات پڑھے :اے اللہ !ہم گواہی دیتے ہیں کہ جو کچھ تو نے اِن کی طرف نازل فرمایا ،وہ سب آپ صلی اللہ علیہ وسلم نے (امت کو)پہنچایا اور اپنی امت کے ساتھ خیر خواہی اور اللہ کے راستے میں جہاد کیا ،حتیٰ کہ اللہ تعالیٰ نے اپنے دین کو غالب کیا اور ذاتِ وحدہٗ لا شریک پر ایمان لایا گیا ،پس اے ہمار ے معبود!ہمیں ان لوگوں میںشامل فرماجو ان پر نازل شدہ کلام کی پیروی کرتے ہیں ، (آخرت میں)ہمیں ان کے ساتھ جمع فرما کہ ہماری پہچان ایک دوسرے کے ساتھ ہو، پس بے شک وہ مومنین پر بہت شفقت فرمانے والے مہربان ہیں، ہم آپ پر ایمان پر کسی بدل کے طلبگار نہیں اور نہ کبھی اس کے بدلے میں مال لیں گے، تو لوگوں نے کہا :آمین !آمین !(نماز پڑھنے والے) لوگ نکلتے، پھر اس کے بعد دوسرے لوگ داخل ہوتے حتیٰ کہ تمام مردوں ،عورتوں اور بچوں نے نماز پڑھی، (البدایۃ والنہایۃ: ج:5،ص:286)‘‘۔
علامہ زرقانی لکھتے ہیں :
’’[[arabic: قَالَ عِیَاضٌ: الصَّحِیحُ الَّذِی عَلَیْہِ الْجُمْہُورُ: أَنَّ الصَّلَاۃَ عَلَی النَّبِیِّ ﷺ کَانَتْ صَلَاۃً حَقِیقِیَّۃً لَا مُجَرَّدَ الدُّعَاء ِ فَقَطْ، نَعَمْ، لَا خِلَافَ أَنَّہٗ لَمْ یَؤُمَّہُمْ عَلَیْہِ أَحَدٌ، فَقِیْلَ:تَعَبُّدِیٌّ، وَقِیْلَ :لِیُبَاشِرَ کُلُّ وَاحِدٍ الصَّلَاۃَ عَلَیْہِ مِنْہُ إِلَیْہِ،وَقَالَ السُّہَیْلِیُّ: أَخْبَرَ اللَّہُ: أَنَّہٗ وَمَلَائِکَتَہٗ یُصَلُّوْنَ عَلَیْہِ، وَأَمَرَ کُلَّ وَاحِدٍ مِنَ الْمُؤْمِنِینَ أَنْ یُصَلِّیَ عَلَیْہِ، فَوَجَبَ عَلٰی کُلِّ وَاحِدٍ أَنْ یُبَاشِرَ الصَّلَاۃَ عَلَیْہِ مِنْہُ إِلَیْہِ، وَالصَّلَاۃُ عَلَیْہِ بَعْدَ مَوْتِہٖ مِنْ ہٰذَا الْقَبِیلِ، وَأَیْضًا فَإِنَّ الْمَلَائِکَۃَ لَنَا فِی ذٰلِکَ أَئِمَّۃٌ، انْتَہَی، وَقَالَ الشَّافِعِیُّ فِی الْاُمِّ:وَذٰلِکَ لِعِظَمِ أَمْرِہٖ ﷺ وَتَنَافُسِہِمْ فِیمَنْ یَتَوَلَّی الصَّلَاۃَ عَلَیْہِ، وَقِیلَ لِعَدَمِ اتِّفَاقِہِمْ عَلَی خَلِیفَۃٍ، وَقِیلَ لِوَصِیَّتِہٖ بِذٰلِکَ]]‘‘۔
ترجمہ:’’ قاضی عیاض نے فرمایا:اورجمہور کا صحیح موقف یہ ہے : نبی صلی اللہ علیہ وسلم کی جنازہ کی جو نماز پڑھی گئی ،وہ حقیقی نماز تھی صرف دعا نہ تھی،ہاں! اس میں کوئی اختلاف نہیں کہ اس نماز کی امامت کسی نے نہیں کی ،بعض نے کہا: یہ تعبدی امر تھا(یعنی بطورِ عبادت ادا کی گئی) اور بعض نے کہا:یہ اس لیے تاکہ ہر کسی کوخودآپ کی نمازجنازہ کی سعادت حاصل ہواور علامہ سہیلی نے کہا:اللہ تعالیٰ نے فرمایا : اللہ تعالیٰ اور اس کے فرشتے آپصلی اللہ علیہ وسلم پر درود بھیجتے ہیں اور ہر مومن کو حکم دیا کہ وہ آپ صلی اللہ علیہ وسلم پر درود بھیجے تو ہر مومن پر یہ واجب ہوگیا کہ ہر ایک اپنی طرف سے خود آپ صلی اللہ علیہ وسلم پر درودبھیجےاور آ پ صلی اللہ علیہ وسلم کی وفات کے بعدبھی آپ صلی اللہ علیہ وسلم پر درود اسی قبیل سے ہے ، پس بے شک فرشتے اس شِعار میں ہمارے امام ہیں اور امام شافعی نے’’کِتَابُ الْاُمّ‘‘ میںفرمایا: یہ رسول اللہ صلی اللہ علیہ وسلم کی عظمت واحترام کی وجہ سے تھااور آپس میںآپ کی نماز جنازہ کی امامت کی سعادت میں یکساں شریک ہونے کے`
},
{
  pageNumber: 240,
  text: `جذبے کی وجہ سے اور بعض نے کہا:(اُس وقت تک) خلیفہ پر عدم اتفاق کی وجہ سے اور بعض نے کہا:اس لیے کہ آپ صلی اللہ علیہ وسلم نے اس کی وصیت فرمائی تھی، (شَرْحُ الزُّرْقَانِی عَلَی الْمُوطَّا:ج2ص:94)‘‘۔
امام شافعیرحمۃ اللہ علیہ نے لکھا:
’’[[arabic: صَلَّی النَّاسُ عَلٰی رَسُولِ اللَّہِﷺاَفْرَادًا لَا یَوُمُّہُمْ اَحَدٌ، وَذٰلِکَ لِعِظَمِ اَمْرِ رَسُولِ اللَّہِﷺوَتَنَافُسِہِمْ فِی اَنْ لَا یَتَوَلَّی الْإِمَامَۃَ فِی الصَّلَاۃِ عَلَیْہِ وَاحِدٌ وَصَلُّوْا عَلَیْہِ مَرَّۃً بَعْدَ مَرَّۃٍ]]‘‘۔
ترجمہ: ’’لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کی نماز جنازہ کسی امام کے بغیر انفرادی طور پر اس لیے پڑھی ،کیونکہ اس سے آپ کی عظمت اور احترام ملحوظ خاطر تھا اور صحابہ کرام کا یہ جذبہ کہ سب اس سعادت میں شریک ہوں ، سعادتِ امامت کسی ایک کے لیے خاص نہ ہو ،پس سب نے آپ پر باربار نماز جنازہ پڑھی ،(اَلْاُمّ لِلشَّافِعی: ج:1،ص:314 دارلمعرفہ، بیروت)‘‘۔
علامہ سہیلی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: ذَکَرَ ابْنُ إسْحَاقَ وَغَیْرُہٗ: اَنّ الْمُسْلِمِینَ صَلَّوْا عَلَیْہِ اَفْذَاذًا، لَا یَوُمُّہُمْ اَحَدٌ، کُلّمَا جَاءَتْ طَائِفَۃٌ صَلَّتْ عَلَیْہِ وَہٰذَا خُصُوصٌ بِہٖ ﷺ وَلَا یَکُونُ ہٰذَا الْفِعْلُ إلّا عَنْ تَوْقِیْفٍ وَکَذٰلِکَ رُوِیَ اَنَّہٗ اَوْصٰی بِذٰلِکَ ]]‘‘۔
ترجمہ:’’ابن اسحاق وغیرہ نے بیان کیا ہے :مسلمانوں نے آپ صلی اللہ علیہ وسلم کی نماز جنازہ انفرادی طورپرپڑھی اور کسی نےان کی امامت نہیں کی ،جب ایک گروہ آتا ، توآپ صلی اللہ علیہ وسلم پر نماز پڑھتا اور یہ آپ صلی اللہ علیہ وسلم کی خصوصیت تھی اور یہ کام توقیفی ہی ہوسکتا ہےاور اسی طرح روایت کی گئی ہےکہ آپ صلی اللہ علیہ وسلم نے اس کی وصیت کی تھی، (رَوْضُ الْاَنْف :جز: 7، ص:594،دار احیاء التراث العربی(‘‘۔توقیفی سے مراد یہ ہے کہ آپ صلی اللہ علیہ وسلم سے نقل وسماع پر موقوف ہے، کسی کی عقلی سوچ کا نتیجہ نہیںہے۔
امام احمد رضاقُدِّسَ سِرُّہُ الْعَزِیْزسے سوال ہوا:’’ آنحضرت صلی اللہ علیہ وسلم کے جنازہ کی نماز کتنی مرتبہ پڑھی گئی اور اول کس شخص نے پڑھائی تھی؟‘‘۔
 آپ نے جواب میں لکھا: ’’جنازہ ٔاَقدس پر نماز کے بارے میں`
},
{
  pageNumber: 241,
  text: `اقوال مختلف ہیں: ایک کے نزدیک یہ نماز ِمعروف نہ ہوئی، بلکہ لوگ گروہ دَر گروہ حاضرہوتے اور صلوٰۃ وسلام عرض کرتے، بعض اَحادیث بھی اس کی مؤیّدہیں،جیساکہ ہم نے اپنے رسالہ :’’ [[arabic: اَلنَّھْیُ الْحَاجِزْ عَنْ تَکْرَارِ صَلوٰۃِ الْجَنَائِز]]‘‘میں بیان کیا ہے اور بہت علماء یہی نمازِ معروف مانتے ہیں،امام قاضی عیاض نے اسی کی تصحیح فرمائی،جیساکہ علامہ زُرقانی کی’’شَرْحُ الْمُؤَطَّا‘‘ میں ہے۔سیدنا صدیق اکبر رضی اللہ عنہ فتنوں کے سَدِّباب اور اُمّت کے نظمِ اجتماعی کے انتظام میں مشغول تھے ، جب تک ان کے دستِ حق پرست پر بیعت نہیںہوئی تھی، لوگ فوج در فوج آتے اور جنازۂ انور پر نماز پڑھ کر چلے جاتے۔ لیکن جب حضرت ابو بکر صدیق رضی اللہ عنہ کے ہاتھ پر بیعت ہوگئی،تو وہ آپ صلی اللہ علیہ وسلم کے شرعی ولی مقرر ہوگئے ۔پھر جب اُنہوں نے جنازۂ مقدس پر نماز پڑھ لی ، تواُن کے بعد کسی نے نہیں پڑھی، کیونکہ ولی کے جنازہ پڑھنے کے بعد کسی کونمازِ جنازہ کے اعادہ کااختیار نہیں ہے، ان تمام مطالب کی تفصیلِ قلیل، فقیر کے مذکورہ بالا رسالہ میں درج ہے۔
 امام شمس الائمہ سرخسی اپنی ’’مبسوط‘‘ میں لکھتے ہیں:
’’[[arabic: اِنَّ أَبَابَکرٍ رَضِیَ اﷲتَعَالٰی عَنْہُ کَانَ مَشْغُوْلًا بِتَسْوِیَۃِ الْاُمُوْرِ وَتَسْکِیْنِ الْفِتْنَۃِ فَکَانُوْا یُصَلُّوْنَ عَلَیْہِ قَبْلَ حُضُوْرِہٖ وَکَانَ الْحَقُّ لَہٗ لِاَنَّہٗ ھُوَ الْخَلِیْفَۃُ فَلَمَّا فَرَغَ صَلّٰی عَلَیْہِ،ثُمَّ لَمْ یُصَلِّ أَحَدٌ بَعْدَہٗ عَلَیْہِ]]‘‘۔
 ترجمہ:’’(نبی کریم صلی اللہ علیہ وسلم کے وصال کے بعد)حضرت ابو بکررضی اللہ عنہ (اُمّت کے) معاملات درست کرنے اور فتنہ کو فرو کرنے میں مشغول تھے، سو لوگ ان کی آمد سے پہلے آکرصلوٰۃ پڑھتے جاتے اور حق اُن کا تھا کیونکہ وہ خلیفہ مقرر ہوچکے تھے ،پھر جب وہ اُمّت کے معاملات کو نمٹانے کے بعد فارغ ہوئے تو انہوں نے نماز پڑھی،پھر آپ کے بعد کسی نے نہیں پڑھی ‘‘۔پھر امامِ اہلسنّت نے مختلف کُتبِ فتاویٰ کے حوالے سے حضرت عبداللہ بن مسعود رضی اللہ عنہ کی یہ روایت نقل فرمائی،رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:`
},
{
  pageNumber: 242,
  text: `’’ [[arabic: اِذَا غَسَلْتُمُوْنِیْ وَکَفَنتُمُوْنِی فَضَعُوْنِی عَلٰی سَرِیْرِی،ثُمَّ اخْرُجُوْا عَنِّی فَاِنَّ اَوَّلَ مَنْ یُّصَلِّی]]`
},
{
  pageNumber: 243,
  text: `[[arabic: عَلَیَّ جِبْرِیْلُ،ثُمَّ مِیْکَائِیْلُ،ثُمَّ اِسْرَافِیْلُ،ثُمَّ مَلَکُ الْمَوْتِ مَعَ جُنُوْدِہٖ مِنَ الْمَلٰئِکَۃِ بِاَجْمَعِھِمْ ثُمَّ ادْخُلُوْا عَلَیَّ فَوْجًا بَعْدَ فَوجٍ فَصَلُّوْاعَلَیّ وَسَلِّمُوْاتَسْلِیمًا]]‘‘۔ 
ترجمہ:’’ جب تم میرے غسل وکفن سے فارغ ہوجائو،تومجھے میری چارپائی پر رکھ کر باہر نکل جانا، کیونکہ سب سے پہلے جبرئیل مجھ پر صلوٰۃ پڑھیں گے، پھر میکائیل ،پھر اسرافیل پھر مَلَکُ الْمَوت اپنے سارے لشکروں کے ساتھ علیہم السلام، پھر گروہ دَرگروہ میرے پاس حاضر ہوکر مجھ پر درود وسلام عرض کرتے جاؤ، وَاللّٰہُ سُبْحَانَہٗ وَتَعَالٰی أَعْلَمُ،(فتاویٰ رضویہ ، جلد9، ص: 315بتصرُّف)‘‘۔ صلوٰۃ کا کلمہ نماز کے لیے بھی آتاہے اور درود کے لیے بھی۔
امام حاکم کی روایت کے الفاظ یہ ہیں:
’’[[arabic: إِذَا غَسَّلْتُمُونِي وَحَنَّطْتُمُوْنِي وَكَفَّنْتُمُوْنِي فَضَعُوْنِي عَلٰی شَفِيْرِ قَبْرِيْ، ثُمَّ اخْرُجُوْا عَنِّي سَاعَةً، فَإِنَّ أَوَّلَ مَنْ يُصَلِّي عَلَيَّ خَلِيْلِي وَجَلِيْسِيْ جِبْرِيْلُ وَمِيْكَائِيْلُ، ثُمَّ إِسْرَافِيْلُ، ثُمَّ مَلَكُ الْمَوْتِ مَعَ جُنُوْدٍ مِنَ الْمَلَائِكَةِ، ثُمَّ لِيَبْدَأْ بِالصَّلَاةِ عَلَيَّ رِجَالُ أَهْلِ بَيْتِيْ، ثُمَّ نِسَاؤُهُمْ، ثُمَّ ادْخُلُوا أَفْوَاجًا أَفْوَاجًا وَفُرَادٰى وَلَا تُوْذُوْنِي بِبَاكِيَةٍ، وَلَا بِرَنَّةٍ وَلَا بِصَيْحَةٍ، وَمَنْ كَانَ غَائِبًا مِنْ أَصْحَابِي فَاَبْلِغُوْهُ مِنِّي السَّلَامَ، فَإِنِّي أُشْهِدُكُمْ عَلٰى أَنِّي قَدْ سَلَّمْتُ عَلٰی مَنْ دَخَلَ فِي الْإِسْلَامِ، وَمَنْ تَابَعَنِي عَلٰی دِيْنِيْ هٰذَا مُنْذُ الْيَوْمِ إِلٰی يَوْمِ الْقِيَامَةِ]]‘‘۔
ترجمہ:’’جب تم مجھے غسل دے دو اور خوشبو لگادواور مجھے کفن پہنادو تو مجھے میری قبر کے کنارے (سریرِ منیر )پررکھ دینا ، پھر کچھ دیر کے لیے تم سب باہر نکل جانا ، کیونکہ سب سے پہلے مجھ پر صلوٰۃ میرے خلیل وجلیس جبریل ومیکائیل اور پھر اسرافیل پڑھیں گے ،پھر ملک الموت اپنے ملائکہ کے تمام لشکروں کے ساتھ پڑھیں گے، پھر میرے اہلِ بیت کے مرد پڑھیں گے ،پھر اُن کی خواتین پڑھیں گی، پھر تم گروہ در گروہ اور تنہا داخل ہوکر پڑھنا اور رونے ، بین کرنے اور چلّانے سے مجھے اذیت نہ دینا اور میرے اصحاب میں سے جو موجود نہ ہوں ،انہیں میری طرف سے سلام پہنچانا ، پس میں تمہیں گواہی دیتا ہوں کہ جو اسلام میں داخل ہوااور جس نے روزِ قیامت تک دین میں میری پیروی کی ، اُس پر میرا سلام`
},
{
  pageNumber: 244,
  text: `ہو ، (المستدرک علی الصحیحین:4399)‘‘۔
 امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْزحضرت علی کے نمازجنازہ پڑھنے کی کیفیت بیان کرتے ہوئے لکھتے ہیں:
’’اسی طرح وصالِ اقدس کے بعد حضور پر نور پر جو صلوٰۃ صحابہ کرام رضی اللہ عنہم نے ادا کی ، ایک جماعتِ علماء اسے بھی درود ودعا کے معنی میں لیتی ہے اور حدیث امیرالمومنین علیرضی اللہ عنہ سے یہی ظاہر:’’ [[arabic: عَنْ عَلِيٍّ ،قَالَ: لَمَّا وُضِعَ رَسُوْلُ اللَّهِ ﷺ عَلَى السَّرِيرِ ،قَالَ عَلِيٌّ: أَلَا يَقُوْمُ عَلَيْهِ أَحَدٌ لَعَلَّهٗ يَوءُمُّ، هُوَ إِمَامُكُمْ حَيًّا وَمَيِّتًا، فَكَانَ يَدْخُلُ النَّاسُ رَسَلًا رَسَلًا، فَيُصَلُّونَ عَلَيْهِ صَفًّا صَفًّا ،لَيْسَ لَهُمْ إِمَامٌ وَيُكَبِّرُونَ وَعَلِيٌّ قَائِمٌ بِحِيَالِ رَسُوْلِ اللهِ ﷺ يَقُوْلُ: سَلامٌ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ! اَللّٰهُمَّ إِنَّا نَشْهَدُ أَنْ قَدْ بَلَّغَ مَا أُنْزِلَ إِلَيْهِ وَنَصَحَ لاُمَّتِهٖ وَجَاهَدَ فِيْ سَبِيْلِ اللَّهِ حَتّٰى أَعَزَّ اللَّهُ دِينَهٗ وَتَمَّتْ كَلِمَتُهٗ،اَللّٰهُمَّ فَاجْعَلْنَا مِمَّنْ يَتَّبِعُ مَا أَنْزَلَ اللَّهُ إِلَيْهِ وَثَبِّتْنَا بَعْدَهٗ وَاجْمَعْ بَيْنَنَا وَبَيْنَهٗ، فَيَقُوْلُ النَّاسُ: آمِينَ آمِينَ! حَتّٰى صَلّٰی عَلَيْهِ الرِّجَالُ ثُمَّ النِّسَاءُ ثُمَّ الصِّبْيَانُ.]]‘‘۔
ترجمہ:’’حضرت علی رضی اللہ عنہ سے روایت ہے: جب حضور پر نور سید المرسلین صلی اللہ علیہ وسلم کو غسل دے کر سریر منیر پر لٹایا، حضرت مولا علی کَرَّمَ اللہُ وَجْہَہ نے فرمایا: حضور اقدس صلی اللہ علیہ وسلم کے آگے کوئی امام بن کر نہ کھڑا ہو کہ حیاتِ ظاہری میں بھی وہ تمہارے امام تھے اور وصالِ مبارک کے بعد وہی تمہارے امام ہیں ۔ پس لوگ گروہ در گروہ  داخل ہوتے اور صف در صف آپ پر صلوٰۃ پڑھتے ،ان کا کوئی امام نہ تھا ۔ علی کَرَّمَ اللہُ وَجْہَہرسول اللہ صلی اللہ علیہ وسلم کے سامنے کھڑے عرض کرتے تھے: سلام ہو آپ پر اے نبی اور اللہ کی رحمت اور اس کی برکتیں۔ الٰہی!ہم گواہی دیتے ہیں کہ آپ صلی اللہ علیہ وسلم پر جو دین نازل ہوا ، وہ آپ صلی اللہ علیہ وسلم نے پہنچادیا اور ہر بات میں اپنی امت کی بھلائی کی اور راہِ خدا میں جہاد فرمایا، یہاںتک کہ اللہ عزوجل نے اپنے دین کو غالب کیا اور اللہ کا قول پورا ہوا۔ الٰہی! تو ہم کو ان پر اتاری ہوئی کتاب کے پیروکاروں میں شامل فرما اوران کے بعد بھی اس دین پر ثابت قدم رکھ اور روزِ`
},
{
  pageNumber: 245,
  text: `قیامت ہمیں ان سے ملا،مولا علی یہ دعا کرتے اور حاضرین آمین کہتے، یہاں تک کہ ان پر مردوں ،پھر عورتوں اور پھر لڑکوں نے صلوٰۃ کی، صلی اللہ علیہ وسلم،(الطبقات الكبریٰ، ج:۲، ص:۲۹۱،  دار صادر بیروت)‘‘۔۔۔مزید لکھتے ہیں:
علامہ زرقانی شرح مؤطا للامام مالک میں امیر المؤمنین حضرت علی کَرَّمَ اللہُ وَجْہَہ الْکَرِیْم کی حدیث مذکور کے بعد لکھتے ہیں:
’’[[arabic: وَظَاهِرُ هٰذَا أَنَّ الْمُرَادَ بِالصَّلَاةِ عَلَيْهِ مَا ذَهَبَ إِلَيْهِ جَمَاعَةٌ :أَنَّ مِنْ خَصَائِصِهٖ أَنَّهٗ لَمْ يُصَلَّ عَلَيْهِ أَصْلًا، وَإِنَّمَا كَانَ النَّاسُ يَدْخُلُونَ فَيَدْعُوْنَ وَيَفْتَرِقُونَ،قَالَ الْبَاجِيُّ: وَلِهٰذَا وَجْهٌ وَهُوَ أَنَّهُ أَفْضَلُ مِنْ كُلِّ شَهِيدٍ، وَالشَّهِيدُ يُغْنِيهِ فَضْلُهٗ عَنِ الصَّلَاةِ عَلَيْهِ، وَإِنَّمَا فَارَقَ الشَّهِيدَ فِي الْغُسْلِ ; لِاَنَّهٗ حَذَّرَ مَنْ غَسَّلَهٗ إِزَالَةَ الدَّمِ عَنْهُ، وَهُوَ مَطْلُوْبٌ بَقَاؤُهٗ لِطِيْبِهٖ وَلِاَنَّهٗ عُنْوَانٌ بِشَهَادَتِهٖ فِي الْآخِرَةِ، وَلَيْسَ عَلَى النَّبِيِّ ﷺمَا يَكْرُهُ إِزَالَتُهٗ عَنْهُ فَافْتَرَقَا، انْتَهٰى،وَأُجِيْبَ بِاَنَّ الْمَقْصُوْدَ مِنَ الصَّلَاةِ عَلَيْهِ عَوْدُ التَّشْرِيْفِ عَلَى الْمُسْلِمِيْنَ مَعَ أَنَّ الْكَامِلَ يَقْبَلُ زِيَادَةَ التَّكْمِيلِ]]‘‘۔
ترجمہ:’’اس کا ظاہر یہی ہے کہ حضور صلی اللہ علیہ وسلم پر صلوٰۃ سے مراد وہی ہے جو ایک جماعت کا مذہب ہے کہ حضور اقدس کے خصائص سے ہے کہ آپصلی اللہ علیہ وسلم کی نمازِ جنازہ بالکل نہ پڑھی گئی۔ پس یہ ہوا کہ لوگ داخل ہوتے اور دعا کر کے جدا ہوجاتے۔ باجی نے فرمایا: اس کی ایک وجہ ہے، وہ یہ کہ سرکار ہر شہید سے افضل ہیں اور شہید کو اس قدر فضیلت حاصل ہے کہ اس کی نمازِ جنازہ کی ضرورت نہیں ۔ رہا یہ کہ غسل کے بارے میں سرکار کا معاملہ شہید سے الگ رہا تو اس کی وجہ یہ ہے کہ شہید کو غسل اس لیے نہیں دیا جاتا کہ اس پر جو خون لگا ہے، وہ زائل ہوجائے گا جب کہ اس کی پاکیزگی کے باعث اس کا باقی رہنا مطلوب ہے اور اس لیے بھی کہ آخرت میں وہ اس کی شہادت کا نشان ہوگااور نبی اکرم صلی اللہ علیہ وسلم کے جسم پر ایسی کوئی چیز نہیں جسے زائل کرنا پسندیدہ  ہو، اس لیے یہ حکم الگ الگ ‘‘۔ پھر اس کا جواب نقل کیا کہ حضور اقدس صلی اللہ علیہ وسلم کی نماز جنازہ پڑھنے کا مقصد یہ ہے کہ مسلمانوں کو شرف حاصل ہو،`
},
{
  pageNumber: 246,
  text: `مزیدیہ کہ کامل تکمیل کو قبول کرتا ہے (کیونکہ اللہ تعالیٰ کی بارگاہ میں مراتب کمال لا متناہی ہیں)،(شرح الزرقانی علی المؤطا،ج:۲،ص:۹۴)،(فتاویٰ رضویہ، ج:۹،ص: ۲۸۴۔۲۸۷، ملخصاًوملتقطاً، رضا فائونڈیشن لاہور)‘‘۔
نوٹ: اصل کتاب میں ’’[[arabic: یَدْعُوْنَ وَیَفْتَرِقُوْنَ]]‘‘ کی جگہ ’’[[arabic: یَدْعُوْنَ وَیُصَدِّقُوْنَ]]‘‘ ہے۔
	بعض بددین لوگ تعریض کرتے ہیں کہ ادھر رسول اللہ صلی اللہ علیہ وسلم کا جنازہ رکھاہواتھا اوریہ لوگ اُمورِ خلافت طے کرنے میں مصروف تھے ،ایسے لوگوں کو معلوم ہونا چاہیے کہ اُس وقت دین کاسب سے ترجیحی مسئلہ خلیفہ کاانتخاب تھا، کیونکہ خلیفہ ہی کو اُمت کے نظمِ اجتماعی کے معاملات کو لے کر آگے چلنا تھا ،آج بھی دنیا بھر کی  ملتوں اور قوموں کا نظمِ اجتماعی تسلسل کا تقاضا کرتاہے اور مذہب کے امتیاز کے بغیر یہ شعار آج بھی دنیا کی تمام ملتوں اور قوموں میں رائج ہے کہ اگر وقت کا بادشاہ یا سربراہِ مملکت اپنے عہدِ اقتدار میں فوت ہوجائے ، تو اس کی آخری رسوم ادا کرنے سے پہلے اس کے عارضی یا مستقل جانشین کا انتخاب کیا جاتا ہے اور پھر اُسی کی سربراہی میں آخری رسوم ادا کی جاتی ہیں ۔چونکہ رسول اللہ صلی اللہ علیہ وسلم کی مِن جملہ حیثیات میں سے ایک یہ تھی کہ آپ اُس وقت کی اسلامی ریاست اور نظمِ اجتماعی کے حاکمِ اعلیٰ تھے، لہٰذا نظمِ اجتماعی کے تسلسل کے لیے لازم تھا کہ پہلے آپ کے جانشین کا انتخاب ہوتا اور نظمِ اجتماعی کے امور ،جس میں آپ کا جنازہ وتدفین شامل ہے، وہی آپ کا نائب قرار پاتا، پس جب حضرت ابوبکر صدیق رضی اللہ عنہ خلیفہ منتخب ہوگئے تو وہ آپ کے شرعی ولی مقرر ہوگئے ،امام ِ اہلسنت مجدد دین وملت امام احمد رضا قادری محدثِ بریلی قُدِّسَ سِرُّہُ الْعَزِیْزکا موقف یہی ہے۔ 
	رسول اللہ صلی اللہ علیہ وسلم کے مُحِبّ صادق علامہ محمد بن یوسف الصالحی الشامی نے اپنی سیرت کی کتاب ’’سُبُلُ الْھُدیٰ وَالرّشَاد‘‘ میں باب باندھاہے:
’’[[arabic: جِمَاعُ اَبْوَابِ مَرَضِ رَسُول اللّٰہِ وَوَفَاتِہٖ]]‘‘ اورامام بخاری نے باب باندھا :’’[[arabic: بَابُ وَفَاۃ النَّبِی ﷺ ]]‘ ‘، احادیثِ مبارکہ میں آپ صلی اللہ علیہ وسلم کے  وصالِ مبارک کے لیے`
},
{
  pageNumber: 247,
  text: `’’[[arabic: تُوَفِّیَ رَسُول اللّٰہِ ﷺ ]]‘‘ (یعنی آپ صلی اللہ علیہ وسلم کی وفات ہوئی) کے کلمات آئے ہیں،(صحیح بخاری:1399)۔ سَیِّدُالْمُرْسَلِیْن رَحْمَۃ لِلْعٰلَمِیْن سَیِّدُنَامُحَمَّدٌ رَّسُوْلُ اللّٰہ صلی اللہ علیہ وسلم کے وصال مبارک کے بعد دیگر احکام شرعی بھی جاری ہوئے مثلاً:غسلِ مبارک ،کفن پہنانا،قبرانور میں تدفین وغیرہ اور منہاج نبوت پر اُمّت کے نظمِ اجتماعی کے اُمور چلانے کے لیے خلافت وامارت کا نظام قائم کیاجانا وغیرہ ۔الغرض اکابر اُمّت سے دونوں طرح کی روایات ثابت ہیں ،اسے باعثِ نزاع نہیں بنانا چاہیے ،ہماری نظر میں چونکہ ظاہری علامات کے اعتبار سے رسول اللہ صلی اللہ علیہ وسلم نے وصال فرمایااور نماز جنازہ اسلام کا شِعار ہے ،اس لیے آپ صلی اللہ علیہ وسلم کی نماز جنازہ پڑھے جانے کا قول راجح ہے، لیکن اس میں بھی دعائے مغفرت شامل نہیں ہے ، آپ صلی اللہ علیہ وسلم پر صلوٰۃ وسلام کو جنازہ کے قائم مقام سمجھتے ہیں،اُس کی بابت بھی روایات موجود ہیں ،فریقین کو ایک دوسرے پر طعن نہیں کرنا چاہیے ، نہ یہ سمجھنا چاہیے کہ معروف نمازِ جنازہ کا قائل مسلک سے خارج ہوجاتاہے ۔
علامہ غلام رسول سعیدی رحمۃ اللہ علیہ لکھتے ہیں:
علامہ نووی لکھتے ہیں:’’قاضی عیاض نے فرمایا: امام مسلم نے رسول اللہ صلی اللہ علیہ وسلم کے کفن اور آپ کی قبر کے بارے میں احادیث ذکر کی ہیں اور آپ کے غسل اور نماز جنازہ کے بارے میں احادیث ذکر نہیں کیں۔ آپ کے غسل کے بارے میں سب اس بات پر متفق ہیں کہ آپ کو غسل دیا گیا اور نماز جنازہ پڑھے جانے میں اختلاف ہے۔ بعض علماء نے کہا: آپ کی نماز جنازہ بالکل نہیں پڑھی گئی ،لوگ فرداً فرداًجاکر دعا کر کے لوٹ آتے تھے اور اس کی وجہ میں پھر اختلاف ہے۔ بعض علماء نے کہا: آپ اپنی فضیلت کی وجہ سے نماز سے مستغنی تھے، لیکن یہ صحیح نہیں ہے، کیونکہ اگر ایسا ہوتا تو پھر آپ کو غسل بھی نہیں دیا جاتا۔ بعض نے کہا: اس وقت کوئی امام مقرر نہیں تھا اور یہ بھی غلط ہے، کیونکہ نمازیں پڑھی جاتی تھیں اور نماز باجماعت معطل نہیں ہوئی تھی اور حضرت ابوبکر کی بیعت آپ کے دفن سے پہلے مکمل ہوچکی تھی اور حضرت ابوبکر دفن سے پہلے مسلمانوں کے امام اور خلیفہ مقرر ہوچکے تھے، صحیح نظریہ`
},
{
  pageNumber: 248,
  text: `جس پر جمہور قائم ہیں، وہ یہ ہے کہ آپ کی نمازِ جنازہ فرداً فرداً پڑھی گئی۔ ایک جماعت جاتی اور سب اکیلے اکیلے نماز جنازہ پڑھتے ،پھر وہ جماعت باہر آجاتی اور دوسری جماعت چلی جاتی ۔ مردوں کے بعد عورتوں نے نماز جنازہ پڑھی، پھر بچوں نے پڑھی۔ رسول اللہ صلی اللہ علیہ وسلم کے دفن کو پیر سے بدھ تک مؤخر کرنے میں حکمت یہ تھی کہ بیعت مکمل ہوجائے اور مسلمانوں کا ایک امیر منتخب ہوجائے تاکہ کسی نزاع اور اختلاف کے وقت اس کی اطاعت کی جاسکے،(شرح صحیح مسلم،ج:۱،ص:۳۱۲، نور محمد اصح المطابع کراچی)‘‘۔
	رسول اللہ صلی اللہ علیہ وسلم کی جنازہ کے متعلق اس سے پہلے ہم علامہ شمس الدین سرخسی کی طویل عبارت بھی نقل کر چکے ہیں، جس طرح قاضی عیاض اور علامہ نووی نے فرمایا: جمہور کا یہ نظریہ ہے کہ آپ صلی اللہ علیہ وسلم کی نمازِ جنازہ پڑھی گئی ہے۔ شمائل ترمذی میں امام ترمذی نے اپنی سند کے ساتھ حدیث ذکر کی ہے کہ آپ کی نمازِ جنازہ میں تکبیرات، ثنا اور درود شریف کو پڑھا گیا، (شرح صحیح مسلم، ج:۲،ص: ۸۱۳۔۸۱۲، فرید بک اسٹال لاہور)‘‘۔ 
خلاصۂ کلام :  سیدالمرسلین سیدنا محمد رسول اللہ صلی اللہ علیہ وسلم پر نمازِ جنازہ کے حوالے سے سَلف سے خلف تک اکابرِ امت کی دو آراہیں :(1) آپ کا جنازہ گروہ در گروہ اور فرداً فرداً معروف طریقے سے پڑھا گیا ، لیکن اس کے آخر میں ’’[[arabic: اَللّٰہُمَّ اغْفِرْ لِحَیِّنَاوَمَیِّتِنَا]]‘‘والی دعا شامل نہیں تھی، بلکہ آپ کے فضائل مبارکہ اور شانِ رفیع کا ذکرتھا۔ (2)سب گروہ در گروہ یا فرداً فرداً آتے اور آپ کی خدمت میں صلوٰۃ وسلام عرض کرتے ،آپ کی دعوت وابلاغِ دین کی تصدیق کرتے ، آپ پر نازل کردہ کلامِ الٰہی اور وحیِ ربانی پر ایمان لانے کا اقرار کرتے اور آخرت میں آپ کے ساتھ جمع ہونے کی دعا کرتے۔ان دونوں میں سے کسی بھی رائے کو اختیار کرنے میں کوئی شرعی خرابی لازم نہیں آتی اور امام اہلسنت نے معروف نمازِ جنازہ والی رائے پر کوئی نکیر نہیں فرمائی، لہٰذا اپنے دلائل سے کوئی کسی رائے کو ترجیح دے ،تو شریعت میں اس کی گنجائش ہے۔
	 (3)مندرجہ بالا دونوں صورتوں میں امام کوئی نہیں تھا، کیونکہ صحابہ نے چاہا کہ سب کو یہ سعادت حاصل ہو اور کسی کا اختصاص نہ رہے ، (4)جب حضرت ابوبکر صدیق رضی اللہ تعالیٰ عنہ آپ`
},
{
  pageNumber: 249,
  text: `صلی اللہ علیہ وسلم کے جانشین اور خلیفۂ اول منتخب ہوچکے اور صحابۂ کرام نے اُن کی بیعتِ عام کرلی ، تو وہ آپ کے شرعی ولی قرار پائے ،اس لیے اُن کے بعد نمازِ جنازہ یا صلوٰۃ وسلام عرض کرنے کا سلسلہ موقوف کردیا گیا اور آپ کی تدفین مبارک کردی گئی۔ 
	مندرجہ بالا عبارات میں یہ بحث آئی ہے کہ آپ صلی اللہ علیہ وسلم کا جنازہ معروف طریقے سے پڑھا گیا یا صحابۂ کرام گروہ در گروہ اور فرداً فرداً آتے اور صلوٰۃ وسلام عرض کر کے اور آپ کے فضائل بیان کرکے چلے جاتے۔ یہاں ’’معروف طریقے ‘‘سے یہ مراد نہیں ہے کہ جسدِ انور سامنے رکھا گیا ، ایک شخص امام بنااور باقی صف در صف مقتدی بنے اورمسنون طریقے سے نمازِ جنازہ پڑھی گئی ۔ بلکہ اس بحث کا مطلب یہ ہے کہ آیا اسے جنازے کا نام دیا جائے یا محض صلوٰۃ وسلام پیش کرنے کا، اس میں دو آراء ہیں ۔ورنہ بہارِ شریعت میں متعدد دعائیں مذکور ہیںاور بچوں کے لیے الگ دعا ہے،اس میں کسی کا اختلاف نہیں کہ یہ عصرِحاضر کی طرح معروف اور معتاد جنازہ نہ تھا، ہماری رائے میں امامِ اہلسنت کا یہ قول ’’جنازہ معروف طریقہ سے نہ ہوا‘‘، اسی مفہوم کا حامل ہے۔ 

[[heading: میت کی مسہری پر پرچم رکھنا]] 
سوال:
	 ہمارے ملک میں یہ رواج بن گیا ہے کہ جب کسی سیاسی پارٹی کا بڑا شخص مرتا ہے یا شہید ہو جاتا ہے تو سیاسی پارٹی والے میت کی مسہری  اور قبر پر اُس پارٹی کا جھنڈاڈال دیتے ہیں ، اسی طرح شہید ہونے والے فوجیوں کی مسہری کو قومی پرچم میں لپیٹا جاتاہے، یہ عمل کہاں تک درست یا غلط ہے،اگر غلط ہے تو ملک کے جھنڈے کہاں تک درست ہیں ؟، (اسلم خان ترین ، ڈسٹرکٹ ہرنائی )۔ 
جواب:
	اس رواج کی کوئی شرعی حیثیت نہیں ہے اور شریعت میں کسی مقام پر اس کی ممانعت بھی نہیں آئی ہے، اس میں دینی برکت کا کوئی عنصر شامل نہیں ہے ،ہوسکتاہے کہ میت کو قبر میں رکھتے`
},
{
  pageNumber: 250,
  text: `وقت پرچم اتار لیتے ہوں ۔ فوجی شہداء کی تکریم کے طورپر بھی ان کے تابوت کے اوپر قومی پرچم لپیٹاہوتاہے ،یہ شہید کی تکریم کا ایک دنیاوی شِعار ہے،جیسے قومی ترانہ کھڑے ہوکر سننا،لیکن شہید کی میت کو قبر میں رکھتے وقت قومی پرچم اتار لیا جاتا ہے ، اس کی شریعت میں نہ کوئی حیثیت ہے اورنہ ہی اس کی ممانعت ہے۔ جب ہم کسی چیز کے بارے میں کہتے ہیں کہ اس کی کوئی شرعی حیثیت نہیں ہے ،تو اس کا مطلب یہ ہوتاہے کہ اس پر کوئی اُخروی اجر وثواب مرتب نہیں ہوتا ۔یہ جدید دنیا میں شہید کو اکرام کے ساتھ رخصت کرنے کا ایک شعار ہے، جنازے یاقبر پرفوجی سلامی کی بھی یہی حیثیت ہے۔البتہ بطور تبرُّک کسی بزرگ سے منسوب کسی شے کو میت سے لاحق کرنا شرعاً جائز ہے ۔ حدیث پاک میں رسول اللہ صلی اللہ علیہ وسلم کا رئیس المنافقین عبداللہ ابن ابی کے بیٹے کی درخواست پر اُس کے کفن کے لیے اپنی قمیص دینا ثابت ہے :
’’[[arabic: عَنِ ابْنِ عُمَرَ رَضِیَ اللَّہُ عَنْہُمَا:أَنَّ عَبْدَ اللّٰہِ بْنَ أُبَیٍّ لَمَّا تُوُفِّیَ،جَاءَ ابْنُہٗ إِلَی النَّبِیِّ ﷺ، فَقَالَ:یَا رَسُوْلَ اللّٰہِ! أَعْطِنِیْ قَمِیْصَکَ أُکَفِّنْہٗ فِیْہِ وَصَلِّ عَلَیْہِ وَاسْتَغْفِرْ لَہٗ فَاَعْطَاہُ النَّبِیُّ ﷺقَمِیْصَہٗ]]‘‘۔
ترجمہ:’’ حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں: جب عبداللہ بن اُبَیّ فوت ہوا تو اس کا بیٹا(عبداللہ بن عبداللہ) رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور عرض کی : یارسول اللہ ! آپ مجھے اپنی قمیص مبارک عطا فرمایئے تاکہ میں اس میں اپنے والد کو کفن دوں اور اُس کی نمازِ جنازہ پڑھایئے اور اُس کے لیے مغفرت کی دعا فرمایئے ،پس رسول اللہ صلی اللہ علیہ وسلم نے اُسے اپنی قمیص عنایت فرمائی،(صحیح بخاری :1269)‘‘۔
(۱)’’[[arabic: عَنْ سَہْلٍ رَضِیَ اللّٰہُ عَنْہُ:أَنَّ امْرَأَۃً جَاءَتِ النَّبِیَّ ﷺبِبُرْدَۃٍ مَنْسُوجَۃٍ، فِیہَاحَاشِیَتُہَا،اَتَدْرُونَ مَاالْبُرْدَۃُ،قَالُوا:اَلشَّمْلَۃُ،قَالَ:نَعَمْ،قَالَتْ:نَسَجْتُہَا بِیَدِی فَجِئْتُ لِاَکْسُوَکَہَا،فَاَخَذَہَا النَّبِیُّ ﷺمُحْتَاجًا إِلَیْہَا،فَخَرَجَ إِلَیْنَاوَإِنَّہَا إِزَارُہٗ، فَحَسَّنَہَا فُلاَنٌ،فَقَالَ:اکْسُنِیْہَا،مَا أَحْسَنَہَا،قَالَ الْقَوْمُ :مَا أَحْسَنْتَ،لَبِسَہَا النَّبِیُّ ﷺمُحْتَاجًا إِلَیْہَا،ثُمَّ سَاَلْتَہٗ،وَعَلِمْتَ أَنَّہٗ لاَ یَرُدُّ، قَالَ :إِنِّی وَاللّٰہِ،مَا سَاَلْتُہٗ لِاَلْبَسَہٗ،إِنَّمَاسَاَلْتُہٗ لِتَکُونَ کَفَنِی،قَالَ سَہْلٌ : فَکَانَتْ کَفَنَہٗ]]‘‘۔
ترجمہ:’’ حضرت سہل  رضی اللہ عنہ بیان کرتے ہیں : ایک عورت نبی کریم صلی اللہ علیہ وسلم کی خدمت میں خوبصورت بُنی ہوئی حاشیہ والی چادر لائی، تمہیں معلوم ہے کہ بُردہ کسے کہتے ہیں، انہوں نے`
},
{
  pageNumber: 251,
  text: `جواب دیا :وہ بڑی چادرہے، کہا: ہاں، اُس عورت نے عرض کی: میں نے خود یہ چادر بُنی ہے، تاکہ آپ کو پہناؤں، نبی صلی اللہ علیہ وسلم نے یہ چادر لے لی ،ا س وقت آپ کو اس کی ضرورت بھی تھی ،آپ ہمارے پاس وہ چادر پہن کر آئے ،(اُنہوں نے نام لے کر کہا): فلاںشخص کہنے لگا : یہ کتنی اچھی چادر ہے،یہ آپ مجھے عطا فرما دیجیے۔ اس پر حاضرین نے اُسے کہا:تو نے اچھا نہیں کیا،اس چادر کو نبی صلی اللہ علیہ وسلم نے پہناتھا اور اس وقت آپ کو اس کی ضرورت تھی، پھر تم نے اس کو مانگ لیا اورتم کو معلوم ہے کہ آپ صلی اللہ علیہ وسلم سوال کو رَد نہیں فرماتے ، اُس شخص نے کہا: اللہ کی قسم! میں نے اسے پہننے کے لیے نہیں اپنے کفن کے لیے طلب کیا ہے۔حضرت سہلرضی اللہ عنہ نے فرمایا : وہ چادر مبارک اس شخص کا کفن بنی،(صحیح بخاری: 1277) ‘‘ ۔
(۲)’’[[arabic: عَنْ أُمِّ عَطِیَّۃَ،قَالَتْ:تُوُفِّیَتْ بِنْتُ النَّبِیِّ ﷺ،فَقَالَ لَنَا:اغْسِلْنَہَا ثَلاَثًا، اَوْخَمْسًا اَوْ اَکْثَرَ مِنْ ذٰلِکَ،إِنْ رَأَیْتُنَّ،فَإِذَافَرَغْتُنَّ فَاٰذِنَّنِیْ،فَلَمَّا فَرَغْنَا اٰذَنَّاہُ فَنَزَعَ مِنْ حَقْوِہِ إِزَارَہٗ،وَقَالَ :أَشْعِرْنَہَا إِیَّاہٗ]]‘‘۔
ترجمہ:’’ حضرت ام عطیہ رضی اللہ عنہا بیان کرتی ہیں: نبی صلی اللہ علیہ وسلم کی صاحبزادی فوت ہوگئیں ، پس آپ نے ہم سے فرمایا: ان کو تین مرتبہ غسل دویا پانچ مرتبہ یااگر تم چاہو تو  اس سے زیادہ مرتبہ دو،پھر جب تم فارغ ہوجاؤ تومجھے مطلع کرنا،پھرجب ہم فارغ ہوگئیں توہم نے آپ کو مطلع کیا،آپ نے اپنا تہبند اتار کر ہمیں دیا اورفرمایا: اس کو اُن کے جسم سے ملادینا ، (صحیح بخاری: 1257)‘‘۔
(۳)امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْز لکھتے ہیں : ابونعیم نے معرفۃ الصحابہ اور دیلمی نے مسند الفردوس میں بسند حسن حضرت عبداﷲبن عباسرضی اللہ عنہما سے روایت کی  :
’’[[arabic: لَمَامَاتَتْ فَاطِمَۃُ اُمُّ عَلِیٍّ رَضِیَ اﷲُعَنْھَا،خَلَع رَسُوْلُ اﷲِ ﷺ قَمِیْصَہٗ وَاَلبَسَھَا]]`
},
{
  pageNumber: 252,
  text: `[[arabic: اِیَّاہُ،وَاضْطَجَعَ فِی قَبْرِھَا،فَلَمَّاسَوّٰی عَلَیْھَاالتُّرَابَ،قَالَ بَعْضُھُمْ:یَارَسُوْلَ اﷲِ! رَأَیْنَاکَ  صَنَعْتَ شَیْئًالَمْ تَصْنَعْہُ بِاَحَدٍ،فَقَالَ :اِنِّی اَلْبَسْتُھَا قَمِیْصِیْ لِتَلَبُّسٍ مِّنْ ثِیَابِ الْجَنَّۃِ وَاضْطَجَعتُ مَعَھَا فِی قَبْرِھَا لِاُخَفِّفَ عَنْھَا مِنْ ضَغْطَۃِ الْقَبْرِ،اَنَّھَاکَانَتْ اَحْسَنَ خَلْقِ اﷲِ صَنِیْعًا اِلَیّ بَعدَ أَبِی طَالِبٍ]]‘‘۔ 
ترجمہ:’’جب حضرت علی  کَرَّمَ اللہُ وَجْہَہ  کی والدہ ماجدہ حضرت فاطمہ بنت اسد رضی اللہ عنہا کا انتقال ہوا،تو رسول اﷲصلی اللہ علیہ وسلم نے اپنا کُرتا اتار کر انہیں پہنایا اور اُن کی قبر(متبرک کرنے کے لیے اس ) میں لیٹے، جب قبر پر مٹی برابر کردی گئی، تو کسی نے عرض کی:یارسول اﷲ!آج ہم نے آپ کوایسا عمل کرتے دیکھا، جوآپ صلی اللہ علیہ وسلم نے (پہلے) کسی کے ساتھ نہیں کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں میں نے اپنا کُرتا اس لیے پہنایا کہ یہ جنت کے کپڑے پہنے اور ان کی قبر میں اس لیے لیٹا تاکہ قبر کے دبانے میں ان سے تخفیف کروں، یہ ابوطالب کے بعد خلقِ خدا میں سب سے زیادہ میرے ساتھ نیک سلوک کرنے والی تھیں‘‘۔ مزید لکھتے ہیں: امام ابو عمر یوسف بن عبدالبر کتاب الاستیعاب فی معرفۃ الاصحاب میں فرماتے ہیں :
حضرت امیر معاویہ رضی اللہ عنہ نے اپنے انتقال کے وقت وصیت میں فرمایا  :
’’[[arabic: اِنِّی صَحِبْتُ رَسُوْلَ اﷲِ ﷺ فَخَرَجَ لِحَاجَۃٍ فَاَتْبَعْتُہٗ بِاِدَاوَۃٍ فَکَسَانِیْ اَحَدَ ثَوبَیْہِ الَّذِیْ یَلِیْ جَسَدَہٗ فَخَبَأتُہٗ لِھٰذَا الْیَوْمِ،وَاَخَذَرَسُوْلُ اﷲِ ﷺ مِنْ اَظفَارِہٖ وَشَعْرِہٖ ذَاتَ یَومٍ فَاَخَذْتُہٗ،فَخَبَاْتُہٗ،لِہٰذَا الْیَوْمِ فَاِذَا اَنَامِتُّ فَاجْعَلْ ذٰلِکَ الْقَمِیْصَ دُوْنَ کَفَنِیْ مِمَّایَلِیْ جَسَدِیْ وَخُذْ ذٰلِکَ الشَّعْرَ وَالْاَظفَارَ فَاجْعَلْہٗ فِی فَمِیْ وَعَلٰی عَیْنِی وَمَوَاضِعَ السُّجُوْدِ مِنِّی]]‘‘۔ 
ترجمہ:’’میں رسول اللہ صلی اللہ علیہ وسلم کی صحبت سے شرف یاب ہوا، ایک دن نبی کریمصلی اللہ علیہ وسلم حاجت کے لیے تشریف فرما ہوئے، میں لوٹا لے کر ہمراہ رکاب سعادت مآب ہوا۔ حضور پُرنور صلی اللہ علیہ وسلم نے اپنے جوڑے سے کُرتا کہ بدنِ اقدس سے متصل تھا ،مجھے انعام فرمایا، وہ کُرتا میں نے آج کے لیے چھپا رکھا تھااور ایک روزنبی صلی اللہ علیہ وسلم نے ناخن و مُوئے مبارک`
},
{
  pageNumber: 253,
  text: `تراشے وہ میں نے لے کر اس دن کے لیے اٹھا رکھے، جب میں مرجاؤں تو قمیص سراپا تقدیس کو میرے کفن کے نیچے بدن کے متصل رکھنااورموئے مبارک اور پاکیزہ ناخنوں کو میرے منہ اور آنکھوں اور اعضائے سجدہ (پیشانی اورناک وغیرہ) پر رکھ دینا ، (فتاویٰ رضویہ ،جلد9،ص:115)‘‘۔

[[heading: زوال کے وقت نمازِ جنازہ پڑھنا]] 
سوال:
	 ایک جنازہ جس کا وقت11بجے مقررتھا ،جگہ کی تبدیلی کہ وجہ سے 11:20پر پہنچا اور 11:35پر اداکیاگیا ،اس دن زوال کا وقت 11:22 تا11:55تھا ،کیا جنازہ اداہوگیا؟۔اس کے علاوہ دو جنازے ایسے تھے ،جن کا وقت ہی 11:30رکھاگیااور اسی وقت اداکیے گئے ،کیا زوال کے وقت پڑھی گئی نمازِ جنازہ واجب الاعادہ ہے،(محمد شفیق ، چکوال)۔
جواب:
	حدیث پاک میں نمازِ جنازہ اور تدفین میں جلدی کرنے کا حکم دیاگیا ،احادیث ِ مبارکہ میں ہے:
(۱)’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَرَضِیَ اللّٰہُ عَنْہُ عَنِ النَّبِیّ ﷺ قَالَ :أَسْرِعُوْابِالْجَنَازَۃِ، فَإِنْ تَکُ صَالِحَۃً فَخَیْرٌ تُقَدِّمُوْنَہَاإِلَیْہِ،وَإِنْ تَکُ سِوٰی ذٰلِکَ فَشَرٌّ تَضَعُوْنَہٗ عَنْ رِقَابِکُمْ ]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی صلی اللہ علیہ وسلم نے فرمایا: جنازہ کو جلدی لے جاؤ،پس اگر وہ نیک ہے تو تم اس کوبھلائی کی طرف جلدی پہنچا رہے ہو اور اگر وہ اس کے سوا (یعنی بدکار) ہے توتم شر کو اپنی گردنوں سے اتار رہے ہو ،(صحیح بخاری: 1315)‘‘۔
(۲)	’’[[arabic: عَنْ عَلِیِّ بْنِ أَبِی طَالِبٍ أَنَّ رَسُوْلَ اللّٰہِ ﷺقَالَ :لَا تُؤَخِّرُوا الْجِنَازَۃَ إِذَا حَضَرَتْ]]‘‘۔
ترجمہ:’’حضرت علی بن ابوطالب بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب`
},
{
  pageNumber: 254,
  text: `جنازہ حاضر ہوتو (نمازِ جنازہ میں) تاخیر نہ کرو ،(سُنن ابن ماجہ: 1486)‘‘۔
(۳)	’’[[arabic: عَنْ عَلِیِّ بْنِ أَبِی طَالِبٍ،أَنَّ رَسُوْلَ اللّٰہِ ﷺقَالَ لَہُ :یَا عَلِیُّ!ثَلاَثٌ لاَ تُؤَخِّرْہَا:اَلصَّلاَۃُ إِذَا أَتَتْ،وَالْجَنَازَۃُ إِذَا حَضَرَتْ، وَالْاَیِّمُ إِذَا وَجَدْتَ لَہَا کُفْئًا]]‘‘۔
ترجمہ:’’حضرت علی بن ابوطالب بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے اُن سے فرمایا:اے علی ! تین کاموں میں تاخیر نہ کرو :نماز کی ادائیگی جب نماز کا وقت آجائے ، جنازہ جب حاضر ہو ،بے شوہرعورت(خواہ کنواری ہو یا بیوہ یا مطلّقہ)  کے لیے جب اُس کا کفو مل جائے ،(سُنن ترمذی: 1075)‘‘۔
	نمازِ جنازہ ہر وقت مشروع ہے یہاں تک کہ اوقاتِ مکروہہ میں بھی، اگرجنازہ اُسی وقت آیا ہو،صاحبِ ہدایہ مُتوفّٰی593؁ھ فرماتے ہیں:
’’[[arabic: لَا تَجُوْزُ الصَّلَاۃُ عِنْدَ طُلُوْعِ الشَّمْسِ وَلَاعِنْدَ قیَامِہَا فِی الظَّہِیْرَۃِ وَلَاعِنْدَ غُرُوْبِہَا لِحَدِیْثِ عُقْبَۃَ بْنِ عَامِرٍ رَضِیَ اللّٰہ عَنْہُ، قَالَ :ثَلَاثَۃُ أَوْقَاتٍ نَہَانَارَسُوْلُ اللّٰہِ عَلَیْہِ الصَّلَاۃُ وَالسَّلَامُ أَنْ نُّصَلِّیَ فِیْہَاوَأَنْ نَقْبِرَ فِیْہَامَوْتَانَاعِنْدَطُلُوْعِ الشَّمْسِ حَتّٰی تَرتَفِعَ وَعِنْدَ زَوَالِہَا حَتّٰی تَزُوْلَ وَحِیْنَ تَضِیْفُ لِلْغُرُوْبِ حَتّٰی تَغْرُبَ وَالْمُرَادُ بِقَوْلِہٖ وَأَنْ نَّقْبِرَصَلَاۃُ الْجَنَازَۃِ لاَنَّ الدَّفْنَ غَیْرُ مَکْرُوْہٍ]]‘‘۔
ترجمہ:’’ طلوعِ شمس ،غروبِ شمس اور نصف النہار کے اوقات میں نمازِ جنازہ پڑھنا مکروہ ہے ،کیونکہ عقبہ بن عامر کی روایت میں ہے : رسول اللہ صلی اللہ علیہ وسلم نے ان تین (مکروہ) اوقات میں نمازپڑھنے اور دفن کرنے سے منع فرمایا ہے، وہ یہ ہیں:طلوعِ شمس کے وقت یہاں تک کہ سورج بلند ہوجائے اور زوال کے وقت یہاں تک کہ زائل ہوجائے اور جب آفتاب غروب ہونے لگے یہاں تک کہ بالکل غروب ہوجائے،مراد یہ ہے کہ ان اوقات میں نمازِ جنازہ مکروہ ہے ،دفن کرنا مکروہ نہیں ہے‘‘۔۔۔نیز لکھتے ہیں:
’’[[arabic: وَلَاصَلَاۃُ جَنَازَۃٍ لِمَا رَوَیْنَا وَلَا سَجْدَۃُ تِلَاوَۃٍ لاَِنَّہَا فِیْ مَعْنَی الصَّلَاۃِ،وَالْمُرَادُ بِالنَّفْیِ الْمَذْکُوْرِ فِی صَلاَۃِ الْجَنَازَۃِ وَسَجَدَۃِ التِّلَاوَۃِ الْکَرَاہَۃُ حَتّٰی لَوْصَلَّاہَافِیْہِ أَوْ تَلَا فِیْہِ آیَۃَ السَّجْدَۃِ فَسَجَدَہَا،جَازَلاَِنَّہَا أُدِّیتْ نَاقِصۃً کَمَا وَجَبَتْ إِذِ الْوُجُوْبُ بِحُضُوْرِ]]`
},
{
  pageNumber: 255,
  text: `[[arabic: الْجَنَازَۃِ وَالتِّلَاوَۃِ]]‘‘۔
یعنی قدوری کی عبارت میں نماز جنازہ اور سجدہ تلاوت کے حوالے سے جو جواز کی نفی کی گئی ہے ،اس کا مطلب یہ نہیں کہ ان اوقات میں اصلاً نماز جنازہ اور سجدہ تلاوت کا انعقاد نہیں ہوگاجیسا کہ باقی فرائض منعقد نہیں ہوتے ،بلکہ اس کا مطلب یہ ہے کہ نماز جنازہ اور سجدہ صحیح تو ہوگا مگر کراہیت کے ساتھ، یعنی عدم جوازسے مکروہ ہونا مراد ہے ، کیونکہ ناقص وقت میں یہ واجب ہوئے اور اسی وقت میں ادا کردیے گئے۔
چنانچہ علامہ محمود بابرتی حنفی مُتوفّٰی 786؁ھ صاحبِ ہدایہ کی عبارت کی تشریح کرتے ہوئے فرماتے ہیں:
’’[[arabic: (وَالْمُرَادُ بِالنَّفْیِ الْمَذْکُوْرِ فِیْ صَلَاۃِ الْجنَازَۃِ)یَعْنِیْ أَنَّ الْمُرَادَ بِالنَّفْیِ الْمَذْکُوْرِفِی صَلَاۃِ الْجِنَازَۃِ وَسَجْدَۃِ التِّلَاوَۃِ بِقَوْلِہٖ:وَلَا صَلَاۃُ جنَازَۃٍ وَلَا سَجْدَۃُ تِلَاوَۃٍ ہُوَ الْکَرَاہِیَۃُ، یَعْنِی بِہٖ نَفْیَ عَدَمِ الْجَوَازِ،بِخِلَافِ الْفَرَائِضِ فِی ہٰذِہِ الْاَوْقَاتِ الثَّلَاثَۃِ سِوٰی عَصْرِ یَوْمِہٖ،فَإِنَّ قَوْلَہٗ لَا تَجُوْزُ الصَّلَاۃُ عِنْدَ طُلُوْعِ الشَّمْسِ إلٰی آخِرِہٖ مُجْرًی عَلٰی حَقِیْقَۃِ عَدَمِ الْجَوَازِ،(العنایہ شرح الھدایہ،ج1ص235۔236)]]‘‘۔
ترجمہ:مکروہ اوقات میں نمازِ جنازہ اور سجدۂ تلاوت کی نفی سے مراد کراہت ہے ، بخلاف فرائض کے کہ ان اوقات میں ان کا پڑھنا جائز نہیں ہے ،سوا اس کے کہ اُس دن کی عصر کی نماز کراہت سے خالی وقت میں نہ پڑھی ہو تو (قضا کرنے کی بجائے)غروبِ آفتاب سے پہلے مکروہِ تحریمی وقت میں پڑھ لی جائے ، کیونکہ صاحبِ ہدایہ کی عبارت کا مطلب بھی یہی ہے کہ ان اوقات میں فرض نماز جائز نہیں ہے،(العنایہ شرح الہدایہ،ج1ص235۔236)‘‘۔
علامہ ابوبکر بن محمد الحدادی الحنفی مُتوفّٰی 800؁ھ لکھتے ہیں:
’’[[arabic: (قَوْلُہٗ: وَلَا یُصَلِّی عَلٰی جنَازَۃٍ وَلَا یَسْجُدُ لِتِلَاوَۃٍ) ہٰذَا إذَا وَجَبَتَا فِی وَقْتٍ مُبَاحٍ وَأُخِّرَتَا إلٰی ہٰذَا الْوَقْتِ فَإِنَّہٗ لَا یَجُوْزُ قَطْعًا أَمَّا لَوْ وَجَبَتَا فِی ہٰذَا الْوَقْتِ وَأُدِّیَتَا فِیْہِ جَازَ، لِأَنَّہَاأُدِّیَتْ نَاقِصَۃً کَمَا وَجَبَتْ،إذ الْوُجُوْبُ بِحُضُوْرِ الْجَنَازَۃِ وَالتِّلَاوَۃِ فَإِنْ قُلْتَ:مَا]]`
},
{
  pageNumber: 256,
  text: `[[arabic: الْاَفْضَلُ الْاَدَاءُ أَوِالتَّاْخِیْرُ إلٰی وَقْتٍ مُبَاحٍ،قُلْتُ:أَمَّا فِی صَلَاۃِ الْجَنَازَۃِ فَالْاَفْضَلُ الْاَدَاءُ لِقَوْلِہٖ عَلَیْہِ السَّلَامُ:عَجِّلُوْا بِمَوْتَاکُمْوَقَالَ:ثَلَاثٌ لَا یُؤَخَّرْنَ جنَازَۃٌ أَتَتْ وَدَیْنٌ وَجَدْت مَا تَقْضِیْہِ وَبِکْرٌ وُجِدَ لَہَا کُفْوٌ،وَأَمَّا فِیْ سَجْدَۃِ التِّلَاوَۃِ فَالْاَفْضَلُ التَّأخِیْرُ، لِأَنَّ وُجُوْبَہَا عَلَی التَّرَاخِیْ وَفِی الْہِدَایَۃِ: اَلْمُرَادُ بِالنَّہْیِ الْمَذْکُوْرِ فِیْ صَلَاۃِ الْجنَازَۃِ وَسَجْدَۃِ التِّلَاوَۃِ الْکَرَاہَۃُ حَتّٰی لَوْ صَلَّاہَا فِیْہِ أَوْ تَلَا سَجْدَۃً فِیْہِ وَسَجَدَہَا جَازَ، لِاَنَّہَا أُدِّیَتْ نَاقِصَۃً کَمَا وَجَبَتْ ]]‘‘۔
ترجمہ:’’ (ان اوقات میں )نہ نمازِ جنازہ پڑھے اور نہ سجدۂ تلاوت کرے، یہ مسئلہ اُس صورت میں ہے کہ یہ دونوں (نمازِ جنازہ اور سجدۂ تلاوت) مباح وقت میں واجب ہوئے ہوں اور انہیں وقتِ مکروہ تک مؤخر کیا گیا ہو، کیونکہ یہ صورت قطعاًجائز نہیں ہے ، لیکن اگر اُسی (مکروہ) وقت میں واجب ہوئے ہوں اور اُسی وقت ادا کردیے گئے ہوں ، تو جائز ہے، کیونکہ یہ ناقص وقت میں واجب ہوئے اور ناقص وقت میں ادا کردیے گئے، اس لیے کہ ان اوقات میں جنازے کے آجانے یا آیتِ سجدہ  پڑھے جانے کے سبب واجب ہوئے، اگر سوال کیا جائے کہ ایسی صورت میں افضل کیا ہے، آیا اُسی مکروہ وقت میں ادا کردیے جائیں یا مباح وقت تک مؤخر کردیے جائیں ، میں کہتا ہوں: نمازِ جنازہ کا تو اُسی وقت ادا کرنا افضل ہے، کیونکہ نبی صلی اللہ علیہ وسلم نے فرمایا: ’’اپنے مردوں کو قبر تک پہنچانے میں جلدی کرو‘‘اور آپ صلی اللہ علیہ وسلم نے فرمایا: ’’تین چیزوں میں تاخیر نہ کرو:ایک نمازِ جنازہ ،جبکہ جنازہ حاضر ہو، دوسرا قرض کہ اُس کی ادائیگی پر قادر ہوجائے اور کنواری عورت جبکہ اُس کے لیے ہمسر رشتہ مل جائے‘‘، لیکن سجدۂ تلاوت کو مباح وقت تک مؤخر کرنا افضل  ہے ، کیونکہ اس کی ادائیگی کے وجوب میں تاخیر کی گنجائش ہے اور ہدایہ میں ہے :نمازِ جنازہ اور سجدۂ تلاوت کی نہی سے مراد یہ ہے کہ اگر ادا کیے گئے تو کراہت کے ساتھ ہوگی حتیٰ کہ اگر اس میں جنازہ پڑھ لیا یا آیتِ سجدہ پڑھ لی اور سجدہ کرلیا تو جائز ہے، کیونکہ یہ ناقص واجب ہوئے تھے اور ناقص ادا ہوگئے ،(الجوہرۃ النیرۃ،ج1ص69)‘‘۔
تنویر الابصار مع الدرالمختار میں ہے :`
},
{
  pageNumber: 257,
  text: `’’[[arabic: وَیَنْعَقِدُ نَفْلٌ بِشُرُوْعٍ فِیْہَابِکَرَاہَۃِ التَّحْرِیْمِ لَا یَنْعَقِدُالْفَرْضُ وَمَاہُوَ مُلْحَقٌ بِہٖ کَوَاجِبٍ لِعَیْنِہٖ کَوِتْرٍ وَسَجْدَۃِ تِلَاوَۃٍ،وَصَلَاۃِ جَنَازَۃٍ،تُلِیَتِ الْاٰیَۃُ فِیْ کَامِلٍ وَحَضَرَتِ الْجَنَازَۃُ قَبْلَ لِوُجُوبِہٖ کَامِلًا فَلَا یَتَاَدّٰی نَاقِصًا،فَلَوْ وَجَبَتَا فِیْہَا لَمْ یُکْرَہْ فِعْلُہُمَا:أَیْ تَحْرِیْمًا.وَفِی التُّحْفَۃِ:الْاَفْضَلُ أَنْ لَا تُؤَخَّرَ الْجَنَازَۃُ]]‘‘۔
ترجمہ:’’ان(مکروہ ) اوقات میں نفل نماز کراہت تحریم کے ساتھ ہوجائے گی ، فرض ادا نہیں ہوگا اور جواس سے ملحق ہے،مثلاً واجب لعینہٖ، جیسے وتر اور سجدۂ تلاوت و نمازِ جنازہ جبکہ آیتِ سجدہ کامل وقت میں پڑھی گئی ہو اور جنازہ وقت مکروہ سے پہلے آگیا ہو اس لیے کہ ان کا وجوب کامل ہُوا تو ناقص طور پر ادائیگی نہ ہوگی، ہاں اگر ان دونوں کا وجوب ان ہی اوقات میں ہوا ہو تو ان اوقات میں ان کی ادائیگی مکروہِ تحریمی نہیں۔تحفہ میں ہے:افضل یہ ہے کہ جنازہ میں دیر نہ کی جائے،(جلد 2،ص:536-539، دمشق)‘‘ ۔ 
	جنازہ اگر ممنوع اوقات میں لایاگیا ہوتو اسی وقت پڑھ لیں،اس میں کوئی کراہت نہیں ہے ،کراہت اس صورت میں ہے کہ جنازہ پہلے سے تیار موجود ہے اور تاخیر کی یہاں تک کہ مکروہ وقت داخل ہو گیا ۔علامہ نظام الدین رحمۃ اللہ علیہ مُتوفّٰی1161؁ھ  لکھتے ہیں:
’’[[arabic: ہٰذَا إِذَا وَجَبتْ صَلَاۃُ الْجَنَازَۃِ وَسَجْدَۃُ التِّلَاوَۃِ فِی وَقْتٍ مُبَاحٍ وَأَخَّرَتَا إِلٰی ہٰذَا الْوَقْتِ فَإِنَّہٗ لَایَجُوْزُ قَطْعًا،أَمَّا لَوْوَجَبَتَا فِیْ ہٰذَا الْوَقْتِ وَاُدِّیَتَافِیْہِ جَازَ، لِاَنّہَا أُدِّیتْ نَاقِصَۃً کَمَا وَجَبَتْ، کَذَافِی السِّرَاجِ الْوَہَّاجِ وَہٰکَذَا فِی الْکَافِی و التِّبْیِیْنُ لٰکِنَّ الْاَفْضَلَ فِی سَجْدَۃ التِّلاَوَۃِ تَأخِیْرُہَا وَفِیْ صَلَاۃِ الْجَنَازَۃِ التَّأخِیْرُ مَکْرُوْہٌ]]‘‘۔
ترجمہ:’’یہ اس وقت ہے کہ جب نمازِ جنازہ یا سجدۂ تلاوت مباح وقت میں واجب ہوا اور پھر ان دونوں کو وقتِ مکروہ تک مؤخر کیا،تو ادائیگی قطعاً جائز نہیں ہے ،لیکن اگر نمازِ جنازہ اور سجدۂ تلاوت مکروہ وقت میں واجب ہوئے ،تو اسی وقت میں اداکرنا جائز ہے۔اس لیے کہ جیسے ناقص وقت میں واجب ہوئے،اسی طرح ناقص وقت میں اداکردیے گئے ،’’سراج`
},
{
  pageNumber: 258,
  text: `الوہاج‘‘ اور ’’ تبیین ‘‘ میں اسی طرح ہے ،لیکن سجدۂ تلاوت میں تاخیر کرنا افضل ہے اور نمازِ جنازہ میں تاخیر کرنا مکروہ ہے ،(فتاویٰ عالمگیری ،جلداول،ص:52)‘‘۔
	لیکن اگر جنازہ دانستہ مؤخر کرکے مکروہ وقت میں پڑھ لیاگیا ہے تو اداہوگیا ، دوبارہ صحیح وقت میں اس کا اعادہ یاقضا نہیں ہے،کیونکہ نماز جنازہ کی تکرارجائز نہیں ہے ،البتہ یہ فعل مکروہ تحریمی ہے، البتہ جنازہ مکروہ وقت ہی میں آئے ، تواسے اُسی وقت پڑھ سکتے ہیں ، کیونکہ جس طرح اس کا وجوب ناقص وقت میں ہوا، اسی طرح اداہوگیا ۔تاہم جنازہ کا وقت اہتمام کے ساتھ مؤخر کرکے مکروہ تحریمی وقت میں مقرر کرناکراہتِ تحریمہ کا سبب ہے ۔ 	علامہ زین الدین ابن نُجیم حنفی مُتوفّٰی970؁ھ لکھتے ہیں:
’’ [[arabic: وَفِی التُّحْفَۃِ:اَلْأفْضَلُ أَنْ یُصَلِّیَ عَلَی الْجَنَازَۃِ إذَاحَضَرَتْ فِی الْاَوْقَاتِ الثَّلَاثَۃِ وَلَایُؤَخِّرَہَا بِخِلَافِ الْفَرَائِضِ وَظَاہِرُ التَّسْوِیَۃِ بَیْنَ صَلَاۃِ الْجَنَازَۃِ وَسَجْدَۃِ التِّلَاوَۃِ أَنَّہٗ لَوْحَضَرَتِ الْجَنَازَۃُ فِیْ غَیْرِ مَکْرُوْہٍ فَاَخَّرَہَاحَتّٰی صَلّٰی فِی الْوَقْتِ الْمَکْرُوْہِ،فَإِنَّہَا لَا تَصِحُّ وَتَجِبُ إعَادَتُہَا کَسُجُوْدِ التِّلَاوَۃِ وَذَکَرَ الْإِسْبِیْجَابِیُّ: لَوْ صَلّٰی صَلَاۃَ الْجَنَازَۃِ فَإِنَّہٗ یَجُوْزُ مَعَ الْکَرَاہَۃِ وَلَا یُعِیْدُ]]‘‘۔
ترجمہ:’’ ’’تحفہ ‘‘ میں ہے : اگر جنازہ مکروہ وقت میں آیا ہے، تو دیگر فرائض کے برعکس اس جنازے کو اُسی وقت پڑھ لینا افضل ہے اور نمازِجنازہ اورسجدۂ تلاوت کے حکم میںمساوات کی صورت یہ ہے کہ اگر جنازہ غیر مکروہ وقت میں آیا اور اسے مُؤخّر کرکے مکروہ وقت میں پڑھا تویہ صحیح نہیں ہے اور اس کا اعادہ واجب ہے، جیسے کہ سجدۂ تلاوت کا حکم ہے اور ’’اسبیجابی ‘‘ نے کہا:اگر (پہلے سے موجود )جنازہ( مؤخّرکرکے مکروہ وقت میں )پڑھا توکراہت کے ساتھ جائز ہے ،کیونکہ جنازے کی تکرار نہیں ہے‘‘ ۔آگے چل کر لکھتے ہیں:’’[[arabic: وَإِنْ قَرَأَہَا قَبْلَ ذٰلِکَ، ثُمَّ سَجَدَہَا فِی ہٰذَا الْوَقْتِ لَا یَجُوْزُ وَیُعِیْدُ]]‘‘۔
ترجمہ:’’اگر آیتِ سجدہ صحیح وقت میں پڑھی تھی،لیکن سجدۂ تلاوت (کو مؤخر کرکے) مکروہ وقت میں اداکیاتوجائز نہیں ہے اور اس کا اعادہ کرے،(البحرالرائق، ج:1، ص:434)‘‘۔
علامہ بدرالدین کاسانی حنفی مُتوفّٰی 587؁ھ لکھتے ہیں:`
},
{
  pageNumber: 259,
  text: `’’[[arabic: تُکْرَہُ الصَّلَاۃُ عَلَی الْجَنَازَۃِ عِنْدَ طُلُوْعِ الشَّمْسِ وَغُرُوْبِہَا،وَنِصْفِ النَّہَارِ لِمَا رَوَیْنَا مِنْ حَدِیثِ عُقْبَۃَ بْنِ عَامِرٍ أَنَّہٗ قَالَ:ثَلَاثُ سَاعَاتٍ نَہَانَا رَسُوْلُ اللّٰہِ ﷺأَنْ نُّصَلِّیَ فِیْہَاوَأَنْ نَقْبُرَ فِیْہَا مَوْتَانَا،وَالْمُرَادُمِنْ قَوْلِہٖ:أَنْ نَقْبُرَ فِیْہَامَوْتَانَا،اَلصَّلَاۃُ عَلَی الْجَنَازَۃِ دُوْنَ الدَّفْنِ إذْ لَا بَاْسَ بِالدَّفْنِ فِیْ ہٰذِہِ الْاَوْقَاتِ فَإِنْ صَلَّوْا فِیْ أَحَدِ ہٰذِہِ الْاَوْقَاتِ لَمْ یَکُنْ عَلَیْہِمْ إعَادَتُہَا،لِاَنَّ صَلَاۃَ الْجَنَازَۃِ لَا یَتَعَیَّنُ لِاَدَائِہَا وَقْتٌ فَفِی أَیِّ وَقْتٍ صُلِّیَتْ وَقَعَتْ أَدَاءً لَا قَضَاءً ]]‘‘۔
ترجمہ:’’ طلوعِ شمس ،غروبِ شمس اور نصف النہار کے اوقات میں نمازِ جنازہ پڑھنا مکروہ ہے ، کیونکہ عقبہ بن عامر کی روایت میں ہے : رسول اللہ صلی اللہ علیہ وسلم نے ان تین (مکروہ) اوقات میں نمازِ جنازہ پڑھنے سے منع فرمایاہے، دفن کرنا منع نہیں ہے ،سواگر کچھ لوگوں نے ان تین اوقات میں سے کسی ایک (مکروہ) وقت میں نمازِ جنازہ پڑھ لی ،توان پرنمازِ جنازہ کا اعادہ لازم نہیں ہے ،کیونکہ نمازِ جنازہ کی ادائیگی کے لیے کوئی وقت متعین نہیں ہے ،سو جس وقت پڑھی جائے گی ،ادا کہلائے گی ،قضا نہیں،(مُلخصاًبدائع الصنائع، ج:1، ص:469)‘‘۔

[[heading: ایک قبر سے ستر مُردے اٹھائے جانے کی روایت]] 
سوال:
	لوگوں میں یہ مشہور ہے کہ قیامت کے روز ایک قبرسے 70مردے اٹھیں گے ، اس کی دینی حیثیت کیاہے؟،(قاضی محمد اشرف، اورنگی ٹاؤن)۔
جواب:
	یہ صرف لوگوں کی بنائی ہوئی باتیں ہیں ،اس بات کی کوئی شرعی حیثیت نہیں ہے ، لیکن یہ امر ناممکن بھی نہیں ہے ،ہمیں نہیں معلوم کہ قیامت کب آئے گی اور اس سے پہلے کتنے انسان زمین میں مدفون ہوں گے ،یہ بھی ممکن ہے کہ ایک میت کے آثار معدوم ہو جائیں ،تو وہاں کوئی دوسری میت دفن کردی جائے ،سیلابوں ،جنگوں اور آفات کے نتیجے میں مشکلات کے`
},
{
  pageNumber: 260,
  text: `باعث ایک قبر میں زیادہ میتیں دفن کی جاسکتی ہیں ،تاہم ایک قبر سے تعیین کے ساتھ ستر مردے اٹھائے جانے کی روایت ثابت نہیں ہے ۔

[[heading: میت کوکاندھا دینا]]
سوال:
	کیا غیرمحرم عورت کی میت کو کندھا دے سکتا ہے؟،(ساجد علی)۔
جواب:
	غیر محرم کاندھا دے سکتاہے ،غیر محرم عورت کا چہرہ نہیں دیکھ سکتا ،چھو نہیں سکتا ۔ امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْزسے شوہر کے اپنی بیوی کے جنازے کو ہاتھ لگانے کے بارے میں پوچھاگیا توآپ نے لکھا:’’جنازے کو محض اجنبی ہاتھ لگاتے ،کندھوں پر اٹھاتے ، قبر تک لے جاتے ہیں ،شوہر نے کیاقصور کیاہے ،یہ مسئلہ جاہلوں میں محض غلط مشہور ہے۔ہاں! شوہر کواپنی زنِ مردہ کابدن چھونا جائز نہیں ،چہرہ دیکھنے کی اجازت ہے[[arabic: کَمَا نَصَّ عَلَیْہِ فِی التَّنْوِیْرِ وَالدُّرَرِوَغَیْرِہمَا]](جیساکہ تنویر الابصار اوردرمختار وغیرہما میں اس کی تصریح ہے) اجنبی کو چہرہ دیکھنے کی بھی اجازت نہیں ،(فتاویٰ رضویہ ،جلد9، ص:138)‘‘۔


 [[heading: پیداہوتے ہی مرنے والے بچے کی نمازِ جنازہ کاحکم]] 
سوال: 
	میرے قریبی گاؤں میں ایک بچہ زندہ حالت میں پیداہو ا اور فوری فوت ہوگیا ، لیکن لوگوں نے اس کی نمازِ جنازہ نہیں پڑھی ،اس سلسلے میں شریعت کا کیا حکم ہے ؟،(ڈاکٹر عبدالرزاق ،جہلم )۔
جواب:
	جو بچہ زندہ پیداہواخواہ چند سانسیں ہی لیںاور فوت ہوگیا ،ا س کو غسل وکفن دیں گے ، اس کا نام بھی رکھا جائے گا اور اس کی نمازِ جنازہ بھی پڑھی جائے گی ، تنویر الابصار مع الدرالمختار میں ہے:’’[[arabic: وَمَنْ وُّلِدَفَمَاتَ یُغَسَّلُ وَیُصَلّٰی عَلَیْہِ]]‘‘۔ترجمہ:’’جوزندہ پیدا`
},
{
  pageNumber: 261,
  text: `ہونے کے بعد فوت ہوا،اسے غسل دیاجائے گا اور اُس کی نمازِ جنازہ بھی پڑھی جائے گی،  (جلد5،ص:310،دمشق)‘‘۔
علامہ علاء الدین کاسانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَأَمَّابَیَانُ مَنْ یُصَلّٰی عَلَیْہِ،فَکُلُّ مُسْلِمٍ مَاتَ بَعْدَ الْوِلَادَۃِ یُصَلّٰی عَلَیْہِ صَغِیْرًا کَانَ أَوْ کَبِیْرًا ذَکَرًا کَانَ أَوْ أُنْثٰی،حُرًّا کَانَ أَوْ عَبْدًا]]‘‘۔
ترجمہ:’’ اور رہا (میت پر) نمازِ جنازہ پڑھنے کے بارے میں : پس زندہ پیداہوکر مرنے والے ہر مسلمان کی نمازِ جنازہ پڑھی جائے گی ،خواہ وہ چھوٹا ہو یا بڑا  مرد ہو یا عورت ، آزاد ہو یا غلام ،(بدائع الصنائع،جلد1،ص:461)‘‘۔
علامہ زین الدین بن ابراہیم المعروف ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: (قَوْلُہٗ:وَمَنِ اسْتَہَلَّ صُلِّیَ عَلَیْہِ وَإِلَّا لَا)اسْتِہْلَالُ الصَّبِیِّ فِی اللُّغَۃِ أَنْ یَرْفَعَ صَوْتَہٗ بِالْبُکَاءِ عِنْدَوِلَادَتِہٖ۔۔۔ وَفِی الشَّرْعِ أَنْ یَکُوْنَ مِنْہُ مَا یَدُلُّ عَلٰی حَیَاتِہٖ مِنْ رَفْعِ صَوْتٍ أَوْ حَرَکَۃِ عُضْوٍ۔۔۔فِی الْمُحِیْطِ قَالَ أَبُوْحَنِیْفَۃَ: إِذَاخَرَجَ بَعْضُ الْوَلَدِ وَتَحَرَّکَ ثُمَّ مَاتَ،فَإِنْ کَانَ خَرَجَ أَکْثَرُہٗ صُلِّیَ عَلَیْہِ،وَإِنْ کَانَ أَقَلُّہٗ لَمْ یُصَلَّ عَلَیْہِ.وَفِی آخِرِالْمُبْتَغٰی بِالْمُعْجَمَۃِ:اَلْوَلَدُ إذَا خَرَجَ رَأْسُہٗ، وَہُوَیَصِیْحُ ثُمَّ مَاتَ قَبْلَ أَنْ یَخْرُجَ لَمْ یَرِثْ،وَلَمْ یُصَلَّ عَلَیْہِ مَا لَمْ یَخْرُجْ أَکْثَرُ بَدَنِہِ حَیًّا]]‘‘۔
ترجمہ:’’اوریہ قول: جو پیدائش کے وقت رویا ،اس کی نماز پڑھی جائے گی جو نہیں رویا،اُس کی نہیں پڑھی جائے گی ۔لُغت میں ’’استھلال‘‘ بچے کا پیدائش کے وقت زور سے رونامراد ہے ۔۔۔۔ اور شرعاً آواز بلندکرنا یا کسی عضو کا حرکت کرنا اُس کے زندہ ہونے پر دلالت کرتاہے ۔۔مزید لکھتے ہیں: ’’محیط‘‘ میں ہے: امام ابو حنیفہ نے فرمایا:جب بچے کا بعض حصہ باہر نکلا اور حرکت بھی کی ،پھر مرگیا ،پس اگر اکثر حصہ نکلا تو اس پر نماز پڑھی جائے گی اور اگر کم حصہ نکلا تو نماز نہیں پڑھی جائے گی اور ’’اَلْمُبْتَغٰی ‘‘ کے آخر میں : بچے کا سر باہر نکلا ،اس وقت وہ صحیح تھا ،پھر باہر نکلنے سے پہلے مر گیا ، وارث نہیں بنے گا اور نہ اُس کی نمازِ جنازہ پڑھی`
},
{
  pageNumber: 262,
  text: `جائے گی، (البحر الرائق ،جلد2، ص: 229-230)‘‘۔

[[heading: مجنون کی نمازِ جنازہ]] 
سوال:
	45سال کا ایک پاگل شخص ہے ،اس کے جنازہ میں کون سی دعا پڑھی جائے گی بالغ کی یا نابالغ کی،اگر نابالغ کی دعاپڑھ لی جائے توکیا یہ کافی ہوگی ؟،(عبدالرحمن ، لانڈھی )۔
جواب:
	نمازِ جنازہ میں تیسری تکبیر کے بعد میت کے لیے اور تمام مسلمانوں کے لیے مغفرت کی دعا کی جاتی ہے، احادیث مبارکہ میں بہت سی دعائیں وارد ہوئیں ،رسول اللہ صلی اللہ علیہ وسلم یہ دعا فرماتے تھے:
’’[[arabic: اَللّٰہُمَّ اغْفِرْلِحَیِّنَاوَمَیِّتِنَاوَشَاہِدِنَاوَغَائِبِنَاوَصَغِیْرِنَا وَکَبِیْرِنَاوَذَکَرِنَاوَأُنْثَانَا،اَللّٰہُمَّ مَنْ أَحْیَیْتَہٗ مِنَّا فَاَحْیِہٖ عَلَی الْإِسْلَامِ،وَمَنْ تَوَفَّیْتَہٗ مِنَّا فَتَوَفَّہٗ عَلَی الْإِیمَانِ]]‘‘۔
ترجمہ: ’’ اے اللہ ! ہمارے زندہ و مردہ ،حاضر وغائب ، بڑے چھوٹے اور مردوعورت کو بخش دے ،اے اللہ ! ہم میں سے تو جسے زندہ رکھے،اُسے اسلام پر زندہ رکھ اورہم میں سے تو جس کو وفات دے ،اُسے ایمان پر وفات دے،(سُنن ابوداؤد:3201) ‘‘۔
	مجنون (پاگل) ،بے عقل اور بچے کے لیے دعائے مغفرت نہیں کی جائے گی کیونکہ وہ مکلّف نہیں ہیں،تنویر الابصار مع الدرالمختار میں ہے : ’’[[arabic: وَلَا یُسْتَغْفَرُ فِیْہَالِصَبِیٍّ وَمَجْنُوْنٍ وَمَعْتُوْہٍ لِعَدَمِ تَکْلِیْفِہِمْ ]]‘‘۔ترجمہ:’’اور نمازِ جنازہ میں بچے ،مجنون اور بے عقل کے لیے استغفار نہیں کی جائے گی کیونکہ وہ احکام کے مُکلّف نہیں‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: ہٰذَا فِی الْاَصْلِیِّ فَإِنَّ الْجُنُوْنَ وَالْعَتَہَ الطَّارِئَیْنِ بَعْدَ الْبُلُوْغِ لَا یُسْقِطَانِ الذُّنُوْبَ السَّالِفَۃَ کَمَا فِی شَرْحِ الْمُنْیَۃِ ]]‘‘۔
ترجمہ:’’ یہ اُس مجنون اور معتوہ (فاتر العقل)کے بارے میں ہے ،جو بچپن ہی سے اس میں`
},
{
  pageNumber: 263,
  text: `مبتلا ہو ،اس لیے کہ بالغ ہونے کے بعد لاحق ہونے والاپاگل پن اورعقلی فتور سابق گناہوں کو ساقط نہیں کرتے ،جیساکہ ’’شرح المنیہ‘‘ میں ہے ،(حاشیہ ابن عابدین شامی ، جلد5، ص:270، دمشق)‘‘۔
علامہ زین الدین ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَلَا یُسْتَغْفَرُ لِصَبِیٍّ،وَلَا لِمَجْنُوْنٍ وَیَقُوْلُ: اَللّٰہُمَّ اجْعَلْہُ لَنَا فَرَطًا وَاجْعَلْہُ لَنَا أَجْرًا وَذُخْرًا وَاجْعَلْہُ لَنَا شَافِعًا وَمُشَفَّعًا،کَذَا وَرَدَ عَنْ رَسُوْلِ اللّٰہِ ﷺوَلِاَنَّہٗ لَا ذَنْبَ لَہُمَا]]‘‘۔
ترجمہ:’’ اور بچے اور مجنون کے لیے(نمازِ جنازہ میں) دعائے مغفرت نہ کرے اور یہ دعا پڑھے: ترجمہ: ’’اے اللہ ! تو اس کو ہمارے لیے پیش روبنا اور اسے ہمارے لیے باعثِ اجر اور ذخیرۂ(آخرت ) بنا اور اسے ہمارے لیے شفاعت کرنے والا اور مَقْبُولُ الشَّفَاعۃ کردے‘‘، رسول اللہ صلی اللہ علیہ وسلم سے اسی طرح وارد ہواہے ، کیونکہ بچے اور مجنون کا گناہ ہی نہیں ہے(کہ اُن کے لیے استغفار کی جائے) ،(البحر الرائق ،جلد2،ص:323)‘‘۔
	ایسا شخص جوپیدائشی طورپریا بالغ ہونے سے پہلے مجنون ہوا ،کبھی مُکلّف ہی نہ ہواتھا ، اس کی نمازِ جنازہ میں دعائے مغفرت نہیں پڑھی جائے گی البتہ اگر جنون  بالغ ہونے کے بعد لاحق ہوا ہے ،تو اس کے لیے دعائے مغفرت کی جائے گی کیونکہ بالغ ہونے کے بعد جنون لاحق ہونے کی درمیانی مدت میں وہ مُکلّف تھا اورجنون لاحق ہونے سے پہلے کے گناہ جنون سے ختم نہیں ہوں گے ۔
شیخ ابراہیم حلبی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وَالْمَجْنُوْنُ کَالطِّفْلِ ذَکَرَہٗ فِی الْمُحِیْطِ وَیَنْبَغِیْ أَنْ یُّقَیَّدَ بِالْجُنُوْنِ الْاَصْلِیِّ لِاَنَّہٗ لَمْ یُکَلَّفْ فَلَا ذَنْبَ لَہٗ کَالصَّبِیِّ بِخِلَافِ الْعَارِضِیِّ فَاِنَّہٗ قَدْ کُلِّفَ وَعُرُوْضُ الْجُنُوْنِ لَایَمْحُوْ مَاقَبْلَہٗ بَلْ ھُوَ کَسَائِرِ الْاَمْرَاضِ وَرَفَعَہٗ لِلتَّکْلِیْفِ]]‘‘۔
ترجمہ:’’ مجنوں بچے کی مثل ہے ، ’’محیط‘‘ میں اس کا بیان ہوا ،بہتریہ ہے کہ جنون کواصل سے`
},
{
  pageNumber: 264,
  text: `مقیّد کیاجائے (یعنی جنون اصلی کہاجائے)کہ بچے کی طرح مُکلّف نہ ہونے کے سبب اس کا کوئی گناہ نہیں ہے ،(بلوغت ) کے بعد لاحق ہونے والے جنون کا حکم اس کے برعکس ہے ، کیونکہ وہ (احکام کا) مُکلّف ہوچکاتھا اور (بلوغت کے بعد ) لاحق ہونے والاجنون ماقبل کے گناہوں کو نہیں مٹاتا ،بلکہ وہ باقی امراض کی طرح ہے اور احکام کا مُکلّف ہے،(حلبی کبیر، ص:587)‘‘۔اگر کوئی شخص مستقل جنون کے مرض میں مبتلا ہو اور بلوغت کے بعد بھی افاقہ نہ ہواہوتو وہ بچوں کی طرح شرعی احکام کا مُکَلّف نہیں ہے اور اس کی نمازجنازہ میں بچوں والی دعا پڑھی جائے گی اوراگر کبھی بالغ ہونے کے بعد جنون سے اس قدر افاقہ ہواہو کہ چند نمازوں کا وقت گزر گیا تو اس کی نماز جنازہ میں بالغوں کی طرح دعائے مغفرت پڑھی جائے گی ۔
	چار بار تکبیریں کہنا اور قیام کرنا نماز جنازہ کے ارکان ہیں  ،کوئی تکبیر رہ گئی یا قیام نہ کیاتو نماز دہرانا ہوگی ۔نمازِ جنازہ میں پہلی تکبیر کے بعد ثناء پڑھنا ، دوسری تکبیر کے بعد نبی صلی اللہ علیہ وسلم پر درود پڑھنا اورتیسری تکبیر کے بعد میت کے لیے دعاکرنا سُنّت مؤکَّدہ ہے ۔بہتر یہ ہے کہ جو دعائیں احادیث میں وارد ہیں ،اُن میں سے کوئی دعا پڑھے اور ماثور دعائیں یاد نہ ہوں تواُمور ِ آخرت پر مبنی دعاؤں میں سے جو دعا چاہے ، پڑھے ۔
علامہ نظام الدینرحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: ثُمَّ یُکَبِّرُ أُخْرٰی وَیَدْعُوْ لِلْمَیِّتِ وَجَمِیْعِ الْمُسْلِمِیْنَ وَلَیْسَ فِیْہَا دُعَاءٌ مُؤَقَّتٌ وَعَن رَّسُوْلِ اللّٰہِ ﷺأَنَّہٗ کَانَ یَقُوْلُ: اَللّٰہُمَّ اغْفِرْ لِحَیِّنَا وَمَیِّتِنَاوَشَاہِدِنَا وَغَائِبِنَا وَصَغِیْرِنَا وَکَبِیْرِنَا وَذَکَرِنَاوَأُنْثَانَا،اَللّٰہُمَّ مَنْ أَحْیَیْتَہٗ مِنَّا فَاَحْیِہٖ عَلَی الْإِسْلَامِ،وَمَنْ تَوَفَّیْتَہٗ مِنَّا فَتَوَفَّہٗ عَلَی الْإِیْمَانِ،فَإِنْ کَانَ الْمَیِّتُ صَغِیْرًا عَنْ أَبِی حَنِیْفَۃَ رَحِمَہُ اللّٰہُ تَعَالٰی أَنَّہٗ یَقُوْلُ:’اَللّٰہُمَّ اجْعَلْہٗ لَنَا فَرَطًا،اَللّٰہُمَّ اجْعَلْہٗ لَنَاذُخْرًا وَأَجْرًا اَللّٰہُمَّ اجْعَلْہٗ لَنَا شَافِعًا وَّمُشَفَّعًا،ہٰذَا إِذَا کَانَ یُحْسِنُ ذٰلِکَ فَإِنْ کَانَ لَا یُحْسِنُ یَاْتِی بِاَیِّ دُعَاءٍ شَآءَ ]]‘‘۔
ترجمہ:’’ پھرآخری تکبیر پڑھے اور میت کے لیے اورتمام مسلمانوں کے لیے دعا کرے اور`
},
{
  pageNumber: 265,
  text: `نماز جنازہ کے لیے کوئی مخصوص دعانہیں ہے ، رسول اللہ صلی اللہ علیہ وسلم سے منقول ہے کہ آپ صلی اللہ علیہ وسلم یہ دعا فرماتے تھے : ’’ اے اللہ ! ہمارے زندہ و مردہ ،حاضر وغائب ، بڑے چھوٹے اور مردوعورت کو بخش دے ،اے اللہ ! ہم میں سے تو جسے زندہ رکھے،اُسے اسلام پر زندہ رکھ اورہم میں سے تو جس کو وفات دے ،اُسے ایمان پر وفات دے‘‘،پس اگر میت بچے کی ہو تو امام ابو حنیفہ رحمہ اللہ تعالیٰ سے منقول ہے : ’’اے اللہ ! تو اس کو ہمارے لیے پیش روبنا ، اے اللہ !اسے ہمارے لیے باعثِ اجر اور ذخیرۂ(آخرت ) بنا ، اے اللہ ! اسے ہمارے لیے شفاعت کرنے والا اورمقبولُ الشفاعۃ کردے‘‘، اگریہ مسنون(وماثور) دعائیں اچھی طرح آتی ہوں،تویہی پڑھے اور اگر یہ دعائیں اچھی طرح یادنہ ہوں تو (آخرت سے متعلق) کوئی سی بھی دعا(جو یاد ہو) پڑھ لے،(فتاویٰ عالمگیری ،جلد1، ص:164)‘‘ ۔ 
	البتہ اگرکسی نے نابالغ بچے یا پیدائشی مجنون کی نمازِ جنازہ میں تیسری تکبیر کے بعد بھول کر بالغ کی دعا پڑھ لی یا بالغ وبالغہ کی نمازِ جنازہ میں بھول کر بچے کی دعا پڑھ لی ،تب بھی نماز اداہوجائے گی ، نمازِ جنازہ دہرانے کی ضرورت نہیں ہے ،بالغ کے لیے دعائے مغفرت نمازِ جنازہ کے بعد اور تدفین کے بعد بھی کرسکتے ہیں ،بلکہ ہمیشہ کرسکتے ہیں۔

[[heading: وقف قبرستان کو بدلا نہیں جاسکتا]] 
سوال:
	ہمارے علاقے میں ایک قبرستان تھا ،وقت کے ساتھ قبروں کے نشانات مٹ گئے ، قبرستان کے ساتھ مسجد موجود ہے ،بعض احباب نے قبرستان والی جگہ پر امام کی رہائش اور مدرسے کے کمرے تعمیر کردیے ہیں ،کیا یہ درست ہے ؟،(محمد محسن ،لاہور )۔
جواب:
	مسلمانوں کے قبرستان کو (خواہ کتنا ہی قدیم کیوں نہ ہو )مسمار کرنا یا کسی دوسرے مقصد کے لیے استعمال کرنا ہرگز جائز نہیں ،علامہ نظام الدینرحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: وَسُئِلَ ھُوَ (أَیِ الْقَاضِیِ الْاِمَا مُ شَمْسُ الْاَئِمَّۃِ مَحْمُوْدُ الْاُوْزْجَنْدِیُّ )عَنِ الْمَقْبَرَۃِ فِی]]`
},
{
  pageNumber: 266,
  text: `[[arabic: الْقُریٰ اِذَا انْدَرَسَتْ وَلَم یَبْقَ فِیْہَاأَثَرُالْمَوْتٰی لَاالْعَظْمُ وَلَا غَیْرُہٗ ھَلْ یَجُوْزُ زَرْعُھَا وَاِسْتِغْلَالُھَا، قَالَ:لَا،وَلَھَاحُکْمُ الْمَقْبَرَۃِ،کَذَا فِی الْمُحِیْطِ]]‘‘۔
ترجمہ:’’ شمس الائمہ اما م قاضی محمود اوزجندی سے دیہات میںموجودایسے قبرستان کی بابت پوچھا گیا کہ جس(قبرستان) کے نشانات مٹ چکے ہوں اور اُس میں میت کی ہڈیاں یا کوئی دوسرے آثار (اعضاء وغیرہ) باقی نہ رہے ہوں،توکیا اس پر کھیتی کرنا اور اس سے غلہ حاصل کرنا جائز ہے ؟،آپ نے جواب میں فرمایا : نہیں بلکہ وہ قبرستان ہی کے حکم میں ہے ،جیسا کہ ’’محیط‘‘ میں ہے ‘‘۔محشی نے اس پر حاشیہ لکھا :
’’ [[arabic: قَوْلُہٗ :قَالَ :لَا،ھٰذَا لَایُنَافِیْ مَاقَالَہُ الزَّیْلَعِیُّ فِیْ بَابِ الْجَنَائِزِمِنْ أَنَّ الْمَیِّتَ اِذَابَلیٰ وصَارَ تُرَابًاجَازَ زَرْعُہٗ وَالْبِنَاءُ عَلَیْہِ ، لِاَنَّ الْمَانِعَ ھُنَاکَوْنُ الْمَحَلِّ مَوْقُوْفًا عَلَی الدَّفْنِ فَلَا یَجُوْزُ اِسْتِعْمَالُہٗ فِیْ غَیْرِہٖ فَلْیَتَاَمَّلْ وَلْیُحَرِّرْ]]‘‘۔
ترجمہ:’’ایسا قبرستان جس کے آثار مٹ چکے ہیں ،علامہ قاضی محمود اوزجندی نے اس میں کاشت کرنے کی ممانعت فرمائی ہے، یہ’’ امام زیلعی‘‘ کے اس قول کے منافی نہیں ہے کہ جب میت بوسیدہ ہوکر مٹی ہوجائے تواس میں عمارت بنانے اور کاشت کرنے کی اجازت ہے ، ممانعت کا حکم اس زمین کے لیے ہے، جو قبرستان کے لیے وقف ہے، کیونکہ وقف کو تبدیل نہیں کیاجاسکتا ہے اور’’ امام زیلعی‘‘ کی اجازت اس قبرستان کے لیے ہے ،جو وقف نہیں ہے، پس غورکرکے درست مسئلہ لکھنا چاہیے،(فتاویٰ عالمگیری ،جلد2،ص: 470 ) ‘‘ ۔یہ حکم اُس صورت میں ہے کہ جب وقف مکمل ہوچکاہو ،تو اُس میں تبدیلی جائز نہیں، لہٰذا صورتِ مسئولہ میں قبرستان والی جگہ پر امام کی رہائش گاہ اور مدرسہ تعمیر کرنا جائز نہیں ہے ۔

[[heading: قبر پکی کرنے کا حکم]] 
سوال:
	قبر پکی کرنے سے کیا مراد ہے اوراس کا شرعی حکم کیاہے ؟،(قاضی محمد اشرف، اورنگی ٹاؤن)۔
جواب:`
},
{
  pageNumber: 267,
  text: `قبر اندر سے کچی ہونا چاہیے ،حقیقۃً قبر کچے گڑھے کا نام ہے ،قبر کے اندر پکی اینٹیں لگانا مکروہ ہے،تنویر الابصار مع الدرالمختار میں ہے:
’’[[arabic: وَیُسَوَّی اللَّبِنُ وَالْقَصَبُ لَا الْآجُرُّالْمَطْبُوْخُ وَالْخَشَبُ لَوْ حَوْلَہٗ، أَمَّا فَوْقَہٗ فَلَا یُکْرَہٗ ]]‘‘۔
ترجمہ:’’ قبرپر کچی اینٹیں اور بانس چن دے ،پکی اینٹیں اورلکڑی اس کے گردنہ لگائے ، اوپر ہوتو مکروہ نہیں ‘‘،اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: قَالَ فِی الْحِلْیَۃِ: وَکَرِہُوا الْآجُرَّ وَأَلْوَاحَ الْخَشَبِ،وَقَالَ الْإِمَامُ التُّمُرْتَاشِیُّ:ہٰذَا إذَا کَانَ حَوْلَ الْمَیِّتِ،فَلَوْ فَوْقَہٗ لَا یُکْرَہٗ لِاَنَّہٗ یَکُوْنُ عِصْمَۃً مِنَ السَّبُعِ.وَقَالَ مَشَایِخُ بُخَارٰی:لَا یُکْرَہُ الْآجُرُّ فِی بَلْدَتِنَا لِلْحَاجَۃِ إلَیْہِ لِضَعْفِ الْاَرَاضِی ]]‘‘۔
ترجمہ:’’حلیہ میں کہا:’’ علماء نے پکی اینٹوں اورلکڑی کے تختوں کو مکروہ کہاہے اورامام تمر تاشی نے فرمایا: یہ اُس وقت ہے جب میت کے اردگرد ہو اور اگر اس کے اوپر ہوتو مکروہ نہیں ،اس لیے کہ یہ درندوں سے حفاظت کا ذریعہ ہوگا ۔مشایخ بخارا نے فرمایا: ہمارے شہروں میں پکی اینٹیں مکروہ نہیں ہیں کیونکہ زمین کمزور ہونے کی وجہ سے اس کی ضرورت ہے ، (جلد5، ص:344-345،دمشق)‘‘۔یعنی اگر قبر کی جگہ کی زمین کچی ہو اور قبر کے بیٹھ جانے کا اندیشہ ہوتو قبر کی حفاظت کے لیے پکی اینٹیں استعمال کی جاسکتی ہیں ۔
امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْزلکھتے ہیں:
 ’’قبر پختہ بنانے میں حاصل ارشاد علمائے امجادرحمۃ اللہ علیہم یہ ہے کہ اگر پکی اینٹ میّت کے متصل یعنی اس کے آس پاس کسی جہت میں نہیں کہ حقیقۃً قبر اسی کا نام ہے بلکہ گڑھا کچّا اور بالائے قبر پختہ ہے تو مطلقاً ممانعت نہیں، یہاں تک کہ امامِ اَجلّ فقیہِ مُجتہِد اسمٰعیل زاہدی نے خاص لحد میں پکی اینٹ پر نَصّ فرمایا ،جبکہ کچّے چوکے کی تَہ ہواور اپنی قبر مبارک میں یونہی کرنے کی وصیت فرمائی او ر متصل میّت ممنوع مکروہ ، مگر جبکہ بضرورت تری ونرمی زمین ہو، تو ا س میں بھی حرج نہیں‘‘۔`
},
{
  pageNumber: 268,
  text: `امام احمد رضا قادریقُدِّسَ سِرُّہُ الْعَزِیْز سے سوال ہوا :’’قبر کا پختہ کرانا بہتر ہے یا نہ کرانا؟، اگر پختہ بنانا بہتر ہے تواس کی تعمیر میں کن خاص اور ضروری باتوں کا لحاظ رکھنا چاہیے، مثلاً : طول عرض بلندی او رصورت وغیرہ‘‘۔آپ نے جواب میں لکھا: ’’ قبر پختہ نہ کرنا بہتر ہے ، اور کریں تو اندر سے کڑا کچا رہے، اوپر سے پختہ کرسکتے ہیں، طول وعرض موافق قبرمیّت ہو اور بلندی ایک بالشت سے زیادہ نہ ہو اورصورت ڈھلوان بہتر ہے، واﷲتعالیٰ اعلم،(فتاویٰ رضویہ ، جلد9،ص:421-425)‘‘۔

[[heading: میت کو عمامہ کے ساتھ دفن کرنے کا شرعی حکم]] 
سوال:
	آج کل یہ دیکھنے میں آرہاہے کہ میت کے سر پر عمامہ باندھ کر دفن کیاجاتاہے ، کیایہ درست ہے ؟،(منور احمد نعیمی ، ملیر )۔
جواب:
	حدیث پاک میں ہے :
 (۱)’’[[arabic: اِذَاکَفَّنَ أَحَدُکُمْ أَخَاہٗ فَلْیُحَسِّنْ کَفَنَہٗ]]‘‘۔
ترجمہ:’’جب تم میں سے کوئی اپنے بھائی کو کفن دے ،تو اچھا کفن دے، (صحیح مسلم: 2182)‘‘۔ علماء ومشایخ کو عمامہ کے ساتھ دفن کرنا جائز ہے اور عوام کے لیے مکروہِ تنزیہی ہے ،بہتریہ ہے کہ عامۃ الناس کو عمامہ کے ساتھ دفن نہ کریں ،لیکن اگر پہنادیاتو گنہگار نہیں ہوگا،تنویر الابصار مع الدرالمختار میں ہے:
’’[[arabic: وَتُکْرَہٗ الْعِمَامَۃُ لِلْمَیِّتِ فِی الْاَصَحِّ’’مُجْتَبٰی‘‘وَاسْتَحْسَنَہَا الْمُتَاَخِّرُوْنَ لِلْعُلَمَاءِ وَالْاَشْرَافِ وَلَا بَاْسَ بِالزِّیَادَۃِ عَلَی الثَّلَاثَۃِ وَیُحَسَّنُ الْکَفَنُ لِحَدِیْثِ حَسِّنُوا اَکْفَانَ الْمَوْتٰی فَإِنَّہُمْ یَتَزَاوَرُوْنَ فِیْمَا بَیْنَہُمْ وَیَتَفَاخَرُوْنَ بِحُسْنِ اَکْفَانِہِمْ ’’ظَہِیْرِیَّۃٌ‘‘]]۔
ترجمہ:’’صحیح ترین قول کے مطابق میت کے سرپر عمامہ باندھنا مکروہ ہے ، بحوالہ : ’’مُجتبٰی‘‘ اوربعض متاخرین نے علماء ومشایخ کے لیے مستحسن قراردیاہے اور (مرد کے کفن میں) تین`
},
{
  pageNumber: 269,
  text: `کپڑوں سے زیادہ کرنے میں حرج نہیں ہے اور کفن اچھا بنانا چاہیے کیونکہ حدیث پاک میں ہے : مُردوں کے اچھے کفن بناؤ کیونکہ وہ باہم ملاقات کرتے ہیں اور اچھے کفن پر باہم فخر کرتے ہیں ، بحوالہ:’’ظہیریہ‘‘ ۔
علامہ ابن عابدین شامی رحمۃ اللہ علیہ اس کی شرح میں لکھتے ہیں:
’’[[arabic: وَنَقْلُہٗ قَبْلَہٗ عَنِ’’الْمُجْتَبٰی‘‘الْکَرَاہَۃُ لٰکِنْ قَالَ: فِی الْحِلْیَۃِ عَنِ’’الذَّخِیْرَۃِ‘‘مَعْزِیًّا إلٰی عِصَامٍ:أَنَّہٗ إلٰی خَمْسَۃٍ لَیْسَ بِمَکْرُوْہٍ وَلَا بَاْسَ بِہٖ،ثُمَّ قَالَ:وَوُجِّہَ بِاَنَّ ابْنَ عُمَرَ کَفَّنَ ابْنَہٗ وَاقِدًا فِیْ خَمْسَۃِ أَثْوَابٍ قَمِیْصٍ وَعِمَامَۃٍ وَثَلَاثِ لَفَائِفَ وَأَدَارَ الْعِمَامَۃَ إلٰی تَحْتِ حَنَکِہٖ رَوَاہٗ سَعِیْدُ بْنُ مَنْصُوْرٍ]]‘‘۔
ترجمہ:’’ اس سے قبل ’’المُجتبیٰ‘‘سے کراہت کو نقل کیا ہے ،لیکن ’’الحلیہ‘‘ میں ’’الذخیرہ‘‘ کے حوالے سے ہے اوراُنہوں نے ’’عِصام‘‘ کی طرف منسوب کرتے ہوئے کہا: پانچ تک کپڑے مکروہ نہیں اور اس میں کوئی حرج نہیں ،پھرکہا: اس کی دلیل یہ ہے کہ حضرت ابن عمر رضی اللہ عنہما نے اپنے بیٹے واقد کو پانچ کپڑوں میں کفن دیا ،قمیص ،عمامہ اورتین لفافے اور عمامے کو اس کی ٹھوڑی کے نیچے سے گھمایا ،اسے سعید بن منصور نے روایت کیا،(حاشیہ ابن عابدین شامی ،جلد5،ص:226-227، دمشق )‘‘۔لیکن جہاں لوگوں کے لیے میت کو عمامہ پہنانا مانوس ہو ،تو ایسی چیزوں کو اختلاف کا سبب نہیں بنانا چاہیے ، کیونکہ کسی امر مستحب پر اصرار اور اس کے ترک پر ملامت اسے واجب کا درجہ دینا ہے اوریہ درست نہیں ہے اور کوئی اپنے ذوق کے مطابق کررہاہے تو دوسروں کو اس پر بلاوجہ اعتراض نہیں کرنا چاہیے،بہر حال عوام کے لیے یہ مکروہ تنزیہی ہے۔ 

[[heading: تابوت میں میت کو دفنانے کا حکم]]
سوال:
	میت کو تابوت میں دفن کرنے کا کیا حکم ہے ،(قاری بہادر خان ، چترال )۔
جواب:
	فقہائے کرام نے ذکر کیا ہے :’’ اگر فوت ہونے والا شخص مرد ہو تو بلاعذر اُسے تابوت`
},
{
  pageNumber: 270,
  text: `سمیت دفن کرنا مکروہ ہے اور اگر میت عورت ہے تو اُسے تابوت کے ساتھ دفن کرنا افضل ہے‘‘ ، علامہ علاء الدین حصکفی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: وَلَا بَاْسَ بِاِتِّخَاذِ تَابُوْتٍ وَلَوْ مِنْ حَجَرٍ اَوْ حَدِیْدٍ (لَہٗ عِنْدَ الْحَاجَۃِ) کَرَخَاوَۃِ الْاَرْضِ]]‘‘۔
ترجمہ:’’ضرورت وحاجت کے وقت مرد میت کے لیے تابوت بنانے میں حرج نہیں ہے، خواہ وہ پتھر کا ہو یا لوہے کا،حاجت سے مراد جیسے زمین کا نرم ہونا‘‘۔
	 اسی طرح اگر زمین میں پانی ہے یا میت کے اعضاء کسی حادثے کے سبب منتشر ہیں ،تو اُسے تابوت میں دفن کیا جاسکتا ہے۔
 علامہ ابن عابدین رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: اَمَّا إذَا کَانَ لَہٗ سَقْفٌ اَوْ بِنَاءٌ مَعْقُوْدٌ فَوْقَہٗ کَقُبُوْرِ بِلَادِنَا وَلَمْ تَکُنِ الْاَرْضُ نَدِیَّۃً وَلَمْ یُلْحَدْ فَیُکْرَہُ التَّابُوْتُ]]‘‘۔
ترجمہ:’’لیکن اگرقبر کی چھت ہو اور اس کے اوپر بھی کوئی تعمیر ہو جیسے ہمارے علاقے کی قبریں ہوتی ہیں اور زمین میں نمی نہ ہو اور لحد نہ بنائی ہوئی ہو تو تابوت میں دفن کرنا مکروہ ہے ‘‘ ۔۔۔نیز فرماتے ہیں:
’’[[arabic: لَا بَاْسَ لِلْمَرْاَۃِ مُطْلَقًا، وَبِہٖ صَرَّحَ فِی شَرْحِ الْمُنْیَۃِ فَقَالَ: وَفِی الْمُحِیْطِ:وَاسْتَحْسَنَ مَشَایِخُنَا اتِّخَاذَ التَّابُوْتِ لِلنِّسَاء ِ، یَعْنِیْ: وَلَوْ لَمْ تَکُنِ الْاَرْضُ رَخْوَۃً ،فَإِنَّہٗ اَقْرَبُ إلَی السَّتْرِ وَالتَّحَرُّزِ عَنْ مَسِّہَا عِنْدَ الْوَضْعِ فِی الْقَبْرِ]]‘‘۔
ترجمہ:’’اور عورت کو مطلقاً (یعنی کسی عذر کے بغیربھی) تابوت میں دفن کیا جاسکتا ہے اور ’’مُنْیۃ المصلی‘‘ کی شرح میں اس کی تصریح کی گئی ہے اور ’’محیط‘‘میں ہے: ہمارے مشایخ نے عورتوں کو تابوت میں دفن کرنے کو مستحسن قرار دیا ہے ، یعنی اگر زمین نرم بھی نہ ہو (تب بھی) ،کیونکہ یہ ستر اور قبر میں رکھتے وقت میت کو چھونے سے اجتناب کا ذریعہ ہے ، (ردالمحتار،ج:2،ص:235‘‘ ۔اور اگر خدانخواستہ کسی حادثے یا بارش کی کثرت یا اچانک قبرکھودے جانے کے سبب میت ظاہر ہوجائے ،تو ستر قائم رہے گا۔`
},
{
  pageNumber: 271,
  text: `[[heading: روزے اور زکوٰۃ کے مسائل]]`
},

{
  pageNumber: 273,
  text: `[[heading: روزے کی حالت میں مسواک کا استعمال]] 
سوال:
	 روزے کی حالت میں مسواک ، ٹوتھ پیسٹ یا ٹوتھ پاؤڈر استعمال کرسکتے ہیں ؟، (عبداللہ ضیائی ، کورنگی )۔
جواب:
	حدیث پاک میں ہے :
’’ [[arabic: عَنْ عَبْدِ اللّٰہِ بْنِ عَامِرِ بْنِ رَبِیعَۃَ عَنْ أَبِیْہِ قَالَ:رَأَیْتُ النَّبِیَّ ﷺمَا لاَ أُحْصِی یَتَسَوَّکُ وَہُوَ صَائِمٌ]]‘‘۔
ترجمہ:’’حضرت عامر بن ربیعہ رضی اللہ عنہ بیان کرتے ہیں: میں نے بے شمار مرتبہ نبی صلی اللہ علیہ وسلم کو روزہ میں مسواک کرتے دیکھا، (سُنن ترمذی:725)‘‘۔
	روزے کی حالت میں فقہائے احناف نے مسواک کی اجازت دی ہے ،چاہے وہ خشک ہو یاتر ،جس میں کچھ ذائقہ موجود ہوتا ہے ۔
علامہ زین الدین ابن نجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَأَمَّا السِّوَاکُ فَلَا بَأْسَ بِہٖ لِلصَّائِمِ أَطْلَقَہٗ فَشَمِلَ الرَّطْبَ وَالْیَابِسَ وَالْمَبْلُولَ وَغَیْرَہٗ قَبْلَ الزَّوَالِ وَبَعْدَہٗ]]‘‘۔
ترجمہ:’’ اوررہا مسواک کرنا ،روزہ دار کے لیے مسواک کرنا مکروہ نہیں ہے مسواک خشک ہویاتر اگرچہ پانی سے تر کی ہوئی ہو ،زوال سے پہلے کرے یا بعد کو ،(البحرالرائق ،جلد 2،ص:302)‘‘۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَأَمَّا الرَّطَب الأَخْضَر فَلاَبَأس بِہٖ عِنْدَالْکُلّ ]]‘‘۔
ترجمہ:’’ اوررہی سبز مرطوب مسواک تو اس میں کسی کے نزدیک کوئی مضائقہ نہیں ،(فتاویٰ عالمگیری ،جلد1،ص:199)‘‘۔`
},
{
  pageNumber: 274,
  text: `	مسواک کی تری یا اس کی لکڑی کاکوئی ریزہ یا ریشہ حلق میں چلاگیا تو روزہ فاسد ہوجائے گا،امام یحییٰ بن شرف النَّوَوی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: لَوِ اسْتَاکَ بِسِوَاکٍ رَطْبٍ فَانْفَصَلَ مِنْ رُطُوبَتِہٖ أَوْ خَشَبِہٖ الْمُتَشَعّبِ شَیٌٔ وَابْتَلَعَہٗ أَفْطَرَ بِلَا خِلَافٍ]]‘‘۔
ترجمہ:’’ اگر مرطوب مسواک کی اوراس کی ریشے دار لکڑی میں کوئی ریشہ نگل لیاتو بالاتفاق روزہ ٹوٹ جائے گا ،(المجموع شرح المہذب،جلد6،ص:318)‘‘۔
امام احمد رضاقادری قُدِّسَ سِرُّہُ الْعَزِیْز لکھتے ہیں: 
	’’مسواک کرنا سنّت ہے، ہروقت کرسکتا ہے، اگر چہ تیسرے پہر یا عصر کو، چبانے سے لکڑی کے ریزے چھوٹیں یا مزہ محسوس ہوتو نہ چاہئے، خلال کرنے میں تو کوئی مضائقہ نہیں ، روزہ بند ہونے سے پہلے خِلال کرلینا چاہیے تاکہ روزے کی حالت میں اس کی ضرورت نہ رہے ،البتہ اگر سحری کھا کر فارغ ہُوا تھا کہ صبح ہوگئی تو اسی وقت خِلال کرے گا ، اس میں حرج نہیں ہے ، روزے میں منجن مَلنا نہ چاہیے،(فتاویٰ رضویہ ، جلد10،ص:511، بتصرُّف)‘‘۔
	منجن ،ٹوتھ پاؤڈر اور پیسٹ اس سے مختلف ہے کہ اس میں ذائقہ بہت محسوس ہوتاہے، نہ اس پر مسواک کااطلاق ہوتاہے اور نہ مسواک کی سنت اداکرنے کے لیے اس کی ضرورت ہے ،حتی الامکان روزے کی حالت میں اس کے استعمال سے اجتناب کرنا چاہیے، کیونکہ   اس کے ذرّات کےحلق سے اندر  جانے کا اندیشہ ہوتا ہے اور ایسی صورت میں روزہ فاسد ہوجائے گا ،الغرض منجن یا ٹوتھ پاؤڈر یا پیسٹ سے ممانعت کا مشورہ احتیاط کی بناپر ہے کہ غیر ارادی طورپر بھی بعض ذرات کا حلق میں چلے جانے کا امکان رہتاہے ،،تاہم محض ذائقہ محسوس ہونے سے روزہ نہیں ٹوٹے گا۔`
},
{
  pageNumber: 275,
  text: `[[heading: روزے کی قضافی الفور واجب نہیں ]]
سوال:
	کسی شخص کے رمضان کے روزے قضا ہوگئے ہوں تو ان کی قضا کب تک رکھ سکتاہے، (محمد طلحہ ہاشمی ، کراچی)۔
جواب:
اللہ تعالیٰ کا ارشاد ہے :’’[[arabic: فَمَن کَانَ مِنکُم مَّرِیْضاً أَوْ عَلٰی سَفَرٍ فَعِدَّۃٌ مِّنْ أَیَّامٍ أُخَرَ]]‘‘۔
ترجمہ:’’سوجو شخص تم میں سے بیمار ہو یا مسافر ہو (اور وہ روزے نہ رکھ سکے )تو دوسرے دنوں میں عدد (پوراکرنالازم ہے)،(البقرہ:184)‘‘۔
صحیح بخاری میں امام بخاری نے ایک باب باندھا:’’[[arabic: مَتٰی یُقْضیٰ قَضَاءُ رَمَضَانَ ]]‘‘، (رمضان کے روزوں کی قضا کب کی جائے )؟،اس باب کے تحت انہوں نے حضرت عبداللہ بن عباس اور حضرت عائشہ رضی اللہ عنہما کے حوالے سے درج ذیل روایات بیان فرمائی ہیں : ’’[[arabic: وَقَالَ ابْنُ عَبَّاسٍ:لَا بَاْسَ أَنْ یُفَرَّقَ لِقَوْلِ اللّٰہِ تَعَالٰی:فَعِدَّۃٌ مِّنْ أَیَّامٍ أُخَرَ]]‘‘۔
ترجمہ:’’ حضرت ابن عباس رضی اللہ عنہا نے فرمایا: اگریہ روزے مُتفرق رکھے جائیں توکوئی حرج نہیں ہے کیونکہ اللہ تعالیٰ نے فرمایا: تو دوسرے دنوں میں عدد (پوراکرنالازم ہے)،(البقرہ:184)‘‘۔قضا روزے رکھنے سے مراد یہ ہے کہ بلاناغہ تسلسل کے ساتھ رکھنا ضروری نہیں ہے، بلکہ اپنی سہولت کے مطابق بیچ میں وقفہ بھی کرسکتے ہیں۔نیز قضائے رمضان کا روزہ غیر رمضان میں اگر رکھنے کے بعدکسی وجہ سے ٹوٹ جائے یاتوڑ دیاجائے تو اس کا کفارہ نہیں ہے ،صرف قضا ہے ۔
’’[[arabic: عَنْ أَبِیْ سَلَمَۃَ قَالَ:سَمِعْتُ عَائِشَۃَ رَضِیَ اللّٰہُ عَنْہَا،تَقُوْلُ:کَانَ یَکُوْنُ عَلَیَّ الصَّوْمُ مِنْ رَمَضَانَ، فَمَا أَسْتَطِیْعُ أَنْ أَقْضِیَ إِلَّا فِی شَعْبَانَ، قَالَ یَحْیٰ:اَلشُّغْلُ مِنَ النَّبِیِّ أَوْ بِالنَّبِیِّ ﷺ]]‘‘۔
ترجمہ:’’ ابوسلمہ بیان کرتے ہیں : میں نے حضرت عائشہ رضی اللہ عنہا کو فرماتے سنا: میرے ذمے`
},
{
  pageNumber: 278,
  text: `[[heading: صنعتی مقصد میں استعمال ہونے والی مشینری پر زکوٰۃ کا حکم]]
سوال: 1
	ایک مشینری ہم نے باہر سے اس شرط پر خریدی کہ اُس کی آدھی قیمت ایڈوانس دیں گے اور آدھی قیمت مشینری نصب کرنے کے بعد اداکریں گے ۔ کیا مشینری کے لیے ادا کردہ یا مختص کی گئی رقم پر زکوٰۃ واجب ہے ؟،جو مشینری فیکٹری میں لگی ہوئی ہے ،اس پر زکوٰۃ کا کیا حکم ہے ؟، (کامران خان ، لاہور )۔
سوال: 2
	ایک کارپینٹر کے ساتھ 35 لاکھ روپے میں دروازے بنوانے کا معاہدہ طے ہوا، دس لاکھ روپے ادائیگی کر دی ہے۔اس نے کام پانچ جنوری کو شروع کرنا ہے۔ باقی پچیس لاکھ روپے کی ادائیگی کام مکمل ہونے پر ہے۔ جو باقی پچیس لاکھ روپے ہیں ،کیا ان کی زکوٰۃ مجھ پر واجب ہے؟،(سید محمد نعمان قادری)۔
جواب:
	سال کے آخر میں آپ کی مِلک میں جتنا بھی سونا ،چاندی ،نقد رقم اور جو مال کاروبار میں لگاہواہے ،الغرض تمام ذرائع سے جمع شدہ اس سارے مال پر زکوٰۃ واجب ہے ۔زکوٰۃ کی ادائی کا وقت آنے سے پہلے آپ مشینری یا دروازے بنانے کے لیے جو رقم اداکرچکے ہیں ، تو وہ زکوٰۃ سے مستثنیٰ ہوگی ، البتہ مشینری کے لیے درکار جو رقم ابھی آپ کے پاس موجود ہے،وہ زکوٰۃ سے مُستثنیٰ نہیں ہے۔جو مشینری کارخانے میں صنعتی مقصد کے لیے استعمال ہورہی ہیں ، ان کی مالیت پر زکوٰۃ نہیں ہے،یہی مشینری اگر کسی تاجر کے شوروم میں ہے اور وہ اس کاکاروبار کرتاہے ، تو ان کی موجودہ بازاری قیمت پر زکوٰۃ ہے، کیوں کہ اب یہ مالِ تجارت ہے، پیداوار کا ذریعہ نہیں ہے۔`
},
{
  pageNumber: 279,
  text: `[[heading: زکوٰۃ قمری سال کے حساب سے دی جائے گی ]]
سوال :
	زکوٰۃ قمری حساب سے دی جائے گی یا شمسی ؟کیا شمسی حساب سے زکوٰۃ ادا کرنے والا گنہگار ہے ؟،قمری حساب سے ادائیگی کی دلیل کیاہے؟،(انعام حسن مقدم ، کراچی)۔
جواب:
	سال سے مراد ہجری سال کے بارہ مہینے ہیں ،چونکہ یہ چاند کے حساب سے ہوتا ہے، اس لئے اسے قمری سال  Luminar Yearکہاجاتا ہے۔ بعض دینی احکام جیسے عیدین ،رمضان المبارک کے روزے، عدت کے احکام ،حج اور زکوٰۃ قمری سال سے متعلق ہیں ۔ قمری سال تقریباً 355دنوں پر مشتمل ہوتا ہے جبکہ شمسی سال 365دنوں کا ہوتا ہے ۔اگرشمسی (Gragorian)سال کے حساب سے زکوٰۃ ادا کی جائے تو قمری حساب سے یہ ایک سال ، دس دنوں پر ادا ہوئی ، دس دن زائد کی زکوٰۃ اُس کے ذمے رہے گی ۔ یعنی 32شمسی سال( جسے عرفِ عام میں سن عیسوی کہاجاتا ہے) مکمل ہونے پر تقریباً 33قمری سال ہوجاتے ہیں اور اس طرح ایک سال کی زکوٰۃ بیچ میں غائب ہوجاتی ہے ،جس کا آخرت میں حساب دینا ہوگا ۔
علامہ زین الدین ابن نُجیم حنفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وَالْمُرَادُ بِکَوْنِہٖ حَوْلِیًّا أَنْ یَتِمَّ الْحَوْلُ عَلَیْہِ،وَہُوَ فِی مِلْکِہٖ لِقَوْلِہٖ عَلَیہِ الصَّلَاۃُ وَالسَّلَامُ: لَا زَکَاۃَ فِیْ مَالٍ حَتّٰی یَحُوْلَ عَلَیْہِ الْحَوْلُ،قَالَ فِی الْغَایَۃِ:سُمِّیَ حَوْلًا، لِاَنَّ الْاَحْوَالَ تَحُوْلُ فِیْہِ، وَفِی الْقُنْیَۃِ الْعِبْرَۃُ فِی الزَّکَاۃِ لِلْحَوْلِ الْقَمَرِیِّ]]‘‘۔
ترجمہ:’’سال گزرنے سے مراد ،کسی شخص کی مِلک میں موجود مال پر پورا سال گزرنا ہے ، رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے:’’ کسی مال پر اس وقت تک زکوٰۃ نہیں جب تک کہ اُس مال پر پورا سال نہ گزر جائے ‘‘،’’الغایہ‘‘ میں ہے : ’’حول‘‘ نام اس لیے رکھاگیاہے کہ (درمیانِ سال کے) احوال بدلتے رہتے ہیں اور ’’قُنیہ‘‘ میں ہے: زکوٰۃ واجب ہونے کے لیے قمری`
},
{
  pageNumber: 280,
  text: `سال کا اعتبار کیاجائے گا ،(البحرالرائق ،جلد2،ص:356)‘‘۔
تنویرالابصار مع الدالمختار میں ہے :
’’[[arabic: (وَحَوْلُہَا) أَیْ الزَّکَاۃِ (قَمَرِیٌّ) بَحْرٌ عَنِ الْقُنْیَۃِ (لَا شَمْسِیٌّ)]]‘‘۔
ترجمہ:’’زکوٰۃ واجب ہونے کے لیے مال پر ایک قمری سال گزرنا شرط ہے ،نہ کہ شمسی ، ’’البحرالرائق ‘‘ میں ’’قُنیہ‘‘ کے حوالے سے اسی طرح ہے ‘‘۔
علامہ ابن عابدین شامی رحمۃ اللہ علیہ اس کی شرح میں لکھتے ہیں: 
’’[[arabic: عِبَارَتُہٗ مَعَ الْمَتْنِ وَأَجَلُ سَنَۃٍ قَمَرِیَّۃٍ بِالْاَہِلَّۃِ عَلَی الْمَذْہَبِ وَہِیَ ثَلٰثُمِائَۃٍ وَأَرْبَعٌ وَخَمْسُوْنَ وَبَعْضُ یَوْمٍ، وَقِیْلَ: شَمْسِیَّۃٌ بِالْاَیَّامِ وَہِیَ أَزْیَدُ بِاَحَدَ عَشَرَ یَوْمًا]]‘‘۔
ترجمہ:’’مذہبِ مختار کے مطابق زکوٰۃ اداکرنے کی مدت چاندوں کے اعتبار سے قمری سال ہے اوروہ 354دن کامل اور ایک دن کا کچھ حصہ ہے،  اور کہا جاتاہے کہ شمسی سال دنوں کی گنتی کے اعتبار سے گیارہ دن زائد ہونا ہے ، (جلد5، ص:538،مطبوعہ:دمشق)‘‘۔

[[heading: جمع شدہ ایڈوانس یا زرِ ضمانت پر زکوٰۃ نہیں ہے ]]
سوال:
	 میرے چھوٹے بھائی نے دکان کے ایڈوانس کی مد میں دو لاکھ روپے جمع کرائے ہوئے ہیں اور دکان میں ڈھائی لاکھ روپے کا مال بھی موجود ہے ،ماہانہ کرایہ دس ہزار روپے دیتاہے ۔ کیا بھائی پر زکوٰۃ واجب ہے ،کس چیز پر زکوٰۃ بنتی ہے ؟،(محمد ریحان ،ناظم آباد)۔
جواب:
	ناپ تول کے موجودہ اَعشاری نظام(Matric System) کے اعتبار سے نصاب ِشرعی کی کم ازکم مقدار 612.36 گرام چاندی یا اس کی رائج الوقت قیمت کے مساوی نقد رقم یا مالِ تجارت یا مُتفرق مال جو اس کی بنیادی حاجت سے زائد ہو، جس کا مالک ہونے سے مسلمان پر زکوٰۃ فرض ہوجاتی ہے۔حدیث پاک میں ہے :
’’ [[arabic: عَنْ عَلِیٍّ عَنِ النَّبِیِّ ﷺ قَالَ:فَاِذَا کَانَتْ لَکَ مِائَتَا دِرْھَمٍ وَحَالَ عَلَیْھَا الْحَوْلُ،]]`
},
{
  pageNumber: 281,
  text: `[[arabic: فَفِیْھَا خَمْسَۃُ دَرَاھِمَ ،وَلَیْسَ عَلَیْکَ شَیْئٌ یَعْنِیْ فِی الذَّھَبِ حَتّٰی تَکُوْنَ لَکَ عِشْرُوْنَ دِیْنَارًا،فَاِذَاکَانَتْ لَکَ عِشْرُوْنَ دِیْنَارًا وَّحَالَ عَلَیْھَا الْحَوْلُ، فَفِیْھَا نِصْفُ دِیْنَارٍ، فَمَازَادَ فَبِحِسَابِ ذٰلِکَ]]‘‘۔
ترجمہ:’’حضرت علی رضی اللہ عنہ بیان کرتے ہیں: نبی  صلی اللہ علیہ وسلم  نے فرمایا : جب تمہارے پاس دو سو درہم ہوں اوران پر ایک سال گزر جائے توان پر پانچ درہم زکوٰۃ ہے اور سونے پر اس وقت تک زکوٰۃ نہیں ہے جب تک کہ وہ بیس دینا ر نہ ہو ،پس جب سونا بیس دینا ر ہوجائے اور اس پر ایک سال گزر جائے، تو اس پر نصف دینارزکوٰۃ ہے ،پھر جب سونے کی مقداربڑھتی چلی جائے تو اُسی حساب سے زکوٰۃ عائد ہوگی،(سنن ابو داؤد ، جلد1، ص: 221 )‘‘۔ واضح رہے کہ دو سو درہم چاندی کا موجودہ وزن 612.36گرام ہے اور 20دینار سونے کا موجودہ وزن 87.48گرام ہے۔ایک تولہ 11.664گرام کے برابر ہوتا ہے۔اگر مال مخلوط ہے یعنی کچھ سونا ، چاندی ،نقد رقم یا مالِ تجارت وغیرہ ،تو اس صورت میں وجوبِ زکوٰۃ کے لیے چاندی کا نصاب معتبر ہے ،سونے کا نہیں ،لیکن اگر مال صرف سونا ہے اور دیگر مُتفرق اموال میں سے کچھ بھی نہیں ہے ،تو پھر سونے کے نصاب کا اعتبار ہوگا ۔
	آپ کے بیان کے مطابق آپ کے بھائی صاحبِ نصاب ہیں اور اُن پر زکوٰۃ کی ادائی لازم ہے ۔ ایڈوانس کی رقم پر زکوٰۃ نہیں ہے ،کیونکہ اس کی حیثیت رہن شدہ مال کی سی ہے کہ اس پر مالک کی ملکیت تو ہے ،لیکن قبضہ نہیں ہے اور نہ وہ اس پر تصرُّف کرسکتاہے ۔لہٰذا دکان میں جو ڈھائی لاکھ روپے مالیت کا مال ِ تجارت ہے ،اس پر زکوٰۃ واجب ہے اور اگر اس کے علاوہ کوئی نقد رقم یا چاندی /سونا وغیرہ ہے تو زکوٰۃ کی ادائی کے لیے اسے بھی مالیت میں جمع کرنا ہوگا ۔

[[heading: زکوٰۃ کے چند پیچیدہ مسائل ]]
	زکوٰۃ کے حوالے سے چند سوالات کے جوابات مطلوب ہیں ،اُمید ہے رہنمائی`
},
{
  pageNumber: 282,
  text: `فرمائیں گے ،(از: قادری فقیر، کراچی)۔
تمہید: ہمارے ہاں ایک مسئلہ یہ ہے کہ لوگ اپنی زیر ملکیت مالِ تجارت کا حکم الگ الگ پوچھتے ہیں ،یہی صورت حال سونے اور چاندی کی بابت درپیش ہوتی ہے ،شرعی حکم یہ ہے کہ جو قمری تاریخ کسی صاحب کی زکوٰۃ کاحساب لگانے کے لیے مقرر ہے ،اس تاریخ کو جتنا نقد،بینک اکاؤنٹس ، شیرز، بانڈز، سرٹیفیکٹس، کارخانے میں خام مال اور تیار مال، مارکیٹ میں واجب الوصول (Receivables)رقوم ،سونا چاندی ،تجارتی پلاٹ وعمارات وکارخانے وغیرہ ، الغرض سب کی مجموعی مالیت نکال کر اس پر زکوٰۃ اداکرنی ہوگی۔اگر آپ کے ذمے قرض ہے ،تو وہ مجموعی مالیت سے منہا ہوجائے گا ۔البتہ اگردس یا پندرہ یا بیس یا پچیس سال کی طویل مدت والے میعادی قرض  ہیں ،تووہ منہانہیں ہوں گے ،صرف اُن کی رواں سال کی اقساط منہا ہوں گی ۔سال کے دوران جو آپ کے ذاتی اور انتظامی اخراجات ہوجاتے ہیں ،وہ ازخود مالیت سے نکل جاتے ہیں یعنی زکوٰۃ آمدنی پر نہیں لگتی بلکہ اختتامِ سال پر تمام تر ذاتی ، انتظامی ودیگر مصارف وضع کرنے کے بعد جو مالیت بچ رہے،اس پر زکوٰۃ عائد ہوتی ہے ، اب ہم سوال وجواب سلسلہ وار تحریر کریں گے:
سوال:1
	اگر زمین کا سودا ایک لاکھ میں ہوا ،زمین کا بیعانہ پچاس ہزار روپے دیا اور باقی پچاس ہزار روپے اداکرنے باقی ہیں، تو زکوٰۃ کس پر لگے گی ، جبکہ زمین کی ملکیت کے بارے میں جھگڑا ہے ، زمین مل بھی سکتی ہے اور نہیں بھی، دونوں امکانات موجود ہیں۔
جواب:
	آپ نے سوال کی جو نوعیت بتائی ہے ،اس کی رو سے عقد مُتحقق نہیں ہوا ،آپ کایہ بیعانہ اگر قابلِ وصول ہے اور آپ کے پاس ثبوت وشواہد موجود ہیں، تو زکوٰۃ کاحساب نکالتے وقت اسے آپ اپنے مال میں جمع کریں گے ۔`
},
{
  pageNumber: 283,
  text: `سوال:2
	اگرکسی نے ایک زمین بلڈنگ بنانے کے لیے لی اور اس کی قیمت ایک کروڑ روپے ہے ،تو زکوٰۃ بلڈنگ مکمل ہونے کے بعد لگے گی یا جو زمین کی رقم ادا کی ہے ،اس پر لگے گی اور کب تک؟،کیونکہ بلڈنگ مکمل ہونے میں پانچ سال بھی لگ سکتے ہیں اور اس میں مزید پیسے بھی لگیں گے تو زکوٰۃ کیسے اداہوگی؟۔
جواب:
	چونکہ یہ زمین مالِ تجارت ہے، اس لیے اس کی موجودہ بازاری قیمت پر زکوٰۃ ہوگی ، جب اس کی تعمیر شروع ہوگی اور اگر تعمیر آپ اپنے مال سے کررہے ہوں گے، توہرسال زکوٰۃ کا حساب لگاتے وقت اسٹرکچر سمیت زمین کی جو قیمت ہوگی ،اس پر زکوٰۃ عائد ہوگی ۔ 
سوال:3
	بلڈنگ تعمیر ہورہی ہے ، ممبران سے اقساط کی صورت میں رقم وصول ہورہی ہے اور تعمیر پر بھی رقوم خرچ ہورہی ہیں ،مثال کے طورپر پچاس لاکھ روپے لوگوں سے آئے اور پچیس لاکھ روپے خرچ کردیے ،باقی پچیس لاکھ روپے بلڈر کے پاس رکھے ہیں ،تو زکوٰۃ کس پر ہوگی ؟۔
جواب:
	صورتِ مسئولہ میں خریدار اور بلڈر کے درمیان معاہدہ ’’ بیعِ استصناع‘‘ کاہے ، خریدار نے بلڈر کو جو رقم دی ہے ،نہ وہ رہن ہے اورنہ دَین کہ زکوٰۃ سے مُستثنیٰ قرار دیاجائے ، وہ ثمن ہے اور تاوقتیکہ قبضہ خریدار کو منتقل ہوجائے ،وہ بلڈر کی ملکیت ہے ،لہٰذا بلڈنگ پر خرچ شدہ اور بلڈر کے پاس جمع شدہ رقم اس کی مِلک ہے اور اُسی پر اُس کی زکوٰۃ عائد ہوگی ۔
سوال:4
	اگر بلڈنگ مکمل ہوتی ہے اور اس میں ایک کروڑ نفع ہوتا ہے تو زکوٰۃ کیانفع پر لگے گی ، نیز یہ نفع خرچ بھی ہوچکاہے ،باقی بچاہی نہیں ہے ،کیونکہ جو نفع ہوا اس کی کوئی زمین خرید لی`
},
{
  pageNumber: 284,
  text: `اور اس زمین پرہم زکوٰۃ نکال رہے ہیں توکیا جو نفع ہوا تھا ،اس پر زکوٰۃ ہوگی جبکہ وہ نفع موجود نہیں ہے ۔
جواب:
	اس کے لیے تمہیدی گفتگو کو دوبارہ پڑھ لیں ، دورانِ تعمیر بلڈنگ کی زکوٰۃ کا حکم سوال نمبر3 میں دے دیاگیاہے ،باقی مالکانہ بنیاد پر خریداروں کے نام قبضہ منتقل کرنے کے بعد وہ بلڈرکی مِلک سے خارج ہوجائے گی ۔منافع کی رقم سے جو بلڈرنے تجارتی پلاٹ خریدا ، وجوب وادائے زکوٰۃ کے لیے وہ بلڈر کی مجموعی مالیت میں جمع ہوجائے گا ۔جونقد ہے،وہ بلڈر کی مجموعی مالیت میں جمع ہوچکاہے ، اس پر بھی زکوٰۃ عائد ہوگی ،الّا یہ کہ جو رقم سال کے دوران و ہ اپنے ذاتی یا انتظامی یا تعمیری مصارف (سامان تعمیر مع کنٹریکٹر کی اجرت وغیرہ)پر خرچ کرچکے ہیں ،وہ رقوم اَزخوداس کی مجموعی مالیت سے وضع ہوچکی ہیں۔
سوال:5
	اگرکسی شخص کے پاس زمین ہے جو ایک کروڑ کی خریدی ،آج اس کی مارکیٹ ویلیو دو کروڑ ہے ،تو زکوٰۃ کس پر لگے گی جبکہ اس کے پاس رقم نہیں ہے، صرف زمین ہے جوکہ فروخت نہیں کی اورہوسکتا ہے کہ ویلیو دو کروڑ ہو،مگر اس زمین کا گاہک نہیں ہے ؟۔
جواب:
	جوبھی زمین تجارتی مقاصد کے لیے خریدی گئی ہے ،اس کی مارکیٹ ویلیو پر زکوٰۃ ہے ، قیمت خرید کا اعتبار نہیں ہے ،سونے ، چاندی، مالِ تجارت، صنعتی خام مال وتیار مال کایہی حکم ہے ،قیمت سے مراد وہ ہے کہ جس پر وہ فروخت ہوسکتی ہے ،زکوٰۃ کی ادائیگی میں تاخیر مستحسن نہیں بلکہ باعثِ گناہ ہے ، لیکن بعدمیں بھی بہرحال اداکرنی ہوگی ۔  
سوال:6
	 اگر کسی شخص نے کوئی زمین خریدی اور اس پر عدالت میں کیس دائر ہوگیا ،وہ اسے بیچ نہیں سکتا تو کیا اس کی قیمتِ خرید پر زکوٰۃعائد ہو گی اور کب تک؟۔`
},
{
  pageNumber: 285,
  text: `جواب: 
	اگر تجارتی مقصد کے لیے خریدی گئی زمین کی فروخت اور دیگر مالکانہ تصرُّ فات پر عدالت نے پابندی لگادی ہے اور خریدارکے غیر مشروط مالکانہ حقوق کو ابھی عدالت نے تسلیم نہیں کیا ،تو ملکیت کے مُتحقق ہونے اور قبضہ منتقل ہونے تک اس پر زکوٰۃ عائد نہیں ہوگی ۔ تاہم جب عدالت سے خریدارکے حق میں فیصلہ آجائے اوراسے قبضہ بھی مل جائے تو اس کے بعد رواں سال میںاس کو اُس کی زکوٰۃ دینی ہوگی ، لیکن اگر اس کے پاس اُس زمین کی ٹھوس ملکیتی دستاویزات اور شواہد موجود ہیں ،تو عدالت سے مالکانہ حق اور قبضہ ملنے پر پچھلے سالوں کی زکوٰۃ بھی دینی ہوگی ۔  
سوال:7۔
	 اگر کسی شخص نے کوئی اسکول کرایہ پر دیاہوا ہے اور ماہانہ کرایہ پانچ لاکھ روپے آتاہے ، سال کے آخر میںوہ کرایہ خرچ ہوجاتاہے یاکسی کاروبار میں لگ جاتاہے، تو زکوٰۃ آمدنی پر لگے گی یا اسکول کے لیے خریدی ہوئی زمین کی مالیت پر، یاجو خرچ کرلی ہے اورجس سے کوئی زمین خریدی ہے اُس پر؟۔
جواب: 
	صاحبِ نصاب نے جو اسکول کرائے پر دیا ہے ،تویہ مال تجارت نہیں ہے ،بلکہ اس کا ذریعہ ٔمعاش ہے، اُسے جو ماہانہ کرایہ ملتاہے ،وہ اُس کے دیگر ذرائع آمدن کے ساتھ جمع ہوجاتاہے،زکوٰۃ کے مالی سال کے اختتام پر یا زکوٰۃ کا حساب لگانے سے پہلے دورانِ سال جو خرچ ہوتارہا، وہ ازخود اس کی ملکیت سے منہاہوگیاہے،سال کے اختتام پر تمام ذرائع سے جو ا س کا مال جمع ہوگا ،اُس پر زکوٰۃ ہوگی ،اِس میں وہ پلاٹ بھی شامل ہوگا ،جو کرائے کی آمدنی سے تجارتی مقصد کے لیے خریدا گیاہے ۔
سوال:8۔
	 اگرکوئی زمین خرید کر اللہ کے نام پروقف کرد ے ،کیا اُس زمین میں زکوٰۃ کی رقم`
},
{
  pageNumber: 286,
  text: `استعمال کرسکتے ہیں ؟۔

جواب : 
	جو زمین کسی نے خرید کر اللہ کے نام پر وقف کردی ہے ،وہ اُس کی ملک سے نکل گئی اور اللہ کی مِلک ہوگئی ہے ،اب وہ شخص نہ اُس زمین کا مالک ہے ، نہ اُس پر مالکانہ تصرُّف کرسکتا ہے، البتہ وہ وقف کے مُتولی کے طورپر اس کے مالی وانتظامی معاملات کی نگرانی کرسکتاہے اور اس میںواقف کا استحقاق کسی دوسرے شخص سے زیادہ ہے، موقوفہ جائیداد پر کوئی زکوٰۃ نہیں ہے ،کیونکہ وہ پوری جائیداد راہ خدا میں وقف ہوچکی ہے ،یہ ایسے ہی ہے جیسے کسی شخص نے زکوٰۃ کی ادائیگی کا وقت آنے سے پہلے اپنا سارا مال اللہ کی راہ میں دیدیاہو یا وقف کردیا ہو تواب اس مال کی زکوٰۃ اُس پر واجب نہیں ہے ، کیونکہ وہ سارا مال اللہ کی راہ میں خرچ ہوگیا ۔البتہ وقف کردہ زمین پر زکوٰۃ کی رقم خرچ کرنے کی بابت جو سوال کیاگیاہے ، اس کے بارے میں واقف کو اپنے مقاصداور تفصیلات بتانی ہوگی اور اس کے ذہن میں جو طریقۂ کار ہے ،اُس کی وضاحت کرنی ہوگی ۔تب ہی ہم اُن تفصیلات کی روشنی میں شرعی حکم بتاسکیں گے ، مطلقاً اجازت نہیں دے سکتے ۔			
سوال:9
	لوگوں کو مدرسہ بناکر دے دیاہو ،کیااُس پر زکوٰۃ کی رقم استعمال ہوسکتی ہے ؟۔
جواب :
	آپ زکوٰۃ کی رقم سے براہِ راست مدرسہ بناکر نہیں دے سکتے ،البتہ اگر اس مدرسے میں مستحقِ زکوٰۃ طلبہ یا طالبات تعلیم پارہے ہیں ،ان کے جملہ مصارف کے لیے زکوٰۃ دے سکتے ہیں ،اس کو شرعی طریقے کے مطابق خرچ کرنا اہل مدرسہ کی ذمہ داری ہے ۔ 
سوال:10
	زکوٰۃ کی رقم سے کسی کو کوئی یونیورسٹی بناکر دی اور جس کو دی ہے ،وہ اس کو کمرشل اور فی سبیل اللہ دونوں طریقے سے استعمال کرتے ہیں، کیایہ طریقہ صحیح ہے اور اس پر زکوٰۃ کی رقم`
},
{
  pageNumber: 287,
  text: `کا خرچ کرنا جائز ہے؟۔
جواب :
	کسی شخص نے زکوٰۃ کی رقم سے جو یونیورسٹی بنائی ہے ،اس سے زکوٰۃ ادانہیں ہوئی ، البتہ وہاں جو مستحق طلبہ یا طالبات دینی یا عصری تعلیم پارہے ہیں ،اُن کے مصارف کے لیے آپ زکوٰۃ دے سکتے ہیں ،یونیورسٹی چلانے والے فرد یاادارے کی ذمے داری ہے کہ وہ شرعی حدود وقیود اور احکام کے مطابق ان مستحقین پر زکوٰۃ اور صدقاتِ واجبہ (فطرہ ،فدیہ ، کفارات اور نذر)کی رقم خرچ کریں ۔یونیورسٹی کی تعمیر پر کسی صاحبِ نصاب نے زکوٰۃ کی جو رقم لگائی ہے ،وہ زکوٰۃ ادانہیں ہوئی ،وہ زکوٰۃ بدستوراُس شخص کے ذمے واجب الادا ہے،اسے اداکرنا ہوگا ،چاہے جتنا وقت گزرگیاہو ، تاہم فریضۂ زکوٰۃ کی ادائیگی میں تاخیر گناہ کا سبب ہے ۔جب تک کاروباری اور رفاہی یعنی مخلوط ادارے کا تفصیلی طریقۂ کار معلوم نہ ہو ، ہم حتمی رائے نہیں دے سکتے ۔سوال میں یہ بھی واضح نہیں ہے کہ وہ یونیورسٹی کس کی مِلک ہے ،اگروہ شخصی ملکیت ہے ، تو وہ مالک کی کل مالیت کا حصہ ہے ۔
سوال:11
	 اگر کسی صاحبِ نصاب نے پانچ لاکھ روپے کسی کو انویسٹ کرنے کے لیے دیئے ،ایک سال گزر گیا،کوئی نفع نہیں آیا ،تو زکوٰۃ کس رقم پر لگے گی اور اگر دوسال بعد اس کا نفع ایک لاکھ آتاہے تو زکوٰۃ نفع پر لگے گی یا کاروبار میں لگائی ہوئی اصل رقم پر ؟۔
جواب: جو رقم کاروبار میں انویسٹ کی ہے ،دیکھنا ہوگا کہ انویسٹر نے شراکت کا معاہدہ کیا ہے یا مضاربت کا اور آیا وہ معاہدہ شریعت کے مطابق ہے یانہیں ، تاہم ہرسال زکوٰۃ اصل مع منافع (یعنی مجموعی رقم) پر عائد ہوگی ،اگر کسی سال نفع نہیں آیا تو صرف اصل مال پر زکوٰۃ واجب ہوگی ۔اگلے سال منافع آگیا ہے ،تو اس سال منافع اوراصل رقم کے مجموعے پر زکوٰۃ واجب ہوگی ۔`
},
{
  pageNumber: 288,
  text: `سوال:12
	 اگرصاحبِ نصاب نے کسی کو قرض دیا اور وہ قرض واپس نہیں مل رہا توکیا اس پر زکوٰۃ ہوگی ؟۔
جواب: 
	آپ کے بیان سے ظاہر ہوتاہے کہ آپ کا دین ،’’دینِ ضعیف ‘‘ ہے ،سال بہ سال اس کی زکوٰۃ آپ پر لازم نہیں ہے، لیکن تقدیرِ الٰہی سے آئندہ  کبھی قرض کی وہ رقم واپس آپ کو مل گئی تو اس سال سے اس پر زکوٰۃ عائد ہوگی ،ماضی کے سالوں کی نہیں ہوگی۔ لیکن اگرقرض خواہ کے پاس اس قرض کے ٹھوس قانونی ثبوت وشواہد موجود ہیں ،تو قرض ملنے پر ماضی کے سالوں کی زکوٰۃ بھی اسے دینا ہوگی اور اگر اُس کے پاس ثبوت وشواہد موجودنہیں ہیں تو رقم ملنے پر پچھلے سالوں کی زکوٰۃ اُس پر عائد نہیں ہوگی ۔
سوال: 13
	کسی صاحبِ نصاب نے کسی شخص کو دس ہزار روپے قرض دیا اور وہ ماہانہ ایک ہزار روپے واپس کررہاہے ،تو زکوٰۃ کتنی رقم پر لگے گی ؟۔
جواب: 
	آپ کے بیان کے مطابق آپ کا یہ دین ، دینِ قوی ہے ،زکوٰۃ کا حساب نکالتے وقت جتنا دَین مدیون کے ذمے باقی ہے ، اسے بھی آپ اپنے مال میں شامل کریں گے اور جو اقساط آپ کو وصول ہوچکی ہیں ، وہ ازخود آپ کے مال میں جمع ہوچکی ہیں ، الغرض سب پر زکوٰۃ ہے۔
سوال:14
	مستحق  لوگوں میں زکوٰۃ کی رقم سے راشن تقسیم کرنا صحیح ہے ؟۔
جواب:
	مستحقِ زکوٰۃ لوگوں کو زکوٰۃ کی رقم سے راشن ،کپڑے ،اشیائے ضرورت دی جا سکتی`
},
{
  pageNumber: 289,
  text: `ہیں، بشرطیکہ پہلے مستحقین کا تعین کرلیاجائے اوریہ چیزیں ان کی ملک کردی جائیں ، ان اشیاء کی قیمت خرید زکوٰۃ میں شمار ہوگی ۔بازاروں اور چوراہوں پر جو لنگر لگائے جاتے ہیں ، ان پر زکوٰۃ اور تمام صدقاتِ واجبہ (فطرہ، فدیۂ صوم،کفارۂ قسم ،کفارۂ صوم اور نذر) کی رقوم خرچ نہیں کی جاسکتیں ،کیونکہ ایک تو ان کو مالکانہ تصرّف کا حق حاصل نہیں ہوتا ،اس لیے کہ اُسی مقام پر بٹھا کر کھلانے سے تشہیر مقصود ہوتی ہے ،دوسرا مستحق اور غیر مستحق کا فر ق نہیں ہوتا ،تیسرا یہ کہ غیر مسلم بھی آکر شامل ہوجاتے ہیں ،جبکہ صدقاتِ واجبہ صرف مسلم فقراء ومساکین کا حق ہے ،البتہ نفلی خیرات غیر مسلم کو دی جاسکتی ہے ۔	
سوال:15
	 لوگوں کا علاج کرواکر زکوٰۃ کی رقم سے اسپتال کابل اداکرنا درست ہے ؟۔
جواب: 
	اس کا بہتر طریقہ یہ ہے کہ آپ اسپتال والوں کیساتھ اپنے بھیجے جانے والے (Referred) زکوٰۃ کے مستحق مریضوں کے علاج کے ضامن بننے کا ایک عمومی معاہدہ کرلیں ،پھر جب آپ کے بھیجے ہوئے مستحق مریض کا علاج مکمل ہوجائے تو مریض کے سارے بل جمع کرکے زکوٰۃ دینے والا خود یا اس کا وکیل موقع پر مریض کو نقد رقم دیدے کہ اپنے اسپتال کے واجبات اداکردو ۔امریکا اور مغرب میں اگرچہ ہیلتھ انشورنس کی پالیسی شریعت کے مطابق نہیں ہوتی ، لیکن اُن کا فارمیٹ تقریباً اسی قسم کا ہوتا ہے ، اسپتال یا ڈاکٹر مریض کا علاج مکمل کرنے کے بعد انشورنس کمپنی سے اپنا بل وصول کرتے ہیں ۔ 

[[heading: پلاٹ پر زکوٰۃ کا حکم ]]
سوال:
	 بچوں کے لیے جو پلاٹ خریدے ،اُن پر زکوٰۃ کا کیا حکم ہے ،نیز اُن کے فروخت کیے جانے پر زکوٰۃ کا کیا حکم ہے ؟۔پلاٹ ذاتی رہائش کے لیے خریدا یا کرائے پر دینے کے لیے خریدا ،اس پر زکوٰۃ کا کیا حکم ہے ؟۔`
},
{
  pageNumber: 290,
  text: `جواب:
	جو پلاٹ ذاتی رہائش کے لیے خریدے گئے ہوں ،اُن پر زکوٰۃ ادانہیں کی جائے گی ، اگر کسی موقع پر اُس پلاٹ کو فروخت کردیتے ہیں تو پہلے صاحب نصاب ہونے کی صورت میں جب اپنے مال کی زکوٰۃ اداکریں گے تو اس رقم پر بھی زکوٰۃ عائد ہو گی اور اگر پہلے سے صاحبِ نصاب نہیں ہوں گے ، تو اس وقت سے اس کا سال شروع ہوگا ۔ البتہ جو پلاٹ یا مکان یا فلیٹ تجارت کی نیت سے خریدے کہ اس پر نفع حاصل کریں گے،اس کی مارکیٹ ویلیو پر زکوٰۃ اداکی جائے گی ۔

[[heading: کرائے کی آمدنی پر زکوٰۃ کا حکم ]]
سوال:
	 دو کروڑ کا فلیٹ خریدا ،سالانہ تین لاکھ روپے کرایہ آتاہے ،جو استعمال ہوجاتاہے ، سال کے آخر میں صرف پچاس ہزار روپے بچتے ہیں ،مکان کی موجودہ مارکیٹ ویلیو چار کروڑ روپے ہے، زکوٰۃ کس رقم پر ہوگی ؟۔
جواب:
	یہ فلیٹ مال تجارت نہیں ہے ،بلکہ آپ کا ذریعہ آمدنی ہے ، اس لیے اس فلیٹ کی مارکیٹ ویلیو پر زکوٰۃ نہیں ہوگی بلکہ سال کے دوران جو آپ کے ذاتی اور انتظامی اخراجات ہوجاتے ہیں ،وہ ازخود مالیت سے نکل جاتے ہیں یعنی زکوٰۃ اس فلیٹ کی آمدنی پر نہیں لگے گی بلکہ اختتامِ سال پر تمام تر ذاتی ، انتظامی ودیگر مصارف وضع کرنے کے بعد جو مالیت بچ رہے گی،وہ آپ کے دیگر ذرائع آمدن ،اموال،نقد ،بانڈ ز،سرٹیفیکٹس ،سونا چاندی اور مالِ تجارت کے ساتھ (اگرہے)جمع ہوگی اور آپ کو اپنی مجموعی مالیت پر زکوٰۃ دینی ہوگی ،یعنی جب کوئی شخص ایک بار صاحبِ نصاب ہوگیا توہر آئٹم کی الگ الگ زکوٰۃ کا سوال غیر متعلق ہوجاتاہے ، اسے اپنے تمام ذرائع آمدن کو جمع کرکے زکوٰۃ نکالنی ہوگی ،دوران سال جورقم خرچ ہوگئی ہے ،وہ ازخود منہاہوجائے گی ۔`
},
{
  pageNumber: 291,
  text: `[[heading: گزشتہ سالوں کی زکوٰۃ ادا کرنی ہوگی ]]
سوال:
	ایک خاتون کے پاس ساڑھے سات تولہ سے زیادہ سونے کے زیورات ہیں ،عرصہ پچیس سال سے زکوٰۃ ادا نہیں کی گئی ،اب وہ چاہتی ہیں کہ گزشتہ پورے عرصے کی زکوٰۃ اداکی جائے ۔معلوم یہ کرناہے کہ سونے کے سارے وزن پر سونے کی قیمت موجودہ نرخ کے مطابق لگائی جائے گی ؟،زکوٰۃ اقساط میں اداکی جاسکتی ہے یا یکمشت اداکرنا ہوگی ؟ ۔ ان کی ایک غیر شادی شدہ بیٹی ہے ،کیا نصاب سے زائد سونا اسے دے سکتی ہے ؟،(ڈاکٹر عبدالرزاق ،کالا گوجراں جہلم)۔
جواب:
	مذکورہ خاتون صاحبِ نصاب ہیں اور اُن پر زکوٰۃ واجب ہے ،گزشتہ سالوں کی زکوٰۃ کی ادائی بھی اُن پر لازم ہے ،ادائی میں تاخیر پر گنہگار ہوئیں ، اللہ تعالیٰ سے اس پر توبہ واستغفار کریں اور فوری طورپر ماضی کے تمام سالوں کی زکوٰۃ کی ادائی کا اہتمام کریں ،علامہ نظام الدینرحمۃ اللہ علیہ مُتوفّٰی 1161؁ھ لکھتے ہیں:
’’[[arabic: وَتَجِبُ عَلَی الْفَوْرِ عِنْدَتَمَامِ الْحَوْلِ حَتّٰی یَأثَم بِتَاْخِیْرِہٖ مِنْ غَیْرِعُذْرٍ،وَفِیْ رِوَایَۃِ الرَّازِیْ  عَلَی التَّرَاخِی حَتّٰی یَأثَمَ عِنْدَ الْمَوتِ،وَالْاَوَّلُ أَصَحُّ کَذَا فِی التَّہْذِیْبِ ]]‘‘۔
ترجمہ:’’اور زکوٰۃ سال پورا ہونے پر فوراً واجب ہوجاتی ہے ، یہاں تک کہ کسی عذر کے بغیر زکوٰۃ کی ادائی میں تاخیرپر گنہگار ہوگا اور امام رازی کے نزدیک تاخیر سے مراد یہ ہے کہ موت کے وقت (تک اگر ادانہ کی ) گنہگار ہوگا اور پہلی روایت زیادہ صحیح ہے،جیساکہ ’’تہذیب‘‘ میں ہے،(فتاویٰ عالمگیری ، جلد1، ص:170)‘‘۔
	اگر آپ کے پاس ریکارڈ ہے کہ گزشتہ سالوں کے اختتام پر سونے کی مقدار کیا تھی ، توہرسال کے اختتام پر کل مقدار کے ڈھائی فیصد کی شرح سے پچھلے سال کی زکوٰۃ ادا کرنی ہوگی اور اسی ترتیب سے گزشتہ سالوں کی زکوٰۃ اداکریں اورزیادہ محتاط بات یہ ہے کہ`
},
{
  pageNumber: 292,
  text: `ہرسال کے اختتام پر موجود سونے کے وزن کا چالیسواں حصہ بطور زکوٰۃ وضع کرلیں اور پھر سونا دیں یا اس کے برابر موجودہ نرخ کے مطابق قیمت دیدیں ۔

[[heading: ذاتی استعمال کے لیے خرید کردہ پلاٹ پر زکوٰۃ نہیں ہے ]]
سوال: 
	میرے بیٹے مشترکہ خاندان کی صورت میں میرے ساتھ ہی رہتے ہیں ،سب بالغ اور شادی شدہ ہیں ،انہوں نے اپنے اپنے پلاٹ خریدے ہوئے ہیں لیکن مکان تعمیر کرانے کی پوزیشن میں نہیں ہیں ،کیا ان پلاٹوں پر زکوٰۃ دینا ہوگی ؟۔
جواب:	
	جو پلاٹ ذاتی رہائش کے لیے خریدے گئے ہوں ،اُن پر زکوٰۃ واجب نہیں ہے ، اگر کسی موقع پر اُس پلاٹ کو فروخت کردیتے ہیں تو پہلے سے صاحب نصاب ہونے کی صورت میں جب اپنے مال کی زکوٰۃ اداکریں گے تو اس رقم پر بھی زکوٰۃ عائد ہو گی اور اگر پہلے سے صاحبِ نصاب نہیں ہوں گے ، تو اُس وقت سے اس کا سال شروع ہوگا ۔ البتہ جو پلاٹ یا مکان یا فلیٹ تجارت کی نیت سے خریدے کہ اس پر نفع حاصل کریں گے،اس کی مارکیٹ ویلیو پر زکوٰۃ اداکی جائے گی ۔اس میں خریدتے وقت کی نیت کا اعتبار ہوتاہے ،اگر خریدتے وقت ذاتی استعمال کی نیت تھی، بعدمیں نفع حاصل کرنے کے ارادے سے بیچنے کی نیت کرلی ،تو جب تک بیچ نہ لے ،اس پلاٹ پر زکوٰۃ عائد نہیں ہوگی ۔

[[heading: کرائے کے مکان کی قیمت پر زکوٰۃ عائد نہیں ہوگی ]]
سوال: 
	ایک بیٹے نے اسلا م آباد میں مکان کرائے پر دیاہواہے ،کیا مکان کی پلاٹ سمیت قیمت پر زکوٰۃ واجب ہوگی ؟۔

جواب:
	یہ مکان مال تجارت نہیں ہے ،بلکہ اس کا ذریعہ آمدنی ہے ، اس لیے اس مکان کی`
},
{
  pageNumber: 293,
  text: `مارکیٹ ویلیو پر زکوٰۃ نہیں ہوگی بلکہ سال کے دوران جو ذاتی اور انتظامی اخراجات ہوجاتے ہیں ،وہ ازخود مالیت سے نکل جاتے ہیں، یعنی زکوٰۃ اس مکان کی آمدنی پر نہیں لگے گی بلکہ اختتامِ سال پر تمام تر ذاتی ، انتظامی ودیگر مصارف وضع کرنے کے بعد جو مالیت بچ رہے گی،وہ آپ کے دیگر ذرائع آمدن ،نقد ،بانڈ ز،سرٹیفیکٹس ،سونا چاندی اور مالِ تجارت کے ساتھ جمع ہوگی اور آپ کو اپنی مجموعی مالیت پر زکوٰۃ دینی ہوگی ،یعنی جب کوئی شخص ایک بار صاحبِ نصاب ہوگیا توہر آئٹم کی الگ الگ زکوٰۃ کا سوال غیر متعلق ہوجاتاہے ، اسے اپنے تمام ذرائع آمدن کو جمع کرکے زکوٰۃ نکالنی ہوگی ،دوران سال جورقم خرچ ہوگئی ہے ،وہ ازخود منہاہوجائے گی ۔

[[heading: زکوٰۃ میں غیر شرعی تصرُّف کی درستگی ]]
سوال:
	 ہمارا ادارہ ایک فلاحی ادارہ ہے ،ہمارے ادارے کے پاس 1975؁ء میں جنرل فنڈ سے خریدے گئے 120گز کے دو پلاٹ تھے ۔1987؁ء میں مخیر حضرت کی زکوٰۃ سے 23فلیٹوں پر مشتمل دومنزلہ عمارت تعمیر کی ،اخراجات ساڑھے سات لاکھ روپے آئے ۔یہ فلیٹ ضرورت مند اور مستحق ممبران کے درمیان رہائش کے لیے تقسیم کیے گئے ،لیکن مالکانہ حقوق نہیں دیے گئے ۔ہردوسال بعد کمیٹی تبدیل ہوتی اور فلیٹ کے مکین بھی تبدیل ہوتے ، جب کوئی کمیٹی ان مکینوں کو مالکانہ حقوق دینے کا ارادہ کرتی تو یہ احساس ہوتاکہ جس زمین پر یہ عمارت تعمیر کی گئی ہے ،وہ ادارے کی ملکیت ہے ۔1987؁ء میں عمارت کی تعمیر پر ساڑھے سات لاکھ روپے صرف ہوئے تھے ،جبکہ اب اس طرح کی عمارت ایک کروڑ دس لاکھ روپے میں تعمیر ہوگی ۔معلوم یہ کرناہے کہ ماضی کی غلطی کو کس طرح درست کیاجائے ، زکوٰۃ اور جنرل فنڈ کا تناسب 1987؁ء کے حساب سے ہوگایا آج کے دور کے حساب سے ۔ ہمارے ادارے کی ملکیت بھی باقی رہے اور زکوٰۃ بھی اداہوجائے ،(عبدالکریم ،سیکریٹری پوربندر میمن جماعت ،کراچی)۔`
},
{
  pageNumber: 294,
  text: `جواب: 
	جس نادار فقیر اور مستحقِ زکوٰۃ کو زکوٰۃ کی رقم سے مکان یا فلیٹ بناکر دیا جائے تو اُسے شرعی اور قانونی طور پر اس کامالک بنانا ضروری ہے اور زکوٰۃ کی رقم سے مکان بناکردینے والے فرد یافلاحی انجمن کو اس کے مالکانہ تصرُّف پر پابندی لگانے کا کوئی اختیارنہیں۔کیونکہ زکوٰۃ کی ادائیگی کے لئے تملیک ( مالک بنانا)شرط ہے، یعنی جس مستحق کو زکوٰۃ نقد یا پلاٹ یامکان کی صورت میں دی جارہی ہے، اُسے اُ س مال پر تصرُّف کا مکمل اختیار حاصل ہونا چاہیے۔ جو شخص اپنے مال پر زکوٰۃ اداکررہاہے ، شرعاً اُسے بھی اِس طرح کی شرائط عائد کرنے کا اختیار حاصل نہیں اور جس ادارے یا انجمن کے توسط سے یہ کام انجام دیے جائیں، وہ بھی کسی قسم کی شرائط عائد نہیں کرسکتے کیونکہ اس طرح کی شرائط سے مالکانہ تصرُّف کا اختیارباطل ہوجاتاہے،تنویر الابصار مع الدر المختار میں ہے:
’’[[arabic: (ھِیَ)لُغَۃً:اَلطَّہَارَۃُ وَالنَّمَاءُ،وَشَرْعاً:(تَمْلِیْکٌ)خَرَجَ الْاِبَاحَۃُ،فَلَوْ أَطْعَمَ یَتِیْماً نَاوِیاً الزَّکَاۃَ لَایُجْزِیْہِ،اِلَّا اِذَا دَفَعَ اِلَیْہِ الْمَطْعُوْمَ،کَمَالَو ْکَسَاہُ بِشَرْطِ أَنْ یَعْقِلَ الْقَبْضَ]]‘‘۔
ترجمہ:’’ زکوٰۃکے لغوی معنیٰ ہیں:’’(مال کا) پاک ہونااور (مال کا )بڑھنا ‘‘ ۔زکوٰۃ کے شرعی معنی ہیں:’’فقیر کومالِ زکوٰۃ کا مالک بنادینا ‘‘۔تملیک کی قید سے محض مباح کردینا (یعنی فقرا کومالِ زکوٰۃکے استعمال کی عام اجازت دینا) خارج ہوگیا، پس اگر کسی شخص نے نادار یتیم کو زکوٰۃکی نیت سے کھانا کھلا دیا،تواس سے زکوٰۃ ادا نہیں ہوگی۔مگر جب وہی کھانا یتیم کے حوالے کر دیا جائے تو زکوٰۃ ادا ہوجائے گی، جیسے اگر ادائے زکوٰۃ کے لئے یتیم کو کپڑا پہنایا بشرطیکہ وہ قبضے کی حقیقت کو سمجھتا ہو (توزکوٰۃ ادا ہوجائے گی)‘‘۔ آگے چل کر مزید لکھتے ہیں:’’[[arabic: وَیَشْتَرِطُ أَنْ یَّکُوْنَ الصَّرْفُ(تَمْلِیْکاً)لَااِبَاحَۃً کَمَا مَرَّ ]]‘‘۔
ترجمہ:’’ اورزکوٰۃادا کرنے کی شرط یہ ہے کہ نادار کو مالک بنا دیا جائے نہ کہ محض استعمال کرنے کی اجازت دی ہو، جیسا کہ(گزشتہ سطور میں) گزرا،(ردالمحتار علی الدرالمختار، جلد: 3،ص:161 ، 264-263)‘‘۔`
},
{
  pageNumber: 295,
  text: `	آپ نے لکھا :’’یہ فلیٹ ضرورت مند اور مستحق ممبران کے درمیان تقسیم کیے گئے ،لیکن مالکانہ حقوق نہیں دیئے گئے ‘‘، 1987؁ء سے معاملات اسی طرح ہیں ،یہ برا ہوا ۔ آپ کی جماعت زکوٰۃ دینے والے شخص کی وکیل ہے اور وکیل کی ذمے داری ہے کہ زکوٰۃ مستحقین تک پہنچائے ، آپ کی جماعت نے جو تصرُّف کیا ہے، یہ خلافِ شرع ہے اور اس سے زکوٰۃ ادانہیں ہوئی ،آپ کی جماعت کی ہر دور کی انتظامیہ عنداللہ اس کے لیے جوابدہ ہے۔
علامہ نظام الدین رحمۃ اللہ علیہ مُتوفّٰی 1161؁ھ لکھتے ہیں:
’’[[arabic: وَتَجِبُ عَلَی الفَوْرِ عِنْدَ تَمَامِ الْحَوْلِ حَتّٰی یَأثَمَ بِتَاْخِیْرِہٖ مِنْ غَیْرِعُذْرٍ،وَفِیْ رِوَایَۃِ الرَّازِیْ عَلَی التَّرَاخِیْ حَتّٰی یَأثَمَ عِنْدَ الْمَوْتِ،وَالْاَوَّلُ أَصَحُّ کَذَا فِی التَّہْذِیْبِ ]]‘‘۔
ترجمہ:’’اور زکوٰۃ سال پورا ہونے پر فوراً واجب ہوجاتی ہے ،یہاں تک کہ کسی عذر کے بغیر زکوٰۃ کی ادائی میں تاخیرپر گنہگار ہوگا اور امام رازی کے نزدیک تاخیر سے مراد یہ ہے کہ موت کے وقت (تک اگر ادانہ کی تو) گنہگار ہوگا اور پہلی روایت زیادہ صحیح ہے،جیساکہ ’’تہذیب‘‘ میں ہے،(فتاویٰ عالمگیری ، جلد1، ص:170)‘‘۔
تنویرالابصارمع الدرالمختار میں ہے:
’’[[arabic: (وَقِیْلَ:فَورِیٌّ)أَیْ وَاجِبٌ عَلَی الْفَوْرِ(وَعَلَیْہِ الْفَتْویٰ)کَمَا فِی’’شَرْحِ الْوَھْبَانِیَّۃِ‘‘(فَیَاثَمُ بِتَاخِیْرِہَا)بِلَاعُـذْرٍ (وَتُرَدُّ شَھَادَتُہٗ)لِاَنَّ الْاَمْرَبِالصَّرْفِ اِلَی الْفَقِیْرِمَعَہٗ قَرِیْنَۃُالْفَوْرِ وَھِیَ اَنَّہٗ لِدَفْعِ حَاجَتِہٖ وَھِیَ مُعَجَّلَۃٌ فَمَتٰی لَمْ تَجِبْ عَلَی الْفَوْرِلَمْ یَحْصُلِ الْمَقْصُوْدُ مِنَ الْاِیْجَابِ عَلٰی وَجْہِ التَّمَامِ وَتَمَامُہٗ فِی الْفَتْحِ ]]‘‘۔
ترجمہ:’’بعض نے کہا: زکوٰۃ فوری ہے یعنی زکوٰۃ فی الفور لازم ہوجاتی ہے اور اسی پر فتویٰ ہے ،جیسا کہ’’ شرح وہبانیہ‘‘ میں ہے،پس تاخیر کے ساتھ ادائی سے گناہ لازم لائے گا،جب کہ تاخیر عذر کے بغیر ہو اور ایسے شخص کی شہادت مردود ہے ،کیونکہ حکم زکوٰۃ کے ساتھ مصرفِ زکوٰۃ فقراء کا ذکر کرنا اس پر قرینہ ہے کہ فی الفور ادا ئی ہو، کیونکہ زکوٰۃدینا ضروریاتِ فقیر کو پورا کرنے کے لیے ہوتا ہے اور اس کو جلد اداکرنامقصود ہے اور اگر یہ فی الفورلازم نہ`
},
{
  pageNumber: 296,
  text: `ہو تو ایجابِ زکوٰۃ کا مقصد کامل طورپر حاصل نہ ہوگا،اس کی تفصیل فتح القدیر میں ہے ، (جلد5،ص:462،دمشق)‘‘۔
	جس جنرل فنڈ سے آپ نے اپنی جماعت کے لیے پلاٹ خریدا ہے، بادی النظر میں وہ بھی نفلی صدقہ وخیرات کی رقم ہے ، یہ پلاٹ کسی واقف نے کسی خاص مقصدکے لیے وقف تو کیانہیں کہ اس کو علیٰ حالہٖ قائم رکھنا ضروری ہو ۔لہٰذا اگر آپ کی جماعت کو اس پر فلیٹ تعمیر کرنے اور مستحقین کو استعمال کے لیے دینے کا حق ہے ،تو آپ انہیں مالکانہ بنیاد پربھی دے سکتے ہیں،اس طرح آپ زکوٰۃ کی ادائیگی سے بھی بری الذمہ ہوسکتے ہیں ،ادائیگی میں تاخیر پر آپ کی تمام ادوار کی انتظامیہ کو اللہ تعالیٰ کے حضور توبہ کرنی چاہیے۔لیکن اگر آپ یہ طریقہ اختیار نہیں کرتے تو جس کمیٹی نے زکوٰۃ کا پیسہ ان فلیٹوں پر لگایاہے ،وہ تصرُّف ناجائز تھا ،وہ اس رقم کے ضامن اورکفیل وامین ہیں،انہیں اس کی تلافی کرنی ہوگی ،کیونکہ زکوٰۃ کی وہ رقم کسی حادثے یا سرقے یا غصب یا ڈاکہ کے سبب ضائع نہیں ہوئی کہ آپ تاوان سے بری الذمہ ہوجائیں ،دُرّمختار میں ہے :
’’[[arabic: وَلَا تُضْمَنُ بِالْہَلَاکِ مِنْ غَیْرِ تَعَدٍّوَشَرْطُ الضَّمَانِ بَاطِلٌ کَشَرْطِ عَدَمِہٖ فِی الرَّہْنِ خِلَافًا لِلْجَوْہَرَۃِ]]‘‘۔
  ترجمہ:’’ تعدّی کے بغیر(امانت کی) ہلاکت پر ضامن نہیں ہوں گے اورضمان کی شرط باطل ہے ،جس طرح رہن میں ضمان نہ ہونے کی شرط لگائی جائے ، ’’جوہرہ ‘‘ نے اس سے اختلاف کیاہے ،(ردالمحتار علی الدرالمختار ،جلد8،ص:413،بیروت)‘‘۔ 
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: إِذَاطَلَبَ الْوَدِیْعَۃَ،فَقَالَ:أُطْلُبْہَاغَدًا،ثُمَّ قَالَ فِی الْغَدِ:ضَاعَتْ،فَإِنَّہٗ یُسْاَلُ،إِنْ قَالَ:ضَاعَتْ قَبْلَ قَوْلِیْ أُطْلُبْہَا غَدًا، یَضْمَنُ،وَإِنْ قَالَ:ضَاعَتْ بَعْدَہٗ لَا،لِلتَّنَاقُضِ فِی الْاَوَّلِ دُوْنَ الثَّانِی،کَذَا فِی الْفُصُوْلِ الْعِمَادِیَّۃِ ]]‘‘۔
ترجمہ:’’ جب مالک نے اپنی امانت طلب کی تو رکھنے والے نے کہا: کل لینا ،پھر کل کہا: وہ`
},
{
  pageNumber: 297,
  text: `امانت ضائع ہوگئی ،تو اس سے پوچھاجائے گا کہ کب ضائع ہوئی ، اگر کہے : میرے’’ کل لے جانا ‘‘کہنے سے پہلے ضائع ہوئی ،توضامن ہوگا اوراگر کہے: اس کے بعد ضائع ہوئی تو ضامن نہیں ہوگا کیونکہ پہلی صورت میں تناقض ہے اور دوسری میں نہیں ہے ،’’فصول العمادیہ‘‘ میں اسی طرح ہے ،(فتاویٰ عالمگیری ،جلد4،ص:352)‘‘۔
	زکوٰۃ کی رقم علیحدہ کرکے رکھی ،جب تک مستحقین تک نہ پہنچادے ادائیگی سے بری الذمہ نہیں ہوگا ،اگر وہ مال ضائع ہوگیا تو زکوٰۃ ساقط نہیں ہوگی ، دُرّ مختار میں ہے :
  ’’[[arabic: وَلَا یَخْرُجُ عَنِ الْعُہْدَۃِ بِالْعَزْلِ بَلْ بِالْاَدَاء ِ لِلْفُقَرَاءِ]] 	‘‘۔
ترجمہ:’’ محض مال علیحدہ کردینے سے زکوٰۃ کی ادائیگی سے سبکدوش نہیں ہوگا ،بلکہ فقراء کو اداکردینے کے بعد (ذمہ داری سے اداہوگا)‘‘، اس کی شرح میں علامہ ابن عابدین شامیرحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: فَلَوْضَاعَتْ لَا تَسْقُطُ عَنْہُ الزَّکَاۃُ وَلَوْ مَاتَ کَانَتْ مِیْرَاثًا عَنْہُ، بِخِلَافِ مَا إذَا ضَاعَتْ فِی یَدِ السَّاعِیْ لِاَنَّ یَدَہٗ کَیَدِ الْفُقَرَاءِ’’بَحْرٌ‘‘ عَنِ الْمُحِیْطِ ]] ۔
ترجمہ:’’ پس اگر وہ علیحدہ کیاہوا مال ضائع ہوگیا تو اس سے زکوٰۃ ساقط نہیں ہوگی ،اگر وہ فوت ہوجائے تو وہ مال بطور ترکہ تقسیم ہوگا ،اگر وہ مال زکوٰۃ جمع کرنے والے وکیل کے قبضے میں ضائع ہوا تو زکوٰۃ ساقط ہوجائے گی کیونکہ وکیل کا قبضہ دراصل فقیر ہی کا قبضہ ہے،’’البحر الرائق ‘‘ میں ’’محیط سے روایت کیاگیا ہے، (حاشیہ ابن عابدین شامی ،جلد5،ص:457، دمشق)‘‘۔لیکن انجمنوں کی انتظامیہ زکوٰۃ دینے والوں کی وکیل ہوتی ہے ،فقراء کی نہیں ۔
	خلاصۂ کلام یہ ہے کہ آپ کی جماعت زکوٰۃ دینے والے اشخاص کی وکیل ہے اور وکیل کی ذمے داری ہے کہ زکوٰۃ مستحقین تک پہنچائے ۔ آپ کی خواہش کے مطابق آپ کے ادارے کو ملکیت بھی حاصل رہے اور زکوٰۃ بھی اداہوجائے ، یہ ناممکن ہے ۔ آپ مستحقین زکوٰۃ کو اُن فلیٹوں کا مالک بنادیں۔ `
},
{
  pageNumber: 298,
  text: `[[heading: مالِ زکوٰۃ سے حج کرانے کا حکم ]]
سوال:
	 ایک شخص جو صاحبِ نصاب ہے ،ہرسال اپنی زکوٰۃ مختلف مدارس ،یتیم خانوں اور فلاحی اداروں کو اداکرتاہے ۔اس کا ارادہ ہے کہ کسی مستحق ِ زکوٰۃ کو تلاش کرے ،پھراس کو کچھ رقم گھر والوں کی ضروریات کے لیے دے اور اسے زکوٰۃ کی رقم سے حج پر بھیجے،کیا اس طرح اس کی زکوٰۃ اداہوجائے گی ؟، (مخدوم صدیقی ،ناظم آباد ،کراچی)۔
جواب:
	اگرچہ بیک وقت ایک ہی فقیر کو زکوٰۃ کی بہت بڑی رقم دینا شرعاً پسندیدہ نہیں ہے ،لیکن اگر دیدی تواداہوجائے گی ،علامہ نظام الدینرحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَیُکْرَہُ أَن یُّدْفَعَ إِلٰی رَجُلٍ مِائَتیْ دِرْہَمٍ فَصَاعِدًا،وَإِنْ دَفَعَہٗ جَازَ کَذَا فِی الْہِدَایَۃ ]]‘‘۔
ترجمہ:’’اورایک شخص کو (بیک وقت) دوسو درہم (یعنی مقدارِ نصاب کے برابر)یا اس سے زائد دینا مکروہ ہے ،اگر دے دیا تو جائز ہے (یعنی زکوٰۃ ادا ہوجائے گی)،، ’’ہدایہ‘‘ میں اسی طرح ہے، (فتاویٰ عالمگیری ،جلد1،ص:188)‘‘۔ بعض خاص صورتوں میں نصاب کی مقدار یا اس سے بھی زیادہ مال دینا کراہت کے بغیر جائز ہے، تفصیل کتبِ فقہ میں موجود ہے، یعنی کسی خاص شخص یا اشخاص کے احوال پر موقوف ہے۔
علامہ برہان الدین علی بن ابوبکر مرغینانی نے اس پر یہ اضافہ کیاہے : ’’[[arabic: وَقَالَ زُفَرٌ لَایَجُوزُ]]‘‘یعنی امام زفر کے نزدیک کسی ایک مستحق کو بیک وقت اتنی رقم دینا جائز نہیں ہے (کہ وہ خود غنی اور صاحبِ نصاب ہوجائے ،عدمِ جواز کے قول کا تقاضایہ ہے کہ زکوٰۃ ادانہیں ہوگی )،(الھدایہ ،جلد2، ص:78،مکتبۃ البشریٰ)‘‘۔علامہ محمد بن محمود بابرتی نے ’’عنایہ‘‘ شرح ہدایہ میں اس پر مدلَّل اور مُفصَّل بحث کی ہے ،لیکن صاحبِ ہدایہ کا مختار قول یہی ہے کہ زکوٰۃ اداہوجائے گی ۔
	زکوٰۃ وصدقات ِ واجبہ کی حکمتوں میں لوگوں کو حج اورعمرے کرانا نہیں ہے ،بلکہ مستحقین`
},
{
  pageNumber: 299,
  text: `کی حاجات اصلیہ کوپوراکرنا ہے، البتہ اگر کوئی فقیر ومسکین بے گھر ہے اورکوئی صاحبِ زکوٰۃ مکان خرید کر اسے اس کا مالک بناتاہے ،تو اس مکان کی قیمت غالب صورتوں میں 612,36گرام چاندی یا بعض صورتوں میں87,48گرام سونے کی بازاری قیمت سے زائد ہوگی ،لیکن چونکہ مکان حاجتِ اصلیہ ہے، اس لیے زکوٰۃ بلا کراہت اداہوجائے گی۔ اگر اللہ تعالیٰ نے آپ کو اتنے کثیر مال سے نوازا ہے اور آپ کو کسی صالح مستحقِ زکوٰۃ شخص کو حج کرانے کابھی شوق ہے ،تو اپنے اصل مال میں سے یہ سعادت حاصل کیجیے ، اس کو اس رقم کا مالک بنادیجیے تاکہ وہ صاحبِ استطاعت ہوکر بطور فرض حج اداکرے ۔لیکن اگر آپ زکوٰۃ کی رقم سے کسی شرعی فقیر کو حج کرانا ہی چاہتے ہیں تو اتنی رقم اس کی ملکیت کردیں ۔ اس شخص کی مرضی ہے کہ وہ اس رقم سے حج کرے یا اپنی اورکوئی ضرورت پوری کرے ، آپ اسے مجبور نہیں کرسکتے، اگر آپ نے رقم اس کی ملکیت میں نہیں دی اور اس کے حج کے اخراجات گورنمنٹ یاکسی پرائیویٹ حج گروپ آرگنائزر کے حوالے کردیے اور اس شخص کو حج پر بھیج دیا ،تو آپ کی زکوٰۃ ادانہیں ہوگی ،البتہ اُس کا حج ادا ہوجائے گا۔`
},

{
  pageNumber: 301,
  text: `[[heading: حج اور عمرے کے مسائل]]`
},

  {
    pageNumber: 303,
    text: `[[heading: مکہ مکرمہ کا مستقل باسی یا عارضی رہائشی عمرے کا احرام تنعیم سے باندھے]]
سوال:
	ایک عمرہ مکمل ہوجانے کے بعد دوسرا عمرہ کرنے کے لیے احرام کہاں سے باندھا جائے گا ؟،(انعام الحق ،راشد منہاس روڈ ،کراچی )۔
جواب:
	حدودِ حرم میں موجود شخص کے لیے ’’ تَنْعِیْم ‘‘سے احرام باندھنا افضل ہے ، حدیث پاک میں ہے :
’’[[arabic: اِنَّ عَبْدَ الرَّحْمٰنِ بْن أَبِی بَکْرٍ رَضِیَ اللّٰہُ عَنْہُمَا، أَخْبَرَہٗ:أَنَّ النَّبِیَّ ﷺأَمَرَہٗ أَنْ یُرْدِفَ عَائِشَۃَ وَیُعْمِرَہَا مِنَ التَّنْعِیمِ]]‘‘۔
ترجمہ:’’ عبدالرحمن بن ابی بکر رضی اللہ عنہما بیان کرتے ہیں: نبی کریم صلی اللہ علیہ وسلم نے انہیں یہ حکم دیا کہ وہ حضرت عائشہ رضی اللہ عنہا کو اپنے ساتھ سواری پر بٹھائیں اور ان کو مقامِ تنعیم سے عمرہ کرائیں ،(صحیح بخاری:1784)‘‘۔
علامہ بدرالدین محمود بن احمد عینی حنفی رحمۃ اللہ علیہ اس کی شرح میں لکھتے ہیں :
’’[[arabic: ذِکْرُ مَا یُسْتَفَادُ مِنْہُ فِیْہِ:أَنَّ الْمُعْتَمِر الْمَکِّیَّ لَا بُدَّ لَہٗ مِن الْخُرُوْجِ إِلَی الْحِلِّ ثُمَّ یُحْرِمُ مِنْہُ،وَإِنَّمَا عَیَّنَ التَّنْعِیْمَ ہُنَا دُوْنَ الْمَوَاضِعِ الَّتِی خَارِجَ الْحَرَمِ لِاَنَّ التَّنْعِیْمَ أَقْرَبُ إِلَی الْحِلِّ مِنْ غَیْرِہَا.وَفِی التَّوْضِیْح وَیُجْزِیٔ ُ أَقَلُّ الْحِلِّ وَہُوَ التَّنْعِیْمُ،وَأَفْضَلُہٗ عِنْدنَا الْجِعِرَّانَۃ، ثُمَّ الْحُدَیْبِیَّۃُ]]‘‘۔
ترجمہ:’’ اس حدیث سے معلوم ہو ا کہ مکہ سے عمرہ کرنے والے کے لیے ضروری ہے کہ وہ حدودِ حرم سے نکل کر ’’حِلّ‘‘ میں جائے ، آپ نے خارج حرم کی دوسری جگہوں کے مقابلے میں تنعیم کو اس لیے مقرر فرمایاکہ تنعیم خارج حرم میں سے حرم کے قریب ترین جگہ تھی اور ’’توضیح ‘‘ میں ہے: قریب ترین حِلّ تنعیم سے عمرہ جائز ہے اورہمارے نزدیک افضل `
  },
  {
    pageNumber: 304,
    text: `’’جِعِرّانہ ‘‘ ہے ،پھرحُدَیْبِیَہ ،(عمدۃ القاری ،جلد10،ص:170 )‘‘۔آفاقیوں کے میقات (حج اور عمرے کی نیت باندھنے کی جگہ)اور حدودِ حرم کے درمیان جو خطہ ہے ،اُسے ’’حِلّ‘‘ کہتے ہیں ۔
	حدودِ حرم اور مِنٰی میں رہنے والے لوگوںکے لیے حج کا احرام باندھنے کے لیے سارا حرم میقات ہے اور عمرے کا احرام باندھنے کے لیے میقات ’’حِلّ ‘‘ہے ۔
تنویر الابصار مع الدرالمختار میں ہے : 
’’[[arabic: وَحَلَّ لِاَہْلِ دَاخِلِہَایَعْنِیْ لِکُلِّ مَنْ وُجِدَ فِی دَاخِلِ الْمَوَاقِیْتِ دُخُوْلُ مَکَّۃَ غَیْرَ مُحْرِمٍ مَا لَمْ یُرِدْ نُسُکًا لِلْحَرَجِ کَمَا لَوْ جَاوَزَہَا حَطَّابُو مَکَّۃَ فَہٰذَا مِیْقَاتُہُ الْحِلُّ الَّذِی بَیْنَ الْمَوَاقِیْتِ وَالْحَرَمِ وَالْمِیْقَاتُ لِمَنْ بِمَکَّۃَ یَعْنِیْ مَنْ بِدَاخِلِ الْحَرَمِ لِلْحَجِّ الْحَرَمُ وَلِلْعُمْرَۃِ الْحِلُّ لِیَتَحَقَّقَ نَوْعُ سَفَرٍوَالتَّنْعِیْمُ أَفْضَلُ ]]‘‘۔
ترجمہ:’’ جو لوگ میقات کے اندر رہتے ہیں ان کے لیے احرام کے بغیر مکہ میں داخل ہونا حلال ہے ،جب تک وہ حج (یاعمرے)کا ارادہ نہ کریں ،تاکہ وہاں (حِلّ) میں رہنے والوں کے لیے حرج نہ ہو ،جیساکہ مکہ کے لکڑ ہارے حدودِ حرم کے باہر سے لکڑیاں کاٹ کر احرام کے بغیر گزرتے ہیں ،پس اس کا میقات حِلّ ہے ،جو میقات اورحرم کے درمیان کا علاقہ ہے اورجو حرم کی حدود کے اندرکی جانب رہتاہے ،اس کا میقات حج کے لیے حرم اور عمرہ کے لیے حِلّ ہے تاکہ کچھ سفر مُتحقق ہوجائے اور’’ تنعیم ‘‘افضل ہے ‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: قَوْلُہٗ یَعْنِی إلَخْ:۔۔أَشَارَ إلٰی مَا فِی الْبَحْرِ مِنْ قَوْلِہٖ وَالْمُرَادُ بِالْمَکِّیِّ مَنْ کَانَ دَاخِلَ الْحَرَمِ سَوَاءٌ کَانَ بِمَکَّۃَ اَوْلَا،وَسَوَاءٌ کَانَ مِنْ أَہْلِہَا أَوْلَا،فَیَشْمَلُ الْآفَاقِیَّ الْمُفْرِدَ بِالْعُمْرَۃِ وَالْمُتَمَتِّعَ وَالْحَلَالَ مِنْ أَہْلِ الْحِلِّ إذَا دَخَلَ الْحَرَمَ لِحَاجَۃٍ کَمَا فِی اللُّبَابِ، قَوْلُہٗ:لِیَتَحَقَّقَ نَوْعُ سَفَرٍلِاَنَّ أَدَاءَالْحَجِّ فِیْ عَرَفَۃَ،وَہِیَ فِی الْحِلِّ فَیَکُوْنُ إحْرَامُ  الْمَکِّیِّ بِالْحَجِّ مِنَ الْحَرَمِ لِیَتَحَقَّقَ لَہٗ نَوْعُ سَفَرٍ بِتَبَدُّلِ الْمَکَانِ،وَأَدَاءَ الْعُمْرَۃِ]]`
  },
  {
    pageNumber: 305,
    text: `[[arabic: فِی الْحَرَمِ فَیَکُوْنُ إحْرَامُہٗ بِہَا مِنَ الْحِلِّ لِیَتَحَقَّقَ لَہٗ نَوْعٌ مِنَ السَّفَرِ شَرْحُ النُّقَایَۃِ لِلْقَارِی فَلَوْ عَکَسَ فَاَحْرَمَ لِلْحَجِّ مِنَ الْحِلِّ أَوْ لِلْعُمْرَۃِ مِنَ الْحَرَمِ لَزِمَہٗ دَمٌ إلَّا إذَا عَادَ مُلَبِّیًا إلَی الْمِیْقَاتِ الْمَشْرُوْعِ لَہٗ کَمَا فِی اللُّبَابِ وَغَیْرِہٖ ]]‘‘۔
ترجمہ:’’ ’’یہ البحرالرائق ‘‘ کے قول کی طرف اشارہ ہے،جو یہ ہے : مکی سے مراد وہ ہے جو حدودِ حرم کے اندر ہو ،خواہ وہ مکہ میں ہو یا نہ ہو (یعنی مضافات میں ہو )وہ مکہ کا رہائشی ہو یا نہ ہو،پس یہ قول اُس آفاقی کو بھی شامل ہوگا جو صرف عمرہ کرتاہے ،جو تمتُّع کرتاہے اور اہل ِحِلّ میں سے جس نے احرام باندھا ہو ، جب وہ کسی کام کے لیے حرم میں داخل ہو ،جس طرح ’’لُباب‘‘ میں ہے۔کیونکہ حج کی ادائیگی عرفات میں ہوتی ہے اور عرفات حل میں ہے(حَرم میں نہیں ہے )،پس مکی کے حج کا احرام حرم سے ہوگا تاکہ اس کے لیے مقام بدلنے کے ساتھ سفر کی کوئی صورت مُتحقق ہو۔اورعمرہ کی ادائیگی حرم میں ہوتی ہے تو عمرہ کا احرام حِلّ سے ہوگا تاکہ اس کے لیے سفر کی کوئی نوع مُتحقق ہوجائے ، بحوالہ: ’’شَرح النِّقَایَہْ لِلْقَارِی‘‘۔ اگراس نے اس کے برعکس کیا  یعنی حج کا احرام حِلّ سے اور عمرہ کا حرم سے باندھا تواس پر دَم لازم ہوگا ،مگر جب وہ میقات کی طرف تلبیہ کہتے ہوئے لوٹے ، جو اس کے لیے مشروع کیاگیاہے ، جس طرح ’’لباب‘‘ میں ہے(تودَم لازم نہیں ہوگا)،(حاشیہ ابن عابدین ،جلد6،ص:530-532،دمشق)‘‘۔

[[heading: حج وعمرے کے حوالے سے خواتین کے مسائل]] 
سوال:
	درج ذیل صورتوں میں عورت کیا کرے اور اس پر کیالازم آتاہے :(1)عورت نے حج یا عمرے کا احرام باندھا اور ایام شروع ہوگئے، اگر عمرے کا احرام توڑتی ہے تو اس پر کیا لازم آئے گا۔(2)اگر عمرے کے لیے مکہ مکرمہ پہنچی اور ایام شروع ہوگئے تووہ کیا کرے (3)اگر دورانِ حج منیٰ یا عرفات میں ایام شروع ہوگئے تو وہ کیا کرے۔(4)اگر ایامِ حج حالتِ حیض میں گزر گئے اور واپسی کی فلائٹ 13ذوالحجہ کو ہے، تو اب وہ کیا کرے۔`
  },
  {
    pageNumber: 306,
    text: `جواب:
	(1-2-3-4) حج کااحرام باندھنے کے بعد جب عورت کو حیض آجائے تو وہ حج کے بقیہ تمام افعال اداکرے ،یعنی منٰی ،عرفات اور مزدلفہ کے وقوف سمیت ،قربانی ،رمی ِجمرات سمیت تمام ارکان اداکرے ،بیت اللہ کا طواف نہ کرے ، اسی طرح نماز نہ پڑھے ،تلاوت نہ کرے ،اَذکار وتسبیحات ودرود جاری رکھے اور پاک ہونے کے بعد طواف اداکرے گی۔ اسی طرح عمرہ کاحکم ہے کہ حیض کی وجہ سے احرام کی پابندی برقرار رہے گی اورپاک ہونے کے بعد عمرہ کے افعال ادا کرے گی ۔ اگرکسی عورت نے عمرہ کا احرام کھول دیا ،تو دَم دینا ہوگااور یہ دَم حدودِ حرم میں ہی دیا جائے گا اور عمرہ کی قضا لازم ہوگی ۔ مِنٰی وعرفات میں نمازوں کی ادائیگی کے علاوہ ذکر اذکار کیے جاتے ہیں ،حائضہ عورت پر نماز معاف ہے ، عرفات کے وقوف میں بھی طہارت شرط نہیں ہے۔ 
	اگر حیض سے پاک ہونے تک مکہ میں ٹھہرنا اور پاکی کی حالت میںطوافِ زیارت کرنا ممکن نہ ہو ،یعنی حکومتی اجازت کانہ ہونا حارج ہو یا فلائٹ یا مَحرم یاشوہر کی روانگی کا مسئلہ درپیش ہو تومجبوراً عورت حالتِ حیض ہی میں طوافِ زیارت کرلے اور اُس پر ’’بَدَنَہ‘‘ یعنی اونٹ یا گائے کی قربانی حدودِ حرم میں دینا واجب ہوگی ۔ سابقہ ادوار میں ویزے اور واپس لوٹنے کی تاریخ کا تعین یا تحدید نہیں ہواکرتی تھی اور نہ  وطن واپس آکر دوبارہ جانے کی پابندیاں تھیں ،جس کے سبب اس طرح کے عذر میں لوگ وہیں ٹھہر جاتے تھے یا دوبارہ جاکر اداکرلیاکرتے تھے ۔  مندرجہ بالا اعذار یا کسی اور عذر کے سبب عمرے میں اگر پاک ہونے تک رکنا ممکن نہ ہو تو حالتِ حیض  ہی میں طواف کرلے اور حدود حرم میں دَم (یعنی بکری یا دنبے کی قربانی )دے اور حج وعمرہ دونوں صورتوں میں حالتِ حیض میں طواف کرنے پر اللہ تعالیٰ کے حضور استغفار بھی کرے ۔
حدیث پاک میں ہے :
’’[[arabic: سَمِعتُ الْقَاسِمَ یَقُوْلُ:سَمِعْتُ عَائِشَۃَ تَقُوْلُ:خَرَجْنَا لاَ نَرٰی إِلَّا الْحَجَّ، فَلَمَّا کُنَّا]]`
  },
  {
    pageNumber: 307,
    text: `[[arabic: بِسَرِفَ حِضْتُ،فَدَخَلَ عَلَیَّ رَسُوْلُ اللّٰہِ ﷺوَأَنَا أَبْکِیْ، قَالَ:مَالَکِ أَنُفِسْتِ، قُلْتُ:نَعَمْ،قَالَ:إِنَّ ہٰذَا أَمْرٌ کَتَبَہُ اللّٰہُ عَلٰی بَنَاتِ آدَمَ،فَاقْضِیْ مَا یَقْضِی الْحَاجُّ،غَیْرَ أَنْ لاَتَطُوْفِیْ بِالْبَیْتِ]]‘‘۔
ترجمہ:’’حضرت قاسم بیان کرتے ہیں : میںنے حضرت عائشہ کو یہ کہتے ہوئے سنا:ہم حج کے لیے نکلے ،جب ’’سَرِف‘‘کے مقام پر پہنچے ،تومجھے حیض آگیا،نبی صلی اللہ علیہ وسلم میرے پاس تشریف لائے ،میں اس وقت رورہی تھی ،آپ صلی اللہ علیہ وسلم نے فرمایا: کیا ہوا، کیا تمہیں حیض آگیا ، میں نے کہا: جی ہاں!،آپ نے فرمایا: یہ وہ چیز ہے ،جس کو اللہ تعالیٰ نے آدم کی بیٹیوں پر لکھ دیا ہے، پس تم وہ افعال کروجو تمام حجاج کرتے ہیں ،سوائے اس کے کہ تم بیت اللہ کا طواف نہ کرنا ،(صحیح بخاری: 294)‘‘۔
حضرت عائشہ رضی اللہ عنہا ایک طویل حدیث میںبیان کرتی ہیں:
’’[[arabic: فَدَخَلَ عَلَیَّ رَسُوْلُ اللّٰہِ ﷺوَأَنَا أَبْکِی،فَقَالَ:مَا یُبْکِیْکِ،قُلْتُ:سَمِعْتُ کَلَامَکَ مَعَ أَصْحَابِکَ فَسَمِعْتُ بِالْعُمْرَۃِ قَالَ:وَمَا لَکِ،قُلْتُ:لَا أُصَلِّی،قَالَ:فَلَا یَضُرُّکِ، فَکُوْنِی فِی حَجِّکِ،فَعَسَی اللّٰہُ أَنْ یَرْزُقَکِیْہَا،وَإِنَّمَا أَنْتِ مِنْ بَنَاتِ اٰدَمَ،کَتَبَ اللّٰہُ عَلَیْکِ مَا کَتَبَ عَلَیْہِنَّ ،قَالَتْ:فَخَرَجْتُ فِی حَجَّتِی حَتّٰی نَزَلْنَا مِنًی،فَتَطَہَّرْتُ،ثُمَّ طُفْنَا بِالْبَیْتِ،وَنَزَلَ رَسُوْلُ اللّٰہِ ﷺالْمُحَصَّبَ،فَدَعَا عَبْدَ الرَّحْمَنِ بْنَ أَبِی بَکْرٍ،فَقَالَ:اُخْرُجْ بِاُخْتِکَ مِنَ الْحَرَمِ فَلْتُہِلَّ بِعُمْرَۃٍ، ثُمَّ لِتَطُفْ بِالْبَیْتِ، فَإِنِّی أَنْتَظِرُکُمَا ہَا ہُنَا ،قَالَتْ:فَخَرَجْنَا فَاَہْلَلْتُ،ثُمَّ طُفْتُ بِالْبَیْتِ وَبِالصَّفَا وَالْمَرْوَۃِ،فَجِئْنَا رَسُوْلَ اللّٰہِ ﷺ وَہُوَ فِی مَنْزِلِہٖ مِنْ جَوْفِ اللَّیْلِ،فَقَالَ:ہَلْ فَرَغْتِ،قُلْتُ:نَعَمْ،فَاٰذَنَ فِی أَصْحَابِہٖ بِالرَّحِیْلِ،فَخَرَجَ فَمَرَّ بِالْبَیْتِ فَطَافَ بِہٖ قَبْلَ صَلَاۃِ الصُّبْحِ، ثُمَّ خَرَجَ إِلَی الْمَدِینَۃِ]]‘‘۔
ترجمہ:’’رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے اورمیں رورہی تھی ،آپ صلی اللہ علیہ وسلم نے فرمایا: تم کیوں رو رہی ہو ،میں نے عرض کی: میں نے صحابہ کے ساتھ آپ کی گفتگو سنی ،میں نے عمرہ کی بابت سنا،آپ صلی اللہ علیہ وسلم نے فرمایا: تمہارا مسئلہ کیاہے ،میں نے عرض کی : میں نماز`
  },
  {
    pageNumber: 308,
    text: `نہیں پڑھ پاؤں گی ،آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں اس کا کوئی نقصان نہیں ہے، بس اپنا حج جاری رکھو ،امید ہے اللہ تمہیں عنقریب عمرہ نصیب فرمائے گا ،تم آدم کی بیٹیوں میں سے ہو ، اللہ نے دیگر بناتِ آدم کی طرح تم پر بھی یہ (حیض) لکھ دیاہے ،(حضرت عائشہ بیان کرتی ہیں) : پس میں نے اپنا حج جاری رکھا، یہاں تک کہ ہم منٰی میں اترے ،پھر میں پاک ہوگئی، پھر ہم نے بیت اللہ کا طواف کیا ،پھر ہم وادیِ مُحصَّب میں اترے ،پھر آپصلی اللہ علیہ وسلم نے عبدالرحمن بن ابی بکر کو بلایااورفرمایا: اپنی بہن(عائشہ) کے ساتھ حدودِ حرم سے نکلو ، عمرے کی تلبیہ پڑھو (یعنی احرام باندھو )،پھر بیت اللہ کا طواف کرو ،میں تم دونوں کا یہاں انتظار کروں گا ۔ حضرت عائشہ بیان کرتی ہیں:ہم(حدودِحرم سے)نکلے ،پھر میں نے عمرہ کے لیے تلبیہ پڑھی (یعنی احرام باندھا)،پھر میں نے بیت اللہ کا طواف کیا اور صفاو مروہ کے درمیان سعی کی ،پھر ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے ،وہ نصف شب کو اپنی جگہ پر ہی تھے ،آپ صلی اللہ علیہ وسلم نے فرمایا: تم فارغ ہوگئی ہو ،میں نے عرض کی: جی ہاں! پھر آپ صلی اللہ علیہ وسلم نے صحابہ کو کوچ کرنے کاحکم دیا ،پھر آپ صلی اللہ علیہ وسلم وہاں سے  نکل کرگئے ، نمازفجر سے پہلے بیت اللہ کا طواف کیا ،پھر (نمازِ فجر پڑھ کر) مدینہ منورہ روانہ ہوگئے ، (صحیح مسلم: 1211)‘‘۔
سوال:(5)
	اگر عمرے کا پروگرام پہلے سے طے ہے اور روانگی کے دن ایام شروع ہوگئے،تو وہ کیاکرے ۔
جواب:
	عمرے پر روانگی سے پہلے ایام شروع ہوگئے ،تو اس صورت میںروانگی کی تاریخ آگے بڑھائی جاسکتی ہے ،تو بڑھالے ،اگر ایساکرناممکن نہ ہو توغسل کرکے عمرے کا احرام باندھے اور مکہ جاکر پاک ہونے کا انتظار کرے ،پاک ہوکر طواف وسعی کرلے اور عمرہ مکمل کرلے۔ `
  },
  {
    pageNumber: 309,
    text: `سوال:(6)
	احرام باندھ کر ائیرپورٹ پہنچاتو پتا چلاکہ چیک ان بند ہوگیاہے اور فلائٹ کلوزہوگئی ہے یا معلوم ہوا کہ سیٹ کنفرم نہیں تھی، اب بظاہر اگلی فلائٹ 3دن بعد دستیاب ہوگی تو کیا کرے،اگر احرام کھول دیتا ہے تو اس پر کیا لازم آئے گا۔
جواب:
	اگر احرام کی نیت کرلی تھی تو اب اُس احرام کو پورا کرنا لازم ہے ،اس لیے اُسے چاہیے کہ  گھر واپس آکر جہاز کی سیٹ ملنے تک حالتِ احرام میں رہے اور احرام کی تمام پابندیوں پر عمل کرتارہے ، سیٹ کنفرم ہونے پر روانہ ہوجائے۔لیکن اگر احرام کھول دیا تو گنہگار ہوگا اور اُس پر دَم بھی واجب ہوگااور عمرے کی قضا بھی لازم ہوگی۔ عازمین ِحج و عمرہ کے لیے مشورہ یہ ہے کہ وہ گھر سے غسل کرکے لباس احرام پہن کر چلے جائیں، مرد احرام کی چادریں ائیر پورٹ پر جاکراور معمول کا لباس اتار کر بھی پہن سکتے ہیں، جب سیٹ کنفرم ہو جائے اور بورڈنگ کارڈ مل جائے تو دو رکعت نفل پڑھ لیںاور جب فلائٹ روانہ ہوجائے تو نیت باندھ لیں اور تلبیہ پڑھ لیں، ورنہ بصورت ِدیگر واپس آجائیں اور نارمل لباس پہن لیں، چونکہ وہ مُحرم نہیں ہوئے تھے، اس لیے ان پر کچھ واجب نہیں ہوگا۔

[[heading: حج وعمرہ کے لیے محرم کی شرط ]]
سوال:
	ہم لوگ عمرے پر جارہے ہیں، میرے ساتھ میری ایک دوست جس کی عمر 60سال ہے ،بغیر محرم کے ہمارے ساتھ جاسکتی ہے، (سیدہ ہما احسن ،کراچی)۔
جواب:
	خواتین کے لیے یہ شرط ہے کہ سفرِشرعی کے دوران اسے اپنے شوہر یا کسی محرم کی رفاقت میسر ہو۔ مَحرم نسب، رضاعت(دودھ شریک کا رشتہ) یا مصاہَرت کے رشتے سے ایسے قریبی رشتہ دار مراد ہیں، جن کے ساتھ اُس عورت کا نکاح ہمیشہ ہمیشہ کے لیے حرام ہو،`
  },
  {
    pageNumber: 310,
    text: `جیسے باپ، چچا،ماموں،بیٹا، بھتیجا، بھانجا، داماد، خسراوردودھ کے رشتے سے بھائی ،باپ وغیرہ۔
امام علاء الدین ابی بکر بن مسعودرحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: وَاَمَّا الَّذِیْ یَخُصُّ النِّسَآءَ فَشَرْطَانِ:أَحَدُھُمَا:أَنْ یَّکُوْنَ مَعَھَا زَوْجُھَاأَوْمَحْرَمٌ لَھَا،فَاِن لَمْ یُوجَدْ اَحَدُھُمَالَا یَجِبُ عَلَیْھَا الْحَجُّ]]‘‘۔
ترجمہ:’’اور عورتوں کے لیے دو شرطیںخاص ہیں ، ان میں سے ایک شرط یہ ہے کہ اس کا شوہر یا اس کا محرم اسکے ساتھ ہو،پس اگر ان دونوں میں سے کسی ایک (کی رفاقت )اسے نہ ملے ، تو اس پر حج ادا کرناواجب نہیں،(بدائع الصنائع،جز ثانی ،صفحہ 87،188 مطبوعہ مرکز اہل سنت برکات رضا،گجرات ،ھند)‘‘۔
 	عورت اگر محرم کے بغیر حج یا عمرہ کے لیے جائے تو اگرچہ گنہگار ہوگی ،لیکن حج یا عمرہ ادا ہوجائے گا ،امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْز  محرم کے بغیر عورت کے حج پر جانے کی بابت لکھتے ہیں :’’عورت کا مَحرم یا شوہر کے بغیر سفرپر جانا حرام ہے ،ہاں !اگر چلی جائے گی، گنہگار ہوگی ،ہر قدم پر گناہ لکھا جائے گا ،مگر حج ہوجائے گا کہ شوہر یا محرم کی معیت حج کے صحیح ہونے کے لیے شرط نہیں ہے ،( فتاویٰ رٰضو یہ ، جلد 10،ص:707،رضا فاؤنڈیشن، لاہور)‘‘۔ یعنی شوہر یا محرم کی معیت مسافت شرعی کی مقدار سفر کے لیے شرط ہے ۔  

[[heading: حج وعمرہ کے ٹکٹ ]]
سوال:
	 کسی بھی پروگرام میں بذریعہ قرعہ اندازی حج یا عمرہ کے ٹکٹ دینا جائز ہے ،اس میں کوئی شرعی قباحت ، ممانعت یا حُرمت کا پہلو تونہیں پایا جاتا ۔ اسی طرح آج کل محافل ومجالس میں حج وعمرہ کے ٹکٹ اور انعامات کا سلسلہ رائج ہے ۔کسی بھی سوال کے جواب پر یا کسی مقابلے میں ونر کو انعام دینا یا کسی کی حوصلہ افزائی کے لیے انعام دینا جائز ہے اور انعام دینے میں کوئی شرعی حدبندی مالیت یا نوعیت کے اعتبار سے یا کوئی پابندی تولازم نہیں مثلاً`
  },
  {
    pageNumber: 311,
    text: `نقد رقم یاگھریلو استعمال کی اشیاء یا موٹر سائیکل بطور انعام دینے کا کیا حکم ہے؟،(عامر فیاضی،کراچی)۔
جواب:
	جس چیز میں ایک سے زائد افراد کا حق برابر ہو اور تمام فریق برضاورغبت قرعہ اندازی سے فیصلے پر راضی ہوں تواس صورت میں قرعہ اندازی سے فیصلہ کیاجاسکتاہے ، جیساکہ حضرت مریم کی کفالت کے لیے بیت المقدس کے مُتولیوں میں قرعہ اندازی ہوئی،اللہ تعالیٰ کا ارشاد ہے :
’’[[arabic: وَمَا كُنْتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَامَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنْتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ]]‘‘۔
ترجمہ:’’اور( اے رسولِ مکرم!) آپ اس وقت ان کے پاس نہ تھے ،جب وہ (قرعہ اندازی کے لیے) اپنے قلموں کو(دریامیں) ڈال رہے تھے کہ ان میں سے کون مریم کی کفالت کرے گا اور آپ ان کے پاس نہ تھے ، جب وہ(اس مسئلے میں) باہم جھگڑ رہے تھے ، (آل عمران :44)‘‘۔اس کی تفصیل کُتب تفسیر میں موجود ہے ۔اسی طرح ایک حدیث پاک میں ہے:
’’ [[arabic: إِنَّ رَجُلًا أَعْتَقَ سِتَّۃَ مَمْلُوْکِیْنَ لَہٗ عِنْدَ مَوْتِہٖ،لَمْ یَکُنْ لَہٗ مَالٌ غَیْرَہُمْ، فَدَعَا بِہِمْ رَسُوْلُ اللّٰہِ ﷺ، فَجَزَّأَہُمْ أَثْلَاثًا، ثُمَّ أَقْرَعَ بَیْنَہُمْ، فَاَعْتَقَ اثْنَیْنِ، وَأَرَقَّ أَرْبَعَۃً، وَقَالَ لَہٗ قَوْلًا شَدِیْدًا]]‘‘۔
ترجمہ:’’ ایک شخص نے اپنی وفات کے وقت اپنے چھ غلاموں کو آزادکردیا ،ان (غلاموں)کے علاوہ اس کا کوئی (اور) مال نہیں تھا ،رسول اللہ صلی اللہ علیہ وسلم نے ان کو بلایا اور دو دو افراد پر مشتمل تین گروپوں میں تقسیم فرمادیا ،پھر آپ نے ان تینوں گروپوں میں قرعہ اندازی فرمائی ،تو آپ صلی اللہ علیہ وسلم نے دو افراد(جن کے نام کا قرعہ نکلا تھا)کوآزاد کردیا اور باقی چار کو( ترکے کے طورپر )غلام رہنے دیا اورآپ صلی اللہ علیہ وسلم نے اس شخص کے بارے میں سخت`
  },
  {
    pageNumber: 312,
    text: `کلمات فرمائے ، (صحیح مسلم:1668)‘‘۔نبی کریم صلی اللہ علیہ وسلم کا اس شخص پر ناگواری کا اظہار فرمانا اس سبب سے تھا کہ ایک تہائی سے زیادہ ترکے کی وصیت کرنا جائز نہیں ہے اور اگر کسی نے کردی ہے تو وہ غیر مؤثر ہوجاتی ہے ۔ اس وقت درپیش صورت حال میں اس کا کل ترکہ یہی تھا ، اس لیے آپ صلی اللہ علیہ وسلم نے قرعہ اندازی سے فیصلہ فرمایا، اس مسئلے کی باقی فقہی تفصیلات اس وقت ہمارا موضوع نہیں ہیں ۔
	شریعتِ مُطہرہ میں فرائض ،واجبات اور سُنن کی ادائی کے بعد اللہ تعالیٰ کی راہ میں خرچ کیے جانے والے مال میں صدقاتِ جاریہ کو ترجیح دی گئی ہے ،احادیث مبارکہ  میں ہے :
(۱)’’[[arabic: إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْہُ عَمَلُہٗ إِلَّا مِنْ ثَلَاثَۃٍ: إِلَّا مِنْ صَدَقَۃٍ جَارِیَۃٍ أَوْ عِلْمٍ یُنْتَفَعُ بِہٖ أَوْ وَلَدٍ صَالِحٍ یَدْعُوْ لَہٗ ]]‘‘۔
ترجمہ:’’جب انسان فوت ہوجاتاہے تو اس کے اعمالِ(خیر) کا سلسلہ منقطع ہوجاتاہے سوائے تین اعمال کے ، اُس نے( اپنی زندگی میں ) صدقۂ جاریہ کیاہو یا علمِ نافع جس سے لوگوں کو فائدہ پہنچاہو یا صالح اولاد جو اس کے لیے دعاکرے ،(صحیح مسلم:1631)‘‘۔ 
(۲)’’[[arabic: عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُوْلَ اللَّهِ ﷺ قَالَ: إِذَا مَاتَ الْإِنْسَانُ اِنْقَطَعَ عَمَلُهٗ إِلَّا مِنْ ثَلَاثَةٍ: مِنْ صَدَقَةٍ جَارِيَةٍ وَعِلْمٍ يُنْتَفَعُ بِهٖ، وَوَلَدٍ صَالِحٍ يَدْعُوْ لَهٗ]]‘‘۔
ترجمہ:’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب انسان فوت ہوجاتا ہے تواس کے اعمال کا سلسلہ منقطع ہوجاتا ہے سوائے تین اعمال کے:صدقۂ جاریہ کیاہو یا علمِ نافع جس سے لوگوں کو فائدہ پہنچاہو یا صالح اولاد جو اس کے لیے دعاکرے، (سنن نسائی:3651)‘‘۔
(۳)’’[[arabic: عَنْ أَبِي هُرَيْرَةَ  أَنَّ رَسُوْلَ اللهِ ﷺ قَالَ: إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَمَلُهٗ إِلَّا مِنْ ثَلاَثٍ: صَدَقَةٌ جَارِيَةٌ وَعِلْمٌ يُنْتَفَعُ بِهٖ وَوَلَدٌ صَالِحٌ يَدْعُوْ لَهٗ]]‘‘۔
ترجمہ:حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب انسان فوت ہوجاتا ہے توتین اعمال کے سوا(باقی اعمال کا سلسلہ )منقطع ہوجاتا ہے :صدقۂ`
  },
  {
    pageNumber: 313,
    text: `جاریہ ، علمِ نافع جس سے لوگوں کو فائدہ پہنچاہو یا صالح اولاد جو اس کے لیے دعاکرے، (سنن ترمذی:1376)‘‘۔
	اس موضوع پرمندرجہ بالا تین حدیثیں ہیں، صحیح مسلم کی حدیث میں ’’[[arabic: إِلَّا]]‘‘کا تکرار ہے اور سنن نسائی کی حدیث میں ’’[[arabic: إِلَّا]]‘‘مکرر نہیں ہے۔ 
علامہ ابو الحسن عبيد الله بن محمد عبد السلام رحمانی مباركپوری لکھتے ہیں:
’’ علامہ نوراللہ سندھی نے کہا: ’’[[arabic: اِنْقَطَعَ عَنْہُ عَمَلُہٗ]]‘‘سے مراد یہ ہے کہ اس کے عمل کا ثواب منقطع ہوجاتا ہے ،چونکہ ثواب کا تعلق عمل سے ہوتا ہے، اس لیے انقطاعِ ثواب کو انقطاعِ عمل سے تعبیر کیا اور استثناء کا اسی سے تعلق ہے:یعنی سوائے تین اعمال کے بنی آدم کا ہر عمل منقطع ہوجاتا ہے ، حاصل یہ ہے کہ بظاہر استثناء مشکل ہے اور ان توجیہات سے اشکال رفع ہوجاتا ہے۔ابہری نے کہا: ’’[[arabic: مِنْ]]‘‘زائدہ ہے اور تنوین اعمال کے عوض ہے اور ایک قول یہ ہے :’’[[arabic: عَنْہُ]]‘‘میں ضمیر زائد ہے اور معنی یہ ہوں گے: ’’جب انسان مرجاتا ہے تو تین اعمال کے سوال اس کے اعمال (یعنی جزائے اعمال) منقطع ہوجاتے ہیں ‘‘۔ طیبی نے کہا: استثناء متصل ہے اوراس کی تقدیر یوں ہے: ’’اُس سے اس کے اعمال کا ثواب منقطع ہوجاتا ہے جیسے :نماز ،زکوٰۃ وغیرہ، لیکن ان تین اعمال کا ثواب منقطع نہیں ہوتا ،یعنی جب انسان مرجاتا ہے تو اس کے بعد اس کے اعمال کا ثواب نہیں لکھا جاتا ،کیونکہ ثواب عمل کی جزا ہےاور عمل انسان کی موت کے ساتھ منقطع ہوجاتا ہے،سوائے ایسے فعل کے کہ جس کا نفع دائمی ہو اور جاری وساری ہو، جیسے وقف قائم کرنا یا (دینی کتاب)تصنیف کرنایا تعلیم دینا یا نیک اولاد اور نیک اولاد کو عمل کی جنس قرار اس لیے دیا ہے کہ کوئی شخص اپنی اولاد کے اس دنیا میں آنے کا سبب ہے اور اس کو نیکی کی ہدایت دینے کی وجہ سے اس کی صلاح کا بھی سبب ہے، غیر بھی دعا کرے تو میت کو نفع پہنچتا ہے ،لیکن وَلَد کی تخصیص کی حکمت اولاد کو دعا پر برانگیختہ کرنا ہے، گویا اولاد پر واجب ہے کہ ماں باپ کے لیے دعا کرے‘‘۔
	’’[[arabic: إِلَّا مِنْ صَدَقَۃٍ الخ]]‘‘:یہ ’’[[arabic: إِلَّا مِنْ ثَلَاثَۃٍ]]‘‘سے بدل ہے اور’’[[arabic: إِلَّا]]‘‘کا تکرار مفہوم کو`
  },
  {
    pageNumber: 314,
    text: `مزید مستحکم کردیتا ہےاور اس کی اہمیت کی جانب متوجہ کرتا ہےاورسنن ابودائود اور سنن نسائی کی روایت میں ’’[[arabic: إِلَّا]]‘‘کے تکرار کے بغیر ہےاور ترمذی کی روایت میں ’’ [[arabic: إِلاَّ مِنْ ثَلاَثٍ]]‘‘(کے بعد)[[arabic: صَدَقَۃٌ]] لفظِ اِلَّااور مِنْ جارہ کے بغیر ہےاور اگر ’’[[arabic: صَدَقَۃٍ]]‘‘جر کے ساتھ پڑھیں تو یہ’’ [[arabic: ثَلَاثٍ( جَارِیَۃٍ)]]‘‘سے بدل ہوگا،یعنی ثواب منقطع نہیں ہوگا جیسے : دائمی وقف کا اجر واقِف کو ملتا رہتا ہے اور سنن نسائی اور سنن ابودائود کا ترجمۃ الباب :’’[[arabic: بَابُ الصَّدَقَۃِ عَنِ الْمَیِّتِ]]‘‘سے یہی ظاہر ہوتا ہے،(مرعاۃ المفاتیح،ج:۱،ص:۳۰۶)‘‘۔
	کیونکہ جب تک کسی کے صدقاتِ جاریہ کا فیضان اور اس کے فعلِ خیر کے آثاراس کی وفات کے بعد بھی اس دنیا میں باقی ہیں، اُس شخص کے نامۂ اعمال میں اللہ تعالیٰ کی طرف سے ثواب لکھاجاتارہے گا ۔                                                                                                                                              
’’بعض لوگ یہ کہہ کر بلیک میلنگ کرتے ہیں کہ ہم تولوگوں کو مدینۂ منورہ بھیجتے ہیں ، آپ مدینہ منورہ ضرور بھیجیں، لیکن اس کا اَحسن طریقہ یہ ہے : ’’اگر کوئی صاحبِ حیثیت شخص اللہ تعالیٰ کی رضاکے لیے لوگوں کو حج یا عمرہ کراناچاہتاہے تو خاموشی سے صالح اور مُتقی افراد کو تلاش کرے اور اپنے اس نیک عمل کو کسی تشہیر کے بغیر پایۂ تکمیل تک پہنچائے، یہی شِعار اللہ تعالیٰ کے نزدیک زیادہ پسندیدہ ہے ، اللہ تعالیٰ کا ارشاد ہے :
’’[[arabic: فَمِنَ النَّاسِ مَنْ يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا وَمَا لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ]]‘‘۔
ترجمہ:’’ پس لوگوں میں سے کچھ ایسے ہیں جو کہتے ہیں: اے ہمارے پروردگار!ہمیں (ہمارے کاموں کا) دنیا میں (صلہ) دیدے اور اُن کے لیے آخرت میں کوئی حصہ نہیں ہے ،(البقرہ:200)‘‘،حدیث پاک میں ہے :
’’ [[arabic: كُنَّا نَعُدُّ عَلَى عَهْدِ رَسُولِ اللَّهِ ﷺ أَنَّ الرِّيَاءَ الشِّرْكَ الْأَصْغَرَ هَذَا حَدِيثٌ صَحِيحُ الْإِسْنَادِ]]‘‘۔
 ترجمہ:’’ ہم عہد رسالت مآب صلی اللہ علیہ وسلم میں ریاکاری کو شرکِ اصغر شمار کرتے تھے ، یہ حدیث سنداً صحیح ہے،(المُستدرک للحاکم :7937)‘‘۔الغرض تاجدارِ مدینہ صلی اللہ علیہ وسلم نے صدقاتِ`
  },
  {
    pageNumber: 315,
    text: `جاریہ کی جوترغیب فرمائی ہے ،اُس پر عمل کریں اورایسے دینی مدارس وجامعات قائم کریں ، جن میں دینی وعصری تعلیم کا حسین امتزاج ہو یا نام ونمود کے شو ق کے بغیر انسانی رفاہی خدمات انجام دیں ‘‘۔
	لوگ جلسوں میں نام ونمود کے لیے عمرے کے ٹکٹ بانٹتے پھرتے ہیں ،اہل مجالس اوربعض پیرانِ عظام مجالس میں مجمع بڑھانے کے لیے اس کا سہارا لیتے ہیں۔ شاید اُن کے تقویٰ وکردارمیں وہ کشش نہیں رہی کہ ان ترغیبات کے بغیر لوگ اُن کی مجالس میں کھچے چلے آئیں ۔حضرت سید علی ہجویری المعروف داتا گنج بخش اور حضرت خواجہ معین الدین چشتی اجمیری ،حضرت بابا فرید الدین گنج شکر، ا مام اہلسنت اعلیحضرت امام احمد رضا قادری ، حضرت قبلہ سید پیر مہرعلی شاہ گولڑوی رحمہم اللہ اجمعین اوردیگر اکابر اُمّت رحمہم اللہ تعالیٰ کے اَعراس پر عمرے کے ٹکٹ نہیں بٹتے، سینکڑوں سال بعد بھی اُن کے علم و تقویٰ اور اخلاص ولِلّٰہیت کے سبب لوگ اُن مجالس میںکھچے چلے آتے ہیں ۔آج علم ،تقویٰ اور اخلاص کا متبادل عمرے کے ٹکٹوں کو بنالیاگیاہے،ہمیں فقط علم ، تقویٰ ،اخلاص کے زوال اور ریاکاری کے کلچر پر افسوس ہے،شریعت کاحکم ظاہر پر لگتاہے ،باطن کا معاملہ اللہ کے سپرد ہے ۔
	ہم تو خرافات پر مبنی پروگرام نہیں دیکھتے ، لیکن آج کل الیکٹرانک میڈیا پر افطار کے اوقات میں مر دوں اور عورتوںکے مخلوط اجتماعات میں جس بے ہودہ اوربے ہنگم انداز سے لوگوں کو تحائف تقسیم کیے جارہے ہوتے ہیں اورلوگوں کے بیان کے مطابق خاص طورپر خواتین کا موٹر سائیکل کے لیے اینکر سے اصرار کرنا اور پھر نامحرم اینکر کے ساتھ موٹر سائیکل پر بیٹھ کر ہال کا چکر لگانا ،اینکر کے ساتھ سیلفیاں بنوانا،یہ تمام باتیں شریعت کے خلاف ہیں اور حُرمت کے جو احکام اللہ اور اس کے رسول صلی اللہ علیہ وسلم نے بیان فرمائے ہیں ،کھلے عام اُن کی نافرمانی اور پامالی ہے ۔باقی جہاں تک نقد رقوم ،گھریلو استعمال کی اشیاء یا موٹر سائیل /کار وغیرہ کا تعلق ہے ،تو ہمیں نہیں معلوم کہ یہ رقوم یا اشیاء کس مَد سے دی جاتی ہیں اور ان کا مقصدکیاہے، اگر ان کا مقصد تجارت کو فروغ دینا ہے، کاروبار کو ترقی دیناہے ،تویہ ایک`
  },
  {
    pageNumber: 316,
    text: `خالص تجارتی اور کاروباری معاملہ ہے،لیکن اس میں بھی شرعی حدود کی پاسداری ضروری ہے۔ البتہ اگریہ اشیاء اپنی عاقبت سنوارنے اور اللہ کی رضا کے لیے دی جاتی ہیں ،تو مقصد واضح کیاجائے تا کہ شریعت کی روشنی میں حکم بیان کیاجائے۔رمضان المبارک میں چونکہ افطارسے پہلے ،افطارکے وقت اور افطار کے بعد پرائم ٹائم ہوتاہے ،اس لیے ان اوقات میں پاکیزہ روحانی فضا میں مذہبی پروگراموں کو ترجیح دی جانی چاہیے ،یہ اللہ تعالیٰ کی خوشنودی کا باعث ہوگا ۔

[[heading: وقوفِ عرفہ کے موقع پر عورت کو حیض آجانا ]]
سوال:
	ایک خاتون حج کا خطبہ اور نماز ِ ظہروعصر اداکرنے کے بعدحائض ہوگئی ، بقیہ ارکان کی ادائیگی کس طرح کرے گی؟،(شہزادی بیگم ،کراچی) ۔  
 جواب:
 	حج کے کل ایام پانچ ہیں :پہلا دن آٹھ ذوالحجہ :احرام میں داخل ہونے اور حج کی نیت کرنے کے بعد تلبیہ پڑھنا ،منیٰ کو روانگی ،رات منیٰ میں قیام دوسرا دن نو ذوالحجہ:منیٰ میں نمازِ فجر اداکرکے عرفات پہنچنا، خطبہ سن کر نمازِ ظہر وعصر ملاکر پڑھنا ، غروبِ آفتاب کےبعد مزدلفہ روانہ ہونا، مزدلفہ میں مغرب و عشا  ملاکر اداکرنا۔تیسرا دن دس ذوالحجہ : جمرۂ عقبہ پر رمی، قربانی ( حج کادَمِ شکر)کے بعدایک پور کے برابر بال کترنا اور بیت اللہ جاکر طوافِ زیارت کرنا ، سعی کرنااور رات منیٰ میں گزارنا۔چوتھا دن گیارہ ذوالحجہ: زوال کے بعد تینوں جمرات کی رمی کرنا ،بارہ کی رات منیٰ میں رہنا سنت ہے ۔پانچواں دن بارہ ذوالحجہ :زوال کے بعد تیسرے دن تینوں جمرات کی رمی ،حج مکمل ہوگیا ، مکہ سے روانگی کے وقت طوافِ وداع واجب ہے ۔
	نو ذوالحجہ عرفات کے میدان میں وقوف (ٹھہرنا) حج کا رکنِ اعظم ہے ،حیض ونفاس والی عورت اور جنبی آدمی کا وقوف صحیح ہے ،حج اداہوجائے گا ، وقوفِ مزدلفہ ، وقوفِ منٰی ، رمیِ`
  },
  {
    pageNumber: 317,
    text: `جمرات اور مُتمتع کی قربانی کے لیے طہارت شرط نہیں ہے، لہٰذا یہ واجبات حائض عورت حالتِ حیض میں بھی اداکرسکتی ہے ۔
	طوافِ زیارت حج کا دوسرا رکنِ اعظم ہے ،اسے طوافِ اِفاضہ اور طوافِ فرض بھی کہتے ہیں۔دس ذوالحجہ کی طلوعِ فجر سے طوافِ زیارت کا وقت شروع ہوتاہے اور بارہ ذوالحجہ کے غروبِ آفتاب تک رہتاہے ، چونکہ حیض ونفاس عذرمن جانب العباد نہیں ہے ،بلکہ من جانب اللہ ہے ،اس لیے عذرمن جانب اللہ کی صورت میں تاخیر پر دَم یا کفارہ نہیں ہے ۔اگر حائض اور اس کے محرم کے لیے واپس روانگی میں تاخیر کی گنجائش ہے، تو وہ اپنی ریزرویشن منسوخ کرکے اسے مناسب وقت تک مؤخر کردیں اورحیض ختم ہونے پر غسل کرکے پاک ہوجائیں اور پھر طواف فرض اداکریں ،اس کے بعد حسبِ سہولت طوافِ وداع کرکے رختِ سفر باندھ سکتے ہیں ۔لیکن اگر خدانخواستہ اس کی گنجائش اورسہولت نہ ہو تو حالتِ حیض میں طوافِ زیارت کرلیں اور حدودِ حرم میں کفارے کے طورپر بَدَنہ (یعنی اونٹ یاگائے) کی قربانی دینی ہوگی، ویسے عذرمن جانب اللہ کے لیے قانون میں رعایت ہونی چاہیے ،کیونکہ یہ عبادت حج کا مسئلہ ہے اور مسلم حکومتوں کو اس سلسلے میں سہولت فراہم کرنی چاہیے ،غیر مسلم ممالک سے آنے والے تو واپسی کی تقدیم وتاخیر کے معاملے میں خود مختار ہوتے ہیں ، زیادہ سے زیادہ سابق رزرویشن کی منسوخی اورنئی ریزرویشن کے لیے کچھ اضافی رقم دینی ہوتی ہے، لیکن مسلم حکومتوں کو اضافی رقم نہیں لینی چاہیے ۔
	سعی کے لیے طہارت لازمی نہیں بلکہ مستحب ہے ۔علامہ نظام الدین رحمۃ اللہ علیہ معذور کے حج وعمرہ کی سعی کے بارے میںلکھتے ہیں:
’’[[arabic: وَاِنْ سَعٰی جُنُبًا أوْحَائِضاً أوْ نَفَساً فَسَعْیُہٗ صَحِیْحٌ]]‘‘۔
ترجمہ:’’ اور اگر حیض ونفاس والی عورت اور جنبی شخص(یعنی جس پر غسل واجب ہو ) سعی کریں، تو (ان کا سعی کرنا)صحیح ہے (یعنی سعی کے لیے طہارت شرط نہیں) ،(فتاویٰ عالمگیری، ج:1،ص:41، ص:247)‘‘۔`
  },
  {
    pageNumber: 318,
    text: `علامہ مفتی امجد علی اعظمی رحمۃ اللہ علیہ تحریر فرماتے ہیں: ’’مستحب یہ ہے کہ باوضو سعی کرے ، (بہارِ شریعت، حصہ ششم، جلد1، ص:435)‘‘۔

[[heading: پیدل حج کرنے کی منّت ماننا]]
سوال:
	(1): پیدل حج کرنے کا ثواب زیادہ ہے یا سواری پر حج کرنے کا،(2):اگر پیدل حج کرنے کی نذر مانی ہے تو کیا اس کا پورا کرنا واجب ہے ، اگر نذر پوری نہیں کرتا تو کیا اس پر کفارہ لازم آئے گا،کیونکہ حدیث میں آیا ہے کہ پیدل حج کرنے کا اجر ایک لاکھ گنا ہے، پس سوال یہ ہے کہ ایسی نذر ماننے والا مشقت وتکلیف برداشت کر کے عزیمت پر عمل کرے یا سواری پر حج کرے،(مختار احمد ،کراچی)۔
جواب:
	اللہ تعالیٰ کا ارشاد ہے: ’’[[arabic: وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا وَعَلَى كُلِّ ضَامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ]]‘‘۔
ترجمہ: ’’اور لوگوں میں حج کا اعلان کردیجیے ،وہ آپ کے پاس دور دراز راستوں سے پیدل اور ہر دبلے اونٹ پر سوار ہوکر آئیں گے ، (الحج:27)‘‘۔اس آیت میں چونکہ پیدل اور سوار ہوکر دونوں صورتوں میں حج کا بیان ہے ،لہٰذا پیدل حج کی منّت ماننا شرعاً درست ہے۔ علامہ عمر بن علی حنبلی اس آیت کے تناظر میں لکھتے ہیں:
’’[[arabic: بَدَاَ اللّٰہُ بِذِکْرِ الْمُشَاۃِ تَشْرِیْفاً لَھُمْ]]‘‘،ترجمہ:’’اللہ تعالیٰ نے اس آیت میں پیدل حج کرنے والوں کا ذکر پہلے فرمایا اور یہ اُن کو شرف عطا کرنا ہے ،اُس کے بعد انہوں نے وہ حدیث لکھی ہے جو آگے آرہی ہے ،(اللباب فی علوم الکتاب، ج:14،ص:74)‘‘۔
اب اس موضوع پرچند احادیث مبارکہ ملاحظہ فرمائیں:
(1)’’[[arabic: عَنْ أَنَسٍ رَضِیَ اللّٰہُ عَنْہُ، أَنَّ النَّبِیَّ ﷺرَاٰی شَیْخًا یُہَادٰی بَیْنَ ابْنَیْہِ، قَالَ:مَا بَالُ ہٰذَا، قَالُوْا:نَذَرَ أَنْ یَّمْشِیَ، قَالَ:إِنَّ اللّٰہَ عَنْ تَعْذِیْبِ ہٰذَا نَفْسَہٗ لَغَنِیٌّ،]]`
  },
  {
    pageNumber: 319,
    text: `[[arabic: وَأَمَرَہٗ أَنْ یَرْکَبَ]]‘‘
ترجمہ: ’’حضرت انس رضی اللہ عنہ بیان کرتے ہیں: نبی صلی اللہ علیہ وسلم نے دیکھا :(حج کے موقع پر)ایک شخص اپنے دو بیٹوں کے سہارے جارہا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: اسے کیا ہوا؟،لوگوں نے بتایا:اس نے پیدل حج کرنے کی نذر مانی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا:یہ جو اپنے آپ کو عذاب دے رہا ہے ، اللہ تعالیٰ اس سے بے نیاز ہے اورآپ نے اس کو سوار ہونے کا حکم فرمایا، (صحیح البخاری: 1865)‘‘۔
(2)’’[[arabic: عَنْ عُقْبَۃَ بْنِ عَامِرٍ، أَنَّہُ سَاَلَ النَّبِیَّ ﷺ عَنْ أُخْتِہٖ نَذَرَتْ أَنْ تَمْشِیَ إِلَی الْکَعْبَۃِ، فَقَالَ: إِنَّ اللَّہَ غَنِیٌّ عَنْ نَذْرِ أُخْتِکَ لِتَرْکَبْ وَلْتَہْدِ بَدَنَۃً وَفِیْ رِوَایَۃِ اَبِیْ دَاوٗدَ:وَتُہْدِیَ ہَدْیًا]]‘‘۔
ترجمہ:’’عقبہ بن عامر بیان کرتے ہیں : انہوں نے نبی صلی اللہ علیہ وسلم سے اپنی بہن کے بارے میں سوال کیا کہ انہوں نے پیدل چل کر کعبہ جانے کی منت مانی ہے ،تو آپ صلی اللہ علیہ وسلم نے فرمایا: بے شک اللہ تمہاری بہن کی نذر سے بے نیاز ہے ، اُسے چاہیے کہ وہ سواری پر جائے اور ایک بَدنہ ہدیہ دے اور ابودائود کی روایت میں ہے: ’’وہ ہدی یعنی دم دے‘‘،(صحیح ابن خزیمہ:3045،سنن ابودائود: 3296)‘‘۔بکری یا دنبے کی قربانی کو ہدی بھی کہتے ہیں اور دم بھی۔ 
(3)’’[[arabic: عَنِ ابْنِ عَبَّاسٍ، قَالَ: جَاءَ رَجُلٌ إِلَی النَّبِیِّ ﷺ، فَقَالَ: یَا رَسُولَ اللّہِ! إِنَّ أُخْتِی نَذَرَتْ یَعْنِیْ أَنْ تَحُجَّ مَاشِیَۃً، فَقَالَ النَّبِیُّ ﷺ: إِنَّ اللَّہَ لَا یَصْنَعُ بِشِقَاءِ أُخْتِکَ شَیْئًا، فَلْتَحُجَّ رَاکِبَۃً، وَلْتُکَفِّرْ عَنْ یَّمِینِہَا]]‘‘۔
ترجمہ: ’’عبداللہ بن عباسرضی اللہ عنہما بیان کرتے ہیں: ایک شخص نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی: یارسول اللہ! میری بہن نے پیدل حج کرنے کی منّت مانی ہے ،نبی صلی اللہ علیہ وسلم نے فرمایا: اللہ تمہاری بہن کو مشقت میں ڈال کر کیا کرے گا،اُسے چاہیے کہ وہ سوار ہوکر حج کرے اور قسم کا کفارہ ادا کرے ، (سنن ابودائود:3295)‘‘۔`
  },
  {
    pageNumber: 320,
    text: `فقہی ضابطہ یہ ہے کہ جب ایک ہی چیز کے بارے میں ایک جگہ حکم مطلق ہو، جیسے حدیث نمبر1میں ہے اور دوسری جگہ قید کے ساتھ ہو، جیسے حدیث نمبر2اور3میں ہے ،تو مطلق کومقیّد پر محمول کریں گے اور وہاں بھی قید (جانور کی قربانی دینا یا قسم کا کفارہ) کا اعتبار ہوگا۔ 
امام علاء الدین کاسانی نے فرمایا :حضرت علی رضی اللہ عنہ نے فرمایا:’’جو منّت مان کر اپنے اوپر پیدل حج کرناواجب کردے تو وہ سوار ہوکر حج کرے اورحرم میں ایک بکری کی قربانی دے‘‘۔حدیث مبارک میں اپنے آپ کو ناقابلِ برداشت مشقت میں ڈالنے کو اپنی جان کو عذاب دینے سے تعبیر فرمایا ہے،کیونکہ شریعت نے اُس سے پیدل حج کا مطالبہ نہیں کیا ، منّت مان کر پیدل حج کرنے کی پابندی خود اُس نے اپنے اوپر عائد کی ۔اس کے برعکس اگر کسی ایسی بات کی منّت مانی ہو جو نہ خود عبادتِ مقصودہ ہے اور نہ اُس کی جنس سے کوئی عبادتِ مقصودہ ہے ،تو ایسی شرط لغو ہوگی اور جس عبادت کی منّت مانی ہے ،اُسے پورا کرنا ہوگا، حدیث پاک میں ہے:
’’[[arabic: عَنِ ابْنِ عَبَّاسٍ، قَال:بَیْنَا النَّبِیُّ ﷺ یَخْطُبُ، إِذَا ہُوَ بِرَجُلٍ قَائِمٍ، فَسَاَلَ عَنْہُ، فَقَالُوا:أَبُو إِسْرَائِیلَ، نَذَرَ أَنْ یَقُوْمَ وَلاَ یَقْعُدَ، وَلاَ یَسْتَظِلَّ، وَلاَ یَتَکَلَّمَ، وَیَصُوْمَ، فَقَالَ النَّبِیُّ ﷺ: مُرْہُ فَلْیَتَکَلَّمْ وَلْیَسْتَظِلَّ وَلْیَقْعُدْ، وَلْیُتِمَّ صَوْمَہٗ]]‘‘۔
ترجمہ:’’حضرت عبداللہ بن عباسرضی اللہ عنہما بیان کرتے ہیں: نبی  صلی اللہ علیہ وسلم خطبہ ارشاد فرمارہے تھے کہ ایک شخص کو (دھوپ میں)کھڑے دیکھا،آپ نے اس کے بارے میں پوچھا (یہ کیوں کھڑا ہے؟)، لوگوں نے بتایا:یہ ابواسرائیل ہے ،اس نے نذر مانی ہے کہ کھڑا رہے گا، بیٹھے گا نہیں ،سائے میں بھی نہیں آئے گا، بات بھی نہیں کرے گا اور روزہ رکھے گا، نبی صلی اللہ علیہ وسلم نے فرمایا: اس سے کہو کہ یہ بات کرے ، سائے میں بھی آئے ،بیٹھے بھی اور اپنا روزہ پورا کرے،(صحیح البخاری:6704)‘‘۔یہی وجہ ہے کہ اس شخص کو رسول اللہ صلی اللہ علیہ وسلم نے قسم کا کفارہ دینے کا حکم نہیں فرمایا ،کیونکہ دھوپ میں کھڑا ہونا یاکلام نہ کرنا نہ عبادتِ مقصودہ`
  },
  {
    pageNumber: 321,
    text: `ہے اور نہ اس کی جنس سے کوئی عبادت ہے ،لہٰذا یہ شرط لغو ہے اور روزہ پورا کرنا اس پر واجب ہے ،چنانچہ حافظ ابن حجر عسقلانیرحمۃ اللہ علیہ لکھتے ہیں:
’’ہر وہ فعل جس سے انسان کو تکلیف پہنچے ،خواہ انجام کے اعتبار سے ہو اور اس کا مشروع ہونا کتاب وسنت سے ثابت نہ ہو ،جیسے ننگے پیر چلنا اور دھوپ میں بیٹھنا، تو نہ یہ اللہ تعالیٰ کی عبادت ہے اور نہ اس سے نذر منعقد ہوگی ،کیونکہ نبی صلی اللہ علیہ وسلم نے ابواسرائیل کو صرف روزہ پورا کرنے کا حکم فرمایا اور کوئی حکم نہیں دیا۔اس کی وجہ یہ ہے : آپ کو علم تھا کہ روزہ رکھنا اس پر مشقت کا باعث نہیں ہے اور اس کو بیٹھنے ،باتیں کرنے اور سائے میں جانے کا حکم دیا ۔ علامہ قرطبی نے کہا ہے:’’ابواسرائیل کے اس قصے میں جمہورِ فقہاء کے اس موقف پر واضح دلیل ہے کہ جس نے معصیت کی نذر مانی یاایسے کام کی نذر مانی جو عبادت نہیں ہے تواس نذر کو توڑنے سے کفارہ واجب نہیں ہوتا،(فتح الباری، ج: 7، ص: 761، دارالمعرفہ، بیروت)‘‘۔
آپ نے جس حدیث کا حوالہ دیا ہے ،وہ یہ ہے: 
’’[[arabic: عَنْ زَاذَانَ،قَالَ:مَرِضَ ابْنُ عَبَّاسٍ مَرَضًا شَدِیدًا،فَدَعَاوَلَدَہٗ فَجَمَعَہُمْ فَقَالَ: سَمِعْتُ رَسُولَ اللّٰہِ ﷺیَقُوْلُ:مَنْ حَجَّ مِنْ مَکَّۃَ مَاشِیًا حَتّٰی یَرْجِعَ إِلٰی مَکَّۃَ کَتَبَ اللّٰہُ لَہٗ بِکُلِّ خُطْوَۃٍ سَبْعَ مِائَۃِ حَسَنَۃٍ،کُلُّ حَسَنَۃٍ مِثْلُ حَسَنَاتِ الْحَرَمِ،قِیْلَ:وَمَا حَسَنَاتُ الْحَرَمِ،قَالَ:بِکُلِّ حَسَنَۃٍ مِائَۃُ أَلْفِ حَسَنَۃٍ،ہٰذَا حَدِیثٌ صَحِیحُ الْإِسْنَادِ، وَلَمْ یُخَرِّجَاہُ ]]‘‘۔
ترجمہ:’’ زاذان بیان کرتے ہیں: حضرت ابن عباسرضی اللہ عنہ شدید بیمار ہوگئے ،انہوں نے اپنے بیٹوں کو بلاکر جمع کیا،پھر فرمایا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : جو مکہ سے پیدل حج کرنے کے لیے نکلا ،یہاں تک کہ مکہ لوٹ آیا ،اللہ تعالیٰ اس کو ہر قدم کے بدلے سات سونیکیاں عطافرمائے گا، ہرنیکی حرم کی نیکیوں کی مثل ہوگی،پوچھاگیا:حرم کی نیکیاں کیسی ہیں ؟،فرمایا: ہرنیکی ایک لاکھ نیکیوں کے برابرہے، (المُستدرک علی الصحیحین للحاکم :  1692)‘‘۔اس حدیث کی سند صحیح ہے ،لیکن امام بخاری اور امام`
  },
  {
    pageNumber: 322,
    text: `مسلم نے اس کی تخریج نہیں کی ۔یہ حدیث ’’اَلسُّنَنُ الْکُبْریٰ لِلْبَیْھَقِی، جلد10، ص:78،اَلْمُعْجَمُ الْکَبِیْر، جلد3،ص:169اور مَجْمَعُ الزَّوَائِدْ، جلد3،ص:209میں بھی موجود ہے ۔اسی مضمون کی ایک اورحدیث درج ذیل ہے:
’’[[arabic: عنِ ابْنِ عَبَّاسٍ قَالَ:مَا آسٰی عَلٰی شَیْئٍ إِلَّاعَلٰی أَنِّی لَمْ أَحُجَّ مَاشِیًا إِنِّی سَمِعْتُ رَسُوْلَ اللّٰہِ ﷺ یقُوْلُ:مَن حَجَّ رَاکِبًا کَانَ لَہٗ بِکُلِّ خُطْوَۃٍ حَسَنَۃٌ،ومَنْ حَجَّ مَاشِیًا کَانَ لَہٗ بِکُلِّ خُطْوَۃٍ یَخْطُوْہَاسَبْعُوْنَ حَسَنَۃً مِنْ حَسَنَاتِ الْحَرَمِ،قالَ:قُلتُ:وَمَا حَسَنَاتُ الْحَرَمِ قَالَ:اَلْحَسَنَۃُ بِمِأۃِ أَلْفٍ]]‘‘۔
ترجمہ:حضرت ابن عباسرضی اللہ عنہما نے فرمایا: مجھے کسی چیز کا افسوس نہیں ہے ،سوائے اس کے کہ میں نے پیدل حج نہیں کیا کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سناہے: جس نے سوار ہوکر حج کیا ،اس کو ہرقدم پرایک نیکی ملے گی اور جس نے پیدل حج کیا ، اس کو ہرقدم پر حرم کی ستّر نیکیاں ملیں گے ،پوچھاگیا : حرم کی نیکیاں کیسی ہیں؟،فرمایا: ہرنیکی ایک لاکھ نیکیوں کے برابر ہے،(اَلْکَامِل فِی ضُعَفَاءِ الرِّجَالِ، ج: 5،ص:424)‘‘۔اس روایت سے معلوم ہوا کہ حضرت عبداللہ بن عباس رضی اللہ عنہما پیدل حج کرنے کو زیادہ اجر کا باعث سمجھتے تھے ۔ تاہم خود نبی کریم صلی اللہ علیہ وسلم سے سواری پر حج کرنا ثابت ہے ،لہٰذا یہ آپ کافعلِ مبارک ہے،نیز اس میں یہ حکمت تھی کہ سب لوگ مناسبِ حج سیکھ لیں اور پیدل حج کرنا آپ صلی اللہ علیہ وسلم کی قولی حدیث ہے، فلہٰذا سنت ہے،حدیث پاک میں ہے:
’’[[arabic: إِنَّ ابْنَ عُمَرَ رَضِیَ اللّٰہُ عَنْہُمَا،قَالَ:رَأَیْتُ رَسُولَ اللّٰہِ ﷺ یَرْکَبُ رَاحِلَتَہٗ بِذِی الْحُلَیْفَۃِ،ثُمَّ یُہِلُّ حَتّٰی تَسْتَوِیَ بِہٖ قَائِمَۃً]]‘‘۔
ترجمہ:’ ’حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں:میں نے رسول اللہ صلی اللہ علیہ وسلم کو(اہلِ مدینہ کی میقات) ذُوالْحُلَیْفَہ کے مقام پر سواری پر سوار ہوتے ہوئے دیکھا ،پھر آپ نے احرام باندھا ،حتّٰی کہ سواری سیدھی کھڑی ہوگئی،(صحیح البخاری:1514)‘‘۔`
  },
  {
    pageNumber: 323,
    text: `علامہ بدرالدین عینی حنفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: اَلرّکُوْبُ فِی سَفَرِ الْحَجّ وَالرُّکُوْبُ فِیْہِ وَالْمَشْیُ سَوَاءٌ فِی الْإِبَاحَۃِ،وَالْکَلَامُ فِی الْاَفْضَلِیَّۃ، فَقَالَ قَومٌ:اَلرّکُوبُ أَفْضَلُ اِتّبَاعًا لِلنَّبِی ﷺ وَلِفَضْلِ النَّفَقَۃِ، فَإِنَّ النَّفَقَۃَ فِیہِ کَالنَّفَقَۃِ فِیْ سَبِیْلِ اللّٰہِ سَبْعُمِائَۃِ ضِعْفٍ]]‘‘۔
ترجمہ:’’سفرِ حج میں پیدل چلنا یا سواری پر بیٹھ کر جانا دونوں یکساں طور پر مباح ہیں ،کلام افضلیت میں ہے ، فقہاء کی ایک جماعت نے کہا: سواری پر سفر کرنا افضل ہے کیونکہ اس میں نبی صلی اللہ علیہ وسلم کے فعل کا اتّباع ہے اورپیدل کے مقابلے میں سواری پر حج کا خرچ زیادہ ہے ، کیونکہ حج کے سفرپر جو رقم خرچ ہوتی ہے ،وہ انفاق فی سبیل اللہ کے زمرے میں آتی ہے اور انفاق فی سبیل اللہ کا اجر سات سوگنا ہے،(عمدۃ القاری ،جلد9، ص: 186)‘‘۔اِنْفَاق فِی سَبِیْلِ اللہ کا اجر سورۃ البقرہ:261میں چودہ سو گنا تک بتایا گیا ہے ،عام طور پر احادیثِ مبارکہ میں سات سو گنا تک بتایا گیا ہے ،(صحیح مسلم:1151،مسند احمد:19036،مجمع الزوائد:5268)۔
’’[[arabic: عَنْ أَنَسِ بْنِ مَالِکٍ، قَالَ: قَالَ رَسُوْلُ اللّٰہِ ﷺ:اَلْحُجَّاجُ وَالْعُمَّارُ وَفْدُ اللّٰہِ عَزَّوَجَلَّ، یُعْطِیْہِمْ مَا سَاَلُوْا، وَیَسْتَجِیْبُ لَہُمْ مَا دَعَوْا، وَیُخْلِفُ عَلَیْہِمْ مَا أَنْفَقُوا الدِّرْہَمَ أَلْفَ أَلْفٍ]]‘‘۔
ترجمہ:انس بن مالکرضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: حج اور عمرہ کرنے والے اللہ تعالیٰ کے مہمان ہیں ،وہ جو مانگیں اللہ تعالیٰ انہیں عطا فرماتا ہے اور جو دعا کریں اللہ تعالیٰ قبول فرماتا ہے اور ایک درہم کے بدلے میں انہیں دس لاکھ درہم (کے برابر اجر)عطا فرماتا ہے ،(شُعَبُ الْاِیْمَان:3810)‘‘۔یہ حدیث ضعیف ہے اور فضائلِ اعمال میں ضعیف حدیثیں معتبر ہیں ۔لیکن یہ لگا بندھا ضابطہ نہیں ہوتا ، بلکہ اللہ تعالیٰ ہر ایک کواُس کے حُسنِ نیت اور اخلاص کے مطابق عطا فرماتا ہے ،جیساکہ صحیح مسلم کی حدیث میں ہے:’’بنی آدم کے ہر نیک کام کا بدلہ دس گنا سے سات سو گنا تک بڑھا کرعطا کیا جاتا ہے، (صحیح`
  },
  {
    pageNumber: 324,
    text: `مسلم:1151)‘‘۔
صحیح البخاری:1865کی شرح میں علامہ بدرالدین عینی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’ظاہریہ (غیر مقلدین) نے کہا: جو چلنے سے عاجز ہو ،اُس پر کوئی دم نہیں ہے ،کیونکہ چلنے کی نذر ماننا ،نذرِ شرعی نہیں ہے اور اس میں بدن کو تھکانا ہے ،باقی فقہاء کے اس میں اقوال ہیں:ایک قول یہ ہے : حضرت علی اور حضرت عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے : ’’جو بیت اللہ کا پیدل چل کر حج کرنے کی نذر مانے اور پھر اس کو پورا کرنے سے عاجز آجائے تو جتنا چل سکتا ہو چلے اور پھر سوار ہوجائے اور ہدی دے‘‘، حضراتِ عطاء، حسن ، امام ابوحنیفہ اور امام شافعی کا یہی قول ہے ،امام ابوحنیفہ نے فرمایا: ’’اگر عَجز کے بغیر سوار ہوا تو حانث ہونے کی بنا پر قسم کا کفارہ دے گا‘‘،اسے امام طحاوی نے روایت کیا اور امام شافعی نے فرمایا:’’احتیاط یہ ہے کہ دم دے اور جوطاقت نہ رکھے، اُس سے دم ساقط ہوجائے گا‘‘،اُن کی دلیل یہ ہے :ایک روایت میں آپ صلی اللہ علیہ وسلم نے فرمایا:’’سوار ہوجائے اور دم دے‘‘۔ دوسرا قول یہ ہے :’’واپس لوٹ کر پھر دوبارہ حج کرے اور جتنی جگہ پچھلے حج میں سوار ہوکر چلا تھا،اتنی جگہ پیدل چلے اور اس پر کوئی دم نہیں ہے ،یہ حضراتِ ابن عمر،ابن عباس ، نخعی اور ابن جبیررضی اللہ عنہم کا قول ہے ،اسے امام مالک نے مؤطا میں بیان کیا ہے‘‘اور تیسرا قول یہ ہے: ’’واپس لوٹ کر جتنی جگہ سوار ہوا تھا ،پیدل چلے اور دم بھی دے ، حضراتِ ابن عباس ،نخعی اوراِبْنُ الْمُسَیَّب رضی اللہ عنہم سے بھی یہ قول مروی ہے ،امام مالک نے احتیاطاً دونوں چیزوں یعنی پیدل چلنے اور دم دینے کا حکم دیا ،(عمدۃ القاری ، ج:10، ص:321)‘‘۔
	ہماری نظر میں سواری پر سفر کرنے والا اور پیدل چلنے والا دونوں بیت اللہ تک کی مسافت کو طے کرتے ہیں ،ایک مال خرچ کرتا ہے اور دوسرا جسمانی مشقت اٹھاتا ہے اور دونوں عنداللہ ماجور ہیں اور احادیثِ مبارکہ میں بیان کردہ اجر کے حق دار ہیں ۔بہت سے معاملات بندوں کے احوال کے اعتبار سے ہوتے ہیں ،کسی کے لیے مال خرچ کرنا مشکل ہوتا ہے اور کسی کے لیے جسمانی مشقت برداشت کرنا ، سو ہر ایک کو اُس کے حال کے مطابق`
  },
  {
    pageNumber: 325,
    text: `اجر ملے گا، لیکن اپنے آپ کو ناقابلِ برداشت مشقت اور اذیت میں مبتلا کرنا شریعت کا مطلوب نہیں ہے ،تاہم اگر کسی نے پیدل حج کرنے کی منت مانی ہے تو وہ اُسے پورا کرے اور اگر چلنے سے عاجز ہے توسوار ہوجائے اور حرم میں دم دے ۔
علامہ علی القاریرحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: (أَنْ تَرْکَبَ) أَیْ لِلْعَجْزِ (وَتُہْدِیَ ہَدْیًا) وَأَقَلُّہٗ شَاۃٌ وَأَعْلَاہُ بَدَنَۃٌ، فَالشَّاۃُ کَافِیَۃٌ وَالْاَمْرُ بِالْبَدَنَۃِ لِلنَّدْبِ ،قَالَ الْقَاضِیْ:لَمَّا کَانَ الْمَشْیُ فِی الْحَجِّ مِنْ عِدَادِ الْقُرُبَاتِ وَجَبَ بِالنَّذْرِ وَالْتَحَقَ بِسَائِرِ أَعْمَالِہِ الَّتِی لَا یَجُوْزُ تَرْکُہَا إِلَّا لِمَنْ عَجَزَ وَیَتَعَلَّقُ بِتَرْکِہِ الْفِدْیَۃُ وَاخْتُلِفَ فِی الْوَاجِبِ فَقَالَ عَلِیٌّ رَضِیَ اللَّہُ عَنْہُ:تَجِبُ بَدَنَۃٌ وَقَالَ بَعْضُہُمْ:یَجِبُ دَمُ شَاۃٍ کَمَا مُجَاوَزَۃِ الْمِیقَاتِ وَحَمَلُوا الْاَمْرَ بِالْبَدَنَۃِ عَلَی الِاسْتِحْبَابِ وَہُوَقَوْلُ مَالِکٍ وَأَظْہَرُ  قَوْلَیِ الشَّافِعِیِّ وَقِیْلَ:لَا یَجِبُ فِیْہِ شَیْءٌ وَإِنَّمَا أُمِرَ بِالْہَدْیِ عَلٰی وَجْہِ الِاسْتِحْبَابِ دُوْنَ الْوُجُوْبِ ]] ‘‘۔
ترجمہ:’’اگر چلنے سے عاجز ہے تو سوار ہوجائے اور حرم میں ہدی دے ،اس کی کم از کم مقدار بکری ہے اورزیادہ سے زیادہ اونٹ یا گائے ہے ،پس بکری کی قربانی کافی ہے اور اونٹ یا گائے کی قربانی مستحب ہے ،قاضی عیاض نے کہا: جب پیدل حج کرنا عبادات میں سے ہے تو نذر ماننے سے واجب ہوگااور اُن اعمال کے ساتھ لاحق ہوگا جن کا ترک صرف عجز کی صورت میں جائز ہے اور اس کے ترک سے فدیہ لازم آئے گا اور اس کے بارے میں اختلاف ہے :حضرت علی رضی اللہ عنہ نے فرمایا: بَدنہ واجب ہے ،بعض نے فرمایا: بکری کا دم دینا واجب ہے ،جیسے حج یا عمرے کے لیے سفر کرنے والا میقات سے بغیر احرام کے گزر جائے تو اُسے بکری کا دم دینا ہوتا ہے اور بَدَنہ کے حکم کو استحباب پر محمول کیا ہے اور امام مالک کا قول بھی یہی ہے اور امام شافعی کا زیادہ واضح قول بھی یہی ہے اور بعض نے کہا: کچھ بھی واجب نہیں ہوتا اور ہدی کا حکم بطورِ استحباب کے ہے، وجوب کے طور پر نہیں ہے ،(مرقاۃ المفاتیح، ج:6،ص:2253)‘‘۔`
  },
  {
    pageNumber: 326,
    text: `علامہ علاء الدین حصکفیرحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: نَذَرَ الْمُکَلَّفُ حَجّاً مَاشِیاً مَشٰی مِنْ مَّنْزِلِہٖ وُجُوْباً فِی الْاَصَحِّ حَتّٰی یَطُوْفَ الْفَرْضَ لِاِنْتِھَاءِ الْاَرْکَانِ وَلَوْ رَکِبَ فِیْ کُلِّہٖ اَوْ اَکْثَرِہٖ لَزِمَہٗ دَمٌ وَفِیْ اَقَلِّہٖ بِحِسَابِہٖ]]‘‘۔
ترجمہ: ’’اگر عاقل بالغ مرد یا عورت نے پیدل حج کرنے کی منّت مانی تو صحیح ترین قول کے مطابق اس پر واجب ہے کہ اپنے گھر سے پیدل چلے یہاں تک کہ طوافِ فرض (یعنی طوافِ زیارت) ادا کرلے ،کیونکہ اس پر ارکانِ حج کا اختتام ہوجاتا ہے اور اگر پورا سفر یا اُس کا اکثر حصہ سواری پر طے کیا تو اُس پر دم لازم آئے گا اوراگر پورے سفر سے کم حصہ سواری پر طے کیا تو درمیانی بکری کی قیمت لگاکر مسافت کے تناسب سے صدقہ دے ، (حاشیہ ابن عابدین ،ج:7،ص:458-59)‘‘، اس کی شرح میں علامہ ابن عابدین شامیرحمۃ اللہ علیہ لکھتے ہیں:
’’اگر سفر کا بعض حصہ سواری پر طے کیا تو درمیانی بکری کے اعتبار سے قیمت لگا کراُس تناسب سے صدقہ دے اور عمرے کا اختتام حَلْق پر ہوگااور قیاس کا تقاضا یہ ہے کہ حج کا اختتام بھی طواف سے پہلے یا بعد حَلْق پر ہو،خواہ حَلْق طوافِ زیارت سے پہلے ہو یا بعد میں، تاکہ احرام سے باہر آجائے ‘‘۔ صدر الشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں:
’’پیدل حج کرنے کی منّت مانی تو واجب ہے کہ گھر سے طوافِ فرض تک پیدل ہی رہے اور پورا سفر یا اکثر سواری پر کیا تو دَم دے اور اگر اکثر پیدل رہا اور کچھ سواری پر تو اُسی حساب سے بکری کی قیمت کا جتنا حصہ اس کے مقابل آئے ،خیرات کرے۔ پیدل عمرہ کی منّت مانی تو سرمونڈانے تک پیدل رہے، (بہارِ شریعت حصہ ششم، ص:1215،مکتبۃ المدینہ کراچی)‘‘۔اگر نصف سفر سواری پر کیا ہے تو درمیانی بکری کی نصف قیمت خیرات کرے اور اگر تہائی سفر سواری پر کیا ہے تو تہائی قیمت خیرات کرے۔`
  },
  {
    pageNumber: 327,
    text: `[[heading: مالِ حرام سے حج کی قبولیت کا حکم ]]
سوال:
	 2010؁ء میں ہم تین افراد (والدہ ،بہن اور میں)نے اپنا فریضۂ حج اداکیا ،تینوں کے اخراجات والدہ نے کیے ،میری والدہ کا یوبی ایل میں اکاؤنٹ تھا ،اسی اکاؤنٹ سے تمام اخراجات اداکیے ،کچھ عرصہ بعد خیال آیا ان پیسوں میں سود کی رقم بھی شامل ہوگئی تھی ، اب ہم پریشان ہیں کہ حج اداہوایا نہیں ؟،(سید محمد فواد، کراچی )۔
جواب:
	فرض حج آپ کے ذمے سے ساقط ہوگیا ،البتہ مالِ حرام کی آمیزش حج کی قبولیت میں مانع ہے جیساکہ امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْز لکھتے ہیں : سود کے روپیہ سے جو کارِ نیک کیاجائے اُس میں استحقاقِ ثواب نہیں ،حدیث شریف میں ہے: جو مال حرا م لے کر حج کو جاتا ہے جب لبّیک کہتا ہے، ہاتف غیب سے جواب دیتا ہے :’’ [[arabic: لَالَبَّیکَ وَلَا سَعْدَیْکَ وَحَجُّکَ مَرْدُوْدٌ عَلَیْکَ حَتٰی تَرُدَّ مَافِیْ یَدَیْکَ]]‘‘۔
ترجمہ:’’ نہ تیری بارگاہِ الٰہی میں حاضری قبول ہے اور نہ ہی تیرا نذرانۂ بندگی قبول ہے ، اور تیرا حج تجھے واپس لوٹایا جاتا ہے (یعنی یہ مقبول نہیں ہے )تا وقتیکہ تو یہ مالِ حرام جو تیرے قبضے میں ہے اُسے ان کو لوٹادے ،جو اس کے حق دار ہیں ۔حدیث میں ہے:رسول اللہ  صلی اللہ علیہ وسلم  فرماتے ہیں :’’[[arabic: اِنَّ اللّٰہَ طَیِّبٌ لَایَقْبَلُ اِلَّا الطَّیِّبَ ]]‘‘،ترجمہ:’’ بے شک اللہ عزّ وجل پاک ہے ،پاک ہی چیز کو قبول فرماتا ہے ‘‘،(فتاویٰ رضویہ ،جلد23،ص:541)‘‘۔لیکن اگر آپ کی والدہ کی اصل کمائی حلال تھی اور وہ اتنی تھی کہ آپ تینوں کے حج کے لیے کافی تھی ، تو اس حلال کمائی سے حج کی نیت کرنی چاہیے ، محض سود کی ملاوٹ سے اصل حلال رقم حرام نہیں ہوگی ۔`
  },
  {
    pageNumber: 329,
    text: `نکاح کے مسائل`
  },
  {
    pageNumber: 331,
    text: `[[heading: نکاح کے بعد رخصتی کب ضروری ہے ]]
سوال:
	اگر نکاح ہوجائے اور رخصتی ایک یا دو سال بعد ہوتو کیا یہ شرعاً جائز ہے، (رائے ثقلین رضوی، سرگودھا)۔
جواب:
	شریعت کی رُو سے دو مردگواہوں کی موجودگی میں ایجاب وقبول سے نکاح منعقد ہوجاتا ہے اور زوجین کے ایک دوسرے پر حقوق شرعاً ثابت ہوجاتے ہیں ،اس کے بعد باوقار طورپر رخصتی کی جاسکتی ہے ،ام المومنین حضرت عائشہ صدیقہ رضی اللہ عنہا کا نکاح سات سال کی عمر میں ہوا اور رخصتی نو سال کی عمر میں ہوئی۔
	  رخصتی کے لیے شرعاً کسی مدت کا تعین نہیں ہے ،اپنی سہولت کے مطابق فریقین طے کرسکتے ہیں ،لیکن جب سہولت ہو ،جلدی کرنا بہتر ہے تاکہ زوجین اِغوائے نفس اورمکرِ شیطان سے محفوظ رہیں ،لیکن اس کے لیے شریعت میں کوئی لگابندھا ضابطہ مقررنہیں ہے۔

[[heading: دودھ پلانے والی ماں کے بیٹے یا پوتے سے نکاح نہیں ہوسکتا ]]
سوال:
	شاہد کی دادی کا کہناہے کہ اس نے شاہدکے چچاکی بیٹی فاطمہ کو 58سال کی عمر میں دودھ پلایا ،فاطمہ کی عمر ایک سال تھی اور بقول دادی کے اس وقت چھاتی کا ایک حصہ خشک اور دوسرے میں سفید لیس دار پانی تھا ۔کیااس سے رضاعت ثابت ہوجاتی ہے ،شاہد کا فاطمہ سے نکاح جائز ہے یا نہیں ؟(زیب الرحمن ،کراچی )۔
جواب:
	کسی بچے یا بچی کو مدتِ رضاعت (یعنی ڈھائی سال کی عمر کے اندر) دودھ پلانے سے رضاعت کا رشتہ قائم ہوجاتاہے اور جو رشتے نسب سے حرام ہیں ،رضاعت کے سبب`
  },
  {
    pageNumber: 332,
    text: `بھی حرام ہوجاتے ہیں،حدیث پاک میں ہے :
’’[[arabic: عَنْ عَائِشَۃَ قَالَتْ:قَالَ لِی رَسُوْلُ اللّٰہِ ﷺ: یَحْرُمُ مِنَ الرَّضَاعَۃِ مَا یَحْرُمُ مِنَ الْوِلَادَۃِ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں : رسول اللہ  صلی اللہ علیہ وسلم نے مجھ سے فرمایا : رضاعت سے وہ تمام رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہوتے ہیں،( صحیح مسلم : 3505 )‘‘ ۔ 
	آپ کے بقول دادی کا کہنا ہے کہ’’ اس وقت چھاتی کا ایک حصہ خشک اور دوسرے میں سفید لیس دار پانی تھا‘‘،تو اگر اس حصے سے دودھ پیاتو رضاعت ثابت ہو جائے گی ، تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَشَرْعًامَصٌّ مِنْ ثَدْیِ اٰدَمِیَّۃٍ وَلَوْ بِکْرًا أَوْ مَیِّتَۃً أَوْ اٰیِسَۃً]]‘‘۔
ترجمہ:’’ اور شرعاً (حکم یہ ہے کہ) کنواری یا مردہ عورت یا بوڑھی عورت کا دودھ پیا تو رضاعت ثابت ہوجائے گی ‘‘۔آگے چل کے مزید لکھتے ہیں:’’[[arabic: وَلَبَنُ بِکْرٍ بِنْتِ تِسْعِ سِنِیْنَ فَاَکْثَرَمُحَرِّمٌ]]‘‘۔ترجمہ:’’نو سال عمر والی کنواری یا زیادہ عمر والی عورت کا دودھ پیا ، حُرمت رضاعت ثابت ہوجائے گی ،(جلد9،ص:31،دمشق)‘‘۔
	دودھ پینے والی لڑکی کا نکاح دودھ پلانے والی عورت کے بیٹوں ،پوتوں سے نہیں ہوسکتا کہ یہ اس کے بیٹوں کی رضاعی بہن اور پوتوں کی رضاعی پھوپھی ہے ۔
تنویر الابصار مع الدرالمختار میں ہے : 
’’[[arabic: وَلَاحِلَّ بَیْنَ الرَّضِیْعَۃِ وَوَلَدِ مُرْضِعَتِہَاأَیْ الَّتِی أَرْضَعَتْہَاوَوَلَدِ وَلَدِہَالِاَنَّہٗ وَلَدُ الْاَخِ]]‘‘۔
ترجمہ:’’دودھ پینے والی لڑکی کا نکاح دودھ پلانے والی ماں کے بیٹے سے جائز نہیں ہے (کیونکہ وہ اس کا رضاعی بھائی ہے) اور اسی طرح اس کے پوتے سے بھی جائز نہیں ہے ، کیونکہ وہ اس کا رضاعی بھتیجا ہے ،(جلد9،ص:58-59، دمشق ) ‘‘۔یعنی دودھ پلانے والی عورت کا بیٹا اس دودھ پینے والی لڑکی کا رضاعی بھائی اور اُس رضاعی بھائی کا بیٹا اس کا`
  },
  {
    pageNumber: 333,
    text: `رضاعی بھتیجا ہے اوررضاعت کے رشتے سے دونوں اس پرحرام ہیں ۔
	 آپ نے لکھا ہے: ’’دادی کے اس وقت چھاتی کا ایک حصہ خشک اور دوسرے میں سفید لیس دار پانی تھا ‘‘،حُرمتِ رضاعت اُس دودھ سے ثابت ہوتی ہے ،جس میں بچے کے نشونما کی صلاحیت موجود ہے، یہاں بظاہر ایسانہیں ہے ،لہٰذا واضح شواہد کے بغیر حُرمت کا فتویٰ نہیں دیا جاسکتا، علامہ کمال الدین ابن ہمامرحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: قَوْلُہٗ :وَإِذَا نَزَلَ لِلرَّجُلِ لَبَنٌ فَاَرْضَعَ بِہٖ صَبِیَّۃً لَمْ یَتَعَلَّقْ بِہٖ تَحْرِیمٌ،لِاَنَّہٗ لَیْسَ بِلَبَنٍ عَلَی التَّحْقِیْقِ فَلَا یَتَعَلَّقُ بِہِ النُّشُوْ ءُ وَالنُّمُوُّ،وَہٰذَالِاَنَّ اللَّبَنَ إنَّمَا یُتَصَوَّرُ مِمَّنْ یُتَصَوَّرُ مِنْہُ الْوِلَادَۃُ،وَقَدْ یُذْکَرُ فِی بَعْضِ الْحِکَایَاتِ أَنَّہُ اتَّفَقَ لِرَجُلٍ إرْضَاعُ صَغِیْرٍ،فَإِنْ صَحَّ فَہُوَمِنْ خَوَارِقِ الْعَادَاتِ لَا یُبْنَی الْفِقْہُ بِاعْتِبَارِہٖ،وَعَلٰی ہٰذَا یَلْزَمُ أَنَّہٗ لَوْ نَزَلَ لِبِکْرٍلَمْ تَبْلُغْ سِنَّ الْبُلُوغِ لَبَنٌ لَایَتَعَلَّقُ بِہِ التَّحْرِیْمُ،وَیُحْکَمُ بِاَنَّہٗ لَیْسَ لَبَنًا،کَمَا لَوْ نَزَلَ لِلْبِکْرِ مَاءٌ أَصْفَرُ لَا یَثْبُتُ مِنْ إرْضَاعِہٖ تَحْرِیمٌ.وَالْوَجْہُ الْفَرْقُ بِعَدَمِ التَّصَوُّرِ مُطْلَقًا،فَإِذَا تَحَقَّقَ لَبَنًا تَثْبُتُ الْحُرْمَۃُ،بِخِلَافِ الرَّجُلِ،لِاَنَّ الْحُکْمَ لَازِمٌ دَائِمًا بِاَنَّہُ لَیْسَ بِلَبَنٍ]]‘‘۔
ترجمہ:’’ اگر (خارق عادت کے طورپر) مرد کا دودھ نکل آئے اور وہ بچے کو دودھ پلادے ، تو اس سے حُرمت ثابت نہیں ہوگی ، کیونکہ تحقیق یہ ہے کہ یہ دودھ نہیں ہے،اس لیے اس کے ساتھ بچے کی نشونما متعلق نہیں ہے ،کیونکہ دودھ اس سے متصور ہوتاہے،جس سے بچے کی پیدائش متصور ہو ،بعض حکایات میں ہے: ایسااتفاق ہواہے کہ ایک مرد نے چھوٹے بچے کو دوھ پلایا، اگر یہ درست ہے تویہ خارق عادت ہے اور اس پر قیاس کرکے کسی فقہی ضابطے کی بنیاد نہیں رکھی جاسکتی ،اس پر لازم آئے گا کہ اگر کسی نابالغہ کنواری لڑکی کا دودھ اتر آیا ،تویہ ایسا دودھ ہے ،جس کے ساتھ حُرمت رضاعت متعلق نہیں ہے اورحکم یہی لگایاجائے گا کہ یہ دودھ نہیں ہے ،جیسے کسی کنواری لڑکی کے ہاں زرد رنگ کا مائع اتر آیا (اورکسی بچے کو پلادیا) تو اس کے ساتھ حُرمتِ رضاعت متعلق نہیں ہوگی اور فرق کا سبب یہ ہے کہ جہاں مطلقاً دودھ متصور ہی نہ ہو (اس پر حُرمت رضاعت کا حکم عائد نہیں ہوگا) ،پس جب دودھ ہونا ثابت`
  },
  {
    pageNumber: 334,
    text: `ہوجائے تو حُرمت رضاعت بھی ثابت ہوجائے گی ، مردکا مسئلہ اس کے برعکس ہے،کیونکہ اس سے حُرمت رضاعت ثابت نہ ہونے کا حکم دائمی طورپر لازم ہے ،کیونکہ وہ دودھ ہے ہی نہیں ، (فتح القدیر ،جلد3،ص:436)‘‘۔خلاصۂ کلام یہ ہے کہ مذکورہ مسئلے میں جب تک واضح شواہد نہ ہوں ، حُرمت کا فتویٰ نہیں دیا جاسکتا، لہٰذا شاہد کا فاطمہ کے ساتھ نکاح جائز ہے۔

[[heading: رضاعت کی مدت دو یا ڈھائی سال ]]
سوال:
	 آپ نے تفہیم المسائل ،جلد پنجم ،ص:363اور جلد ہشتم ،ص:248 پر لکھا ہے  : ’’ جس بچی یا بچے نے کسی عورت کا دودھ مدتِ رضاعت (یعنی ڈھائی سال کی عمر تک ) پیاہے ،اس پر رضاعی ماں باپ کی ساری اولاد خواہ وہ دودھ پلانے سے پہلے کی ہو یا بعد کی ، اسی طرح اس رضاعی ماں کی کسی دوسرے شوہر سے اولاد ، سب اس دودھ پینے والے کے لیے رضاعی بہن بھائی ہوگئے ‘‘، کیا دودھ پلانے کی مدت ڈھائی سال ہے ، حالانکہ قرآن کریم دودھ چھڑانے کی مدت دوسال بتائی گئی ہے ، (علامہ مولانا عبداللہ ،گوجرانوالہ)۔
جواب:
	آپ کا فرمان بجا ہے کہ بچے کو دودھ پلانے کی مدت دو سال ہے، اس سے زیادہ مدت کے لیے دودھ پلانے کی اجازت نہیں ہے ،البتہ حُرمتِ  رضاعت کے ثبوت کے لیے ڈھائی سال کی مدت مقرر ہے ، دُرّمختار میں ہے :
’’[[arabic: فِی وَقْتٍ مَخْصُوْصٍ ہُوَحَوْلَانِ وَنِصْفٌ عِنْدَہٗ وَحَوْلَانِ فَقَطْ عِنْدَہُمَا وَہُوَالْاَصَحُّ فَتْحٌ وَبِہٖ یُفْتٰی کَمَا فِی تَصْحِیْحِ الْقُدُوْرِیِّ عَنِ الْعَوْنِ،لٰکِنْ فِی الْجَوْہَرَۃِ أَنَّہٗ فِی الْحَوْلَیْنِ وَنِصْفٍ، وَلَوْ بَعْدَ الْفِطَامِ مُحَرَّمٌ وَعَلَیْہِ الْفَتْویٰ]]‘‘۔
ترجمہ:’’(حُرمتِ رضاعت کا رشتہ) ایک مخصوص مدت تک قائم ہوتاہے ، امامِ اعظم رحمۃ اللہ علیہ کے نزدیک اس کی مدت ڈھائی سال ہے او رصاحبین کے نزدیک دو سال ہے ، یہی صحیح ترین قول ہے( بحوالہ : فتح القدیر) اور اسی پر فتویٰ دیاجاتاہے ،جس طرح ’’تصحیح القدوری‘‘ میں`
  },
  {
    pageNumber: 335,
    text: `’’عون‘‘ سے مروی ہے ،لیکن ’’اَلْجَوہَرَۃُ النَّیِّرَہ‘‘ میں ہے : یہ (مدت) پورے ڈھائی سال ہے ،اگر دودھ چھڑانے کے بعدبھی کسی بچے نے عورت کا دودھ پیاہو ،تو اس سے حرمت رضاعت ثابت ہوجائے گی اور فتویٰ اسی پر ہے،(حاشیہ ابن عابدین شامی ، جلد9،ص:32-33 ، دمشق)‘‘۔
علامہ بدرالدین عینی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: فَثَبَتَ أَنَّ بَعْدَ الْحَوْلَیْنِ رَضَاعٌ، فَلَا یُمْکِنُ قَطْعُ الْوَلَدِ عَنِ اللَّبَنِ دَفْعَۃً وَاحِدَۃً،فَلَا بُدَّ مِنْ زِیَادَۃِ مُدَّۃٍ یَعْتَادُ فِیْہَا الصَّبِیُّ مَعَ اللَّبنِ الْفِطَامِ،فَیَکُوْنُ غِذَاؤُہٗ اللَّبَنُ تَارَۃً وَالطَّعَامُ أُخْریٰ إِلٰی أَنْ یَّنْسَی اللَّبَنَ،وَأَقَلُّ مُدَّۃٍ تَنْتَقِلُ بِالْعَادَۃِ سِتَّۃٌ أَشْہُرٍ اعْتِبَارًا بِمُدَّۃِ الْحَبَلِ ]]‘‘۔
ترجمہ:’’ پس ثابت ہواکہ دودھ پلانے کی مدت مکمل دوسال کے بعد تک ہے کیونکہ بچے سے ایک دم دودھ چھڑانا ممکن نہیں ہوتا ،اس لیے ضروری ہے کہ حُرمتِ رضاعت کی مدت دوسال سے بڑھائی جائے گی جس میں بچہ عادتاً دودھ چھوڑنے کے عمل سے گزرتاہے ،سوکبھی اس کی غذا دودھ ہوتاہے اورکبھی دوسری چیزیں ،یہاں تک کہ وہ دودھ کو بھول جا ئے اور کم سے کم مدت جس میں بچہ پوری طرح دودھ سے دوسری غذا کی طرف منتقل ہوجاتاہے ، چھ ماہ ہے ، اس کو کم سے کم مدتِ حمل پر قیاس کریں گے (جو چھ ماہ ہے)،(عمدۃ القاری ، جلد20، ص:135)‘‘۔
صدرالشریعہ علامہ امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں:
 ’’مسئلہ :بچہ کو دو برس تک دودھ پلایا جائے، اس سے زیادہ کی اجازت نہیں۔ دودھ پینے والا لڑکا ہو یا لڑکی اور یہ جو بعض عوام میں مشہور ہے کہ لڑکی کو دو برس تک اور لڑکے کو ڈھائی برس تک پلا سکتے ہیں یہ صحیح نہیں۔ یہ حکم دودھ پلانے کا ہے اور نکاح حرام ہونے کے لیے ڈھائی برس کا زمانہ ہے، یعنی دو برس کے بعد اگرچہ دودھ پلانا حرام ہے مگر ڈھائی برس کے اندر اگر دودھ پلا دے گی، حرمت نکاح ثابت ہو جائے گی اور اس کے بعد اگر پیا، تو حرمت نکاح`
  },
  {
    pageNumber: 336,
    text: `نہیں، اگرچہ پلانا جائز نہیں،(بہارِ شریعت ،جلددوم،حصہ ہفتم،ص:36)‘‘۔لہٰذا ان دونوں مقامات پر ایک طرح سے اجمال رہ گیاہے، جس پر آپ کو اشکال پیداہو ا۔اِس اجمال کی تفصیل اور وضاحت یہ ہے کہ مدتِ رضاعت بلاشبہ دوسال ہے جو اللہ تعالیٰ نے قرآن کریم میں بیان فرمائی ہے:’’[[arabic: وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ ۖ لِمَنْ أَرَادَ أَنْ يُتِمَّ الرَّضَاعَةَ]]‘‘۔
ترجمہ:’’مائیں اپنے بچوں کو پورے دوسال دودھ پلائیں ،یہ (حکم )اس کے لیے ہے جو دودھ پلانے کی مدت پوری کرنا چاہے ، (البقرہ:233)‘‘ ۔(۲)’’[[arabic: وَفِصَالُہٗ فِیْ عَامَیْنِ ]]‘‘، ترجمہ:’’ اور اس کا دودھ چھڑانا دوبرس میں ہے ،(لقمان:14)‘‘۔لیکن چونکہ یہ حلال وحرام کا مسئلہ ہے، اس لیے فقہائے کرام نے بربنائے احتیاط حُرمتِ رضاعت کے ثبوت کے لیے ڈھائی سال کی مدت مقرر کی ہے ،کیونکہ جو بچے صرف ماں کے دودھ سے پرورش پاتے ہیں ،ان کا یک دم دودھ چھڑانا مشکل ہوتاہے ، بچہ دودھ پینے کی ضد کرتاہے ،یہاں تک کہ بعض عورتیں بچے کا دودھ چھڑانے کے لیے اپنے پستان پر ایلوا یا مرچ یاکوئی کڑوی چیز لگاتی ہیں کہ بچے دودھ سے مُتنفر ہوجائے ، یہاں تک کہ جو بچے بوتل سے نپل کے ذریعے مصنوعی دودھ پیتے ہیں ،وہ بھی یک دم دودھ نہیں چھوڑ پاتے ۔ 

[[heading: نافرمان ہوکر گھر سے چلی جانے والی بیوی کا نفقہ شوہر پر لازم نہیں ہے ]]
سوال:
	 اگر بیوی بغیر کسی وجہ کے اور بغیر پوچھے گھر سے چلی جائے تو کیا طلاق دینا جائز ہے؟،(شاہد خان ماہی، شاہ کوٹ، پنجاب)۔
جواب:	
	اسلامی تعلیمات کا منشا اور مزاج تو یہ ہے کہ شوہر وبیوی کے مابین ’’رشتۂ نکاح‘‘ تاحیات قائم رہے ،مگر بعض ناگزیرحالات میں طلاق اور خلع کا راستہ بھی رکھا ہے تاکہ طبائع کے اختلاف کی وجہ سے زندگی ایک دوسرے کے لئے جہنّم نہ بن جائے ۔ قرآن مجید میں اللہ تعالیٰ نے یہ ہدایت فرمائی ہے کہ اگر زوجین کے درمیان اختلافات زیادہ بڑھ`
  },
  {
    pageNumber: 337,
    text: `جائیں تو دونوں کے خاندانوں سے ایک ایک بزرگ یا زیرک و دانا اور اصلاح پسند نمائندہ چن کران دونوں کو ثالث مقرر کیا جائے تاکہ وہ زوجین کے درمیان اختلاف کو رفع کرسکیں،ارشاد باری تعالیٰ ہے :
’’[[arabic: وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ وَحَكَمًا مِنْ أَهْلِهَا إِنْ يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا]]‘‘۔
ترجمہ:’’اور اگر تمہیں ان دونوں (میاں بیوی) کے درمیان اختلاف کا اندیشہ ہو تو ایک حَکَم شوہر کے خاندان سے اور ایک حَکَم (ثالث) بیوی کے خاندان سے مقرر کرو،اگر وہ دونوں اصلاح کا ارادہ کرلیں تو اللہ تعالیٰ ان دونوں کے درمیان موافقت (کی صورت ) مقدر فرمالے گا، بے شک اللہ خوب جاننے والا خبر رکھنے والا ہے،(النساء:35)‘‘۔
	طلاق اگرچہ ناگزیر صورت حال میں ایک مشروع ومباح امر ہے ،لیکن یہ تمام مباح امور میں اللہ تعالیٰ کو سب سے زیادہ نا پسند ہے ، رسول اللہ  صلی اللہ علیہ وسلم کا ارشاد ہے: 
(۱)’’[[arabic: عَنِ ابْنِ عُمَرَ ، عَنِ النَّبِیِّ ﷺقَالَ: اَبْغَضُ الْحَلَالِ اِلَی اللّٰہِ عَزَّوَجَلَّ الطَّلَاقُ]]‘‘۔
ترجمہ:’’حضرت ابن عمر رضی اللہ عنہما سے روایت ہے : رسول اللہ  صلی اللہ علیہ وسلم نے فرمایا: ’’(تمام) حلال امور میں جو امر اللہ تعالیٰ کی سب سے زیادہ ناراضی کا باعث ہے،وہ طلاق ہے،(سنن ابو داؤد: 2171)‘‘۔ 
(۲)	’’[[arabic: عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ :قَالَ لِیْ رَسُوْلُ اللّٰہِ ﷺ:وَلَا خَلَقَ اللّٰہُ شَیْئًا عَلیٰ وَجْہِ الْاَرْضِ اَبْغَضَ اِلَیْہِ مِنَ الطَّلاَقِ]]‘‘۔
ترجمہ :’’حضرت معاذ بن جبلرضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا :روئے زمین پر اللہ تعالیٰ نے کوئی ایسی چیز پیدا نہیںفرمائی جو اس کے نزدیک طلاق سے زیادہ ناپسندیدہ ہو، (رواہ الدارقطنی:3939)‘‘۔
(۳)’’[[arabic: عَنْ ثَوْبَانَ اَنَّ رَسُوْلَ اللّٰہِ ﷺقَالَ :اَیُّمَاامْرَأَۃٍ سَاَلَتْ زَوْجَھَا طَلَاقًا مِنْ غَیْرِبَاْسٍ فَحَرَامٌ عَلَیْھَا رَائِحَۃُ الْجَنَّۃِ]]‘‘۔`
  },
  {
    pageNumber: 338,
    text: `ترجمہ:’’حضرت ثوبان رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ  صلی اللہ علیہ وسلم نے فرمایا :جو عورت کسی ناگزیر مجبوری (اور ناقابل برداشت صورت حال )کے بغیر اپنے شوہر سے طلاق کا مطالبہ کرے، اس پر جنت کی خوشبو حرام ہے،(یہ الفاظ ترمذی شریف کے ہیں)، (سُنن ترمذی: 1187،سُنن ابوداؤد: 2221،سُنن ابن ماجہ : 2134)‘‘۔تاہم اگر طلاق دینے کے سوا کوئی چارۂ کار نہ رہے تو بہتر یہ ہے کہ اُس طُہر میں، جس میں بیوی سے قربت نہ کی ہو ،اُسے ایک طلاق دیں، عدت کے دوران شوہر کو یک طرفہ طورپر رجوع کا حق حاصل ہے،اگر اُس نے رجوع نہ کیاتو عدت گزرنے کے بعدیہ ایک طلاقِ بائن ہوجائے گی اور نکاح ختم ہوجائے گامہر اگرادانہیں کیا تولازم ہوجائے گااور عدت گزرنے کے بعدعورت اپنی مرضی سے کسی بھی شخص کے ساتھ نکاح کے لیے آزادہوگی جبکہ کوئی مانعِ شرعی نہ ہواور باہمی رضامندی سے پہلے طلاق دہندہ شوہر کے ساتھ نیامہر مقرر کرکے نکاح کرسکتی ہے ،لیکن اُس شوہر کے پاس آئندہ صرف دوطلاقوں کا حق رہے گا،یہ پہلی طلا ق خدانخواستہ آئندہ دی جانے والی طلاق کے ساتھ جمع ہونے کے لیے مؤثر رہے گی ۔
	اگر عورت مرد کی طرف سے کسی ایذا رسانی کے بغیر مرد کے ساتھ رہنے پر راضی نہ ہو اورشوہر کے حقوق کا خیال نہ رکھے توایسی عورت قرآن کریم اور فقہِ اسلامی کی اصطلاح میں ’’ناشزہ‘‘ یعنی نافرمان(Disobedient) کہلاتی ہے اور ایسی عورت کا نان نفقہ ، رہائش ،علاج معالجہ وغیرہ شوہر کے ذمے لازم نہیںہے ،جب تک کہ وہ اپنے شوہر کے ساتھ رہنے پر آمادہ نہ ہوجائے ،علامہ نظام الدین لکھتے ہیں :’’[[arabic: وَاِنْ نَشَزَتْ فَلَا نَفقَۃَ لَھَا حَتّٰی تَعُوْدَ اِلٰی مَنْزِلِہٖ ]]‘‘،ترجمہ:’’ اگر عورت نافرمان ہوکر شوہر کے گھر سے نکل جائے تو جب تک وہ واپس (شوہر کے )گھر لوٹ کر نہ آجائے ،اس کا نان نفقہ شوہر کے ذمے نہیں، (فتاویٰ عالمگیری،جلد1،ص: 545 )‘‘۔`
  },
  {
    pageNumber: 339,
    text: `[[heading: بہو سے زنا]]
سوال:		
	ایک شخص محمد خان نے اپنی بہو سے زبردستی زنا کیا ،لڑکی اپنی بہنوں کے گھر چلی گئی ، محمد خان کی بیوی قرآن کی قسم دے کر واپس لے آئی ،سسرمحمد خان نے دوبارہ یہی حرکت کی ، جرگہ بیٹھا ،جرگے نے فیصلہ پیرصاحب میاں اعظم خان کے حوالے کیا ،پیرصاحب نے لڑکی کو مجرم سے چھ لاکھ روپے دلوائے، تھانہ پولیس سے آزادکرادیا اورفریقین میں صلح کرادی۔سوال یہ ہے :
۱۔کیا سسر کا بہو سے زناکرنے کے بعد بیٹے کے ساتھ نکاح برقراررہے گا ۔
۲۔کیا پیرصاحب کا یہ فیصلہ شریعت کی رُو سے درست ہے۔
۳۔سسر محمد خان کی شرعی سزا کیاہے ،برادری واہلِ محلہ اس سے تعلق رکھیں یا نہیں ؟،(محمد اسلم خان نیازی ،لیاری کراچی )۔
جواب:
	وہ عورتیں ،جن سے نکاح حرام ہے، ان کو 9قسم پرمنقسم کیا جاتاہے،جس میں ایک قسم حرمتِ مصاہرت ہے،جومردوعورت ایک دوسرے کو شہوت سے چھوئیں یا ایک دوسرے کی شرمگاہ کودیکھیں،تواُس عورت کے اصول وفروع مرد پرحرام ہوجائیں گے اورمردکے اصول وفروع عورت پر حرام ہوجائیں گے،اس کو حرمتِ مصاہرۃ کہتے ہیں۔اس کے بارے میں علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَکَمَاتَثْبُتُ ہٰذِہِ الْحُرمَۃُ بِالْوَطْئِ تَثْبُتُ بِالْمَسِّ وَالتَّقْبِیْلِ وَالنَّظَرِاِلَی الْفَرجِ بِشَھْوَۃٍ کَذَافِی الذَّخِیْرَہِ ]]‘‘۔
ترجمہ:’’حرمت مصاہرت ، جس طرح وطی(مباشرت) سے ثابت ہوتی ہے، اسی طرح شہوت کے ساتھ چھونے، بوسہ لینے اور فرج(شرمگاہ) کی طرف نظرکرنے سے بھی ثابت ہوتی ہے،جیساکہ ’’ذخیرہ‘‘ میںہے،(فتاویٰ عالمگیری،جلد1ص: 274 275,)‘‘۔`
  },
  {
    pageNumber: 340,
    text: `	سسر کے زنا کرنے کے بعد عورت اور اس کے شوہر کے درمیان حرمت مصاہرت کا تعلق قائم ہوچکا ہے ، اس لیے دونوں کوفوراً علیحدگی اختیار کرلینی چاہیے۔ایسی صورت میں نکاح کے ازالے کے لیے جوالفاظ کہے جائیں وہ طلاق نہیں بلکہ ’’مُتارکہ‘‘ کہلاتے ہیں ، شوہریوں کہے:’’ میں نے تجھے نکاح سے آزادکیا  یا میں نے تجھے چھوڑ دیا ‘‘ ۔ 
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَبِحُرْمَۃِ الْمُصَاہَرَۃِ لَا یَرْتَفِعُ النِّکَاحُ حَتّٰی لَا یَحِلَّ لَہَا التَّزَوُّجُ بِاٰخَرَ إلَّا بَعْدَ الْمُتَارَکَۃِ وَانْقِضَاء ِ الْعِدَّۃِ وَالْوَطْءُ بِہَا لَا یَکُوْنُ زِنًا]]‘‘۔
ترجمہ:’’حُرمتِ مصاہرت سے نکاح( ازخود)ختم نہیں ہوتا ،لہٰذا (عورت) کسی دوسرے شخص سے نکاح نہیں کرسکتی ،جب تک شوہر متارکہ نہ کرے اور عدت نہ گزر جائے ، اس دوران اگر(لاعلمی کی بناپر) شوہر نے مباشرت کی ہے، تووہ زنا نہیں ہوگایعنی اسے زناکی حد نہیں لگے گی ،(جلد8،ص:124، دمشق)‘‘۔
	اگر شرعی معیار (یعنی چار عینی گواہوں یا مجرم کے اقرار)سے مُجاز عدالت کے سامنے جرم ثابت ہوجائے تو شریعت کی رُو سے یہ جرم ’’موجبِ حد‘‘ ہے اور اس پر حَدِّ شرعی نافذ کرنے کا اختیار حاکمِ وقت یا مُجاز عدالت کے پاس ہے ۔فقہاء اربعہ کااس پر اتفاق ہے کہ اگر زانی محصن(شادی شدہ)ہوتو اس کو رجم کیا جائے گا خواہ مردہو یا عورت اور اگر وہ غیر مُحصِن ہے تو اس کو کوڑے مارے جائیں گے ۔چونکہ یہ شخص (مُسَمّٰی محمد خان )عاقل وبالغ اورشادی شدہ ہے،اس لیے اس کی سزا رجم ہے، جورسول اللہ صلی اللہ علیہ وسلم کے اپنے عمل مبارک اور احادیث مبارکہ سے ثابت ہے، جو حدِ شہرت کو پہنچی ہوئی ہیں۔ قانون یہ بھی دیکھتاہے کہ جرم کس عدالت کے دائرۂ اختیار میں سرزَد ہواہے ،حدود قائم کرنا حاکمِ اسلام یااُس کے مقررہ و مُجازقاضی کا کام ہے۔ لوگوں یا کسی برادری یا قبیلے یا جرگے کو قانون ہاتھ میں لینے کا اختیار نہیں ہے ۔ جرگے نے جرمانہ چھ لاکھ روپے کیا ہو یا چھ کروڑ روپے ، اس سے حرام حلال نہیں ہوتا اورنہ ہی اس سے فعلِ حرام کی حُرمت مرتفع ہوتی ہے۔`
  },
  {
    pageNumber: 341,
    text: `حدیث پاک میں ہے :
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَوَزَیْدِ بْنِ خَالِدٍ الْجُہَنِیِّ رَضِیَ اللّٰہُ عَنْہُمَا،قَالاَ:جَاءَ أَعْرَابِیٌّ، فَقَالَ: یَارَسُولَ اللّٰہِ!اِقْضِ بَیْنَنَابِکِتَابِ اللّٰہِ، فَقَامَ خَصْمُہٗ فَقَالَ:صَدَقَ،اِقْضِ بَیْنَنَا بِکِتَابِ اللّٰہِ،فَقَالَ الْاَعْرَابِیُّ:إِنَّ ابْنِی کَانَ عَسِیْفًا عَلٰی ہٰذَا،فَزَنٰی بِامْرَأَتِہٖ،فَقَالُوا لِیْ:عَلَی ابْنِکَ الرَّجْمُ، فَفَدَیْتُ ابْنِی مِنْہُ بِمِائَۃٍ مِنَ الْغَنَمِ وَوَلِیْدَۃٍ،ثُمَّ سَاَلْتُ أَہْلَ الْعِلْمِ،فَقَالُوْا: إِنَّمَا عَلَی ابْنِکَ جَلْدُ مِائَۃٍ،وَتَغْرِیْبُ عَامٍ،فَقَالَ النَّبِیُّ ﷺ:لَاَقْضِیَنَّ بَیْنَکُمَا بِکِتَابِ اللّٰہِ،أَمَّا الوَلِیْدَۃُ وَالْغَنَمُ فَرَدٌّ عَلَیْکَ،وَعَلَی ابْنِکَ جَلْدُ مِائَۃٍ وَتَغْرِیْبُ عَامٍ،وَأَمَّا أَنْتَ یَا أُنَیْسُ لِرَجُلٍ فَاغْدُ عَلَی امْرَأَۃِ ہٰذَا،فَارْجُمْہَا،فَغَدَا عَلَیْہَا أُنَیْسٌ فَرَجَمَہَا]]‘‘۔
ترجمہ:’’حضرت ابوہریرہ اور حضرت زید بن خالد الجُہنی رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک دیہاتی نے آکر کہا: یا رسول اللہ ! ہمارے درمیان کتاب اللہ سے فیصلہ کیجیے ،اس کا فریق مخالف کھڑاہوا ،اُس نے کہا: اس نے سچ کہاہے ،ہمارے درمیان کتاب اللہ سے فیصلہ کیجیے ، دیہاتی نے کہا: میرا بیٹا اس کے یہاں مزدور تھا ، اُس نے اِس کی بیوی سے زنا کیا ،پس لوگوں نے مجھ سے کہاکہ تمہارے بیٹے کو رجم کیاجائے گا تو میں نے سو بکریوں اور ایک باندی کو اپنے بیٹے کے فدیہ میں دیا ،پھر میں نے اہل علم سے سوال کیا تو انہوں نے کہاکہ تمہارے بیٹے کو سو کوڑے مارے جائیں گے اور ایک سال کے لیے شہر بدرکیاجائے گا ،تب نبی صلی اللہ علیہ وسلم نے فرمایا: میں تم دونوں کے درمیان کتاب اللہ کے مطابق فیصلہ کروں گا ،رہی باندی اوربکریاں تووہ تمہیں واپس دی جائیں گی اور تمہارے بیٹے کو سو کوڑے مارے جائیں گے اورایک سال کے لیے شہر بدر کیاجائے گا اور آپ صلی اللہ علیہ وسلم نے ایک مرد سے فرمایا: اورتم اے اُنیس ! صبح اس شخص کی بیوی کے پاس جاؤ اور(زنا کا اعتراف کرنے کی صورت میں ) اس کو سنگسار کردو(جیساکہ صحیح بخاری کی دوسری روایت میں ہے)، پھر صبح کو حضرت اُنیس نے اس عورت کو رجم کردیا ،(صحیح البخاری:2696)‘‘۔
	اِس حدیثِ مبارک کی رُو سے جرمانہ واپس کردینا چاہیے ، اس طرح تو مالدار لوگوں`
  },
  {
    pageNumber: 342,
    text: `کے لیے بدکاری کا راستہ کھل جائے گا کہ بدکاری کریں اور پھر پیسے دے کر اپنی جان چھڑالیں ، اللہ تعالیٰ کی حدود کو پیسے کے عوض مُعطّل کرنے کا حق کسی کو نہیں ہے ۔ پیرصاحب کا عمل بھی خلافِ شرع ہے،پیر صاحب کی اولین شرعی ذمے داری یہ تھی کہ جس خاتون سے اس کے سسرنے بدکاری کی ہے ، اس کے اور اس کے شوہر کے درمیان فوراً علیحدگی کراتے ، کیونکہ اب وہ عورت اپنے شوہر پر حرام ہوچکی ہے ۔اسی لیے توہم کہتے ہیں کہ پیرِ طریقت بننے کا حق دار وہی ہے ، جوعالمِ شریعت اورعاملِ شریعت ہو۔  
	اگر محمد خان کے جرم کی محلے یا برادری یا قبیلے میں تشہیر نہ ہوئی ہوتی تو اس پر پردہ ڈالنا بہترتھا ،ایک حدیث ِ مبارک میں ہے : ایک شخص رجم کے دوران تکلیف کی تاب نہ لاکر بھاگا ،تو ایک شخص نے اسے گدھے کی ہڈی سے مارا اور وہ گرکر مرگیا ،پھر وہ نبی صلی اللہ علیہ وسلم کے پاس آیا اور یہ ماجرا بیان کیا ،تو آپ صلی اللہ علیہ وسلم نے فرمایا : تم نے اسے چھوڑ کیوں نہ دیا ، شاید وہ توبہ کرتا اور اللہ تعالیٰ اس کی توبہ قبول فرمالیتا ،پھر فرمایا: اے ہَزَّال!اگرتم نے اس کی پردہ پوشی کی ہوتی، تویہ تمہارے لیے بہتر ہوتا ،(مسند احمد :21892)‘‘۔لیکن اس جرم کی چونکہ تشہیر ہوچکی ہے ،لہٰذا جب تک محمد خان کے بیٹے اوراس کی مذکورہ بیوی کے مابین علیحدگی نہ ہو اورمحمد خان صدقِ دل سے اس کبیرہ گناہ پر شرمندہ ہوکر توبہ نہ کریں ، اُس وقت تک اُن سے میل جول اور معاشرتی روابط رکھنا درست نہیں ہے۔
نوٹ: ہم برتقدیرِ صدقِ سائل (یعنی اس تقدیر پر کہ سائل کابیان درست ہے ) حکمِ شرع بیان کرتے ہیں، ہمارا فتویٰ قضا نہیں ہوتا ،ایسے الزامات کو شواہد کی روشنی میں رَد یا قبول کرنا اور حدّ شرعی نافذکرناعدالت اورحکومت کی طرف سے مقررہ مُجاز قاضی کا کام ہے۔

[[heading: خُسر محرم ہے ]]
سوال:
	شوہر کے زندہ ہوتے ہوئے خُسربہوکے لیے محرم ہے یا نہیں اور شوہر کے مرنے کے بعد خسر بہوکے لیے محرم ہوگایا نہیںاوربہو اس کے ساتھ حج یا عمرے یاکسی بھی سفر پر جاسکتی`
  },
  {
    pageNumber: 343,
    text: `ہے ؟،(عامر لاکھانی، کراچی )۔
جواب:
	مَحرم سے مراد کسی عورت کا وہ مرد رشتے دارہے،جس کے ساتھ شریعت کی رُوسے ہمیشہ کے لیے نکاح حرام ہے ،اس کے تین اسباب ہیں : (۱)وہ رشتے جو نسب کے سبب قائم ہوتے ہیں ،جیسے باپ، دادا،نانا، چچا، ماموں، بھائی، بھتیجا(بھائی کا بیٹا)، بھانجا(بہن کا بیٹا)، بیٹا، پوتا، نواسا وغیرہ۔(۲) رضاعت (اپنی ماں کے سوا کسی غیر عورت کامدتِ رضاعت میں دودھ پینے ) کے سبب قائم ہونے والے رشتے ،جیسے رضاعت کے رشتے سے باپ ،د ادا، نانا، بھائی، بھتیجا، بھانجا، چچا، ماموں، بیٹا، پوتا، نواسا، (۳) رشتۂ مصاہرت،اسے اردو میںسسرالی رشتہ اور انگریزی میںIn-Law کہتے ہیں، جیسے خُسر، ساس، داماد ، بہو وغیرہ۔بعض رشتے ایسے ہوتے ہیں کہ جن سے نکاح وقتی طور پر تو حرام ہوتا ہے لیکن ہمیشہ ہمیشہ کے لیے حرام نہیں ہوتا ،جیسے بہنوئی کہ جب تک ایک بہن اس کے نکاح میں ہے ، دوسری بہن کااُس کے ساتھ نکاح حرام ہے،لیکن اگر پہلی بہن کو طلاق دیدی یا وہ قضائے الٰہی سے فوت ہوگئی تو عدتِ طلاق یا عدتِ وفات گزرنے کے بعد دوسری بہن کا اس کے ساتھ نکاح جائز ہے ، اس لیے بہنوئی مَحرم نہیں ہے ،لہٰذا خواہرِ نسبتی( سالی) کا بہنوئی  کے ساتھ حج یا عمرہ یا کسی بھی سفر پر جانا جائز نہیں ہے ۔ چچازاد ، ماموں زاد، خالہ زاد، پھوپھی زادمرد رشتے دار یا شوہر کے بھائی( جیٹھ، دیور) سے پردہ واجب ہے،کیونکہ وہ مَحرم نہیں ہے۔
	پس خُسر بہو کے لیے مَحرم ہے ،کیونکہ اس کے ساتھ بہو کا نکاح ہمیشہ کے لیے حرام ہے ، خواہ شوہر زندہ ہو یا فوت ہوگیاہو ،اللہ تعالیٰ کا ارشاد ہے : ’’[[arabic: وَحَلَائِلُ أَبْنَائِكُمُ الَّذِينَ مِنْ أَصْلَابِكُمْ]]‘‘۔
ترجمہ:’’اورتمہارے نسبی بیٹوں کی بیویاں (تم پر حرام کی گئیں) ، (النسآء:23)‘‘۔
دُرّ مختار میں ہے :’’[[arabic: وَزَوْجَةَ أَصْلِهِ وَفَرْعِهِ مُطْلَقًا وَلَوْ بَعِيدًا دَخَلَ بِهَا أَوْ لَا]]‘‘،ترجمہ:’’ اور اپنی اصل(باپ دادا) اورفرع (بیٹے اور پوتے )کی زوجہ مطلقاً حرام ہیں،اگرچہ بعید`
  },
  {
    pageNumber: 344,
    text: `ہوں،خواہ اس کے ساتھ ازدواجی تعلق قائم ہوایا نہ ہواہو ، (حاشیہ ابن عابدین شامی ، جلد8،ص:104،دمشق)‘‘۔چونکہ خُسر مَحرم ہے ، اس لیے بہو اُس کے ساتھ حج یا عمرے کے سفر پر جاسکتی ہے ،تاہم بلاضرورت اور بے تکلف خَلوت میں میل جول سے احتراز کیاجائے ۔خاص طورپر جبکہ وہ عمر رسیدہ نہ ہوں ،کیونکہ آج کل کئی ناخوشگوار واقعات میڈیا میںرپورٹ ہورہے ہیں اور اگر ظنِّ غالب ہے کہ خُسر اَخلاقی گراوٹ کا حامل ہے، تو عزتِ نفس ، آبرو کے تحفظ اورکسی ناخوشگوار صورت حال میں مبتلا ہونے سے بچنے کے لیے اس کے ساتھ سفر اور خَلوت سے گریز کیاجائے ۔
علامہ علاء الدین ابو بکر بن مسعود کاسانی حنفی رحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: ثُمَّ صِفَةُ الْمَحْرَمِ أَنْ يَكُونَ مِمَّنْ لَا يَجُوزُ لَهُ نِكَاحُهَا عَلَى التَّأْبِيدِ إِمَّا بِالْقَرَابَةِ أَوِ الرَّضَاعِ أَوِ الصِّهْرِيَّةِ ، لِأَنَّ الْحُرْمَةَ الْمُؤَبَّدَةَ تُزِيلُ التُّهُمَةَ فِي الْخَلْوَةِ، وَلِهَذَا قَالُوا : إِنَّ الْمَحْرَمَ إِذَا لَمْ يَكُنْ مَأْمُونًا عَلَيْهِ لَمْ يَجُزْ لَهَا أَنْ تُسَافِرَ مَعَهُ]]‘‘۔
ترجمہ:’’مَحرم وہ شخص ہے جس سے ہمیشہ ہمیشہ کے لیے نکاح حرام ہو ،خواہ حرمتِ نکاح رشتۂ قرابت کی وجہ سے ہو یا رشتۂ رضاعت کی وجہ سے ہو یا رشتۂ   مصاہرت (سسرالی رشتہ) کی وجہ سے، کیونکہ دائمی حرمت سے خلوت میں تہمت کا اندیشہ زائل ہو جاتا ہے،اسی لیے فقہائےکرام نے کہا ہے کہ اگر مَحرم بھی قابلِ اعتماد نہ ہو(یعنی اس سے آبرومحفوظ نہ ہو)تو اس کے ساتھ بھی عورت کا سفر پر جانا جائز نہیں ہے،(بدائع الصنائع،جز ثانی ،ص: 187-188، مطبوعہ مرکز اہل سنت برکات رضا،گجرات ،ھند)‘‘۔`
  },

{
  pageNumber: 345,
  text: `[[heading: طلاق کے مسائل]]`
},

  {
    pageNumber: 347,
    text: `[[heading: طلاق کے الفاظ ]]
سوال:
	عبدالمجید ولد احمد حسین کا اپنے بھائی عبدالعزیز سے جھگڑا ہوا اور جھگڑے کے دوران عبدالمجید نے چار پانچ مرتبہ یہ کہا: ’’ مجھ پر طلاق ہے ،طلاق ہے ،طلاق ہے ،اگر میں اس حویلی میں رہاتو ‘‘۔ بقول عبدالمجید یہ بات اس نے ایک مرتبہ کہی جبکہ گواہوں کا کہناہے کہ چار پانچ مرتبہ کہی ۔عبدالمجید کا کہناہے کہ اس گھر میں نہ رہنے سے مراد مستقبل میں نہ رہنے کی تھی ،یہ واقعہ مغرب عشاء کے درمیان پیش آیا اور وہ رات عبدالمجید نے اسی گھر میں گزاری ، دوسرے دن صبح دس گیارہ بجے وہ معمولی ضرورت کا سامان لے کر گھر سے چلاگیا ، اس واقعے کے بعد عبدالمجید حویلی میں نہیں گیا ۔ معلوم یہ کرنا ہے کہ کیا طلاق واقع ہوگئی ہے یا نہیں ؟، (ڈاکٹر محمد سونا خان ، ڈیرہ اسماعیل خان )۔
جواب:
	شوہر کے الفاظ :’’ مجھ پر طلاق ہے، طلاق ہے ،طلاق ہے ‘‘،عُرف میں صریح ہیں ،اگر یہ الفاظ شوہر نے تعلیقاً نہ کہے ہوتے تو براہِ راست  بلانیت طلاق واقع ہوجاتی ۔کُتبِ فقہ میں اس کی نظیر یوں بیان کی گئی ہے،تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَمِنَ الْاَلْفَاظِ الْمُسْتَعْمَلَۃِ:الطَّلَاقُ یَلْزَمُنِیْ،وَالْحَرَامُ یَلْزَمُنِی،وَعَلَیَّ الطَّلَاقُ،وَعَلَیَّ الْحَرَامُ،فَیَقَعُ بِلَا نِیَّۃٍ لِلْعُرْفِ،فَلَوْ لَمْ یَکُنْ لَہُ امْرَأَۃٌ یَکُونُ یَمِیْنًا فَیُکَفَّرُ بِالْحِنْثِ تَصْحِیحُ  الْقُدُورِیِّ]]‘‘۔
ترجمہ:’’ مستعمل الفاظ میں (جو طلاق کے قائم مقام ہیں):مجھے طلاق لازم ہے ،حرام مجھے لازم ہے ،مجھ پر طلاق ،مجھ پر حرام ،توعرف کی وجہ سے نیت کے بغیر طلاق واقع ہوجائے گی،اگر اس کی بیوی نہ ہو تو یہ یمین (قسم)ہوگی اور قسم توڑنے کی صورت میں وہ کفارہ اداکرے گابحوالہ:’’تصحیح القدوری‘‘، (حاشیہ ابن عابدین شامی ، جلد9،ص:168، دمشق )‘‘۔`
  },
  {
    pageNumber: 348,
    text: `	مذکورہ شخص نے تین طلاق کو اس حویلی میں بدستور رہنے کے ساتھ مشروط اور مُعلق کیا ہے ، کیونکہ ’’اگر میں اس حویلی میں رہا ‘‘ کا مستفاد یہ ہے کہ اگر میں نے اب یہاں مستقل سکونت جاری رکھی تومیری بیوی پر تین طلاق، یعنی اگر وہ مستقبل میں حویلی میں اپنی سکونت باقی رکھتاہے ،تو حانث ہوجائے گا اور اس کی بیوی پر تین طلاقیں واقع ہوجائیں گی۔یہ مراد نہیں ہوتا کہ اگروہ راتوں رات فوراً نہ نکلا تواس کی بیوی پر تین طلاق ،جبکہ سوال میں بیان کی گئی صورت میں صبح ہوتے ہی وہ اپنی بیوی اور بچوں کے ساتھ ضروری سامان اور کپڑے لے کر روانہ ہوگیا ۔اس صورت میں اس کی بیوی پر کوئی طلاق واقع نہیں ہوئی ،اس مسئلے کی نظیر درج ذیل ہے : 
تنویرالابصار مع الدرالمختار میں ہے :
’’ [[arabic: (حَلَفَ لَا یَسْکُنُ ہٰذِہِ الدَّارَ أَوِالْبَیْتَ أَوِالْمَحَلَّۃَ ) یَعْنِی الْحَارَّۃَ(فَخَرَجَ وَبَقِیَ مَتَاعُہٗ وَأَہْلُہٗ) حَتّٰی لَوْ بَقِیَ وَتِدٌ (حَنِثَ) وَاعْتَبَرَ مُحَمَّدٌنَقْلَ مَا تَقُومُ بِہِ السُّکْنٰی،وَہُوَ أَرْفَقُ وَعَلَیْہِ الْفَتْوٰی،قَالَہٗ الْعَیْنِیُّ ]]‘‘۔
ترجمہ:’’ اس نے قسم کھائی : وہ اس مکان یا محلے میں نہیں رہے گا ،وہ خود نکل گیا ،اس کا سامان اور اس کے اہل وہاں رہ گئے ،یہاں تک کہ اگر ایک کیل بھی باقی رہ گئی تو وہ حانث ہوجائے گا ،امام محمد رحمۃ اللہ تعالیٰ نے ان چیزوں کے منتقل کرنے کا اعتبار کیاہے ،جن کے ساتھ سکونت کا اہتمام ہوتاہے ،یہ قول زیادہ  نرم ہے(یعنی اس میں آسانی ہے) اسی پر فتویٰ ہے ، یہ ’’علامہ عینی ‘‘کا قو ل ہے‘‘،مزید لکھتے ہیں:
’’[[arabic: اِشْتَغَلَ بِطَلَبِ دَارٍ أُخْرٰی أَوْ دَابَّۃٍوَإِنْ بَقِیَ أَیَّامًا أَوْ کَانَ لَہٗ أَمْتِعَۃٌ کَثِیرَۃٌ فَاشْتَغَلَ بِنَقْلِہَا بِنَفْسِہٖ وَإِنْ أَمْکَنَہٗ أَنْ یَسْتَکْرِیَ دَابَّۃً لَمْ یَحْنَثْ]]‘‘۔
ترجمہ:’’ دوسرے گھر کی تلاش یا سواری کی تلاش میں مشغول ہوگیا (اس کوشش میں ) اگرچہ کئی دن وہاں ٹھہرارہا یا سامان بہت زیادہ ہے اور خود ہی اس سامان کے منتقل کرنے میں مشغول ہوگیا اگرچہ یہ اس کے لیے ممکن ہو کہ سواری کرائے پر لے ،وہ حانث نہیں`
  },
  {
    pageNumber: 349,
    text: `ہوگا ، (حاشیہ ابن عابدین شامی ،جلد11، ص:362-363، دمشق)‘‘۔
اس کی شرح میں علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: ہُوَالصَّحِیْحُ لِاَنَّ طَلَبَ الْمَنْزِلِ مِنْ عَمَلِ النَّقَلَۃِ فَصَارَ مُدَّۃَ الطَّلَبِ مُسْتَثْنًی إذَا لَمْ یُفَرِّطْ فِی الطَّلَبِ فَتْحٌ ]]‘‘۔
 ترجمہ:’’ یہی قول صحیح ہے ،اس لیے کہ مکان تلاش کرنا منتقل ہونے کا عمل ہے ،پس مکان تلاش کرنے کی مدت مُستثنیٰ ہوگی ،جبکہ وہ مکان تلاش کرنے میں کوتاہی نہ کرے ،بحوالہ : ’’فتح القدیر ‘‘،(حاشیہ ابن عابدین شامی ،جلد11، ص:362-363، دمشق)‘‘۔یہاں تو صبح ہی چلاگیا اور اس کے بعد اس حو یلی میں نہیں گیا، تو حانث نہیں ہوا اور اس کی بیوی بدستور اس کے نکاح میں ہے ، البتہ اس کے بعد اگروہ واپس اس گھر میں چلاگیا تو شرط کے پائے جانے کے سبب بیوی پر تین طلاقیں واقع ہوجائیں گی ۔اگر وہ دوبارہ اس حویلی میں جاکر رہنا چاہتاہے تو اس کا حیلہ یہ ہے کہ بیوی کو ایک طلاق رجعی دیدے ، عدت کے دوران رجوع نہ کرے ،عدت گزرنے کے بعد وہ بائن ہوجائے گی ۔وہ دونوں وہاں جاکر الگ الگ کمروں میں رہ لیں ،پھر آپس میں نیامہر مقررکرکے عقدِ ثانی کرلیں ۔
تنویر الابصار مع الدرالمختار میں ہے :
’’ [[arabic: فَحِیْلَۃُ مَنْ عَلَّقَ الثَّلَاثَ بِدُخُوْلِ الدَّارِ أَنْ یُطَلِّقَہَا وَاحِدَۃً ثُمَّ بَعْدَ الْعِدَّۃِ تَدْخُلُہَا فَتَنْحَلُّ الْیَمِینُ فَیَنْکِحُہَا]]‘‘۔
ترجمہ:’’ جس آدمی نے گھر میں داخل ہونے کو تین طلاقوںکے ساتھ معلق کیا ،اس کا حیلہ یہ ہے کہ اسے ایک طلاق دیدے ،پھر عدت کے بعد وہ گھر میں داخل ہو تو قسم ختم ہوجائے گی ، پھر شوہر اس سے نکاح کرلے ،(حاشیہ ابن عابدین شامی ،جلد9،ص:485، دمشق)‘‘۔

[[heading: طلاقِ صریح ]]
سوال:
	ایک مسلم نوجوان کی ایک مسلمان خاتون کے ساتھ ایک سال قبل شادی ہوئی ،دونوں`
  },
  {
    pageNumber: 350,
    text: `اعلیٰ تعلیم یافتہ ہیں ، وہ امریکہ آئے اور آٹھ ماہ سے شمالی امریکہ میں رہ رہے ہیں ۔پھر بدقسمتی سے ان کے آپس میں اختلافات اورجھگڑے شروع ہوگئے اور حالات بد سے بدتر ہوتے گئے ۔ شوہر نے دوہفتے بیوی کو مارپیٹ کی ، خراشیں بھی آئیں ،دونوں باقاعدہ نمازی ہیں ۔ بیوی نے شوہر سے کہاکہ وہ اس کے ساتھ نہیں رہنا چاہتی اور اس نے طلاق کا مطالبہ کیا ،لیکن وہ دل سے طلاق نہیں چاہتی تھی ،وہ صرف شوہر کا متشددانہ رویہ بدلنا چاہتی تھی ۔ان میں پھر ایک بات پرجھگڑا ہوا ۔شوہر رات بھر سونہ سکا،  شوہر اتنا بیزارو پریشان ہواکہ اس نے فجر کے بعد بیوی سے تین بار کہا: ’’میں تمہیں طلاق دیتاہوں ‘‘۔کچھ دیر اس کمرے میں چکر کاٹنے کے بعد اس نے پھر تین بار یہی کلمات دہرائے ۔عورت خاموش رہی ، لیکن شوہر نے سہ بارہ یہی کلمات دہرائے ۔
	اب وہ دونوں پشیمان ہیں اور جاننا چاہتے ہیں کہ آیا ان کے درمیان طلاق واقع ہوچکی ہے ۔شوہر قرآن پرقسم کھاکر کہتا ہے کہ اسے بالکل یاد نہیں کہ اس نے طلاق کے کلمات کہے ہیں ۔وہ بیوی کے لیے ناشتہ بھی تیارکرکے لایا مگر اس نے نہیں کھایا ۔ان کا امریکہ میں کوئی رشتے دار نہیں ہے ۔ اب سوال یہ ہے کہ کیا طلاق واقع ہوگئی ہے جبکہ وہ غصے کی کیفیت میں تھا اور اس کی طلاق دینے کی نیت بھی نہیں تھی اوروہ قسم کھاکر کہتاہے کہ مجھے طلاق یاد نہیں ہے ،جبکہ بیوی کہتی ہے کہ اس نے طلاق دی ہے،(معرفت:ڈاکٹر خالد اعوان ،امریکہ)۔
جواب:
	مفتی کو غیب کا علم نہیںبلکہ فریقین کے بیان کردہ احوال کی روشنی میں شرعی حکم بیان کرنا مفتی کا کام ہے ۔اُن کے سچا یا جھوٹا ہونے کا فیصلہ اُن کے اور رب کے درمیان کا معاملہ ہے چنانچہ اگر کوئی فریق غلط بیانی سے کام لے رہاہے ،تو اُس کا وبال خود اُس پر ہے ۔اسی طرح اگر کسی گواہ نے جھوٹا بیان دیا ہے ، تو عنداللہ وہ بھی گنہگارہے ۔
	طلاقِ صریح میں نیت کی ضرورت نہیں ،علامہ برہان الدین ابو الحسن علی بن ابو بکر فرغانی رحمۃ اللہ علیہ لکھتے ہیں:`
  },
  {
    pageNumber: 351,
    text: `’’[[arabic: فَالصَّرِیْحُ:قَوْلُہٗ:أَنتِ طَالِقٌ،وَمُطَلَّقَۃٌ،وَطَلَّقْتُکِ فَھٰذَایَقَعُ بِہِ الطَّلَاقُ الرَّجْعِیُّ،لِاَنَّ ھٰذِہِ الْاَلْفَاظَ تُسْتَعْمَلُ فِی الطَّلَاقِ،وَلَا تُسْتَعمَلُ فِیْ غَیْرِہٖ،فَکَانَ صَرِیْحاً۔۔۔ وَلَایَفتَقِرُ اِلَی النِّیَۃ،لاَِنَّہٗ صَرِیْحٌ فِیْہِ لِغَلَبَۃِ الْإِسْتِعْمَالِ]]‘‘۔
ترجمہ:’’پس صریح (طلاق کے الفاظ یہ ہیں): تجھے طلاق ہے ،تو مُطلّقہ ہے اورمیں نے تجھے طلاق دی ،اِن کلمات سے طلاق رجعی واقع ہوجائے گی،اِس لئے کہ یہ الفاظ طلاق ہی میں استعمال ہوتے ہیں اور طلاق کے غیر میں استعمال نہیں کیے جاتے ،پس یہ صریح ہیں اورنیت کی ضرورت نہیں ہے،اِس لئے کہ کثرتِ استعمال کے سبب یہ صریح ہے ، (ہدایہ ، جلد3،ص:143)‘‘۔
تنویر الابصار مع الدر المختار میں ہے :
’’[[arabic: (صَرِیْحُہٗ مَالَمْ یُسْتَعْمَلْ اِلَّافِیْہِ)]]وَلَوْ بِالْفَارِسِیَّۃِ ‘‘۔
ترجمہ:’’ صریح وہ (الفاظ) ہیں جو طلاق کے علاوہ دوسرے معنیٰ میں استعمال نہیں ہوتے، اگرچہ وہ فارسی میں ہوں ‘‘۔علامہ ابن عابدین شامی اِس کی شرح میں لکھتے ہیں: 
’’[[arabic: فَمَالَایُسْتَعْمَلُ فِیْھَااِلَّا فِی الطَّلَاقِ فَھُو َصَرِیْحٌ یَقَعُ بِلَانِیَّۃٍ]]‘‘۔ 
ترجمہ:’’ پس وہ الفاظ جو طلاق کے علاوہ (کسی اور معنیٰ ) میں استعمال نہیں ہوتے ،وہ صریح ہیں اور اُن سے نیت کے بغیر بھی طلاق واقع ہوجاتی ہے ، (ردالمحتار علی الدرالمختار ،جلد4، ص:337)‘‘۔
	آپ کے بیان کے مطابق مذکورہ شخص نے غصے میں طلاق دی ہے ،طلاق غصے ہی میں دی جاتی ہے ایسی حالت نہیں تھی جس میں عقل زائل ہوگئی ہو اور یہ پتانہ ہو کہ میں کیاکہہ رہاہوں۔
امام احمد رضاقادری قُدِّسَ سِرُّہ العزیز لکھتے ہیں: 
’’غصہ مانع وقوعِ طلاق نہیں بلکہ وہی طلاق پر حامل ہوتاہے،تواُسے مانع قراردینا گویا حکمِ طلاق کا راساً (سِرے سے)ابطال (باطل قراردینا)ہے،ہاں!اگر شدّتِ غیظ وجوشِ`
  },
  {
    pageNumber: 352,
    text: `غضب  اس حد کو پہنچ جائے کہ اس سے عقل زائل ہوجائے ،خبرنہ رہے کہ کیاکہتاہوں ،زبان سے کیانکلتاہے،تو بیشک ایسی حالت کی طلاق ہرگز واقع نہ ہوگی ،(فتاویٰ رضویہ ، جلد12، ص:383)‘‘۔
	اَئِمہ ومشائخ عظام نے تصریح فرمائی ہے کہ غصہ ارادۂ طلاق کی علامت ہے ،ملک العلماء علامہ علاءالدین ابوبکر بن مسعود کاسانی حنفی رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: وَحَالُ الْغَضَبِ وَمُذَاکَرَۃُ الطَّلَاقِ دَلِیْلُ اِرَادَۃِ الطَّلَاقِ ظَاہِراً،فَلَایُصَدَّقُ فِی الصَّرْفِ عَنِ الظَّاہِرِ]]‘‘۔
ترجمہ:’’غصہ کی حالت اور مذاکرۂ طلاق ظاہری طورپر طلاق کے ارادہ پر دلیل ہوتے ہیں ،لہٰذاطلاق کے کلمات بولنے کے بعد اگرشوہر کلام کی ظاہری معنی کے خلاف مراد بیان کرے ،تو اُس کی تصدیق نہیں کی جائے گی ،(بدائع الصنائع ،جلد3، ص:149)‘‘۔
صدرالشریعہ علامہ امجد علی اعظمیرحمۃ اللہ علیہ لکھتے ہیں:
 ’’آج کل اکثر لوگ طلاق دے بیٹھتے ہیں، بعد کو افسوس کرتے اور طرح طرح کے حیلہ سے یہ فتویٰ لیاچاہتے ہیں کہ طلاق واقع نہ ہو ۔ایک عذر اکثر یہ بھی ہوتاہے کہ غصہ میں طلاق دی تھی،مفتی کو چاہیے کہ یہ امر ملحوظ رکھے کہ مطلقاً غصہ کا اعتبار نہیں ، معمولی غصہ میں طلاق ہوجاتی ہے ۔وہ صورت کہ عقل غصہ سے جاتی رہے، بہت نادر ہے ،لہٰذاجب تک اس کا ثبوت نہ ہو محض سائل کے کہہ دینے پر اعتماد نہ کرے  (بہارِ شریعت،جلداول، ص: 113)‘‘۔ 

وہ مزید لکھتے ہیں:
 ’’طلاق اکثر غصے ہی میں ہوتی ہے اور غصہ میں جو طلاق دی جاتی ہے ،واقع ہوتی ہے ،مگر جب کہ غصہ اِس حد کاہو کہ عقل تکلیفی زائل ہوجائے کہ غصہ کی شدت میں مجنون اور پاگل کی طرح ہوجائے کہ اسے کچھ امتیاز ہی باقی نہ رہے ، جو کچھ کہے اُس کا علم نہ رہے کہ کیاکہتاہے تو اس صورت میں طلاق واقع نہ ہوگی ،مگریہ یاد رکھنا چاہئے کہ اگر واقع میں اس حد کا غصہ نہ ہوا اورلوگوں پر یہ ظاہر کرتاہے کہ مجھے بالکل خبر نہیں کہ کیا کہاتو اپنے اس جھوٹے بیان سے`
  },
  {
    pageNumber: 353,
    text: `مؤاخذہ اُخروی سے بری نہ ہوگا۔ اور وہ بیان طلاق کو عنداللہ منع نہ کرے گا اور اگرمعمولی غصہ تھاتو جتنی طلاقیں دی ہیں ،واقع ہیں،(فتاویٰ امجدیہ دوم،ص:197 )‘‘۔
	اس ساری تفصیل کے بعد مذکورہ سوال کے مندرجات کی روشنی میں اب دونوں پشیمان ہیں اور جاننا چاہتے ہیں کہ آیا ان کے درمیان طلاق واقع ہوچکی ہے ؟،اس کا جواب بالکل واضح ہے کہ طلاق واقع ہوچکی ہے اور عورت ، مرد پر حُرمتِ مُغلظہ کے ساتھ حرام ہوچکی ہے۔ لیکن اس کے بعد شوہر نے اپنا رُخ تبدیل کرتے ہوئے یہ کہاکہ وہ ’’قرآن پر قسم کھاکر کہتاہے کہ اسے بالکل یاد نہیں کہ اس نے طلاق کے کلمات کہے ہیں‘‘ ،نیز اس نے یہ کہاکہ ’’اس کی طلاق دینے کی نیت بھی نہیں تھی‘‘ ان الفاظ کی مثال ایسی ہی ہے جیسے کہاجاتا ہے :’’[[arabic: فَرَّمِنَ الْمَطَرِ وَقَامَ تَحْتَ الْمِیْزَابِ]]‘‘(بارش سے بھاگ کر پرنالے کے نیچے کھڑا ہوگیا)،شوہر یہ باور کرانا چاہتاہے کہ غصہ اس درجے کاتھا کہ اس کی عقل زائل ہوگئی تھی ، اور ایسی صورت میں طلاق واقع نہیں ہوتی ہے،لہٰذا عدمِ وقوعِ طلاق کا فتویٰ صادر کیاجائے ۔
	آپ کے بیان کے مطابق شوہر نے  قسم کھاکر یہ کہا : ’’مجھے بالکل یاد نہیں کہ میں نے طلاق کے کلمات کہے ہیں‘‘ ،ان قسمیہ کلمات میں اس نے اپنی یادداشت کی نفی کی ہے ،اس میں نفی واثبات دونوں کی گنجائش موجود ہے، نیز اس نے یہ کہا: ’’میری طلاق دینے کی نیت بھی نہیں تھی‘‘،اس میں ایک طرف وہ اپنی یادداشت کی نفی کر رہا ہے اور دوسری طرف تاکید کے ساتھ کہہ رہا ہے کہ میری طلاق دینے کی نیت بھی نہیں تھی ،اس سے بھی یہ ظاہر ہوتا ہے کہ مذاکرۂ طلاق موجود تھااور طلاقِ صریح کے لیے نیت کا ہونا ضروری نہیں ، مزید یہ کہ نیت کی نفی کرنا بالواسطہ طلاق کا اقرار ہے ،اگر کلمہ طلاق کہاہی نہیں تو نیت کا انکار کیونکر مُتصور ہوگا۔ 
	اس سے  معلوم ہوتاہےکہ شوہر حیلے بہانے سے کام لیتے ہوئے طلاق دینے کے باوجود غصے کو زوالِ عقل کی آڑ بناکر چاہتاہے کہ حرام حلال ہوجائے ۔لہٰذاچونکہ شرعی گواہی موجود نہیں ہےاور عورت کو یقین ہے کہ شوہر نے اُسے تین طلاقیں دی ہیں ، تو وہ شوہر کو اپنے اوپر قابونہ دے اور جس طرح بھی بن پڑے ، اس سے چھٹکاراحاصل کرے ۔`
  },
  {
    pageNumber: 354,
    text: `[[heading: بیوی شوہر کو طلاق نہیں دے سکتی ]]
سوال:
	میرے شوہر نے مجھے نکاح کے بعد طلاق کا حق دے رکھا ہے ، جس کے بعد ایک موقع پر میں نے اپنے شوہر کے فون پر SMSکیا: ’’ میں تمہیں طلاق دیتی ہوں ،طلاق دیتی ہوں ،طلاق دیتی ہوں‘‘،کیا اس سے طلاق واقع ہوجاتی ہے ؟،(طیبہ یاسمین ،گجرات )۔	
جواب:
	شریعت کا منشا یہ ہے کہ زوجین خوشگوار ازدواجی زندگی گزاریں،لیکن اگر کبھی حالات نامساعد ہو جائیں اور زوجین کا اللہ تعالیٰ کے قائم کردہ حدود کے اندر رہتے ہوئے رشتۂ نکاح کو جاری رکھنا دشوار ہوجائے اور نباہ کی کوئی صورت نہ بن سکے تو شوہر کو یہ حکم ہے کہ’’[[arabic: تَسْرِیْحٌ بِإِحْسَانٍ]]‘‘  کرتے ہوئے طلاق دے کربیوی کو اپنی زوجیت سے علیحدہ کر دے ۔شوہر کو طلاق کا اختیار اس لیے دیا تاکہ طلاق کم سے کم واقع ہو کیونکہ عورت فطری طورپر جلدباز ہوتی ہے اور بسا اوقات بغیر سوچے کوئی فیصلہ کرلیتی ہے اور بعد میں اسے افسوس ہوتا ہے ، اس کے مقابل مرد نتیجے پر بھی غور کرتا ہے۔
	شوہر کی طرف سے تفویض کیے جانے پر بیوی کو طلاق کا اختیار حاصل ہوجاتاہے ،لیکن اس اختیار کی صورت میں وہ خود پر طلاق واقع کرے گی، شوہر کو طلاق نہیں دے سکتی،جبکہ آپ نے سوال میں جو صورت درج کی ہے ، اس کے مطابق بیوی نے شوہر کو تین بار کہا: ’’میں تمہیں طلاق دیتی ہوں ‘‘، اس  سے طلاق واقع نہیں ہوتی ۔
علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَلِہٰذَا لَوْ مَلَّکَہَا الطَّلَاقَ فَطَلَّقَتْہٗ لَا یَقَعُ’’بَحْرٌ‘‘]]۔
ترجمہ:’’ اگر مرد نے عورت کو طلاق کا مالک بنایا ،عورت نے مردکو طلاق دے دی ،تو طلاق واقع نہیں ہوگی بحوالہ :’’ البحرالرائق ‘‘،(حاشیہ ابن عابدین شامی ،جلد9،ص:230، دمشق)‘‘۔`
  },
  {
    pageNumber: 355,
    text: `	نیز تفویضِ طلاق کا حق استعمال کرنے سے پہلے دیکھنا ہوگا کہ آیا یہ تفویض شرعی شرائط کے مطابق ہے اور شوہر کی طرف سے تفویضِ طلاق کا حق دائمی ہے ،نیز شوہر نے کتنی طلاق کا حق تفویض کیاہے ۔ اس کے کلمات فقہائے کرام نے یہ بتائے ہیں کہ شوہر نکاح منعقد ہونے (یعنی ایجاب وقبول) کے بعد بیوی سے کہے : ’’تم جب کبھی بھی چاہو اپنے آپ کو طلاق دے سکتی ہو ‘‘۔ ان الفاظ سے صرف ایک طلاق کا حق عورت کو حاصل ہوگا ،جب تک تین طلاق کی صراحت نہ ہو ۔ اسی طرح ایجاب وقبول اور نکاح منعقد ہونے سے پہلے جو نکاح نامے کے کالم میں لکھ دیاجاتاہے :’’ شوہر نے طلاق کا حق بیوی کو تفویض کردیاہے‘‘، یہ شرعاً غیر مؤثر ہے، کیونکہ ایجاب وقبول اور انعقاد نکاح سے پہلے وہ عورت اس کی بیوی بنی ہی نہیںاور خود اس کو(نکاح سے پہلے ) اُس وقت طلاق کا اختیار نہیں ہوتا تووہ یہ حق  بیوی کو کیسے تفویض کرسکتا ہے، کیونکہ خود شوہر کو یہ حق نکاح منعقد ہونے کے بعد حاصل ہوتاہے ، اس پرہم تفصیلی طورپر لکھ چکے ہیں ۔آپ کے سوال میں اس بات کی صراحت نہیں ہے کہ شوہر نے تین طلاقوں کا حق تفویض کیاہے ،جو الفاظ سوال میں مذکور ہیں ان کے مطابق توصرف ایک طلاق کا حق تفویض کیا گیا ہے ، اس لیے آپ کو تین طلاق کا حق حاصل ہی نہیں ہے اور ایک طلاق کاحق بھی اس صورت میں کہ تفویض ِ طلاق شریعت کے مطابق ہوئی ہو ،خلاصۂ کلام یہ ہے کہ آپ کا نکاح بدستور قائم ہے ۔`
  },
  {
    pageNumber: 357,
    text: `[[heading: وراثت کے مسائل ]]`
  },
  {
    pageNumber: 359,
    text: `[[heading: ترکے کا ایک مسئلہ]]
سوال:
	ایک شخص کا انتقال ہواہے، اس کے ورثاء میں دوبیٹے ، تین بیٹیاں اور ایک بیوہ ہیں، اس نے ترکے میں سترلاکھ روپے مالیت کا ایک مکان چھوڑا ہے، اس کا ترکہ کس طرح تقسیم ہوگا ،(مدثر حسین نقشبندی قادری، امام و مدرس مسجد نور الہدی، برانکس ،نیو یارک)۔
جواب:
	ازرو ئے شر ع کسی بھی وفات یافتہ شخص کے تر کے کوتقسیم کر نے سے قبل تین قسم کے مصارف وضع کئے جاتے ہیں:(۱)مصا رف تکفین وتدفین (2)متوفّٰی کے ذمہ اگر کسی کا قرض ہو، تواس کی ادائیگی (3)اگرمتوفیٰ نے کو ئی وصیت کی ہو تو زیا دہ سے زیا دہ تہا ئی ترکے کی حد تک ا س وصیت کا نفاذ،بشر طیکہ یہ وصیت کسی شر عی وارث کے حق میں نہ ہو ۔یہ تین امور تقسیمِ وراثت سے مقد م ہو تے ہیں،ان کو منہا کرنے کے بعد بقیہ ترکہ ورثا ء میں تقسیم ہوتا ہے۔صورتِ مسئولہ میں برصدقِ بیان سائل اگر ورثاء وہی ہیں جو سوال میں مذکور ہیں، تومُتوفّٰی شخص کا کل ترکہ 8حصوں میں منقسم ہوگا ،ان میں سے بیوہ کوایک حصہ ، دونوں بیٹوں کو4حصے(فی کس دوحصے) اور تین بیٹیوں کو3حصے(فی کس ایک ایک حصہ) ملیں گے۔`
  },
  {
    pageNumber: 360,
    text: `[[heading: اسلامی قانونِ وراثت اِجباری ہے ]]
سوال:
	 اگر میرے دادا نے وراثت میں زمین چھوڑی ہو اور میرے والد کو پتا نہ ہو یا دلچسپی نہ ہواور میرے والد کے انتقال کے بعد میرے بھائیو ں کومعلوم ہو جاتاہے کہ میرے دادا نے وارثت میں زمین چھوڑی تھی ،میرے بھائی اس زمین کو آباد کر دیتے ہیں۔ زمین کو آباد کرنے کے دوران کوئی دوسرا فریق میرے بھائیو ں پر عدالت میں کیس کر دیتا ہے کہ یہ زمین ہماری قوم نے آپ کے داداکو نہیں دی تھی ،لیکن وہ کیس میرے بھائی جیت جاتے ہیں۔اب پوچھنا یہ ہے کہ اس زمین میں میرا بھی حصہ بنتا ہے یا نہیں ؟ وہ مجھے میرا حصہ نہیں دیتے اور کہتے ہیں: ہمارے معاشرے میں بہنوں کو کسی نے بھی زمین نہیں دی ہے،( ایک مظلوم خاتون)۔
جواب:
	آپ کے والد کا ترکہ اُن کے تمام شرعی ورثاء کے درمیان اسلامی قانون وراثت کے مطابق تقسیم ہوگا ،کسی بھی وارث کے حصے کو روکنا اور نہ دینا ظلم اور غصب ہے ۔آپ کے بھائیوں کی یہ سوچ بھی جہالت پر مبنی ہے کہ ہمارے معاشرے میں بہنوں کو کسی نے بھی زمین نہیں دی ہے۔قرآن کریم کی سورۃ النساء آیات:10،11اور176میں اَحکام وراثت تفصیل کے ساتھ بیان کیے گئے ہیں۔فقہ ِاسلامی میں علم المیراث ایک مستقل فن ہے ،جسے نصف علم سے تعبیر کیاگیاہے ۔وراثت کی تقسیم اجباری ہے ،اس میں کسی کی مرضی کا کوئی دخل نہیں ہے اور قرآن کاصریح حکم ہے :ترجمہ:’’ (وراثت میں ) مرد کا حصہ دو (عورتوں) کے برابر ہے ،(النساء:11)‘‘،یعنی ترکے میں بیٹے کا حصہ بیٹی سے دگنا ہوگا۔علاقائی یا برادری کی رسوم اگر شریعت کے خلاف ہیں  تو اُنہیں رد کردیا جائے ، حکومت پربھی لازم ہے کہ وہ وفات پانے والے افراد کی زرعی زمین اور منقولہ جائیداد کی ورثاء کے نام منتقلی کے لیے اسلامی قانونِ وراثت کے نفاذ کو یقینی بنائے اور محکمۂ مال کا جو متعلقہ افسر اس کی خلاف ورزی کرے ،اس کے خلاف قانونی کارروائی کی جائے ۔ 

[[heading: وصیت میں زیادتی یا خلاف شرع بات کی اصلاح کی جاسکتی ہے ]]
سوال:
	جب کوئی وصیت کرتاہے اور اس کی وفات کے بعد اس کی وصیت پر اسی طرح عمل کرنا ہوگا یا اس میں کوئی تبدیلی جائز ہے جیسے قبر والی جگہ کا معاملہ ہے ،اگر ورثاء پاکستان لے جانا چاہیں توکیا حکم ہے ،اگرچہ ان تمام باتوں کا علم وصیت کرنے والے کوہے یا نہیں ،اس سلسلے`
  },
  {
    pageNumber: 361,
    text: `میں کیا حکم ہے؟، (مولانا عرفان مدنی ،انگلینڈ)۔
جواب:
	شریعت میں وصیت کرنے کا مطلب بطور احسان کسی کو اپنے مرنے کے بعد اپنے مال یا کسی منفعت کا مالک بناناہے ،علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں: 
’’[[arabic: اَلإِیْصَاءُ فِی الشَّرْعِ تَمْلِیْکٌ مُضَافٌ إِلٰی مَا بَعْدَ الْمَوتِ یَعْنِیْ بِطَرِیْقِ التَّبَرُّعِ سَوَاءٌ کَانَ عَیْنًا أَوْ مَنفَعَۃً،کَذَا فِی التَّبْیِیْنِ ]]‘‘۔
ترجمہ:’’شریعت میں ’’اِیصاء‘‘ یعنی وصیت کرنے کا مطلب یہ ہے کہ اپنے مرنے کے بعد کسی کو تبرُّع (فضل واحسان ) کے طورپر اپنے مال یا کسی منفعت کا مالک بنانا ، ’’تبیین ‘‘ میں بھی اسی طرح ہے ،(فتاویٰ عالمگیری ،جلد6،ص:90)‘‘۔
	فلاں شخص میرا جنازہ نہ پڑھے یا فلاں میرا جنازہ پڑھائے یا کسی خاص جگہ دفن کرنے کی وصیت کرنا باطل ہے ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: أَوْصٰی بِاَنْ یُّدْفَنَ فِی دَارِہٖ فَوَصِیَّتُہٗ بَاطِلَۃٌ إِلَّا أَنْ یُّوْصِیَ أَنْ یُّجْعَلَ دَارُہٗ مَقْبَرَۃً لّلْمُسْلِمِیْنَ، وَفِی الْفَتَاوٰی وَ الْخُلَاصَۃَ :وَلَو أَوْصٰی أَنْ یُّدْفَنَ فِیْ بَیْتِہٖ لَایَصِحُّ وَیُدْفَنَ فِی مَقَابِر الْمُسْلِمِیْنَ.وَلَوْ أَوْصٰی بِاَنْ یُّصَلِّیَ عَلَیْہِ فَلَانٌ،فَقَدْ ذَکَرَ فِی الْعُیُونِ : أَنَّ الْوَصِیَّۃَ بَاطِلَۃٌ وَفِی الْفَتَاوٰی وَ الْخُلَاصَۃِ :وَہُوَلَا یَصِحُّ]]‘‘۔
ترجمہ:’’(کسی نے) وصیت کی کہ مجھے میرے گھر میں دفن کیاجائے ،تو یہ وصیت باطل ہے ، البتہ اگر وہ وصیت کرے کہ اس کے گھر کو مسلمانوں کا قبرستان بنادیاجائے (تویہ وصیت درست ہے)،’’فتاویٰ ‘‘ اور ’’خلاصۃ الفتاویٰ ‘‘ میں ہے:`
  },
  {
    pageNumber: 362,
    text: `اوراگر (کسی نے) وصیت کی کہ اسے اس کے گھر میں دفن کیاجائے تو یہ وصیت صحیح نہیں ہے،اُسے مسلمانوں کے قبرستان میں دفن کیاجائے گااور اگر (کسی نے) وصیت کی:میرا جنازہ فلاں شخص پڑھائے ،تو ’’عیون البصائر ‘‘ میں بیان کیاہے : یہ وصیت باطل ہے ،اور ’’فتاویٰ‘‘ اور ’’خلاصۃ الفتاویٰ‘‘ میں ہے : یہ وصیت صحیح نہیں ہے ،(فتاویٰ عالمگیری ،جلد6،ص:95)‘‘۔
	اگر میت نے وصیت میں کوئی خطا کی یا کسی وارث کے حق میں ظلم کیا تو ولی  یا وصی اُس وصیت میں تصحیح کرسکتاہے ،اللہ تعالیٰ کا ارشاد ہے:
’’[[arabic: فَمَنْ خَافَ مِنْ مُوصٍ جَنَفًا أَوْ إِثْمًا فَأَصْلَحَ بَيْنَهُمْ فَلَا إِثْمَ عَلَيْهِ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ]]‘‘۔
ترجمہ:’’ پھر جس کو وصیت کرنے والے سے بے انصافی یا گناہ کا خوف ہو ،پس وہ اُن کے درمیان صلح کرادے تو اس پر کوئی گناہ نہیں ،بے شک اللہ بہت بخشنے والا بے حد رحم فرمانے والا ہے ،(البقرہ:182)‘‘۔اس سے مراد یہ ہے کہ اگر وصیت کرنے والا وصیت کرتے ہوئے کسی زیادتی یا گناہ کا ارتکاب کرے، تو اُسے اصلاح پر آمادہ کرنا چاہیے ۔
تفسیرمعالم التنزیل میں ہے :
’’[[arabic: إِذَا أَخْطَاَ الْمَیِّتُ فِی وَصِیَّتِہٖ أَوْ جَارَ مُتَعَمِّدًا، فَلَا حَرَجَ عَلٰی وَلِیِّہٖ أَوْ وَصِیِّہٖ أَوْ وَالِی أُمُوْرِ الْمُسْلِمِیْنَ أَنْ یُصْلِحَ بَعْدَ مَوْتِہٖ بَیْنَ وَرَثَتِہٖ وَبَیْنَ الْمُوْصٰی لَہُمْ،وَیُرَدُّ الْوَصِیَّۃُ إِلَی الْعَدْلِ وَالْحَقِّ(فَلاَ إِثْمَ عَلَیْہِ)،أَیْ:لَا حَرَجَ عَلَیْہِ]]‘‘۔
ٔترجمہ:’’ جب میت نے وصیت میں خطاکی یاجان بوجھ کر ظلم کیا اور ولی یا وصی یا مسلمانوں کاحاکم اس کی موت کے بعد اُس کے وارثوں اور مُوصیٰ لہم (جن کے حق میں وصیت کی گئی ہے )، کے درمیان صلح کرادے تو اُن پر کوئی حرج نہیں ہے اور وصیت کو عدل وحق کی طرف لوٹادیاجائے ،تواس میں کوئی گناہ نہیں یعنی کوئی حرج نہیں ہے ،(جلد1،ص:65)‘‘۔
	اگرکوئی شخص کسی وارث کو محروم کردے یاکسی شخص کے لیے اس قدر زیادہ وصیت کرے جس سے دوسرے حق داروں کے حصوں میں کمی ہو تو وہ شخص گنہگار ہوگا ،حدیث پاک میں ہے :`
  },
  {
    pageNumber: 363,
    text: `’’ [[arabic: إِنَّ الرَّجُلَ لَیَعْمَلُ وَالْمَرْأَۃُ بِطَاعَۃِ اللَّہِ سِتِّیْنَ سَنَۃً ثُمَّ یَحْضُرُہُمَا الْمَوْتُ فَیُضَارَّانِ فِی الْوَصِیَّۃِ فَتَجِبُ لَہُمَا النَّار]]‘‘۔
َترجمہ:’’ایک مرد اور عورت ساٹھ سال تک اللہ کی عبادت کرتے رہتے ہیں ،پھر ان کو موت آجاتی ہے اور وہ وصیت میں (کسی کو) ضرر پہنچاتے ہیں توان کے لیے دوزخ واجب ہو جاتی ہے،(سُنن ابو داؤد: 2868)‘‘۔
علامہ ابوالحیان اندلسی اس آیت کی تفسیر میں لکھتے ہیں:
’’ [[arabic: اَیْ عَلِمَ بَعْدَ مَوْتِ الْمُوْصِیْ أَنَّ الْمُوْصِیَ حَافَ وَجَنَفَ وَتَعَمَّدَإِذَایَۃَ بَعْضِ وَرَثَتِہٖ، فَأَصْلَحَ مَا وَقَعَ بَیْنَ الْوَرَثَۃِ مِنَ الْاِضْطِرَابِ وَالشِّقَاقِ،فَلَا إِثْمَ عَلَیْہِ،وَقَالَ عَطَاءٌ: الْمَعْنَی: فَمَنْ خَافَ مِنْ مُّوْصٍ جَنَفًا أَوْ إِثْمًا  فِیْ عَطِیَّتِہٖ لِوَرَثَتِہٖ عِنْدَ حُضُورِ أَجَلِہٖ، فَأَعْطٰی بَعْضًا دُوْنَ بَعْضٍ،فَلَا إِثْمَ عَلَیْہِ أَنْ یُصْلِحَ بَیْنَ وَرَثَتِہٖ فِیْ ذٰلِکَ]]‘‘۔
ُترجمہ:’’موصی (وصیت کرنے والے)کی موت کے بعد معلوم ہواکہ اس نے اپنی وصیت کے ذریعے کسی پر ظلم کیاہے اور وارثوں میں سے دانستہ بعض کو اذیت پہنچائی ہے اور وارثوں کے درمیان جو اضطراب اور اختلاف پیداہوگیا تھا،اُس نے اس کی اصلاح کی تو اس پر  کوئی گناہ نہیں ہے اور عطاء نے کہا: پس جس کواپنی موت کے وقت اپنے وارثوں کے لیے وصیت کرنے والے کی طرف سے  عطیہ دینے میں بے انصافی یا گناہ کا خوف ہوکہ بعض کو دے اور بعض کو نہ دے ،تو اس پر کوئی گناہ نہیں کہ وہ اس کے وارثوں کے درمیان اصلاح کرادے،(البحرالمحیط ، البقرہ:182)‘‘۔
	میت کو ایک ملک سے دوسرے ملک میں منتقل کرنانہ شریعت کا حکم ہے اورنہ  شریعت کی نظر میں یہ شعار پسندیدہ ہے، یہ لوگوں کی اپنی خواہشات یا خاندانی روایات ہیں ، جن کو وہ ترک کرنے پر آمادہ نہیں ہوتے ۔بالفرض اگرکوئی برطانیہ میں مقیم ہے اورمرنے سے پہلے اس نے وصیت کی کہ اس کی میت پاکستان لے جاکر اس کے آبائی قبرستان میں دفن کی جائے ،توایسی وصیت پر عمل کرنا ضروری نہیں ہے ۔`
  },
  {
    pageNumber: 364,
    text: `[[heading: قاتل ، مقتول کا وارث نہیں ہوسکتا ]]
سوال:
	ملک غلام محمد کو اس کے چھوٹے بیٹے ملک عماد نے اس کی جائیداد اپنے نام کروانے کے لیے ڈنڈوں اور لاتوں سے مارا ،جسم کی ساری ہڈیاں توڑ دیں ، 88سالہ ملک غلام محمدنے دم توڑ دیا ، کیا ملک عماد کو اُس کے والد ملک غلام محمد کے ترکے سے حصہ ملے گا ؟، (ملک محمد نصر ، کوئٹہ)۔	
جواب:
	اگر آپ کا بیان درست ہے کہ ملک عماد نے اپنے والد ملک غلام محمد کو قتل کیاہے تو اُسے ترکے سے حصہ نہیں ملے گا کیونکہ قاتل اپنے مقتول کی وراثت سے محروم رہتاہے ۔ 		حدیث پاک میں ہے :
 ’’[[arabic: عَنْ أَبِیْ ہُرَیْرَۃَ عَنِ النَّبِیِّ ﷺ قَالَ: :اَلْقَاتِلُ لَا یَرِثُ]]‘‘۔
ترجمہ:’’حضرت ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ  صلی اللہ علیہ وسلم نے فرمایا: قاتل وارث نہیں ہوتا ہے ،(سُنن ترمذی: 2109)‘‘۔
	امام سراج الدین محمد بن عبدالرشید سجاوندی حنفی نے وراثت سے محرومی کے اسباب بیان کرتے ہوئے لکھا:’’[[arabic: وَالْقَتْلُ الَّذِیْ یَتَعَلَّقُ بِہٖ وُجُوْبُ الْقِصَاصِ أَوِالْکَفَّارَۃِ]]‘‘۔ ترجمہ:’’وہ قتل مقتول کی وراثت سے محرومی کا سبب بنتاہے ، جس کے نتیجے میں (سزاکے طور پر) قصاص یا (قتلِ خطاکی صورت میں)کفّارہ واجب ہوتاہے ،(سراجی ،ص:12)‘‘۔

[[heading: ترکے کا ایک مسئلہ ]]
سوال:
	میرے والد محترم کی ایک صابن فیکٹری تھی ،1998؁ء میں والدنے فیکٹری کی تمام مشینری ، مٹیریل ،2دکانیں اور پانچ گاڑیاں اپنے پانچوں بیٹوں کو ہبہ کردیں ۔ہر شے میں برابر برابر تمیز کردی ،جو چیزیں نام ہوسکتی تھیں ،نام پر کردیں اور باقی چیزوں کا قبضہ دے دیا`
  },
  {
    pageNumber: 365,
    text: `اورخود لاتعلق ہوگئے ،اس وقت تین بھائی بالغ اور دو بھائی نابالغ تھے ،ان کا قبضہ بھی بڑے بھائیوںکو دے دیا ۔اس کے علاوہ ستر لاکھ روپے جو والد صاحب کے بینک اکاؤنٹ میں تھے ، دوبھائیوں کے نام اکاؤنٹ کھلوایا ،کیونکہ یہ دونوں بھائی ہی کاروبار سنبھالتے تھے ، اگر نابالغ بیٹوں کے نام کراتے تو کاروبار میں پیسہ لگانے میں دشواری ہوتی ۔کاروبار علیحدہ کرانے کی صورت میں کسی ایک بیٹے کے پاس بھی اتنا سرمایہ نہ ہوتا کہ ہربیٹا علیحدہ سے کاروبار چلاسکے۔فیکٹری کی زمین ، عمارت اور رہائشی مکان کے بارے میں والد صاحب نے واضح کردیاکہ یہ میری ملکیت ہے اور میرے بعد ورثاء کا حق ہوگا ۔2002؁ء میں والد صاحب فوت ہوگئے ، ورثاء میں دو بیوائیں ، پانچ بیٹے اور نو بیٹیاں چھوڑے ۔ترکے میں سے بھائیوں نے ہر بہن کو دس لاکھ روپے دیئے ،معلوم یہ کرنا ہے کہ جو چیزیں والد صاحب نے اپنی زندگی میں ہبہ کیں ،کیا اس میں ہم بہنوں کا حصہ بنتاہے اور کیا والد صاحب فیکٹر ی کی جگہ اپنے نام رکھ کر بقیہ کاروبار ہبہ کرسکتے ہیں ۔ کاروبار پر بھائیوں کا پہلے سے قبضہ تھا ، اس وقت بھی تمام بھائی مل کر کاروبار چلارہے ہیں ،(بلال ، ڈیرہ اسماعیل خان )۔
جواب:
	سائل بلال صاحب ، جن کا تعلق ڈیرہ اسماعیل خان سے ہے ،کا استفتاء محکمۂ اوقاف سندھ کے مفتی منیر احمد طارق صاحب نے مجھے رائے دینے کے لیے ارسال کیاہے ،یہ فتویٰ 1431؁ھ سے گردش میں ہے اور چھ اداروں کے مراکز ِ افتاء کے جوابات منسلک ہیں ،لیکن حیرت ہے کہ کسی فتوے میں تمام سوالوں کے جوابات نہیں ہیں ۔بحیثیت مجموعی جامعہ امدادیہ کا فتویٰ نسبتاً زیادہ واضح ہے ۔
دارالعلوم کراچی کے فتوے میں لکھاہے : 
’’جہاں تک سوال میں ذکر کردہ سترلاکھ روپے کے گفٹ کا تعلق ہے ،تواگر یہ رقم فیکٹری کے اثاثوں میں شامل تھی ،جیساکہ سوال سے بظاہر یہی معلوم ہوتا ہے ،تو ایسی صورت میں فیکٹری کے ہبہ کے ساتھ اس کا ہبہ بھی درست ہوگیا ،پانچوں بھائی اس رقم کے مساوی طورپر شریک`
  },
  {
    pageNumber: 366,
    text: `ہوگئے ،اگرچہ قانونی مجبوری کی وجہ سے اکاؤنٹ دوبھائیوں کے نام کھولا گیا ہو، اب یہ رقم بھی والد صاحب مرحوم کی وراثت میں تقسیم نہیں ہوگی‘‘۔غالباً اسی کی متابعت میں دارالعلوم دیوبند کے مفتی صاحب نے لکھا :’’ فیکٹری اور اس کے اثاثے کی صحتِ ہبہ کی بات درست ہے ،البتہ والد کے اکاؤنٹ کی رقم کو فیکٹری کا اثاثہ قراردینے میں تَرَدّد ہے ،ہاں اگر وہ رقم فیکٹری کے ورکنگ کیپیٹل کی ہو تو اثاثہ بلا تَردد ہوسکتا ہے ،لیکن رقم فیکٹری کے ورکنگ کیپیٹل کی ہے ، یہ امر محتاجِ ثبوت رہے گا ‘‘۔ 
	ہمیں جو استفتاء دیاگیا ہے، اس میں فیکٹری کی مشینری اور دیگر سازو سامان کی بابت لکھاہے :’’ لیکن ہرشے میں ہربھائی کے حصے کی تمیز کردی (آگے اس کی تفصیل درج ہے)‘‘،اسی طرح نقد رقم کے بارے میں لکھا ہے: 
’’ اس کے علاوہ ستر لاکھ روپے کا بینک اکاؤنٹ ،جوکہ والد صاحب کے نام پر تھا ،اپنے نام سے اکاؤنٹ سے خارج کرکے ستر لاکھ روپے میں سے ہر بھائی کے حصے کی تمیز کرکے دو بھائیوں کے نام مشترکہ اکاؤنٹ کھلوایا ،یعنی والد صاحب نے رقم کا بھی ہبہ کیا(آگے دوبھائیوں کے نام اکاؤنٹ کھلوانے کی وجہ لکھی ہے) ‘‘۔غرض کہ کارخانے اور نقد رقم دونوں میں ’’ہربھائی کے حصے کی تمیز (یعنی علیحدہ نام بہ نام تعین)کے الفاظ لکھے ہیں اوربادی النظر میں بڑے بھائیوں کو دونابالغ بھائیوں کا وکیل بھی بنادیا ،سو وہ رقم بھی باپ نے مساوی طورپر پانچوں بیٹوں کے نام ہبہ کردی ،وہ اگر فیکٹری کے ورکنگ کیپیٹل کا حصہ تھی ،جیساکہ بظاہر معلوم ہوتا ہے ،تو دارالعلوم کراچی اور دارالعلوم دیوبند کے نزدیک بھی بلا تردد یہ ہبہ مؤثر ہے ،لیکن اگر اس رقم کو ورکنگ کیپیٹل سے الگ بھی مان لیاجائے تو اس کو بھی برابر حصص کے ساتھ پانچ بیٹوں کو ہبہ کردیاگیا ہے اور کاروبار کے انچارج دوبڑے بھائی ان کے وکیل ہیں، جیساکہ’’ اگر مگر‘‘ کے بغیر دارالعلوم امدادیہ کے فتویٰ میں واضح موقف اختیار کیاگیاہے۔ جامعہ اشرفیہ کے فتویٰ میں ستر لاکھ روپے کی رقم کو بیٹوں کے نام ہبہ سے خارج کرکے ترکے میں شامل کیاگیا ہے ۔`
  },
  {
    pageNumber: 367,
    text: `	آج کل’’ آن لائن ‘‘رقوم کا ٹرانسفر ہوتاہے ،دست بدست قبضہ نہیں ہوتا اور اسے عملاً اور قانوناً اداشدہ تسلیم کیا جاتاہے ۔صورتِ مسئولہ میں باپ نے اکاؤنٹ سے اپنا نام نکال لیااوریہ تب ہوتاہے کہ والد بنک سے رقم نکال کر بیٹوں کے حوالے کردے ، پھر نئے دستخط کنندگان کے نام ،جنہیں Authorised Signatories  یا  Account Holderکہاجاتاہے ،نیا اکاؤنٹ کھلتاہے،کارخانے کے دیگر اثاثوں میں تو تمیز اور تخلیہ سے ملکیت منتقل ہوگئی اورہبہ مکمل ہوگیا ،جبکہ نقد رقم تو باپ نے بالفعل اپنے نام سے نکال کر پانچ بیٹوں کے الگ الگ حصوں کا تعین کرکے دیدی اور انتظامی وجوہ کی بناپر دو بھائیوں کے نام اکاؤنٹ کھل گیا ۔آج کل تو بیع وشراء کے معاملات میں مبیع پر بالفعل قبضے سے پہلے کاغذات بیع وشراء کی وصولی پر قبضۂ حکمی (Constructive Possession)کو تسلیم کرکے ضامن بنک بائع کو دوسرے ملک میں ادائیگی کردیتاہے ۔
	اس بات کی نشاندہی بھی ضروری ہے کہ باپ نے صرف پانچ بیٹوں کو ہبہ دیاہے اور بیٹیوں کو محروم رکھا ہے، یہ ہبہ اگرچہ شرعاً اور قانوناً مؤثر ہوگیا ہے، لیکن باپ کایہ فعل حدیث مبارک کی رُو سے ناپسندیدہ ہے ،اللہ تعالیٰ اُنہیں معاف فرمائے ،کیونکہ زندگی میں اولاد کو ہبہ کرنے کی صورت میں بیٹوں اور بیٹیوں کو برابر دینا چاہیے ۔
	 تمام فتاویٰ میں یہ قراردیا گیاہے کہ کارخانے کی زمین کا ہبہ بیٹوں کے نام نہیں ہوا اور مجھے بھی اس سے اتفاق ہے ،لہٰذا کارخانے کی زمین اورمکان باپ کا ترکہ ہے ،جو تمام ورثاء میں قانونِ شریعت کے مطابق تقسیم ہوگا ۔تقسیم وراثت کے پہلے تین ضروری امور نمٹانے کے بعد کل ترکہ 304 حصوں میں منقسم ہوگا اور ان میں سے ورثاء کے حصوں کی ترتیب حسبِ ذیل ہوگی : 
	دو بیوائوں کا مجموعی حصہ :38	(فی کس19حصے)
	پانچ بیٹوں کا مجموعی حصہ :140	(فی کس28حصے)
	نو بیٹیوں کا مجموعی حصہ: 126	(فی کس14حصے)`
  },
  {
    pageNumber: 368,
    text: `	مزید یہ کہ بھائیوں نے شریعت کے مطابق ترکے کی تقسیم کے بغیر بہنوں کو دس لاکھ روپے فی کس دیدیے،اس میں بیواؤں کوبھی کچھ نہیں ملا۔ اصولی طورپر پہلے ترکے کی شریعت کے مطابق تقسیم ہونی چاہیے ،کیونکہ ترکے کی تقسیم اجباری ہے، اختیاری نہیں ہے ۔ اس کے بعد اگر بعض یاتمام بالغ ورثاء اپنا پورا یا بعض حصہ بہنوں کو دینا چاہیں تو دے سکتے ہیں،البتہ نابالغ ورثاء کے حصے میں یہ تصرُّف نہیں ہوسکتا ۔
	کاروبار مشترک ہے ،اس میں سب بھائیوں کا حصہ برابر ہے اور نفع بھی برابر تقسیم ہونا چاہیے ،اگر کچھ بھائی عملاً کاروبار کو سنبھال رہے ہیں یا ان کی کاروباری مہارت اور تجربہ زیادہ ہے ،تو باہم بیٹھ کر نفع میں ان کا تناسب زیادہ رکھا جاسکتا ہے، لیکن وہ خدمات کی الگ سے تنخواہ یا مقررہ اضافہ نہیں لے سکتے ،تاہم اس کے باوجود مالکانہ حقوق میں سب بھائیوں کا حصہ برابر رہے گا ۔دویا تین بھائیوں کوکاروبار پر یکطرفہ مالکانہ قبضے کا حق نہیں ہے ۔

[[heading: ہبہ اورترکہ کی تقسیم ]]
سوال:
	والدین کا انتقال ہوچکاہے ،والد صاحب نے اپنی زندگی میں مکان اور تمام اختیارات والدہ کو دے دیئے تھے ۔مکان فروخت کرکے والدہ نے ایک فلیٹ خریدلیاتھا جوکہ سب سے چھوٹے بیٹے آصف کے نام کردیاتھا ،تمام اختیاراور قبضہ محمد آصف کے پاس ہے، باقی سب بیٹے الگ رہتے ہیں ۔ بیماری سے کچھ دن پہلے والدہ نے زبانی دونوں بیٹوں سے کہہ دیاتھا کہ اس گھر کو فروخت کرکے آصف کو چھوٹا مکان دلادو،اب اس گھر کا کیا کریں۔ والدہ کاترکہ ساڑھے بائیس لاکھ روپے میرے پاس تھے ،جو تمام ورثاء کے درمیان شرعی تناسب سے تقسیم کردیئے ہیں ،اس میں آصف کا جو حصہ ہے ،وہ میرے پاس رکھاہے ۔ بڑے بھائی کا کہناہے کہ ساڑھے بائیس لاکھ روپے میں سے آصف کو حصہ نہیں دیں گے اور فلیٹ فروخت کرکے آصف کو چھوٹا فلیٹ دلادیں گے اور بقیہ بچنے والی رقم سے آصف کو کچھ نہیں دیں گے ۔آصف کوکچھ دماغی تکلیف رہتی ہے ،کیافلیٹ بیچنا صحیح ہے اور آصف کے`
  },
  {
    pageNumber: 369,
    text: `حصے کا میں کیاکروں،(شبانہ ،دستگیر ،کراچی )۔
جواب:
	ہبہ کے لیے ضروری ہے کہ موہوب لہٗ (جسے ہبہ کیاگیا ہے )اُس شے موہوبہ (ہبہ کی جانے والی چیز)پر قبضہ بھی کرلے ، تو ہبہ تام (مکمل) ہوجاتا ہے اور وہ شے واہب(ہبہ کرنے والے)کی ملکیت سے نکل جاتی ہے ،پھر وہ موہوب لہٗ (جسے ہبہ کیاگیا ہے )اُس ہبہ شدہ چیز کا مالک ہے کہ جس طرح چاہے اُس میں تصرُّف کرے ۔ قبضہ چاہے حقیقی طورپر ہویا حکمی، علامہ ابن عابدین شامی رحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: قَالَ فِی التَّتَارخَانِیَۃ:قَدْذَکَرْنَا اَنَّ الْھِبَۃَ لاَتَتِمُّ اِلاَّبِالْقَبْضِ وَالْقَبْضُ نَوْعَانِ: حَقِیْقِیٌّ وَأَنَّہٗ ظَاہِرٌ،وَحُکْمِیٌّ وَذٰلِکَ بِالتَّخْلِیَۃِ ]]‘‘۔
ترجمہ:’’تاتارخانیہ میں ہے :ہم ذکرکرچکے ہیںکہ بے شک ہبہ قبضہ کے بغیر مکمل نہیں ہوتا اور قبضہ کی دو قسمیں ہیں: حقیقی : وہ تو ظاہر ہے اور حکمی تو وہ تخلیہ سے ہوتاہے ،(منحۃ الخالق علی حاشیۃ بحرالرائق ،جلد7،ص:486)‘‘۔ تخلیہ سے مراد  یہ ہے کہ ہبہ شدہ چیزکو اپنے استعمال ، تصرُّف اور قبضے سے نکال دینا تاکہ جس شخص کو یہ ہبہ کی گئی ہے ،وہ اس پر قبضہ کرسکے اور اس کے قبضے میں کوئی رکاوٹ نہ ہو ۔ہبہ میں پسندیدہ عمل تو یہ ہے کہ تمام اولاد کو مساوی دیاجائے، لیکن اگر مساوات کا لحاظ کیے بغیر کسی ایک کودیدیا تو شرعاً ناپسندیدہ ہونے کے باوجود نافذ ہوجائے گا ۔ مذکورہ فلیٹ محمد آصف کو ہبہ کردیا گیا ،ان کاقبضہ ہونے کے ساتھ ہی ہبہ مکمل ہوگیا،اب وہ فلیٹ محمد آصف کی ملکیت ہے ،محمد آصف کی اجازت کے بغیر نہ فروخت کیاجا سکتاہے اور نہ کوئی اس میں سے حصے کا مطالبہ کرسکتا ہے، والدہ کا یہ کہنا:’’ اس گھر کو فروخت کرکے آصف کو چھوٹا مکان دلادو‘‘،محض ایک مشورہ ہے ،اس کی کوئی شرعی حیثیت نہیں ۔
	ساڑھے بائیس لاکھ روپے جو والدہ کا ترکہ ہے ،’’ [[arabic: لِلذَّکَرِ مِثْلُ حَظِّ الْاُنْثَیَیْنِ]]‘‘ (ایک لڑکے کاحصہ دو لڑکیوں کے حصے کے برابر ہے، النساء:11) کے تحت ان کے بیٹے اور بیٹیوں کے درمیان تقسیم ہوناچاہیے ، جس میں محمد آصف کو بھی حصہ ملے گا ۔اس کا حصہ جو`
  },
  {
    pageNumber: 370,
    text: `بھائی یا بہن امانت دار اور دیانت دار ہوں انہیں کے پاس محفوظ رکھا جائے تاکہ کفایت سے محمد آصف کے مالی معاملات پر صرف کرسکیں اور اس کا تحریری ریکارڈ بھی رکھیں ۔

[[heading: وراثت کا حصہ لینے کے بعد دوبارہ مطالبہ کرنا ]]
سوال:
	ہمارے والدین کا انتقال ہوچکاہے ،ان کا ایک پلاٹ تھا ،بڑے بھائی نے اس پلاٹ میں اپنا حصہ مانگا ،جو مارکیٹ ویلیو کے مطابق ان کو دے دیاگیا،پلاٹ کی ویلیو بھی بڑے بھائی نے خود ہی معلوم کی تھی،حصہ لے کر بھائی نے کہا : اب میراکوئی تعلق نہیں ،تم لوگ لڑو مرو،مجھے اس معاملے میں نہیں گھسیٹنا،یہ تقریباً بارہ سال پرانی بات ہے۔اب ہم بھائی بہنوں نے اس پلاٹ کو فروخت کرنے کا ارادہ کیاہے ،تو بڑے بھائی جو اپنا حصہ لے چکے ہیں،کہہ رہے ہیں کہ اب پلاٹ مہنگا فروخت ہواہے او رتم لوگوں کا حصہ زیادہ بناہے،لہٰذا مجھے جو فرق نکلتاہے دیاجائے ،اس بارے میںشرعی حکم بیان فرمائیں ،(سلطانہ نبیل ،کراچی )۔	
جواب:
	آپ کے بیان کے مطابق مذکورہ پلاٹ کی تقسیم باہمی رضامندی سے ہوئی تھی، اِس لیے اب آپ کے بڑے بھائی کا مزید حصے کا مُطالبہ درست نہیں ہے۔ جو تقسیم باہمی رضامندی سے ہوچکی ہے ،وہ شرعاً مؤثر اور نافذ ہے اورمذکورہ پلاٹ سے آپ کے بھائی کو مزید کوئی حصہ نہیں ملے گا ۔
علامہ برہان الدین علی بن ابوبکر الفرغانی حنفی رحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: وَلَوْ اِخْتَلَفَا فِی التَّقْوِیْمِ لَمْ یَلْتَفِتْ اِلَیْہِ،لاَِنَّہٗ دَعْوَی الْغَبَنِ،وَلَا مُعْتَبَرَ بِہٖ فِی الْبَیْعِ، فَکَذَا فِی الْقِسْمَۃِ لِوُجُوْدِ التَّرَاضِیْ،اِلَّا اِذَاکَانَتِ الْقِسْمَۃُ بِقَضَاءِ الْقَاضِیْ،وَالْغَبَنُ فَاحِشٌ،لاَِنَّ تَصَرُّفَہٗ مُقَیَّدٌ بِالْعَدْلِ]]‘‘۔
ترجمہ:’’ اگر دونوں(شریک) قیمت لگانے میں اختلاف کریں ،تو اس کی جانب التفات`
  },
  {
    pageNumber: 371,
    text: `نہیں کیاجائے گا ،اِس لیے کہ یہ غبن کا دعویٰ ہے اور اس کا بیع میں اعتبار نہیں کیاجاتا ، اسی طرح باہمی رضامندی سے جو تقسیم ہوجائے،اس میں بھی غبن کا اعتبار نہیں ہوگا،مگر اُس صورت میں جب قاضی کے فیصلے کے تحت تقسیم ہوئی ہو اور غبن فاحش ہو(یعنی دونوں حصوں کی طے کردہ قیمت میں نمایاں فرق ہو اورایسا لگے کہ ایک فریق کے ساتھ کھلا دھوکا ہواہے)،تو پھر اس تنازعے پر توجہ دینا ہوگی ،کیونکہ قاضی کے تصرُّف کے لیے عدل کی قید ہے ‘‘۔مزید لکھتے ہیں :
’’[[arabic: وَاِذَاکَانَ أَرْضٌ وَّبِنَاءٌ،فَعَنْ أَبِیْ یُوْسُفَ رَحِمَہُ اللّٰہُ أَنَّہٗ یُقْسَمُ کُلُّ ذٰلِکَ عَلٰی اِعْتِبَارِ ِالْقِیْمَۃِ، لأَِنَّہٗ لَایُمْکِنُ اِعْتِبَارُ الْمُعَادَلَۃِ اِلَّا بِالتَّقْوِیْمِ،وَعَنْ أَبِیْ حَنِیْفَۃَ رَحِمَہُ اللّٰہُ:أَنَّہٗ یُقْسَمُ الْاَرْضُ بِالْمِسَاحَۃِ،لاَِنَّہٗ ھُوَالْاَصْلُ فِی الْمَمْسُوْحَاتِ،ثُمَّ یُرَدُّ مَنْ وَّقَعَ الْبِنَاءُ فِیْ نَصِیْبِہٖ أَوْ مَنْ کَانَ نَصِیْبُہٗ أَجْوَدَدَرَاہِمَ عَلَی الْاٰخَرِحَتّٰی یُسَاوِیَہٗ،فَتَدْخُلُ الدَّرَاہِمُ فِی الْقِسْمَۃِ ضَرُوْرَۃً کَالْاَخِ لَاوِلَایَۃَ لَہٗ فِی الْمَالِ،ثُمَّ یَمْلِکُ تَسْمِیَۃَ الصِّدَاقِ ضَرُوْرَۃَ التَّزْوِیْجِ]]‘‘۔
ترجمہ:’’اور جب زمین اورعمارت پر مشتمل جائیداد (کی تقسیم )ہو ،تو امام ابو یوسف رحمہ اللہ تعالیٰ سے روایت ہے کہ ہرایک کو قیمت کے اعتبار سے تقسیم کیاجائے گا ، اس لیے کہ (حصوں کے) برابربرابر ہونے کا اعتبار قیمت لگانے سے ہی ممکن ہے اور امام ابو حنیفہ رحمہ اللہ تعالیٰ سے منقول ہے کہ زمین کو پیمائش کرکے تقسیم کیا جائے گا ،اِس لیے کہ قابلِ پیمائش اشیاء میں یہی اصل ہے، پھر جس کے حصہ میں عمارت واقع ہوئی ہو یا جس کا حصہ عمدہ ہو ،وہ دوسرے کو کچھ نقد رقم دے یہاں تک کہ وہ اس کے برابر ہوجائے ،تو ضرورت کی بنا پردراہم (یعنی نقد رقم) تقسیم میں داخل ہوں گے ، جیسے بھائی کو اپنی چھوٹی بہن کے مال میں تصرُّف کا اختیار نہیں ہے لیکن نکاح کی ضرورت کی بناپر اُسے مہر مُقرّر کرنے کا اختیار ہے ،(ہدایہ ، جلد7،ص: 78-87 ) ‘‘ ۔

[[heading: ترکے سے محروم رکھنا ظلم ہے ]]
سوال:
	میرے شوہر کے انتقال کو آٹھ سال ہوچکے ہیں ،میرے شوہرکے چھ بھائی اور تین`
  },
  {
    pageNumber: 372,
    text: `بہنیں ہیں ۔ان کی زندگی میں ان کے والد کے ترکے کی بابت فیصلہ ہوا کہ ہر بیٹے کے حصے میں ڈیڑ ھ کروڑ روپے آئیں گے ۔دوسرے نمبر کے بیٹے نے لڑ جھگڑ کر ڈھائی کروڑ روپیہ لیا ، اب وہ پراپرٹی پانچ کروڑ کی ہے ۔
	میرے شوہر کے انتقال کے ایک سال بعد ہمارا حصہ الگ کرنے کے لیے ایک زمین لی اور اس میں چھ فلیٹ بنوائے تاکہ ایک میں میں رہوں اور باقی کرایہ پر اٹھا کر اپنا گزر سکوں ،اس سارے معاملے میں ڈیڑھ کروڑ لاگت آئی ،ایک سال بعد میری مرضی کے خلاف اس میں دو فلیٹ مزید بنوائے اور میرے دو دیوروں کو دے دیئے ۔میرے جیٹھ بلڈر ہیں ،انہوں نے اردو بازار میں ایک بلڈنگ بنائی ،جس میں میرے ابو نے دو فلیٹ خریدے اور میرے نام کردیئے ، وہ فلیٹ بھی میرے جیٹھ نے مجھے نہیں دیئے اورکہاکہ ان فلیٹوں کی قیمت تمہارے گھر میں ملادی ہے۔آٹھ سال گزرنے کے باوجود پراپرٹی میرے حوالے نہیں کی جبکہ زمین میرے اور میرے بچوں کے نام ہے اورنہ ہی کرایہ میرے ہاتھ میں دیا۔دوسال پہلے بڑے جیٹھ نے نارتھ ناظم آباد میں 500گز کا مکان خریدا ،جس کی آج قیمت چھ کروڑ ہے ، وہ گھر دوبھائیوں کے نام ہے ،جن کا بزنس میں بھی حصہ ہے ۔ مختصر یہ ہے کہ جو میرا اور میرے بچوں کا حصہ بنتاتھا ،اس میں بھی میرے جیٹھ نے اپنے دو بھائیوں کو رکھا اور مزید تین بہنوں کے بارے میں کہتے ہیں کہ اُن کا بھی اس بلڈنگ میں حصہ ہے  مجھے اور میرے بچوں کو اُن کے اصل حق سے محروم رکھنا چاہتے ہیں ،شرعی رہنمائی فرمائیں، (تہمینہ طارق ،ناظم آباد کراچی )۔
جواب: 
	آپ کے بقول آپ کے سُسر کے ترکے سے اُن کے ہر بیٹے کو ڈیڑھ کروڑ روپے ملے ہیں اور اتنا ہی آپ کے شوہر کے حصے میں آیا ،جسے عملی طورپر مکمل نافذ نہیں کیاگیا ،آپ کے جیٹھ کا اس حصے میں تصرُّف اور حق دار کو اُس کے حق سے محروم رکھنا ناجائز ،ظلم وزیادتی ہے اورظلماً مال غصب کرناہے ، اس پر حدیث پاک میں بڑی وعید آئی ہے :’’[[arabic: مَنِ اقْتَطَعَ شِبْراً]]`
  },
  {
    pageNumber: 373,
    text: `[[arabic: مِّنَ الْاَرْضِ ظُلْماً،طَوَّقَہُ اللّٰہُ اِیَّاہٗ یَوْمَ الْقِیَامَۃِ مِنْ سَبْعِ أَرضِیْنَ ]]‘‘ ۔
 ترجمہ :’’جو شخص کسی کی زمین کا ایک با لشت ٹکڑا بھی ظلما ً(یعنی نا حق) لے گا ،تو اُسے اللہ تعالیٰ قیامت کے دن (سز ا کے طو رپر) سا ت زمینوں کا طوق پہنا ئے گا، (صحیح مسلم: 4055)‘‘ ۔
	 اسلام کا قانونِ وراثت اجباری ہے،اس پر عمل کرنا شریعت کی رُوسے لازم ہے کہ ہر وارث کا حصہ اس کی ملکیت میں دیدیاجائے ، محض کسی کے لیے مکان یا جائداد کا استعمال مباح کرنے سے وراثت کی تقسیم مکمل ہوتی ہے ، کسی کے محض زبانی دست بردار ہونے سے اس کا حق ساقط نہیںہوتا ،ہر وارث کا حصہ اس کی ملک اور تصرُّف میں دینا ضروری ہے۔آپ کا سوال پیچیدہ ہے ، کیونکہ آپ کے شوہر کا حصہ براہ راست آپ اور آپ کی اولاد کے قبضے اور مِلک میں نہیں دیاگیا، بلکہ آپ کے دیورنے ازخود اس میں تصرُّف کیا ہے اور یہی تنازع کا سبب ہے ، اب اس میں کاروبار کا عنصر شامل ہوگیا ہے۔ اس لیے بہتر یہ ہے کہ فریقین ایک مستند مفتی اور تعمیر کے شعبے سے وابستہ دو خداترس ماہرین پر مشتمل ایک ثالثی کونسل (مجلس تحکیم) تشکیل دیں اور وہ جوفیصلہ کریں ،اُسے تمام فریق تسلیم کریں ۔

[[heading: مُورِث کی وفات سے پہلے فوت شدہ وارث نہیں بنتا ]]
سوال:
	 اگر بیٹی والد سے پہلے فوت ہوجائے تو کیا اس کا یا اس کے بچوں کاوالد کی وراثت میں حصہ ہوگا،جبکہ اس کے دوسرے بہن بھائی حیات ہوں؟،(افتخار احمد)۔
جواب:
	وارث اسے کہتے ہیں جو وراثت یاترکے میں اپنے حصے کا حق دار ہو اور مُورِث اسے کہتے ہیں جو ترکہ چھوڑ کر وفات پاچکاہو۔اگرکسی شخص کی زندگی میں اُس کا کوئی بیٹا یا بیٹی فوت ہوجائے اور اُس شخص کے مزیدبیٹے اور بیٹیاں حیات ہوں ،تو فوت شدہ بیٹے ،بیٹی یا اُن کی اولاد کو اس شخص کے ترکے سے کچھ نہیں ملے گا،وارث صرف وہی ورثاء بنتے ہیں جو مُورِث کی وفات کے وقت حیات ہوں، کیونکہ تقسیمِ وراثت کاایک مسلّمہ اصول ہے : ’’قریب کا`
  },
  {
    pageNumber: 374,
    text: `وارث دور کے وارث کو محروم کردیتا ہے‘‘،اسے ’’اصولِ حَجبْ‘‘ بھی کہتے ہیں۔تاہم اگرآپ حسنِ سلوک کا مظاہرہ کرتے ہوئے اُن کی اولاد کو بطور استحسان کچھ دے دیں ،تو اجر پائیں گے ،اللہ تعالیٰ کاارشادہے:
’’ [[arabic: وَإِذَا حَضَرَ الْقِسْمَةَ أُولُوا الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينُ فَارْزُقُوهُم مِّنْهُ وَقُولُوا لَهُمْ قَوْلًا مَّعْرُوفًا]]‘‘۔
ترجمہ:’’اورجب(ترکے کی)تقسیم کے موقع پرقرابت دار،یتامیٰ اورمساکین آجائیں (جوشرعاً وارث نہیں بن سکتے)، تو انہیں بھی (رضاکارانہ طور پر)ترکے میں سے کچھ دے دواوران سے اچھی بات کہو،(النساء:8)‘‘۔
	قرآن کایہ حکم ایجابی (Obligatory)تونہیںہے ،استحبابی ہے،اس کی حیثیت مقاصدخیرکے لیے سفارش اورترغیب کی ہے۔لہٰذا جتنا حصہ والد کی وفات کے وقت اُس فوت شدہ بیٹے یا بیٹی کے حیات ہونے کی صورت میں اسے ملناچاہیے تھا،اگرتمام ورثاء اتفاق ِرائے سے اتنا یا اس سے کچھ کم تبُّرعاًاوراستحساناً رضاکارانہ طورپرتقسیم ترکہ سے پہلے ان کی اولاد کوبطورھبہ دیدیں تویہ ایک مستحسن امرہوگا،صلہ رحمی اور اللہ تعالیٰ کی رضاکاباعث ہوگااوراس کا انہیں اجرملے گا۔قرآن مجیداس کی حکمت بیان فرماتاہے :
’’[[arabic: وَلْيَخْشَ الَّذِينَ لَوْ تَرَكُوا مِنْ خَلْفِهِمْ ذُرِّيَّةً ضِعَافًا خَافُوا عَلَيْهِمْ فَلْيَتَّقُوا اللَّهَ وَلْيَقُولُوا قَوْلًا سَدِيدًا]]‘‘۔
ترجمہ:’’اور لوگ (یہ سوچ کر)ڈریں کہ اگر وہ (فوت ہونے کے بعد)اپنے پیچھے (خدانخواستہ)کمزور (بے سہارا)اولاد چھوڑ جاتے، توانہیں ان کے( برباد ہونےکا)خوف ہوتا، تو انہیں چاہیے کہ اللہ سے ڈرتے رہیںاور درست بات کہیں،(النساء:9)‘‘۔پس قرآنِ کریم نے بتایا کہ اپنے پسماندگان پر کسی ایسے مشکل مرحلے کا تصور کرکے غیر وارث نادار اور کمزور رشتے داروں پر ترس کھاکر تقسیم وراثت کے وقت ان کی مدد کرلیا کرو۔`
  },
  {
    pageNumber: 375,
    text: `[[heading: ترکے کا ایک مسئلہ ]]
سوال:
	 میرے پانچ بچے ہیں :۴ بیٹیاں اور ایک بیٹا۔بیٹے کا ابھی ایک ماہ قبل ٹریفک حادثے میں انتقال ہوگیا ہے۔جبکہ تقریبا ایک سال قبل میرے خاوند کا بھی انتقال ہوگیا تھا۔میری تمام بچے شادی شدہ ہیں۔ بیٹے کی تقریبا 6سال قبل شادی ہوئی تھی ۔ اسکی اب تک کوئی اولاد نہیں ہے۔ بہو اب امید سے ہے۔ میرے شوہر سرکاری ملازمت کرتے تھے۔ شوہر کی تنخوا ہ سے گھر کا گزارہ اچھے طریقے سے چلتا تھا۔ تقریبا 5   یا 6    سال قبل میرے شوہر سرکاری ملازمت سے ریٹائر ہوئے ۔ ریٹائرمنٹ کے بعدشوگر کی بیماری کی وجہ سے ان کی بینائی چلی گئی تھی۔ انکی ریٹائرمنٹ پر ملنے والے پیسے او ر کچھ پیسے جو ہم نے تمام عمر اپنی آمدنی میں سے بچت کے ذریعے جمع کیے تھے ۔ ان پیسوں سے ہم نے ایک مکان خریدنا چاہا اور اس سلسلے میںایک مکان کا سودا کیا۔ چونکہ میرے شوہر نابینا ہوچکے تھے۔تو اس کی تمام ڈیل ہمارے اکلوتے بیٹے کے ذریعے سے ہوئی اور اس کی تمام ادائیگی میرے شوہر کے بینک اکائونٹ سے ہوئی۔ مگرکچھ عرصے کے بعد ہمارے علم میں یہ بات آئی کہ وہ مکان ہمارے بیٹے نے خریدتے وقت اپنے نام کروالیا تھا۔ جبکہ ہماری نیت یہ تھی کہ ہماری تمام چیزیں اور اپنی بچت اور شوہر کو ریٹائرمنٹ پر ملنے والے پیسے شرعی اور قانونی طریقے سے تمام بچوں میں منتقل کی جائے۔
	ہمارے علم میں یہ بھی آیا ہے کہ اس نے کچھ اور چیزیں بھی خریدی تھیں۔ جبکہ اس کی سرکاری ملازمت میں گریڈ 7 کی تنخواہ کا آپ بخوبی اندازہ لگا سکتے ہیں۔جو کہ کچھ عرصے قبل گریڈ 11 میں upgrade ہوئی تھی۔(اس بات کا بخوبی اندازہ لگایا جاسکتا ہے کہ اس سرکاری ملازمت میں کتنی پراپرٹی خریدی جاسکتی ہے)۔ والد کے نابینا ہونے کے بعد اس نے والد کے ساتھ جوائنٹ اکائونٹ کھلوایا۔ اور انکے پیسے ان کی مرضی کے خلاف استعمال کیے۔جسکا علم ہونے پر میں نے اور اسکے والد نے کئی بار اس سے تکرار بھی کی`
  },
  {
    pageNumber: 376,
    text: `جس پر یہ ہم سے بہت بدتمیزی کرتا رہا ہے۔ان تمام باتوں کا علم ہماری بہو (رضوان کی بیوہ) کو بھی ہے۔ اب بیٹے کے انتقال کے بعد یہ بات بھی علم میں آئی ہے کہ اس نے کورنگی کے جس مکان میں ہم اپنے سسر کے وقت سے رہتے ہیں۔اس کے کاغذات بھی میرے علم میںلائے بغیر میری الماری سے نکال کر کچھ عرصے قبل اپنے نام کروا لیے ہیں۔اور اس مکان کے کاغذات میری بہو اپنے ساتھ لے کر اپنے میکے چلی گئی ہے۔یہ معلوم ہونے کے بعد میں شدید پریشانی میں مبتلا ہوں کہ میرے گھر کی چھت چھن گئی تو میں بیوہ عورت کہاں جائوں گی۔ اسکے علاوہ میرے بیٹے کی سرکاری ملازمت تھی جسکے بقایا جات کی ادائیگی کے لیے بھی کوشش کرنی ہےاور وہاں سے ملنے والے بقایاجات میں سے کس کس کا حصہ ہوگا۔آپ سے درخواست ہے کہ ہمیں اس سلسلے میں راہنمائی فرمائیں کہ اس تمام صورتحال میں میری تمام بیٹیوں کا اور میرا اور میری بہو (میرے بیٹے کی بیوہ) کا شرعی طور پر کیا حصہ بنتا ہے۔تاکہ ہم خاندان کے دوسرے لوگوں کو اس سلسلے میں بیچ میں ڈال کر اس معاملے کو حل کرانے کی کوشش کریں۔میرے شوہر کے ورثہ میں۔میں اور میری 4   بیٹیاں اور میرے بیٹے کی بیوہ شامل ہیں،(شمیم اختر بیوہ محمد رمضان)۔
جواب:
	آپ کے بیان کے مطابق آپ کے فوت شدہ بیٹے نے دھوکا دہی سے مذکورہ جائداد اپنے نام منتقل کرائی ،اُس کا یہ عمل ناجائز ،ظلم اور گناہ ہے ، حدیث پاک میں ہے : 
’’[[arabic: مَنِ اقْتَطَعَ شِبْراً مِّنَ الْاَرْضِ ظُلْماً،طَوَّقَہُ اللّٰہُ اِیَّاہُ یَوْمَ الْقِیَامَۃِ مِنْ سَبْعِ أَرضِیْنَ ]]‘‘ ۔
 ترجمہ :’’جو شخص کسی کی زمین کا ایک با لشت ٹکڑا بھی ظلما ً(یعنی نا حق) لے گا ،تو اُسے اللہ تعالیٰ قیامت کے دن (سز ا کے طو رپر) سا ت زمینوں کا طوق پہنا ئے گا، (صحیح مسلم: 4055)‘‘ ۔
	 محض اپنے نام پر منتقل کرانے سے مذکوہ جائداد کی ملکیت اسے حاصل نہیں ہوگی اور وہ جائداد بدستور آپ کے مرحوم شوہر کا ترکہ قرار پائے گی اور اصولِ وراثت کے قوانین کے`
  },
  {
    pageNumber: 377,
    text: `تحت ورثاء کے درمیان تقسیم کی جائے گی ، ہم یہ شرعی حکم بیان کررہے ہیں ،اب آپ کے بیٹے کا انتقال ہوچکا ہے ، لیکن آپ کے سوال سے ظاہر ہوتاہے کہ آپ کو ان تمام باتوں کا اس کی زندگی میں علم ہوچکاتھا، اگر آپ اس کی زندگی میں قانونی چارہ جوئی کرتیں تو شاید عدالت سے آپ کوآسانی کے ساتھ ریلیف مل جاتا ،اب بھی کیا ایساہوسکتا ہے ، کوئی قانونی ماہر آپ کی رہنمائی کرسکتاہے، ورنہ خداخوفی اس کا محرک ہوسکتی ہے ، جو دنیا پرستی کے اس دور میں ناپید ہوتی جارہی ہے ،اگر آپ کے بیٹے میں خوفِ خدا ہوتا تو وہ کبھی بھی اپنی ماں اور بہنوں کے ساتھ یہ دھوکا دہی نہ کرتا ۔
	آپ کے فوت شدہ شوہر کا کل ترکہ 48حصوں میں تقسیم ہوگا : بیوہ (شمیم اختر ) کو6حصے چاروں بیٹیوں کو28حصے(فی کس7حصے ) اور فوت شدہ بیٹے کو تقسیمِ ترکہ کے حوالے سے زندہ فرض کرکے اس کے چودہ حصے ہوں گے ، جو اس کے ورثاء میں شریعت کے مطابق تقسیم ہوں گے ، جس میں آپ کابھی چھٹا حصہ ہوگا ۔
	فوت شدہ بیٹے کو والد کی وراثت سے ملنے والا حصہ اور اُس کے ذاتی ترکے کی تقسیم آپ کی بہو کے وضع حمل تک موقوف رکھیں گے ۔ کیونکہ وضع حمل کی صورت میں اس کے ہاں بیٹابھی ہوسکتاہے اور بیٹی بھی ہوسکتی ہے ،بعض اوقات جڑواں بچے (Twins) پیدا ہوجاتے ہیں اور پھر ان کی صنف یعنی لڑکا یا لڑکی ہونے کا مسئلہ ہوگا ، خدانخواستہ حمل ساقط بھی ہوسکتاہے ،لہٰذا بہتریہ ہے کہ وضع حمل تک اس کے ترکے کی تقسیم  موقوف کردی جائے اور وضع حمل کے بعد جوبھی صورت ہو ،اس کے مطابق اس وقت دارالافتاء سے اُس وقت کے وارثوں کے حصص معلوم کر لیے جائیں ۔
	آپ کے فوت شدہ بیٹے کو ملنے والاجی۔پی فنڈ اور بینک اکاؤنٹ ترکے میں شامل ہوگا، کموٹیشن اگر اس کا استحقاق ہے ،تو ترکے میں شامل ہوگا ۔ پینشن گورنمنٹ کے قانون کے مطابق بیوہ کے نام جاری ہوتی ہے ،لہٰذا وہ ترکے میں شامل نہیں ہوگی، باقی تفصیلات جب سامنے آئیں گی توان کا شرعی حکم بتادیاجائے گا ۔`
  },

{
  pageNumber: 379,
  text: `[[heading: خرید وفروخت کے مسائل]]`
},


{
  pageNumber: 381,
  text: `[[heading: بیع بالاقساط ]]
سوال:
	ایک موٹر سائیکل شوروم کا مالک نقد موٹر سائیکل مبلغ چالیس ہزار روپے میں فروخت کرتاہے اور ادھار وہی موٹر سائیکل مبلغ پچاس ہزار روپے میں فروخت کرتا ہے ،اس کی صورت یہ ہے کہ خریدار مبلغ دس ہزار روپے نقدجمع کراتاہے اور بقیہ چالیس ہزار روپے چھ ماہ میں یکمشت یا آسان اقساط میں اداکرتاہے،(محمد فاروق ،ضلع مظفر گڑھ )۔
جواب:	
	مختلف افراد، کمپنیاں اور ادارے ادھار پر سامان فروخت کرتے ہیں اور قیمت اقساط میں وصول کی جاتی ہے، قیمت ، ادائیگی کی مدت اورقسطیں باہمی رضامندی سے طے کرلی جاتی ہیں، عام طور پر یہ موجودہ بازاری قیمت سے زیادہ ہوتی ہے ۔بائع فروخت شدہ چیز یعنی  مَبیع خریدار کے حوالے کرکے اس کی ملک میں دے دیتا ہے۔ یہ عقد شرعاً صحیح ہے، بشرطیکہ اس میں یہ قرار نہ دیا  ہو کہ اگر خدانخواستہ مقررہ مدت میں پوری قیمت ادا نہ کی جاسکی  تو  اضافی مدت کے عوض قیمت میں کسی خاص شرح سے کوئی اضافہ ہوگا۔ اگر تاخیری مدت کے عوض قیمت میں اضافہ کردیا تو یہ سود ہے اور حرام ہے۔ فی نفسہٖ حدود ِ شرع کے اندر ایسی بیع جائز ہے،فقہ میں اسے بیع ’’بالتقسیط‘‘ کہتے ہیں۔
	بیع میں نقد اور ادھار کی صورت میں علیحدہ علیحدہ قیمتیں مقرر کرنے کی شرعی حیثیت کے حوالے سے علامہ غلام رسول سعیدی رحمۃ اللہ علیہ نے تین صورتیں تحریر فرمائی ہیں:
(۱)	زید کوئی چیز ادھار فروخت کرتا ہے اور سب کو معلوم ہے کہ وہ دوسرے نقد فروخت کرنے والوں کے مقابلے میں گراں فروش ہے۔
(۲) 	زید علانیہ کہتا ہے کہ اس کے سامان کی نقد قیمت سو روپیہ اور ادھار ایک سو بیس روپیہ ہے ۔`
},
{
  pageNumber: 382,
  text: `(۳) زید سامان قسطوں پر فروخت کرتا ہے اور ایسے سامان کو جس کی نقد قیمت عام طور پر سوروپیہ ہے ،دس روپیہ ماہانہ کی بارہ قسطوں میں فروخت کرتا ہے۔
	ان صورتوں میں پہلی اور تیسری صورت جائز ہے اور دوسری صورت جس میں زید علانیہ کہتا ہے کہ اس چیز کی نقد قیمت سو روپیہ اور ادھار ایک سو بیس روپیہ ہے ،خواہ وہ ادھار روپیہ بھی بالاقساط وصول کیا جائے یا یک مشت، نقد اور ادھار قیمتوں میں فروخت کرنے کی وجہ سے ناجائز ہے،حدیث پاک میں ہے:
’’[[arabic: عَنْ أَبِي هُرَيْرَةَ قَالَ: نَهٰى رَسُوْلُ اللهِ ﷺعَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ]]‘‘۔
ترجمہ:’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے دوبیعوں کو ایک بیع میں جمع کرنے سے منع فرمایا ہے، (سنن ترمذی:1231)‘‘۔ 
امام ترمذی ’’ [[arabic: بَيْعَتَيْنِ فِي بَيْعَةٍ]]‘‘کی ایک صورت کو بیان کرتے ہوئے لکھتے ہیں:
’’[[arabic: وَقَدْ فَسَّرَ بَعْضُ أَهْلِ العِلْمِ قَالُوا: بَيْعَتَيْنِ فِي بَيْعَةٍ أَنْ يَقُولَ: أَبِيعُكَ هٰذَا الثَّوْبَ بِنَقْدٍ بِعَشَرَةٍ  وَبِنَسِيئَةٍ بِعِشْرِينَ]]‘‘۔
ترجمہ:’’بعض اہلِ علم نے ’’ [[arabic: بَيْعَتَيْنِ فِي بَيْعَةٍ]]‘‘کی تفسیر یہ کی ہے:’’کوئی شخص خریدار سے کہے : میں تمہیں یہ کپڑا نقد دس کا اور ادھار بیس کابیچتا ہوں‘‘۔ 
شیخ شوکانی اس حدیث پر طویل بحث کرتے ہوئے لکھتے ہیں:
’’[[arabic: فِيْهَا الدَّلَالَةُ عَلَى الْمَنْعِ مِنْ الْبَيْعِ إذَا وَقَعَ عَلٰى هٰذِهِ الصُّورَةِ، وَهِيَ أَنْ يَقُوْلَ: نَقْدًا بِكَذَا وَنَسِيئَةً بِكَذَا، لَا إذَا قَالَ: مِنْ أَوَّلِ الْاَمْرِ: نَسِيْئَةً بِكَذَا فَقَطْ وَكَانَ أَكْثَرَ مِنْ سِعْرِ يَوْمِهٖ]]‘‘۔
ترجمہ:’’اس حدیث میں اس بات پر دلالت ہے کہ جب بیع اس صورت پر واقع ہو کہ بائع کہے کہ یہ چیز نقد اتنے کی اور ادھار اتنے کی تو یہ بیع ناجائز ہے، البتہ اگر وہ ابتداء ً کہے کہ یہ چیز ادھار اتنے کی ہے،حالانکہ اس کی قیمت اس دن کی قیمت سے بہت زیادہ لگائی ہو تو یہ جائز ہے،(نیل الاوطار ،ج:5،ص: 181)۔ `
},
{
  pageNumber: 383,
  text: `علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: رَجُلٌ بَاعَ عَلٰى اَنَّهٗ بِالنَّقْدِ بِكَذَا وَبِالنَّسِيْئَةِ بِكَذَا وَإِلٰى شَهْرٍ بِكَذَا وَإِلٰى شَهْرَيْنِ بِكَذَا لَمْ يَجُزْ ،كَذَا فِي الْخُلَاصَةِ]]‘‘۔
ترجمہ:’’ایک شخص نے اس طور پر بیع کی کہ یہ چیز نقد اتنے کی ہے اور ادھار اتنے کی یا ایک ماہ کے ادھار پر اتنے کی ہے اور دو ماہ کے ادھار پر اتنے کی ہے تو یہ ناجائز ہے، اسی طرح خلاصہ میں ہے، (فتاویٰ عالمگیری، ج:3،ص:136)‘‘۔ 
(مقالاتِ سعیدی،ص:399-400)۔
صدرالشریعہ مفتی امجد علی اعظمی رحمۃ اللہ علیہ لکھتے ہیں:
’’بیع میں ثمن کا معین کرنا ضروری ہے، درمختار میں ہے:’’[[arabic: وَشُرِطَ لِصِحَّتِہٖ مَعْرِفَۃُ قَدْرِ مَبِیْعٍ وَثَمَنٍ]]‘‘ اور جب ثمن معین کردیا جائے تو بیع چاہے نقد ہو یا ادھار سب جائز ہے، اس میں ہے:’’[[arabic: وَصَحَّ بِثَمَنٍ حَالٍّ وَمُؤ َجَّلٍ اِلٰی مَعْلُوْمٍ]]‘‘  اور یہ بھی ہر شخص کو اختیار ہے کہ اپنی چیز کو کم یا زیادہ جس قیمت پر مناسب جانے بیع کرے، تھوڑا نفع لے یازیادہ ،شرع میں اس کی ممانعت نہیں، مگر صورت مسئولہ میں یہ ضرور ہے کہ نقد یا ادھار دونوں سے ایک صورت کو معین کرکے بیع کرے اور اگر معین نہ کیااور مجمل رکھا کہ نقد اتنے کو اور ادھار اتنے کو تو یہ بیع فاسد ہوگی اور ایسا کرنا جائز نہ ہوگا، (فتاویٰ امجدیہ ،ج:3،ص:181)‘‘۔
	بعض قارئین کو بیع بالتقسیط کے جواز اور ممانعت کی حکمت سمجھنے میں دشواری ہوتی ہے، اس کا مطلب یہ ہے کہ ثمن کو معلّق نہ رکھا جائے ، قطعی طور پر طے کردیا جائے ، لیکن جب یہ کہاجائے :’’ فلاں چیز نقد اتنے کی ہے اور قسطوں پر اتنے کی ‘‘،تو ثمن طے نہ ہوا بلکہ معلّق ہوگیا ،جبکہ بیع بائع اور مشتری کے درمیان باہمی رضامندی سے مَبیع اور ثمن کے قطعی طور پر طے ہونے کا نام ہے، خواہ بیع نقد ہو یا ادھار ،لیکن جب مبیع اور ثمن بائع اور مشتری کے درمیان طے ہوجائیں اور مَبیع مشتری کے حوالے کردی جائے ، اس پر اُسے قبضہ دے دیا جائے ، تو مِلک تام ہوجاتی ہے اور بیع منقد ہوجاتی ہے۔ `
},
{
  pageNumber: 384,
  text: `[[heading: یہ بیع فاسد ہے ]]
سوال:
	خریدار ، شوروم مالک سے مبلغ چالیس ہزار روپے نقد والا موٹر سائیکل ادھار میں ساٹھ ہزار روپے میں چھ ماہ کی ادائیگی کی شرط پر لیتاہے اور اُس پر قبضہ نہیں کرتا ،اُسی مجلس میں شوروم مالک سے کہتاہے کہ موٹر سائیکل میں نے بیچنا ہے ،تو شوروم مالک چالیس ہزار روپے کی نقد لے لیتاہے اور خریدار کو رقم دے دیتاہے ،حالانکہ خریدار اُس مالک کو ساٹھ ہزار روپے چھ ماہ بعد اداکرنے کا پابند ہے ۔کیا مذکورہ بالا دونوں صورتیں شرعاً جائز ہیں یا نہیں ؟، (محمد فاروق ،ضلع مظفر گڑھ )۔
جواب: 
	اس بیع میں نہ مشتری نے مبیع پر قبضہ کیا اور نہ بائع نے ثمن پر،اس لیے یہ بیع منعقد نہیں ہوئی،نیز یہ بیع عینہ کی وہ صورت ہے ،جو ناجائز ہے ،علامہ برہان الدین ابوالحسن علی بن ابوبکررحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَمَنِ اشْتَرٰی جَارِیَۃً بِاَلفِ دِرْہَمٍ حَالَۃً أَونَسِیْئَۃً فَقَبَضَہَا،ثُمَّ بَاعَہَامِنَ الْبَائِعِ بِخَمْسِمِائَۃٍ قَبْلَ أَنْ یُّنقِّدَ الثَّمَنَ الْاَوَّلَ،لَا یَجُوْزُ الْبَیْعُ الثَّانِیْ،وَقَالَ الشَّافِعِیُّ رَحِمَہُ اللّٰہُ: یَجُوْزُ لاَِنَّ الْمِلْکَ قَدْ تَمَّ فِیْہَابِالْقَبْضِ فَصَارَالْبَیْعُ مِنَ الْبَائِعِ وَمِنْ غَیْرِہٖ سَوَاءٌ:، وَصَارَکَمَا لَوْبَاعَ بِمِثْلِ الثَّمَنِ الْاَوَّلِ أَوْ بِالزِّیَادَۃِ أَوْ بِالْعَرْضِ.وَلَنَا قَوْلُ عَائِشَۃَ رَضِیَ اللّٰہُ عَنْہَا:لِتِلْکَ الْمَرْأَۃ وَقَد بَاعَت بِسِتّمِائَۃٍ بَعدَمَا اِشتَرَتْ بِثَمَانِ مِائَۃٍ:بِئْسَمَاشَرَیْتَ وَاشْتَرَیْتَ،أَبْلِغِی زَیدَ بْنَ أَرْقَمٍ أَنَّ اللّٰہَ تَعَالٰی أَبطَلَ حَجَّہٗ وَجِہَادَہٗ مَعَ رَسُوْلِ اللّٰہ ﷺ إِنْ لَّمْ یَتُبْ وَلاَِنَّ الثَّمَنَ لَمْ یَدخُلْ فِی ضَمَانِہٖ فَإِذَا وَصَلَ اِلَیْہِ الْمَبِیْعُِ،وَوَقَعَتِ الْمَقَاصَۃُ بَقِیَ لَہٗ فَضْلُ خَمْسِمِائَۃٍ وَذٰلِکَ بِلَا عِوَضٍ،بِخِلَافِ مَا إِذَا بَاعَ بِالْعَرْضِ لِاَنَّ الْفَضْلَ إِنَّمَا یَظْہَر عِنْدَ الْمُجَانَسَۃِ]]‘‘۔
ترجمہ:’’ جس نے ایک باندی ایک ہزار درہم میں نقد یا ادھار خریدی اور اسے قبضے میں لے لیا ، پھرقیمت اداکرنے سے پہلے بائع پر پانچ سودرہم میں فروخت کردیا،تویہ بیع ثانی جائز نہیںہے، امام شافعی رحمۃ اللہ علیہ نے کہا: یہ بیع جائز ہے کیونکہ (قیمت پر باہمی رضامندی کے بعد) مبیع پر مشتری کے قبضے سے بیع مکمل ہوگئی ،اب وہ (سابق) بائع پر بیچے یاکسی اور پر حکم یکساں ہے ،یہ ایساہی ہے کہ خواہ وہ پہلی قیمت پر بیچے یا اس سے زیادہ قیمت پر بیچے یا سامان کے عوض بیچے (تمام صورتیں برابر ہیں)۔اس کے نا جائز ہونے پر اَحناف کی دلیل یہ حدیث ہے: ’’ایک عورت نے حضرت زید بن ارقم سے ایک باندی آٹھ سو درہم میں خریدی اورپھر اسے انہی پر واپس چھ سو درہم میں بیچ دیا ،حضرت عائشہ رضی اللہ عنہا ( کو پتاچلا تو آپ ) نے اسے فرمایا: تم نے براسودا کیا ،آپ نے یہ بھی فرمایا: زید بن ارقم کو (میری طرف سے) بتادو کہ اگر آپ نے توبہ نہ کی تو آپ نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جو حج اور جہاد کیاتھا ،وہ سب باطل ہوگئے ،کیونکہ قیمت بائع کے ضمان میں داخل نہیں ہوئی ، پھر جب اس کے پاس مبیع پہنچی اور لین دین ہوا تو اس کے پاس پانچ سو زیادہ بچ گئے اور یہ کسی عوض کے بغیر ہے ،اس لیے جائز نہیں ہوگا۔ اس کے برعکس اگراسے سامان کے بدلے میں بیچا ہوتو بیع جائز ہوگی،کیونکہ زیادتی اس صورت میں ناجائز ہے،جبکہ مبیع اور ثمن دونوں ایک ہی جنس کے ہوں (اور اختلاف جنس کی صورت میں زیادتی جائز ہے) ، (ہدایہ ،جلد5، ص:111)‘‘۔`
},
{
  pageNumber: 385,
  text: `	یہاںبیع کے فاسد ہونے کا سبب  یہ ہے کہ ایک چیز کسی سے ایک قیمت پر اُدھار خریدی اور پھر بعینہٖ وہی چیز اس بائع اول پر پہلے سے کم قیمت پر نقد بیچ دی ،یہ خرید وفروخت ناجائز ہے،کیونکہ یہ قرض پر نفع حاصل کرنے کا ایک حیلہ ہے ۔البتہ اگرتکمیلِ بیع کے بعد پہلے بائع پر وہی چیز سابق قیمت پر یا اس سے زائد پر بیچی تویہ جائز ہے، کیونکہ اس صورت میں ممانعت کی وہ علت رفع ہوجاتی ہے۔

[[heading: گروپ انشورنس کاحکم ]]
سوال:
	 اساتذہ کی ماہانہ تنخواہوں میں سے کچھ روپے ہرماہ ضلعی حکومت گروپ انشورنس کے نام سے کٹوتی کرتی ہے اور ضلعی حکومت کااس معاملے میں پوسٹل لائف انشورنس سے الحاق ہے اور ٹیچر کی وفات کی صورت میں پوسٹل لائف انشورنس والے اس رقم کو بڑھا کر دورانِ ملازمت وفات پانے والے شخص کے ورثاء کو ادا کرتے ہیں-شرعی لحاظ سے ورثاء کے لیے یہ رقم وصول کرنا اوراپنے استعمال میں لانا جائز ہے یا نہیں،(محمدسیف اللہ،کوٹ مومن،ضلع سرگودھا) ۔`
},
{
  pageNumber: 386,
  text: `جواب: 
	 مُروّجہ انشورنس کا عقد غیر شرعی عناصر کی وجہ سے ناجائز ہے، لہٰذا اس سے اجتناب ضروری ہے۔ اس کے متبادل تکافل شرعی طریقہ کار کی وجہ سے جائز ہے۔ضلعی انتظامیہ کو چاہیے کہ گروپ انشورنس پر گروپ تکافل کو ترجیح دیں اور سودی لین دین کے معاملات سے گریز کریں ،سودی رقم کا استعمال اور لین دین حرام ہے۔ اسی طرح بعض اسلامی مالیاتی ادارے کارپوریشنوں ، کمپنیوں ،محکموں اور اداروں کے لیے ملازمین کی پراویڈنٹ فنڈکی جمع شدہ رقوم کے لیے مضاربت کے شرعی اصول پر مبنی اسکیمیں بناتی ہیں۔لہٰذا کارپوریشنوں ،کمپنیوں، محکموں اور اداروں کی ملازمین کی انجمنیں یا یونینیں (CBA) اپنے اداروں کے سربراہان کو اس پر آمادہ کریں کہ وہ ملازمین کی جی پی فنڈ کی جمع شدہ رقوم کے لیے اسلامی تمویل (Financing)کے طریقے اختیار کریں اور جس ملازم کو اپنے جی پی فنڈ سے رقم نکلوانی ہو ،وہ اسے بلاسود دیدی جائے ،کیونکہ یہ اُس کا حق ہے ۔ اسی طرح گروپ تکافل کی پروڈکٹس بھی مارکیٹ میں متبادل کے طورپر موجود ہیں۔

[[heading: خون کی تجارت کا شرعی حکم ]]
سوال:
	کیا جانوروں کا خون تجارت کے لیے فروخت ہوسکتاہے ،اس کی کھاد بنائی جاتی ہے ، جو زمین کی زرخیزی کے لیے اچھی مانی جاتی ہے ۔نیز برائلر مرغی کھانا جائز ہے یا نا جائز بعض لوگ اس کو حرام قرار دیتے ہیں کہ اس کی خوراک (Feeding)میں دمِ مسفوح (یعنی ذبح کے وقت بہنے والا خون) اور دیگر ناپاک اشیاء شامل ہوتی ہیں،(امیر خان ،خیبر پختونخوا )۔`
},
{
  pageNumber: 387,
  text: `جواب: 
	 دَمِ مسفوح (یعنی حلال جانور کے ذبح کے وقت بہنے والے خون) کی حُرمت قرآن ِ کریم سے ثابت ہے ،اللہ تعالیٰ کافرمان ہے:
’’[[arabic: إِنَّمَاحَرَّمَ عَلَیْکُمُ الْمَیْتَۃَ وَالدَّمَ ]]‘‘ ترجمہ:’’تم پر (یہ )چیزیں حرام کی ہیں:مُردار اور بہتا ہوا خون ، (البقرہ:173،النحل:115)‘‘۔ 
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: (بَطَلَ بَیْعُ مَالَیْسَ بِمَالٍ کَالدَّمِ ) الْمَسْفُوْحِ فَجَازَ بَیْعُ کَبِدٍ وَطِحَالٍ(وَالْمَیْتَۃِ)سِوٰی سَمَکٍ وَجَرَادٍ]]‘‘۔
ترجمہ:’’ ایسی اشیاء جو مال نہ ہوں ،جیسے ذبح کے وقت بہنے والا خون اور مُردار کی بیع باطل ہے ،تلّی اور کلیجی کی بیع جائز ہے (یعنی اِن پر دَمِ مَسفوح کا اطلاق نہیں ہوتا )اور(شکارکے ذریعے)جو مچھلی اور ٹڈی مرجائے،وہ حلال ہے (یعنی اُس پر مردار کا اطلاق نہیں ہوتا)، (جلد7، ص:171  )‘‘،حدیث پاک میں ہے:
’’[[arabic: عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُوْلَ اللَّهِ ﷺ قَالَ:  أُحِلَّتْ لَنَا مَيْتَتَانِ: الْحُوتُ، وَالْجَرَادُ]]‘‘۔
ترجمہ:حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہمارے لیے دو مردار حلال کیے گئے ہیں: مچھلی اور ٹڈی، ( ابن ماجہ: 3218)‘‘۔
مفتی احمد یار خان نعیمی رحمۃ اللہ علیہ لکھتے ہیں:
’’جس مچھلی کا شکار نہ کیا جاسکے ،بلکہ دریا ہی اُسے مار دے کہ اُسے کنارے پر پھینک دے، وہ بھی حلال ہے۔۔۔آگے چل کر لکھتے ہیں:’’ [[arabic: یُحِلُّ مَیْتَتَہٗ ]]‘‘دریا کا مارا ہوا جانور حلال ہے، لہٰذا اگر مچھلی دریامیں ہی مر کر تر جائے، وہ حرام ہے کہ وہ دریا کی ماری ہوئی نہیں ہے،بلکہ بیماری کی ماری ہوئی ہے اور اگر تیر یا گولی سے ماری جائے تو حلال ہے کہ یہ شکار کی ہوئی`
},
{
  pageNumber: 388,
  text: `ہے، یہ فرق خیال میں رہے، (تفسیر نعیمی، ج:7،ص:80-81)‘‘۔
علامہ علاءالدین ابو بکر کاسانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَالْمَرْوِیُّ عَنْ أَبِیْ حَنِیْفَۃَ رَحِمَہُ اللّٰہُ أَنَّہٗ قَالَ:اَلدَّمُ حَرَامٌ وَاَکْرَہُ السِّتَّۃَ،أَطْلَقَ اِسْمَ الْحَرَامِ عَلَی الدَّمِ الْمَسْفُوْحِ وَسَمّٰی مَاسِوَاہُ مَکْرُوْھًا لاَِنَّ الْحَرَامَ الْمُطْلَقَ مَاثَبَتَتْ حُرْمَتُہٗ بِدَلِیْلٍ مَّقْطُوْعٍ بِہٖ،وَحُرْمَۃُ الدَّمِ الْمَسْفُوْحِ قَدْ ثَبَتَتْ بِدَلِیْلٍ مَّقْطُوْعٍ بِہٖ وَھُوَ النَّصُّ الْمُفَسَّرُ مِنَ الْکِتَابِ الْعَزِیْزِ قَالَ اللّٰہُ تَعَالٰی عَزَّ شَانُہٗ:’’قُلْ لَّاأَجِدُ فِیْ مَآ أُوْحِیَ اِلَیَّ مُحَرَّمًا عَلٰی طَاعِمٍ یَّطْعَمُہٗ إِلَّا أَنْ یَّکُوْنَ مَیْتَۃً أَوْ دَمًا مَّسْفُوْحًا أَوْ لَحْمَ خِنْزِیْرٍ ‘‘وَاِنْعِقَادُ الْاِجْمَاعِ أَیْضًا عَلٰی حُرْمَتِہٖ،فَأمَّا حُرْمَۃُ مَاسِوَاہُ مِنَ الْاَشْیَاءِ السِّتَّۃِ فَمَا ثَبَتَتْ بِدَلِیْلٍ مَّقْطُوْعٍ بِہٖ بَلْ بِالْاِجْتِہَادِ أَوْ بِظَاہِرِالْکِتَابِ الْعَزِیْزِ الْمُحْتَمَلِ لِلتَّأوِیْلِ أَوِالْحَدِیْثِ لِذٰلِکَ فَصَّلَ بَیْنَہُمَا فِی الْاِسْمِ فَسَمّٰی ذٰلِکَ حَرَامًا وَّذَامَکْرُوْھًا]]‘‘۔
ترجمہ:’’امام ابو حنیفہ رحمہ اللہ سے روایت ہے اُنہوں نے فرمایا:’’ دَمِ مَسفُوح حرام ہے اور باقی اشیاء کو میں مکروہ قراردیتاہوں ،(امام اعظم نے)دَمِ مَسفُوح پر حرام کا اطلاق کیا اور خون کے سوا باقی اشیاء کو مکروہ کہاہے ،اس لیے کہ حرام مطلق وہ ہے ،جس کی حُرمت دلیل قطعی سے ثابت ہو اور بہنے والے خون کی حرمت دلیل قطعی سے ثابت ہے اور وہ ایک ایسی نَصّ سے ثابت ہوتی ہے ،جس کی خودقرآن مجید میں تفسیر کردی گئی ہے ،اللہ تعالیٰ فرماتاہے : ’’آپ کہہ دیجیے کہ جو اَحکام مجھ پر نازل ہوئے ،میں ان میں کسی چیزکو جسے کھانے والا کھائے ،حرام نہیں پاتا ،سوائے اس کے کہ وہ مردارہویا ذبح کے وقت بہنے والا خون یا خنزیر کا گوشت،(الانعام:145)‘‘۔اور اس کی حرمت پر اجماع بھی منعقد ہوچکاہے جبکہ اس کے علاوہ جو دوسری چھ اشیاء ہیں:اُن کی حرمت دلیل قطعی سے ثابت نہیں ہوئی بلکہ اجتہاد یا ظاہرِ کتاب سے ثابت ہوئی ہے ،جس میں تاویل کا بھی احتمال ہے یا پھر حدیث کے ساتھ ثابت ہوئی ہے ،اسی لیے اِن کے نام میں بھی فرق کیاہے ،اُسے حرام قرار دیااور باقی اشیاء کو مکروہ کہاہے ،(بدائع الصنائع ،جلدخامس،ص:90)‘‘۔`
},
{
  pageNumber: 389,
  text: `	ہمارے فقہائے کرام نے ’’دَمِ مَسفوح‘‘ کی بیع کی حُرمت کا قول اِس بناپر کیاتھا کہ یہ مال نہیں ہے ،چنانچہ علامہ برہان الدین علی بن حسن بن ابوبکرالفرغانی حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: بَیْعُ الْمَیْتَۃِ وَالدَّمِ وَالْحُرِّ بَاطِلٌ لِاَنَّھَالَیْسَتْ اَمْوَالاً فَلَاتَکُوْنُ مَحَلاًّ لِّلْبَیْعِ]]‘‘۔
ترجمہ:’’مُردار ،خون اور آزادآدمی کی بیع باطل ہے کیونکہ یہ چیزیں مال نہیں ہیں ،تو یہ بیع کا محل بھی نہ ہوں گی ،(ہدایہ مع فتح القدیر ،جلد6،ص:371)‘‘۔
	لیکن اب دَمِ مَسفوح مال بن چکاہے اورجیساکہ آپ نے لکھاہے کہ یہ کھا د (Fertilizer) بنانے کے لیے استعمال ہوتا ہے،اس کے علاوہ مرغیوں کی خوراک (Poltry Feed)میں استعمال ہوتاہے اور ان صنعتوں سے وابستہ لوگ اسے خریدتے ہیں،تو مَذبَح Slaughter House) (Butchery والوں کے لیے اُسے فروخت کرنا اور اُس کی قیمت لینا جائز ہے ،البتہ انسان کے کھانے یا پینے کے حوالے سے اُس کی حُرمت قطعی ،ابدی اور دائمی ہے ۔
	اسی طرح حرام چیز کسی مخلوط میں مل جائے ،اس کی ماہیت بدل جائے تو اس کی خرید وفروخت جائز ہے ،تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: وَلَامِلْحٌ کَانَ حِمَاراً أَوْخِنْزِیْراً وَلَا قَذَرٌ فِیْ بِئْرٍ فَصَارَحَمْأۃً لِاِنْقلَابِ الْعَینِ، بِہٖ یفْتٰی]]‘‘۔ ترجمہ:’’اور وہ نمک ناپاک نہیں ہے ، جو (اپنے اصل وجود کے اعتبار سے ) گدھا تھا یاخنزیر تھا، (پھر وہ  نمک کی کان میں گرکر تحلیل (Dissolve)ہوکرنمک بن گئے اور ان کی سابق ماہیت باقی نہ رہی) اور کنویں میں گری ہوئی وہ گندگی بھی ناپاک نہیں ہے، جو(تحلیل ہوکر) کالی مٹی کی شکل میں کیچڑ بن گئی،کیونکہ اب اس کی سابق حقیقت بدل گئی ہے ،اسی پر فتویٰ ہے‘‘، اس کے تحت علامہ علامہ شامیرحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: (لِانْقِلَابِ الْعَیْنِ)عِلَّۃٌ لِلْکُلِّ، وَہٰذَا قَوْلُ مُحَمَّدٍ، وَذَکَرَ مَعَہٗ فِی الذَّخِیْرَۃِ وَالْمُحِیْطِ أَبَا حَنِیْفَۃَ حِلْیَۃٌ. قَالَ فِی الْفَتْحِ:وَکَثِیْرٌ مِنَ الْمَشَایِخِ اِخْتَارُوْہُ، وَہُوَ الْمُخْتَارُ، لِاَنَّ الشَّرْعَ رَتَّبَ وَصْفَ النَّجَاسَۃِ عَلٰی تِلْکَ الْحَقِیقَۃِ وَتَنْتَفِی الْحَقِیقَۃُ بِانْتِفَاءِ بَعْضِ]]`
},
{
  pageNumber: 390,
  text: `[[arabic: أَجْزَاءِمَفْهُوْمِهَا فَکَیْفَ بِالْکُلِّ۔۔۔۔وَنَظِیْرُہُ فِی الشَّرْعِ النُّطْفَۃُ نَجِسَۃٌ وَتَصِیْرُ عَلَقَۃً وَہِیَ نَجِسَۃٌ وَتَصِیْرُ مُضْغَۃً فَتَطْہُرُ، وَالْعَصِیْرُ طَاہِرٌ فَیَصِیْرُ خَمْرًا فَیَنْجُسُ وَیَصِیْرُ خَلًّا فَیَطْہُرُ]]‘‘۔
ترجمہ:’’یہ بات کہ  ماہیت کے بدل جانے سے حکم بدل جاتا ہے ، یہ علّت (Cause) سب چیزوں کے لیے ہے، اوریہ امام محمد کا قول ہے اور اس کے ساتھ’’حلیہ‘‘میں ’’ذخیرہ اور ’’محیط ‘‘ کے حوالے سے ذکر کیا ہے کہ یہ امام ابوحنیفہ کا بھی قول ہے۔ علامہ ابن ہمام نے  ’’فتح القدیر‘‘ میںلکھا ہے کہ اکثر مشایخ نے اسی کو اختیار کیا ہے اور یہی قول مختار ہے،کیونکہ شریعت نے اسی حقیقت پر وصفِ نجاست کو مرتب کیا ہے اور اپنے مفہوم کے بعض اجزاء کی نفی سے بھی حقیقت کی بھی نفی ہوجاتی ہے،تو جب کسی چیزکے تمام اجزاء (اپنی سابقہ ہیئت کے ساتھ معدوم ہوجائیں)،تو اس کی حقیقت معدوم کیوں نہیں ہوگی)؟،۔۔۔۔۔۔آگے چل کر علامہ شامی لکھتے ہیں: اور شرع میں اس کی نظیر یہ ہے کہ نطفہ (منی) نجس ہے اور وہ (ماں کے رحم میں)جب عَلَقہ ( منجمد خون(Bloodsucker) کی شکل اختیار کرتا ہے، تب بھی وہ نجس ہوتا ہے اورپھرجب وہ مُضغۃ (گوشت کالوتھڑا(Embryo) بن جاتاہے، تو پاک ہوجاتا ہے۔ اورپھل وغیرہ سے کشید کیا ہوا رس پاک ہوتا ہے،پھر جب پھلوں کا رس سڑ جانے سے خمر(شراب) بن جاتا ہے، تو نجس ہوجاتا ہے (کیونکہ اب اس کی حقیقت بدل گئی ہے)،پھر یہی شراب جو حرام اور نجس ہے جب(نمک اور لیموں ڈالنے سے)سِرکہ بن جاتا ہے ،تو(اپنی حقیقت کے بدل جانے سے)  پاک ہوجاتا ہے، (ردالمحتار علی الدرالمختار ، جلد:1،ص:463)‘‘۔
 	مرغیوں کی خوراک کا شرعاً طیّب وطاہر ہونا ضروری نہیں ہے ، دیہاتوں میں دیسی مرغیاں چل پھر کر غلاظت بھی کھاتی ہیں ، اس لیے فقہاء کرام نے لکھا ہے کہ ایسی مرغیوں کو ذبح کرنے سے پہلے تین دن تک بند کرکے خوراک دی جائے تاکہ بد بو زائل ہوجائے ، جبکہ مرغیوں کی تیار خوراک (یعنی  پولٹری فیڈ ) میں دمِ مسفوح کی ماہیت بدل جاتی ہے۔ دمِ`
},
{
  pageNumber: 391,
  text: `مَسفوح کی اس بیع کی اباحت کا قول اُسی اصول پر مبنی ہے ،جس کے تحت ہمارے فقہائے کرام نے نجس العین اشیاء کی بیع کو منفعت کی بناپر مباح قراردیاہے۔
علامہ برہان الدین علی بن حسن بن ابو بکرالفرغانی لکھتے رحمۃ اللہ علیہ ہیں:
’’[[arabic: قَالَ:وَلَا بَاْسَ بِبَیْعِ السِّرْقِیْنِ،وَیُکْرَہُ بَیْعُ الْعَذِرَۃِ،وَقَالَ الشَّافِعِیُّ رَحِمَہُ اللّٰہُ:لَایَجُوْزُ بَیْعُ السِّرْقِیْنِ أَیْضًالاَِنَّہٗ نَجَسُ الْعَیْنِ،فَشَابَہَ الْعَذِرَۃَ وَجِلْدَ الْمَیْتَۃِ قَبْلَ الدِّبَاغِ، وَلَنَا:أَنَّہٗ مُنْتَفَعٌ بِہٖ،لاَِنَّہٗ یُلْقٰی فِی الْاَرَاضِیْ لِاِسْتِکْثَارِالرَیْعِ،فَکَانَ مَالاً،وَالْمَالُ مَحَلٌّ لِّلْبَیْعِ،بِخِلَافِ الْعَذِرَۃِ،لاَِنَّہٗ لاَیُنْتَفَعُ بِھَا اِلَّا مَخْلُوْطًا،وَیَجُوْزُ بَیْع ُالْمَخْلُوْطِ ھُوَالْمَرْوِیُّ عَنْ مُّحَمَّدٍرَحِمَہُ اللّٰہُ،وَھُوَ الصَّحِیْحُ،وَکَذَا یَجُوْزُ الاِْنْتِفَاعُ بِالْمَخْلُوْطِ لَا بِغَیْرِ الْمَخْلُوْطِ فِی الصَّحِیْحِ ]]‘‘۔
ترجمہ:’’ امام محمد رحمہ اللہ نے فرمایا: گوبر کی بیع میں کوئی حرج نہیں اور پاخانہ(انسانی براز یا فُضلہ) کی بیع مکروہ ہے اورامام شافعی رحمہ اللہ تعالیٰ نے فرمایا: گوبر کی بیع بھی جائز نہیں ، اس لیے کہ وہ نجس العین ہے، تو یہ پاخانہ اوردباغت سے پہلے مُردار کی کھال کے مشابہ ہوگیا اور ہماری دلیل یہ ہے کہ اس سے نفع اٹھایا جاسکتاہے ،اس لیے کہ اس کو پیداوار بڑھانے کے لیے زمینوں میں ڈالا جاتا ہے ،تویہ مال ہوگیا اور مال بیع کا محل ہے ،بخلاف پاخانہ کے ، اس لیے کہ اِ س سے مخلوط ہونے کی صورت ہی میں نفع اٹھایا جاتاہے اور مخلوط کی بیع جائز ہے ، امام محمد رحمہ اللہ سے یہی روایت ہے اوریہی صحیح ہے اورصحیح روایت کے مطابق ایسے ہی مخلوط سے انتفاع جائز ہے جبکہ غیر مخلوط سے جائز نہیں ہے ، (ہدایہ،جلد7،ص:224)‘‘۔
علامہ علاءالدین حصکفی رحمۃ اللہ علیہ لکھتے ہیں :`
},
{
  pageNumber: 392,
  text: `’’[[arabic: (وَبَیْعُ رَجِیْعِ آدَمِیٍّ لَّمْ یَغْلِبْ عَلَیْہِ التُّرَابُ)فَلَوْمَغْلُوْباًبِہٖ جَازَکَسِرْقِیْنٍ وَبَعْرٍ، وَاکْتَفٰی فِی الْبَحْرِ بِمُجَرَّدِخَلْطِہٖ بِتُرَابٍ]]‘‘۔
  ترجمہ:’’آدمی کے پاخانے کی بیع باطل ہے ،جس میں مٹی غالب نہ ہو اوراگر مٹی غالب ہواور وہ مغلوب ہو،تو بیع جائز ہے ،جیسے گوبر اور مینگنی کی بیع جائز ہے اور ’’البحرالرائق‘‘ میں تو محض مٹی کے مل جانے پر اکتفا کیاہے (یعنی مٹی کے غالب ہونے کی بھی قید نہیں لگائی)،(ردالمحتار علی الدرالمختار ، جلد7، ص: 179، بیروت)‘‘۔

[[heading: بینک ملازمین کی ایڈوانس تنخواہوں پر اضافی وصولی ناجائز ہے ]]
سوال: 
	بینک ملازمین کو یہ سہولت حاصل ہوتی ہے کہ وہ اپنے ادارے سے کچھ ماہ کی تنخواہیں پیشگی (Advance)لے سکتے ہیں ،اس رقم کی کٹوتی ان کی ماہانہ تنخواہ سے بالاقساط ہوتی ہے اور اس رقم پر بینک کچھ فیصد اضافی بھی لیتاہے ،کیایہ سود ہے ؟،(محمد صدیق ،ایڈیٹر ماہنامہ شمشاد، چمن )۔
جواب: 
	بینک اپنے ملازمین کو کچھ ماہ کی ایڈوانس تنخواہ کے نام پر جو رقم دیتاہے ،یہ قرض ہے اور اس کی یکمشت یا بالاقساط ادائی بینک ملازم پر واجب ہے ، لیکن بینک قرض کی اصل رقم پرجو کچھ فیصد اضافی رقم لیتاہے ،یہ سود ہے اوریہ شریعت کی رُو سے ناجائز ہے ،اگر اس اضافی ادائی کے بغیر ایڈوانس نہ مل سکتاہو ،توپھر یہ نہیں لینا چاہیے ،اپنے وسائل میں گزارہ کریں ۔ شرعی اصول ہے :’’قرض پر حاصل ہونے والا نفع سودہے ‘‘۔ حدیث پاک میں ہے :
 ’’[[arabic: کُلُّ قَرْضٍ جَرَّ مَنْفَعَۃً فَھُوَ رِبٰوا، الْحَارِثُ عَنْ عَلِیٍّ ]]‘‘۔
ترجمہ:’’ یعنی قرض پرمنفعت حاصل ہو، وہ سود ہے ،(اس کی تخریج حارث نے سیدنا علیکَرَّمَ اللہُ وَجْہَہُ الْکَرِیْمسے کی اور حضرت علی کَرَّمَ اللہُ وَجْہَہُ الْکَرِیْم نے اس کو نبی کریم  صلی اللہ علیہ وسلم سے روایت کیا ) ، (کنزالعمال:15516)‘‘۔`
},
{
  pageNumber: 393,
  text: `[[heading: سیکورٹی کی ملازمت ]]
سوال:
	میں ایک سیکیورٹی کمپنی میں ملازم ہوں، میری ڈیوٹی زرعی ترقیاتی بنک کی سیکیورٹی کی ہے۔ یہ سیکیورٹی کمپنی بنک کا ایک ذیلی ادارہ ہے۔میری تنخواہ اور دیگر مراعات سیکیورٹی کمپنی کی طرف سے ہی آتی ہے ۔ کیا میرا اس سیکیورٹی کمپنی میں کام کرنا جائز ہے؟۔ کہیں میں سود میں ملوث تو نہیں ہوں اور یہ کہ میں یہ نوکری جاری رکھ سکتا ہوں کہ نہیں،(طارق محمود،لاہور)۔
جواب: 
	زرعی ترقیاتی بینکوں کو گورنمنٹ اپنے بجٹ سے رقم دیتی ہے ، جس سے بینک کاشتکاروں کو آسان اقساط پر قرض فراہم کرتاہے ۔بینک کے جو ملازم سود کا حساب کتاب لکھتے یا طے کرتے ہوں ،اُن کی ملازمت ناجائز ہے ، ڈرائیور اور چوکیدار کی ملازمت اور تنخواہ جائز ہے ۔ 
مفتی وقارالدین رحمۃ اللہ علیہ لکھتے ہیں: 
’’بینکوں میں صرف سود  ہی کی رقم نہیں ہوتی ہے۔اسٹیٹ بینک میں تو ملک کے تمام ٹیکس جمع ہوتے ہیں اور دوسرے بینک جب کھولے جاتے ہیں تو ابتدا ء ً اس کے شرکاء اپنے روپے سے شروع کرتے ہیں،اس کے بعد لوگوں کے روپے بھی اس میں جمع ہوتے ہیں اورلوگ بینک سے قرض بھی لیتے ہیں اور سود کا لینا دینا شروع ہوتاہے ۔بینک اس کے علاوہ اور بہت سے کام کرتے ہیں ،لہٰذا بینک کا سرمایہ مخلوط ہوجاتاہے ، اس سے تنخواہ لینے کے حرام ہونے کی کوئی وجہ نہیں ہے۔مخلوط آمدنی سے دوسرے لوگوں کالینا جائز نہیں ہوتا ہے اور اگر بینکوں سے تنخواہ وغیرہ لینا حرام ہوجائے تو پھر پاکستان کے کسی بھی شخص کی آمدنی حلال نہیں رہے گی۔ بینکوں میں ملازمت کرکے تنخواہ لینے کی دو صورتیں ہیں : اگر ملازم کو سود لکھنا پڑتاہے تو اس کی ملازمت بھی ناجائز اور تنخواہ لینا بھی ناجائز ۔احادیث میں سود کا کاغذ لکھنے والے کے`
},
{
  pageNumber: 394,
  text: `بارے میں سخت وعید آئی ہے اورجن ملازمین کو سود لکھنا نہیں پڑتا مثلاً دربان اور ڈرائیور وغیرہ تو ان کی ملازمت بھی جائز ہے اور تنخواہ بھی،(وقار الفتاویٰ ،جلد سوم،ص:325)‘‘۔
	ہماری فہم کے مطابق علامہ مفتی وقار الدینرحمۃ اللہ علیہ کی اس عبارت کا مطلب یہ ہے کہ اگر کسی کی آمدنی مخلوط ہے ،یعنی کچھ جائز ہے اور کچھ ناجائز ،تو اپنا حق لینے والا یہ سمجھے کہ میں آمدنی کے جائز حصے سے اپنا حق لے رہا ہوں ،نہ کہ ناجائز حصے سے اور ناجائز پیسہ اپنی جگہ ناجائز ہی رہتا ہے مگر جائز پیسے کو ناجائز نہیں بناتا۔ 
[[heading:  سپروائزری سرٹیفیکیٹ کا معاوضہ ]]
سوال:
	 میں ایک انجینیر ہوں ،ملازمت کے حصول میں آسانی کے لیے انجینیرنگ کونسل نے ہمیں سپر وائزری سرٹیفیکیٹ جاری کیاہے ۔کچھ ادارے ہمیں ملازمت دینے کے بجائے صرف سرٹیفیکیٹ استعمال کرنے کے لیے ہمیں کچھ معاوضہ دینے کو تیار ہوتے ہیں ،جس کی بناپر وہ اپنے ادارے میں ہمیں ملازم ظاہر کرتے ہیں۔ کیاہمیں اس رقم کالینا درست ہے؟،(محمد احسان ، کراچی )۔
جواب:
	اجارے کی صحیح صورت یہ ہے کہ وہ ادارہ کام کی نوعیت ، مدت اور اجرت کا تعین کرکے آپ کے ساتھ خدمات کا اجارہ کرے ، اس میں شرعاً کوئی خرابی نہیں ہے۔ لیکن آپ نے جو صورت بتائی ہے ،یہ جھوٹ اور دھوکا دہی کی ہے کہ آپ کے نام ’’پاکستان انجینیرنگ کونسل ‘‘ کے جاری کردہ سرٹیفیکیٹ کو دکان پر آویزاں کرکے دکاندار یہ تاثر دیتاہے کہ اس کے ہاں کام کی نگرانی باقاعدہ ایک کوالیفائیڈ انجینیر کرتاہے ،حالانکہ حقیقت اس کے برعکس ہے۔پس آپ کے لیے یہ اُجرت اور آپ دونوں کا یہ عقد ازروئے شریعت ناجائز ہے، حدیث پاک میں ہے: ’’[[arabic: مَنْ غَشَّنَافَلَیْسَ مِنَّا]]‘‘۔ترجمہ:’’ جس نے ہمیں دھوکا دیا ،  وہ ہم میں سے نہیں ،(صحیح مسلم : 283)‘‘۔ آپ کے لیے اُس رقم کا لینا بھی جائز نہیں ہے ۔`
},
{
  pageNumber: 395,
  text: `[[heading: کمپنی کا تاخیر سے آنے پر جرمانہ عائد کرنا ]]
سوال:
	 میں ایک کمپنی میں نومبر2015؁ء میں اکاؤنٹنٹ لگا ،مجھے بتایاگیاکہ آپ کی ڈیوٹی صبح10بجے تاشام 6بجے اورتنخواہ 25ہزار روپے ہے ،اس کے علاوہ کوئی بات نہیں بتائی گئی ،میں نے جون2016تک کام کیا ۔اکثر آدھا گھنٹہ تاخیر سے جاتاتھا ،کمپنی والے کہتے تھے کہ ٹائم پر آیاکریں ۔میں نے 5جولائی کوجون کی تنخواہ مانگی تو جواب ملاکہ آپ تاخیر سے آتے ہیں ،لہٰذا آپ سے پچاس ہزار روپے بطور جرمانہ کاٹیں گے ،پچیس ہزار تنخواہ سے لے لیے اور بقیہ پچیس ہزار مجھ سے طلب کیے ۔جون کے مہینے اور جولائی کے پانچ دن کی تنخواہ29000/=روپے بنتی تھی ،جب کمپنی والوں نے مجھے تنخواہ دینے سے انکار کیااور مجھ سے مزید پچیس ہزار روپے طلب کیے تو میرے پاس کمپنی کے چوبیس ہزار روپے جو تعمیرات کے لیے مجھے دیئے تھے اوروہ میں نے بطور تنخواہ رکھ لیے اور کمپنی کو مطلع کردیا۔ معلوم یہ کرناہے کہ میرا یہ عمل درست ہے یا نہیں ؟،(محمد ریحان ،ناظم آباد کراچی)۔
جواب:
	بحیثیت ملازم ڈیوٹی کے اوقات کی پابندی کرنا آپ پر لازم تھا اور آپ کی ذمے داریوں کا تعین کرنا ادارے کا کام تھا ۔آپ کے بیان کے مطابق آپ مقررہ وقت سے آدھ گھنٹہ تاخیر سے آتے تھے ،فرض کریں کہ مہینے میں ایامِ کار 26دن بنتے ہیں ،تو آپ کا مجموعی ناغہ13گھنٹے بنتاہے ،کمپنی حساب کرکے آپ کی تیرہ گھنٹے کی تنخواہ منہاکرنے کی مجاز ہے ، باقی تنخواہ کی ادائی کمپنی کے ذمے لازم ہے ۔کمپنی کا پورے ماہ کی تنخواہ کاٹ دینا اور مزید پچیس ہزار روپے جرمانے کے طورپر وصول کرنا ناجائز ہے ۔اسی طرح آپ کا 24ہزار روپے بلا اجازت روک لینا ناپسندیدہ عمل ہے ،لیکن اگر کمپنی آپ کا جائز حق دینے پر رضامند نہ ہو توآپ تیرہ گھنٹے کی اُجرت وضع کرکے باقی رقم رکھ سکتے ہیں ۔`
},
{
  pageNumber: 396,
  text: `شریعت میں تعزیر بالمال منسوخ ہے، علامہ ابن عابدین شامیرحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: وَأَفَادَ فِی الْبَزَّازِیَّۃِ أَنَّ مَعْنَی التَّعْزِیرِ بِاَخْذِ الْمَالِ عَلَی الْقَوْلِ بِہِ إمْسَاکُ شَیْ ءٍمِنْ مَالِہٖ عَنْہُ مُدَّۃً لِیَنْزَجِرَ ثُمَّ یُعِیْدُہُ الْحَاکِمُ إلَیْہِ، لَا أَنْ یَاْخُذَہُ الْحَاکِمُ لِنَفْسِہٖ أَوْ لِبَیْتِ الْمَالِ کَمَا یَتَوَہَّمُہُ الظَّلَمَۃُ إذْ لَا یَجُوزُ لِاَحَدٍ مِنَ الْمُسْلِمِیْنَ أَخْذُ مَالِ أَحَدٍ بِغَیْرِ سَبَبٍ شَرْعِیٍّ]]‘‘۔
ترجمہ:’’ ’’بزّازیہ ‘‘ میں اس پر افادہ بیان کیا کہ تعزیر بالمال کا جہاں قول ہے اس کا معنی یہ ہے کہ ملزم کا وہ مال کچھ مدت کے لئے روک لیاجائے تاکہ وہ جرم سے باز آجائے ، پھر حاکم وہ مال واپس کردے گا،اس کے یہ معنی نہیں ہیں کہ حاکم اس مال کو اپنے لیے یابیت المال کے لیے وصول کرے جیساکہ ظالم لوگوں نے خیال کررکھا ہے کیونکہ کسی مسلمان کو شرعی وجہ کے بغیر کسی کامال لینا جائز نہیں ہے ‘‘۔مزید لکھتے ہیں:
’’ [[arabic: وَفِی شَرْحِ الْآثَارِ:التَّعْزِیرُ بِالْمَالِ کَانَ فِی ابْتِدَاء ِ الْإِسْلَامِ ثُمَّ نُسِخَ]]‘‘۔
ترجمہ:’’اور ’’شرح الآثار‘‘ میں ہے: تعزیر بالمال ابتداء ً اسلام میں جائز تھی، پھر منسوخ ہوگئی ،(ردالمحتار علی الدرالمختار، جلد6، ص:77، بیروت) ‘‘ ۔ پس مذکورہ کمپنی کو آپ پر مالی جرمانہ کرنے کا حق نہیں ہے ۔
[[heading: سونا قرض پر لے کر اداکرنے کا طریقہ ]]
سوال: 
	مجھے رقم کی سخت ضرورت تھی میں نے اپنے عزیز سے بات کی اس نے اپنا سونا مجھے دیا میں نے اس کو بیچ کر اپنی ضرورت پوری کرلی اب میں یہ قرض لوٹانا چاہتا ہوں معلوم یہ کرنا ہے واپسی کی صورت کیا ہوگی ؟ ،جتنا سونا لیا اسی کی مقدار میں سونا واپس دیا جائیگا ؟یابیچتے وقت جتنے کا بکا وہ رقم دی جائے گی،(انس رضا ،کراچی )۔`
},
{
  pageNumber: 397,
  text: `جواب:
	قرض کا حکم یہ ہے کہ جو چیز لی گئی ہے ،اُس کی مثل (اس جیسی)اداکی جائے ۔ قرض کی واپسی کے وقت قرض کے طورپر لی ہوئی چیز کی مثل دینی ہوگی ،نہ اُس سے بہتر اور نہ کمتر ، البتہ بہتر اداکرنے کی صورت میں اگر پہلے سے طے نہیں کیاتھا تو جائز ہے، ورنہ نہیں ۔ علامہ کمال الدین المعروف بابن ہمام رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: إِنَّ الدُّیُوْنَ تُقْضٰی بِأَمْثَالِہَا فَیَجِبُ لِلْمَدْیُونِ عَلَی صَاحِبِ الدَّیْنِ مِثْلُ مَا لِصَاحِبِ الدَّیْنِ عَلَیْہِ]]‘‘۔
ترجمہ:’’ قرضوں کی ادائیگی ان کی مثل کے ساتھ ہوتی ہے ،پس مدیون(مقروض) پر واجب ہے کہ وہ دائن ( قرض خواہ) سے لیے ہوئے قرض کی مثل اس کولوٹائے ،(فتح القدیر، جلد8،ص:420)‘‘۔
	لہٰذااگر سونا قرض لیا جائے تو جس مقدار میں قرض لیا گیا اتنی ہی مقدار واپس کرنا از روئے شریعت لازم ہے، اس میں سونے کی قیمت کے اتار چڑھاؤ کا کوئی اعتبار نہیں، سونے کی مقدار کا اعتبار ہوگا۔تنویرالابصار مع الدرالمختار میں ہے:
’’[[arabic: عَقْدٌ مَخْصُوْصٌ أَیْ بِلَفْظِ الْقَرْضِ وَنَحْوِہٖ یَرِدُ عَلٰی دَفْعِ مَالٍ بِمَنْزِلَۃِ الْجِنْسِ مِثْلِیٍّ خَرَجَ الْقِیَمِیُّ لِاٰخَرَ لِیَرُدَّمِثْلَہٗ۔۔۔۔فَیَصِحُّ اسْتِقْرَاضُ الدَّرَاہِمِ وَالدَّنَانِیْرِ وَکَذَا کُلُّ مَا یُکَالُ أَوْ یُوزَنُ أَوْ یُعَدُّ]]‘‘۔
ترجمہ:’’ یہ ایک مخصوص عقد کا نام ہے ،خواہ قرض کے نام سے ہو یا اس کے ہم معنیٰ کسی نام سے ہو ،یہ ایسے مال پر وارد ہوتاہے جو بمنزلہ جنس کے دوسرے کو مثلی مال سپرد کرنے پر ہوتا ہے ،اس سے قیمت والی چیز خارج ہوگئی ۔۔۔۔۔۔پس دراہم ودنانیر کا قرض کے طورپر لینا صحیح ہے اور اسی طرح ہروہ چیز جو ناپ تول یا گنتی والی ہو ، (جلد 15،ص:197، دمشق)‘‘۔ واضح رہے کہ اُس دور میں درہم چاندی کا ہوتاتھا اور دینار سونے کا اور اس کا ایک مخصوص وزن ہوتاتھا ۔
علامہ نظام الدینرحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: لَوِ اسْتَقرَضَ مِنْ اٰخَر حِنْطَۃً فَاَعطٰی مِثْلَہَابَعدَمَا تَغَیَّرَ سِعْرُہَا فَإِنَّہٗ یُجْبَرُ الْمُقْرِضُ]]`
},
{
  pageNumber: 398,
  text: `[[arabic: عَلَی الْقَبُولِ کَذَا فِی مُخْتَار الفَتَاویٰ.وَیَجُوزُ اِسْتَقرَاضُ الذَّہَبِ وَالْفِضَّۃِ وَزَنًا وَلَا یَجُوْزُ عَدَدًا کَذَا فِی التَّتَارخَانِیَۃِ ]]‘‘۔
ترجمہ:’’اگر کسی نے دوسرے شخص سے گندم قرض لی ،تو اس کا نرخ بدل جانے پر بھی اتنی ہی(وزن کی مقدار)دینا ہوگی اور قرض خواہ کو اس کے قبول کرنے پر مجبورکیاجائے گا ، ’’مختار الفتاویٰ ‘‘ میں اسی طرح ہے ۔اور سونے اور چاندی کا وزن کے ساتھ ادھار لین دین جائز ہے، گن کر جائز نہیں ،’’تاتارخانیہ ‘‘ میں اسی طرح ہے ،(فتاویٰ عالمگیری، جلد 3، ص:202)‘‘۔اس میں یہ شرط ہے کہ عقد کے وقت بائع ثمن پر یا مشتری مبیع پر قبضہ کرلے۔
[[heading: غنی کا قرض کی ادائی میں تاخیر کرنا مذموم ہے ]]
سوال:
	 آٹھ سال پہلے زید نے بکر سے دس تولے سونا ادھار لیا اور جلد ازجلد واپس کر نے کاوعدہ کیا ۔زید نے بکرکے دس تولے میں سے کچھ واپس کردیا ہے ، زید غنی ہے اور سونا واپس کرسکتاہے ،لیکن بقیہ سونا واپس کرنے میں مسلسل ٹال مٹول کررہاہے ۔اس کے اس عمل پر کیاحکم لگے گا ؟،(عبدالرحیم ، کورنگی)۔
جواب:
	مالدار شخص کا قرض کی ادائیگی میں تاخیر کرناقابل مذمت فعل ہے ،اس میں اختلاف ہے کہ جو شخص عمداً تاخیر کرے ،اس کا یہ فعل گناہ کبیرہ ہے  یا نہیں؟، لیکن اگر وہ باربار اس طرح کرے تو فاسق قراردیاجائے گا ۔حدیث پاک میں ہے :
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ رَضِیَ اللّٰہُ عَنْہُ:أَنَّ رَسُوْلَ اللّٰہِ ﷺ قَالَ:مَطْلُ الغَنِیِّ ظُلْمٌ]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: غنی کا (قرض کی ادائیگی میں) تاخیر کرنا ظلم ہے ،(صحیح بخاری:2287)‘‘۔
	امام بخاری نے اپنی صحیح میں باب باندھا:’’[[arabic: لِصَاحِبِ الْحَقِّ مَقَالٌ]]‘‘ (جس کا حق ہوتاہے ،اس کو تقاضا کرنے میں سختی کی گنجائش ہوتی ہے )اس کے تحت لکھا: `
},
{
  pageNumber: 399,
  text: `’’[[arabic: وَیُذْکَرُ عَنِ النَّبِیِّ ﷺلَیُّ الْوَاجِدِ یُحِلُّ عُقُوْبَتَہٗ وَعِرْضَہٗ قَالَ سُفْیَانُ:عِرْضُہٗ یَقُوْلُ:مَطَلْتَنِیْ وَعُقُوْبَتُہُ الْحَبْسُ ]]‘‘۔
ترجمہ:’’ اورنبی صلی اللہ علیہ وسلم سے روایت ہے : جس کے پاس قرض اداکرنے کی گنجائش ہو ،اس کا تاخیر کرنا اس کی سزا اور اس کی عزت کو حلال کردیتاہے ،عزت کو حلال کرنا یہ ہے کہ قرض خواہ کہے: تم مجھ سے ٹال مٹول کررہے ہو اور اس کی سزا اس کو قید کرنا ہے ‘‘۔
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ رَضِیَ اللّٰہُ عَنْہُ:أَتَی النَّبِیَّ ﷺرَجُلٌ یَتَقَاضَاہٗ،فَاَغْلَظَ لَہٗ،فَہَمَّ بِہٖ أَصْحَابُہٗ،فَقَالَ:دَعُوْہُ فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالًا]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: نبی صلی اللہ علیہ وسلم سے ایک شخص نے اپنے قرض کا تقاضا کیا اور اس نے سختی سے بات کی ،تو آپ صلی اللہ علیہ وسلم کے اصحاب نے اس (کو مارنے یا ڈانٹنے )کا ارادہ کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس کو چھوڑدو ،کیونکہ حق دار کو سختی سے بات کرنے کی اجازت ہوتی ہے ،(صحیح بخاری:2401)‘‘۔
	اگر کوئی شخص ادائے قرض کی نیت کرلے تو اُسے تائیدِ غیبی حاصل ہوتی ہے اور اللہ تعالیٰ قرض کی ادائیگی میں آسانی فرمادیتاہے :
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ رَضِیَ اللّٰہُ عَنْہُ عَنِ النَّبِیِّ ﷺقَالَ:مَنْ أَخَذَ أَمْوَالَ النَّاسِ یُرِیْدُ أَدَاءَہَا  أَدَّی اللّٰہُ عَنْہُ، وَمَنْ أَخَذَ یُرِیْدُ إِتْلاَفَہَا اَتْلَفَہُ اللّٰہُ]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہرضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے لوگوں سے مال لیا اوروہ ان کو اداکرنے کا ارادہ رکھتاہے تو اللہ تعالیٰ اس کی طرف سے (ان اموال کو) اداکرنے کے اسباب مقدر فرمادے گا اور جولوگوں کے مال(قرض کے طورپر ) لے کر ان کو تلف کرنے کا ارادہ رکھتا ہے تو اللہ تعالیٰ اُس کو تلف کردے گا ،(صحیح بخاری: 2387)‘‘۔
	ضرورت کے بغیر قرض لینا توکوئی پسندیدہ روش نہیں ہے ،لیکن بعض اوقات انسان حالات کے ہاتھوں مجبور ہوکر ناگزیر طورپر قرض لیتا ہے، تو اسے چاہیے کہ وسائل دستیاب`
},
{
  pageNumber: 400,
  text: `ہوتے ہی جتنی جلد ی ممکن ہو ،اس قرض سے چھٹکارا حاصل کرے اور جب تک وسائل دستیاب نہ ہوں توقرض خواہ سے مہلت مانگے اورجو مقروض شخص قرض کی ادائی کا ارادہ کرتاہے ،اللہ تعالیٰ اس کے لیے اسباب پیدافرماتاہے ۔ اگر کوئی قرض لیتاہے اور بروقت ادائیگی کی نیت بھی ہے توقرض لینا مذموم نہیں ہے۔ رسول اللہ صلی اللہ علیہ وسلم اس لیے قرض سے پناہ مانگا کرتے تھے کہ کہیں ایسانہ ہو کہ بروقت ادائیگی کا اہتمام نہ ہوسکے ، صحیح بخاری کی حدیث میں ہے :
 ’’[[arabic: عَنْ عُرْوَۃَ أَنَّ عَائِشَۃَ  رَضِیَ اللّٰہُ عَنْہَا،أَخْبَرَتْہٗ أَنَّ رَسُوْلَ اللّٰہِ ﷺ کَانَ یَدْعُوْ فِی الصَّلاَۃِ وَیَقُوْلُ:اَللّٰہُمَّ إِنِّی أَعُوْذُ بِکَ مِنَ الْمَاْثَمِ وَالْمَغْرَمِ، فَقَالَ لَہٗ قَائِلٌ:مَا أَکْثَرَ مَا تَسْتَعِیْذُ یَا رَسُوْلَ اللّٰہِ مِنَ الْمَغْرَمِ، قَالَ:إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَکَذَبَ وَوَعَدَ فَاَخْلَفَ]]‘‘۔
ترجمہ:’’حضرت عائشہ رضی اللہ عنہا بیان کرتی ہیں:رسول اللہ صلی اللہ علیہ وسلم نماز میں دعا مانگتے تھے اور (تعلیمِ اُمّت کے لیے )اللہ تعالیٰ کی بارگاہ میں عرض کرتے: اے اللہ! میں قرض اور گناہ سے تیری پناہ میں آتا ہوں، تو ایک شخص نے عرض کی: یارسول اللہ! آپ قرض سے بہت زیادہ پناہ طلب کرتے ہیں،آپ صلی اللہ علیہ وسلم نے فرمایا: کوئی شخص جب مقروض ہوتا ہے تو وہ بات کرتا ہے تو جھوٹ بولتا ہے اور (قرض ادا کرنے کا)وعدہ کرتا ہے تو اس کی خلاف ورزی کرتا ہے، (صحیح البخاری:2397)‘‘۔

[[heading: سونے کا ادھار لین دین ]]
سوال:
	سونا ادھار لینا جائز ہے یا نہیں ؟،(عبدالرحیم ،کورنگی)۔
جواب:
	سونے کا ادھار لین دین جائز ہے ،لیکن جس مقدار میں قرض لیا گیا اتنی ہی مقدار واپس کرنا از روئے شریعت لازم ہے، اس میں سونے کی قیمت کے اتار چڑھاؤ کا کوئی`
},
{
  pageNumber: 401,
  text: `اعتبار نہیں، سونے کی مقدار کا اعتبار ہوگا۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَیَجُوْزُ اِسْتَقرَاضُ الذَّہَبِ وَالْفِضَّۃِ وَزَنًا وَلَا یَجُوْزُ عَدَدًا کَذَا فِی التَّتَارخَانِیَۃِ ]]‘‘۔
ترجمہ:’’اور سونے اور چاندی کو وزن کے ساتھ قرض لینا دینا جائز ہے ، گن کر جائز نہیں ، ’’تاتارخانیہ ‘‘ میں اسی طرح ہے ، (فتاویٰ عالمگیری ،جلد3،ص: 202) ‘‘ ۔ 
[[heading: قرض کی واپسی ]]
سوال:
	ہماری اللہ تعالی سے دعا ہے : آپ اور آپ کے اہل وعیال کو اللہ تعالی صحت، تندرستی اور سلامتی عطا فرمائے اور آپ کے علم سے مسلمانوں کو مستفید کرے، آپ کی خدمت میں ایک سوال ہے،برائے مہربانی دین کی روشنی میں ہماری رہنمائی فرمائیں اور ہماری مشکل دور فرمائیں،اللہ آپ کو جزائے خیر عطا فرمائے۔
	آج سے تقریباً چھ سال پہلے محترمہ روبینہ آفتاب (جو کہ کینیڈا میں مقیم ہیں)نے محمد نذیر ملک (جو کہ پچھلی کئی دہائیوں سے سعودی عرب میں مقیم ہیں)،کو ٹیلیفون کیا کہ وہ اپنے کریڈٹ کارڈ کے بلز اور ان کے اوپر سود کی رقم کی ادائیگیوں میں پھنسی ہوئی ہیں اور اس مصیبت سے چھٹکارا پانے کے لیے انہوں نے نذیر ملک صاحب سے تیس ہزار کینیڈین ڈالرقرض کے طور پر مانگے اور ساتھ ہی یہ بھی کہا کہ وہ ایک سال میں یہ رقم واپس کر دیں گی۔ اس زمانے میں سعودی ریال کی شرحِ مبادلہ ایک کینیڈین ڈالر کے بدلے میں 3.864تھی۔ محمد نذیر ملک نے 115,992سعودی ریال کو اس وقت کے ریٹ کے مطابق روبینہ آفتاب کے اکائونٹ میں منتقل کیے اور وہ تیس ہزار کینیڈین ڈالر کی صورت میں اُن کو مل گئے ، پیسے بھجوانے کی تاریخ 17دسمبر 2012 تھی، اس کی رسید بھی موجود ہے۔
	ایک سال یا اس سے کچھ زیادہ عرصہ گزر جانے کے بعد روبینہ آفتاب نے نذیر ملک کو`
},
{
  pageNumber: 402,
  text: `دوبارہ سعودیہ میں فون کیا اور کہا کہ ان کے بیٹے کی عنقریب شادی ہونے والی ہے، اس لیے وہ اس پیسے کو اپنے گھر کی بیسمنٹ کی مرمت میں استعمال کر رہی ہیں، پھر کچھ عرصے بعد انہوں نے کہا : میرے پاس ابھی پیسے نہیں ہیں ،لیکن جیسے ہی پاکستان میں موجود خاندانی وراثت والا گھر بکے ،آپ اس میں سے میرے پیسے کاٹ لیں۔اس بات کو آج تقریباً چھ سال گزر چکے ہیں،بالآخر وہ گھر بک گیا ہے۔ ان چھ سالوں میں ریال کی شرحِ مبادلہ  تقریباً وہی ہے ،جبکہ کینیڈین ڈالر کی شرحِ مبادلہ گر چکی ہے ،یعنی وہ devalueہوچکا ہے، اسی طرح پاکستانی روپیہ کا ریٹ بھی گر چکا ہے۔ نذیر ملک نے روبینہ آفتاب سے تقاضا کیا کہ وہ انہیں قرض ریال کی صورت میں واپس کردیں یا ریال کی موجودہ شرحِ مبادلہ کے مطابق انہیں کینیڈین ڈالر یا پاکستانی روپے دے دیں۔اس کے برعکس روبینہ آفتاب کہتی ہیں : ریال سے میرا کوئی تعلق نہیں ہے، میں کینیڈین ڈالر کی موجودہ شرحِ مبادلہ کے مطابق پاکستانی روپے دوں گی ،اس صورت میں نذیر ملک صاحب کا نقصان ہورہا ہے۔ پس سوال یہ ہے کہ اس مسئلے کا شرعی حل کیا ہے ، آیا نذیر ملک صاحب بطورِ قرض دیے گئے سعودی ریال کا مطالبہ کرنے میں حق بجانب ہیں یا روبینہ آفتاب صاحبہ کا موقف درست ہے ،ہم آپ کی توجہ اور قیمتی وقت کے بیحد شکرگزار ہیں،(ڈاکٹر شہرام ملک،جانسن سٹی، امریکہ)۔
جواب: 
	آپ کے بیان کے مطابق محمد نذیر ملک صاحب نے سعودی عرب سے سعودی ریال میں محترمہ روبینہ آفتاب کو رقم دی جو اُن کو کینیڈین ڈالرز کی صورت میں ملی۔لہٰذا انہوں نے جتنے سعودی ریال دیے ،اُن کی شرحِ مبادلہ بعد میں کم ہوگئی ہو یا زیادہ ،وہ اتنے ریال کے حق دار ہیں اور محترمہ روبینہ آفتاب کو اُتنی مقدار میں سعودی ریال اُن کو واپس کرنے چاہییں۔ کسی نے احسان کیا ہو تو اُس کے ساتھ اچھا سلوک کرنا چاہیے ، ایسے ہی تلخ تجربات کی وجہ سے لوگ ضرورت کے وقت دوسروں کو قرض دینے سے ہاتھ کھینچ لیتے ہیں،جبکہ رسول اللہ صلی اللہ علیہ وسلم کاشِعار یہ تھا: 
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ رَضِیَ اللّٰہُ عَنْہُ:أَنَّ رَجُلًا تَقَاضٰی رَسُوْلَ اللّٰہِ ﷺ فَاَغْلَظَ لَہٗ فَہَمَّ بِہٖ]]`
},
{
  pageNumber: 403,
  text: `[[arabic: أَصْحَابُہٗ، فَقَالَ:دَعُوْہٗ، فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالًا وَاشْتَرُوْا لَہٗ بَعِیْرًا فَاَعْطُوہٗ إِیَّاہٗ وَقَالُوْا:لَا نَجِدُ إِلَّا أَفْضَلَ مِنْ سِنِّہٖ، قَالَ:اِشْتَرُوْہٗ فَاَعْطُوْہٗ إِیَّاہٗ، فَإِنَّ خَیْرَکُمْ أَحْسَنُکُمْ قَضَاءً]]‘‘۔
ترجمہ: حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے سختی کے ساتھ( اپنے قرض کا) تقاضا کیا، اس پر آپ صلی اللہ علیہ وسلم کے اصحاب نے اُس (کوڈانٹنے یا مارنے کا )ارادہ کیا ،آپ صلی اللہ علیہ وسلم نے فرمایا: اس کو چھوڑ دو، کیونکہ جس کا حق ہوتا ہے ،اس کو بات کرنے گنجائش ہوتی ہے ،اس کے لیے ایک اونٹ خرید کر اس کو دے دو،انہوں نے عرض کی: (ہمیں اُس جیسا اونٹ نہیں مل رہا، بلکہ )اس سے بہتر مل رہا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا:وہی خرید کر اس کو دے دو، کیونکہ تم میں سے بہترین شخص وہ ہے جو قرض اچھی طرح ادا کرے، (صحیح البخاری:2390)‘‘۔ اس سے محدثین کرام وفقہائے امت نے یہ مسئلہ اخذ کیا ہے کہ اگر کوئی مقروض قرض کی واپسی کے وقت تبرُّعاً کچھ زائد دے دے تو یہ جائز ہے بلکہ آپ صلی اللہ علیہ وسلم نے اس کی تحسین فرمائی ، بشرطیکہ یہ زیادتی نہ پہلے سے طے شدہ(Conditional) ہو اور نہ ہی معہود (Understood)ہو۔ معہود ہونے کے معنی یہ ہیں کہ کسی کو بار بار کا تجربہ ہو کہ یہ شخص جب بھی قرض لیتا ہے ،کچھ بڑھا کر دیتا ہے اور اسی اضافے کی امید پر وہ اُسے قرض دے،تو ان دو صورتوں میں یہ زیادتی رِبا ہے اور حرام ہے ،ورنہ نبی کریم صلی اللہ علیہ وسلم نے اس کی تحسین فرمائی ہے ۔
	البتہ اگرمحمد نذیر ملک صاحب نے بازار سے کینیڈین ڈالرز خرید کر روبینہ آفتاب کو بھیجے ہوں تو پھر وہ کینیڈین ڈالرز ہی کا مطالبہ کرسکتے ہیں ۔بہتر یہ ہے کہ قرض کے لین دین کے وقت لوگ یا تو سونے کو معیار بنالیں یا کسی مُستحکم کرنسی کو معیار بنا لیں اور طے کرلیں کہ قرض کی واپسی اتنی مقدار سونے یا ڈالریا یورو یا آسٹریلین پائونڈ یا ریال میں ہوگی تاکہ بعد میں جہالت وجہِ نزاع نہ بنے۔میں نے سنا ہے : پاکستان کے قبائلی علاقے میں جب لوگ قرض کا لین دین کرتے ہیں تو وہ دیارکی لکڑی کو مکعب فٹ (Cubic Foot)کے اعتبار سے معیار بنالیتے ہیں ،واللہ اعلم بالصواب۔ہمارے ہاں بہت سی چیزوں کو لوگ معاملہ کرتے`
},
{
  pageNumber: 404,
  text: `وقت مُبہم (Ambiguous) چھوڑدیتے ہیں اور پھر اس پر تنازعات پیدا ہوتے ہیں ، جیسے نکاح کے موقع پر جو تحائف یا زیورات لڑکے والوں کی طرف سے لڑکی کو اور لڑکی والوں کی طرف سے لڑکے کو ملتے ہیں ، اس کے بارے میں نکاح نامے میں یہ نہیں لکھتے کہ یہ کس کی مِلک ہوں گے اور بعد میں تفریق کی صورت میں تنازعات کا سامنا کرنا پڑتا ہے۔
[[heading: قرعہ اندازی کے ذریعے کسی ایک فرد کو کمیٹی کی رقم دینے کا حکم ]]
سوال:
	 ہم دس لوگ مل کر آپس میں کمیٹی مبلغ دس ہزار روپے کی ڈالتے ہیں، اُس کے بعد ہر ماہ کے شروع میںبذریعہ قر عہ اندازی جس کا نام نکل آتا ہے، اُسے وہ رقم مبلغ (ایک لاکھ روپے) دے دی جاتی ہے اس ضمن میں معلوم کرنا تھا کہ آیا یہ کمیٹی ڈالنا جائز ہے یا نہیں،(حفیظ اللہ ،کوئٹہ)۔
جواب: 
	قرعہ اندازی قرآن کریم سے بھی ثابت ہے ،ارشاد باری تعالیٰ ہے : 
’’[[arabic: وَمَا كُنْتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَامَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنْتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ]]‘‘۔
ترجمہ:’’اور آپ اس وقت ان کے پاس نہ تھے ،جب وہ (قرعہ اندازی کے لیے) اپنے قلموں کو ڈال رہے تھے کہ ان میں سے کون مریم کی کفالت کرے گا اور آپ ان کے پاس نہ تھے ،جب وہ(اس مسئلے میں باہم) جھگڑ رہے تھے ،(آل عمران :44)‘‘۔
اسی طرح ایک حدیث پاک میں ہے: 
’’[[arabic: إِنَّ رَجُلًا أَعْتَقَ سِتَّۃَ مَمْلُوْکِینَ لَہٗ عِنْدَ مَوْتِہٖ،لَمْ یَکُنْ لَہٗ مَالٌ غَیْرَہُمْ، فَدَعَا بِہِمْ رَسُوْلُ اللّٰہِ ﷺ، فَجَزَّأَہُمْ أَثْلَاثًا، ثُمَّ أَقْرَعَ بَیْنَہُمْ، فَاَعْتَقَ اثْنَیْنِ، وَأَرَقَّ أَرْبَعَۃً، وَقَالَ لَہٗ قَوْلًا شَدِیْدًا]]‘‘۔
ترجمہ:’’ ایک شخص نے اپنی وفات کے وقت اپنے چھ غلاموں کو آزادکردیا ،ان (غلاموں )`
},
{
  pageNumber: 405,
  text: `کے علاوہ اس کا کوئی مال نہیں تھا ،رسول اللہ صلی اللہ علیہ وسلم نے ان کو بلایا اور دو دو افراد پر مشتمل تین گروپوں میں تقسیم فرمادیا ،پھر آپ نے ان تینوں گروپوں میں قرعہ اندازی فرمائی ،جن دو کے نام کا قرعہ نکلا ،اُنہیں آزاد کردیا اور باقی چار کو( ترکے کے طورپر )غلام رہنے دیا ،آپ صلی اللہ علیہ وسلم نے اس شخص کے بارے میں سخت کلمات فرمائے ،(صحیح مسلم:1668)‘‘۔یعنی آپ صلی اللہ علیہ وسلم نے اس کے اس عمل کو پسند نہیں فرمایا ،کیونکہ مرض وفات میں اپنے مال میں تصرُّف وصیت کے درجے میں ہوتا ہے اور وصیت صرف تہائی مال تک جائز ہے ۔ اس حدیث مبارک کی تشریح میں فقہی مذاہب ہیں ، جو اس وقت ہمارا موضوع بحث نہیں ہے ۔ لیکن مندرجہ بالا آیت مبارکہ اور حدیث مبارک اس امر پر دلالت کرتی ہیں کہ کسی ایسی صورت حال میں جہاں سب کا حق برابر ہو اور کسی ایک کی بھی حق تلفی نہ ہوتی ہو ،تو ترجیح کے تعین کے لیے قرعہ اندازی جائز ہے۔ پس آپ نے جو صورتِ حال بیان کی ہے ،اس میں کمیٹی کے تمام شرکاء کا حق برابر ہے، نہ کسی کا حق تلف ہوتا ہے ،نہ کسی کی رقم جزوی یا کلی طورپر ڈوبتی ہے ،بلکہ سب کا مال محفوظ اور مضمون(Guaranteed) ہے ،بس فقط سب کی رضامندی سے قرعہ اندازی کی جاتی ہے کہ کسے پہلے ملے گا اور کسے بعدمیں ، اس لیے یہ جائز ہے۔ جس ترتیب سے قرعہ اندازی میں نام آئے گا ،جتنی قسطیں وہ اداکرچکاہوگا ،وہ اس کا اپنا مال ہے اور باقی اقساط اس پر قرض ہوں گی اور جس کا نام سب سے آخر میں آئے ،وہ سب اس کا اپنا مال ہے۔ہاں!یہ شرط لازم ہے کہ جن کے نام بالترتیب شروع میں آئیں ، وہ اپنی بقیہ اقساط پابندی سے اداکریں کہ یہ رقم اُن پر قرض ہے اور ادائی کے لیے اس کو یہ مہلت دی گئی ہے ۔
[[heading: ٹوکن والے مال کی خریدوفروخت ]]
سوال:
	 میری کلر کی دکان ہے اور میں حلال روزی کمانا چاہتا ہوں،لیکن مجھے اس میں شبہ ہے۔کلر یا پینٹ بنانے والی اکثرکمپنیاں پینٹ کے ڈبوں میں مختلف مالیت کے ٹوکن ڈال`
},
{
  pageNumber: 406,
  text: `دیتی ہیں اور ڈبوں پر ٹوکن کی کم مالیت لکھ دیتی ہیں اور اصل قیمت چھپا دیتی ہیں ۔ یہ اس لیے کرتی ہیں کہ گاہک ؍خریدار کو پتا نہ چلے اور پیسے کاریگر کو مل جائیں، دوکان والے اکثرایسا ہی کرتے ہیں۔ اس لیے کہ اگر کاریگرخوش ہوگا تو مزید بزنس یا گا ہک لے آئیگا اور کاریگر بھی صاف دکان والے کو کہتا ہے کہ اگرآپ نے ٹوکن کی صحیح قیمت گاہک کو بتائی تو ہم آپ کا کلر؍پینٹ نہیں اٹھائیں گے اور پھر ایسا ہی ہوتا ہے کہ وہ گاہک بھی اس کاریگر کی بات مانتا ہے اور دوکان والے کو نقصان ہی ہوتا ہے.پھر اکثر کاریگر ٹوکن مالک کو بغیر بتائے دوکان والے کو دے کر اس کے پیسے لے لیتے ہیں اور کہتے ہیں کہ ہمارے ہیں اور یہی مارکیٹ میں اکثر ہو رہا ہے۔1۔کیا ٹوکن کے پیسے پینٹر؍کاریگر کو لیناجائز ہے ؟۔2۔کیا دوکان والا ہر گاہک کو ٹوکن کی اصل مالیت بتانے کا پابند ہے یا نہیں کیونکہ ایک تو ڈبوں پر مالیت لکھی ہوتی ہے، دوسرا یہ کہ کمپنی جان بوجھ کر اصل قیمت چھپاتی ہے.سوال3:کچھ کمپنیاں ایسی ہیں جو ٹوکن تو نہیں ڈالتی اور گاہک اس لیے لیتے ہیں کہ چیز اچھی ہوگی لیکن پھر وہی کاریگر کا مسئلہ بیچ آ جاتا ہے، اس لیے دوکاندار اس ڈبے کو گاہک کو مہنگا بیچ کر وہی ٹوکن کی قیمت کاریگر کو دے دیتا ہے.اب ان حالات میں کیا کیا جائے؟رہنمائی فرمائیں، (شمس عمرانی،کراچی)۔

جواب:
	آپ نے سوال میں جو تفصیل بیان کی ہے ، اس سے معلوم ہوتاہے کہ بعض سیل پیک مصنوعات کے ڈبوں میں ٹوکن رکھے جاتے ہیں،یہ لوگوں کی بشری کمزوریوں سے فائدہ اٹھا نے کا حربہ ہے۔ تاہم اگر مال کی مقدار اورمعیار درست ہے ،اسے پیکٹ یا ڈبے پر بیان کیے گئے فارمولے کے مطابق بنایاگیاہے اور کوئی خیانت نہیں کی گئی تو ڈبے یا پیکٹ کے اندر انعامی ٹوکن رکھنے سے کوئی شرعی خرابی لازم نہیں آتی ،بشرطیکہ جس کے نام نکلے ، اسے انعام دیدیاجائے اور ظاہر ہے یہ انعام اس کا حق ہے ،جس کے پیسے سے یہ مال خریدا گیا ہے، ہاں !اگر وہ خود کاریگر سے کہے : تم رکھ لو توٹھیک ہے۔ بائع اور مشتری کے درمیان جس قیمت پر اتفاق ہوجائے ،اس پرشرعاً بیع جائز ہوتی ہے ۔ لیکن آپ کی بیان کردہ`
},
{
  pageNumber: 407,
  text: `مثالوں میں’’ کاریگر یا پینٹر ‘‘ایک تیسرا فریق ہے اور اصل خریدار سے بالا دکاندار اورکاریگر میں کمیشن کا ایک غیر عَلانیہ معاہدہ ہوتاہے ،جس سے اصل خریدار کو بے خبر رکھاجاتاہے ،یہ غَررہے،اسے ہم انگریزی میں Deceptionاور Betrayسے تعبیر کرسکتے ہیں ۔ مغربی ممالک میں مصنوعات پر قیمتیں درج ہوتی ہیں اور اگر کسی پروڈکٹ پر کمیشن یا ڈسکاؤنٹ دیناہوتو وہ بھی Cash Memoپر درج ہوتاہے ،یہاں بھی بعض بڑے ڈیپارٹمنٹل یا سپراسٹورشاید ایساہی کرتے ہیں۔لیکن چونکہ ہماری مارکیٹ کی معیشت بحیثیت مجموعی دستاویز ی (Documented)نہیں ہوتی ، مصنوعات پر قیمتیں درج نہیں ہوتیں ،اس لیے اس طرح کے چور دروازے کھلے رہتے ہیں ۔مصنوعات پر قیمتیں درج نہ ہونے کے سبب بارگیننگ (یعنی بھاؤ تاؤ) کی گنجائش رہتی ہے ،جو گاہک جس طرح پھنس جائے۔ اس طرح کے ضابطے حکومت ہی بناسکتی ہے کہ ہر قابل ذکر پروڈکٹ پر اس کی قیمت درج ہو اورکمیشن یا ڈسکاؤنٹ کا فارمولا بھی واضح ہو ۔
	ہم نے دکان پر اپنے عالم کو بھیج کر معلومات حاصل کیں ، ان کو دکاندار نے جومعلومات فراہم کیں ،وہ یہ ہیں: پہلے صرف دیسی کمپنیاں ڈبوں میں ٹوکن رکھتی تھیں ،پھر ملٹی نیشنل کمپنیوں نے عدالت سے رجوع کیا تو عدالت نے تمام کمپنیوں کو ٹوکن کی مالیت ڈبوں پر لکھنے کا پابندکیا ، اس کے بعد ایک آدھ کمپنی کے سوا ملٹی نیشنل کمپنیوں نے بھی ٹوکن رکھنا شروع کردیے،لیکن اب ہوتایہ ہے کہ: مثلاً ڈبے پر سو روپے لکھاہے ،تو اندر سو سوروپے کے دو ٹوکن نکلیں۔ دکاندار کا اس میں کردار یہ ہے کہ جو شخص ٹوکن لے کر آئے ،خواہ کاریگر ہویا مالک یعنی اصل خریدار،دکاندار اس کو ٹوکن پر درج رقم اداکردیتاہے اور دکاندار اس ادائیگی پر کمپنی سے سروس چارجز لیتاہے ،جس طرح بجلی ،گیس اور ٹیلیفون کے یوٹیلٹی بل بنک وصول کرتے ہیں اور اُن اداروں سے طے شدہ سروس چارجز لے لیتے ہیں،اس صورت میں دکاندار کا کاروبار شرعاً حلال ہے ۔
	پینٹر یا کاریگر کو چاہیے کہ وہ اصل خریدار یا مالک کو بتادے کہ اس میں ٹوکن ہے اور آپ مجھے اجازت دیدیں کہ ٹوکن کے پیسے لے کر میں رکھ لوں ،اگر مالک اجازت`
},
{
  pageNumber: 408,
  text: `دیدے،تواس کے لیے یہ جائز ہوجائے گا اور اگر وہ اصل خریدار یامالک سے چھپاکر خود وصول کرلیتاہے تویہ خیانت ہے اور مالِ حرام ہے ۔اگر مالک کہے کہ میں ٹوکن کے برابر رقم تمہاری اُجرت سے کاٹوں گاتویہ جائز ہے، لیکن اس سے سیلز پروموشن کے لیے کمپنی کا مقصد فوت ہوجائے گا ۔اب اس کا دوسرا پہلو یہ ہے کہ کمپنی ٹوکن کی مالیت کے برابر مال کی کوالٹی (معیار) یا مقدار میں کمی کرتی ہے ،تویہ کمپنی کی خیانت ہے اور فعلِ حرام ہے ۔ اگر کمپنی مال کی مقدار اور معیار میں کمی نہیں کرتی بلکہ اپنے منافع میں سے یہ رعایت دیتی ہے ،تو اس میں شرعاً کوئی خرابی نہیں ہے، لیکن یہ کاریگروں کی بشری کمزوریوں سے فائدہ اٹھا کر اپنے کاروبار کو بڑھاوا دینا ہے تویہ اخلاقاً درست نہیں ہے ،کیونکہ اس سے اخلاقی کمزوریاں فروغ پاتی ہیں ۔ 
	ایک صورت یہ ہے کہ ٹوکن وغیرہ کچھ نہیں ہے ،بس دکاندار کاریگرکا خفیہ معاہدہ  ہوتاہے کہ تم مجھ سے مال لو اور میں تمہیں فلاں مال پراتنے فیصد الگ سے دوں گا اور وہ مال معیار اور مقدار کے حساب سے ناقص ہوتاہے ،یہ کمیشن کاریگر کے لیے ناجائز ہے، کیونکہ اس کا نقصان اصل خریدار کو پہنچتا ہے اور دکاندار کا کاریگر کے ساتھ یہ خفیہ معاہدہ بھی ناجائز ہے ، کیونکہ اللہ تعالیٰ کا حکم تویہ ہے :’’ [[arabic: وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَى ۖ وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ]]‘‘۔
ترجمہ:’’ اورنیکی کے کاموں میں ایک دوسرے کے ساتھ تعاون کرو اور گناہ (اور حدِّشرع سے) تجاوز کے کاموں میں ایک دوسرے کے ساتھ تعاون نہ کرو، (المائدہ:2)‘‘ ۔ اور یہاں کاریگر اور دکاندار خیانت کرنے میں ایک دوسرے کے معاون بن رہے ہیں۔
[[heading: عاقدین کا باہمی رضامندی سے بیع کو فسخ کرنا]]
سوال:
	عامرنے اپنا مکان سلیم کوتین سال کی قسطوں پر ساڑھے چار لاکھ روپے میں فروخت`
},
{
  pageNumber: 409,
  text: `کیا ، سلیم نے ایک لاکھ نواسی ہزار روپے قسطوں میں اداکیے ، دولاکھ اکسٹھ ہزار روپے اس کے ذمے واجب الاداہیں ،چھ سال کا عرصہ گزر چکا ،سلیم نے مزید کوئی رقم ادانہیں کی ۔اب عامرنے سلیم سے یہ طے کیاہے کہ یہ مکان مجھے فروخت کردو ۔اب دونوں اس بات پر رضامند ہیں کہ عامر سلیم کو ایک لاکھ نواسی ہزار روپے واپس کردے اور سلیم عامر کو مکان کا قبضہ دے دے گا ،کیا یہ سودا جائز ہے ؟،(عامر ،کورنگی)۔
جواب:
	فریقین کے درمیان کسی عقد کے ختم کرنے یا دوسرے کے کہنے پر مبیع یا ثمن لوٹادینا اور دوسرے کا لے لینا ،شرعی اصطلاح میں ’’اقالہ‘‘ کہلاتا ہے، حدیث پاک میں ہے :
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ،قَالَ:قَالَ رَسُوْلُ اللّٰہِ ﷺ:مَنْ أَقَالَ مُسْلِمًا أَقَالَہُ اللّٰہُ عَثْرَتَہُ]]‘‘۔
ترجمہ:’’ حضرت ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے کسی مسلمان سے اقالہ کیا،قیامت کے دن اللہ تعالیٰ اُس کی لغزش دفع فرمادے گا ، (سُنن ابو داؤد:3460)‘‘۔ اقالہ کے معنی ہیں: ’’بائع اور مشتری کا باہمی رضامندی سے بیع کا فسخ کرلینا بایں طور پر کہ بائع مبیع کو واپس لے لے اور مشتری کو ثمن واپس کردے‘‘۔ 
تنویر الابصار مع الدرالمختار میں ہے :
’’[[arabic: فَعَبَّرَ بِالْعَقْدِوَیَصِحُّ بِلَفْظَیْنِ مَاضِیَیْنِ وَہٰذَا رُکْنُہَا أَوَأَحَدُہُمَامُسْتَقْبَلٌ کَاَقِلْنِیْ فَقَالَ أَقَلْتُک]]‘‘۔
ترجمہ:’’اسے عقد سے تعبیر کیا ہے اور یہ ماضی کے دو لفظوں کے ساتھ صحیح ہوتا ہے اور یہی اس کا رکن ہے  یا  دونوں میں سے ایک مستقبل کا صیغہ ہو جیسے ایک نے کہا : تومیرے ساتھ اقالہ کر ،دوسرے نے کہا: میں نے تیرے ساتھ اقالہ کیا ،(حاشیہ ابن عابدین شامی ، جلد15،ص:53،دمشق)‘‘۔
	جو ثمن بیع میں تھا ،اُسی پر یا اُس کی مثل پر اقالہ ہوسکتا ہے ،اگر کم یازیادہ پر اقالہ ہواتو شرط باطل ہے اور اقالہ صحیح ہوگایعنی اتناہی دینا ہوگا جو بیع میں ثمن تھا ۔علامہ برہان الدین ابوالحسن علی بن ابوبکر حنفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: فَإِنْ شَرَطَ أَکْثَرَ مِنْہٗ أَوْ أَقَلَّ فَالشَّرْطُ بَاطِلٌ وَیَرُدُّ مِثْلَ الثَّمَنِ الْاَوَّلِ]]‘‘۔
ترجمہ:’’پس  اگر ثمنِ اول سے زیادہ یا اس سے کم کی شرط لگائی ،تو شرط باطل ہے اور بائع ثمنِ`
},
{
  pageNumber: 410,
  text: `اوّل کا مثل ہی واپس کرے گا ‘‘۔۔مزید لکھتے ہیں:
’’ [[arabic: فَالْإِقَالَۃُ عَلَی الثَّمَنِ الأَوَّل لِتَعَذُّرِالفَسْخِ عَلَی الزِّیَادَۃِ،إِذ رَفْعُ مَا لَمْ یَکُنْ ثَابِتًا مُحَالٌ فَیَبْطُلُ الشَّرْطُ،لاَِنَّ الْإِقَالَۃَ لَا تَبْطُلُ بِالشُّرُوْطِ الْفَاسِدَۃِ،بِخِلَافِ الْبَیْعِ]]‘‘۔
ترجمہ:’’پس اقالہ ثمنِ اوّل پرہی ہوگا ،کیونکہ زیادتی پر بیع کا فسخ کرنا مُتعذّر ہے کیونکہ اقالہ شروطِ فاسدہ سے باطل نہیں ہوتا ،بیع کا معاملہ اس کے برعکس ہے (کہ وہ شروطِ فاسدہ سے باطل ہوجاتی ہے )،(ہدایہ ،جلد5،ص:149)‘‘۔پس صورتِ مسئولہ میں آپ سلیم کو اُس سے وصول کی ہوئی رقم ایک لاکھ نواسی ہزار روپے واپس کردیں اوروہ آپ کومکان کا قبضہ دیدے ، تویہ اقالہ (یعنی فسخِ بیع) شرعاً درست ہوگا ۔
[[heading: انعامی رقم ٹیکس کی مد میں اداکرنا ]]
سوال:
	 میں نے پڑھا تھا کہ حکومت کا عوام پر غیر ضروری ٹیکس لگانا حرام ہے اور عوام کا ان ٹیکس سے بچنے کے لیے حیلے بہانے کرنا درست ہے، اگر کوئی  ٹیکسیشن کا ماہر ان کوظلم قرار دے توآج کل اس ظالمانہ ٹیکس سے بچنا ناممکن ہے۔میرا سوال یہ ہے کہ کیا ہم پرائزبونڈ کے انعام سے ملنے والی رقم سے ٹیکس ادا کر سکتے ہیں؟ ، کیونکہ پرائزبونڈ حرام ہیں تو کیا ہم اگر خود پرائزبونڈ کی انعامی رقم استعمال نہ کریں بلکہ حکومت سے ہی لے کرحکومت کو ہی ٹیکس کی مد میں ادا کر دیں تو کیا ایسا کر سکتے ہیں؟(عبدالرؤف،کراچی)۔
جواب:
	 آپ کا یہ نظریہ درست نہیں کہ پرائز بانڈ حرام ہیں، اس لیے اُن پر حاصل ہونے والا انعام ٹیکس کی مَد میں دینا چاہیے ۔ انعامی بانڈز کی خرید وفروخت اور ان پر ملنے والاانعام جائز ہے، بانڈ پر درج قیمت (Face value)پر خرید وفروخت میں تو کسی کا اختلاف نہیں ہے، البتہ اس کی انعامی رقم کے جواز پر علماء کا اختلاف ہے۔ ہمارے علماء اہلسنت`
},
{
  pageNumber: 411,
  text: `وجماعت کے نزدیک یہ انعامی رقم لینا جائز ہے،اس میں حرمت کی کوئی وجہ نہیں ہے۔یہ اختلاف فقہی دلائل کی بنیادپر ہے،یہ مسلکی نوعیت کااصولی یااعتقادی اختلاف نہیں ہے ۔ہر دور کے نئے پیش آنے والے مسائل ’’مجتہَدفیہ‘‘ہوتے ہیں ،یعنی جن پراُس عہد کے اہلِ فتویٰ اور اہلِ علم کو شرعی دلائل کی روشنی میں جواز یا عدم ِ جواز کا حکم لگانا ہوتا ہے۔بعض اوقات علماء کی فقہی آراء اِن کے بارے میں مختلف ہوتی ہیں۔ ایسی صورت میں عام مسلمانوں کو میر امشورہ یہ ہوتا ہے کہ جن علماء کی فقاہت ، اجتہادی اہلیت اور علمی دیانت پر انہیں زیادہ اعتماد ہے، اُن کی رائے پر عمل کریں۔لیکن یہ ترجیح دین داری اور آخرت کی جوابدہی کی بنیاد پر ہونی چاہیے، نہ کہ محض خواہشِ نفس کا اِتّباع کیا جائے۔ان بانڈز کا اجراء حکومتِ پاکستان کرتی ہے، بینک نہیں کرتے ،وہ صرف ان کی خریدوفرخت کے لیے ایجنٹ کا کام کرتے ہیں، اِس میں کوئی سودی معاہدہ بھی شامل نہیں ہے ، نہ مشروط (Conditional)اور نہ معہود (Understood)۔یہ اختلاف ربوٰ کی حرمت میں نہیں ہے، کیونکہ ربوٰ کی حُرمت تو قطعی ہے،بلکہ اس امر میں ہے کہ انعامی بانڈز پر دیا جانا والا انعام سود ہے یا نہیں ۔
	جن علماء نے اسے حرام قرار دیا ، انہوں نے اسے سود اورقمار(Gambling) کہا ہے ۔ ہمارے نزدیک ان کا یہ فتویٰ دلائل کی بنیاد پر درست نہیں ہے۔اس مسئلے پر تفہیم المسائل کی جلد چہارم میں ہم لکھ چکے ہیں اور اگر کسی کو مزید تفصیلی دلائل سے آگہی مطلوب ہو تو علامہ غلام رسول سعیدی کی شرح صحیح مسلم جلد4، ص:111تا126، علامہ مفتی وقار الدین رحمہ اللہ تعالیٰ کی وقار الفتاویٰ، جلداول، ص:226تا 232 اور مفتی رفیق حسنی صاحب کی ’’رفیق الفقہاء‘‘ کا مطالعہ فرمائیں ۔
[[heading: پیشگی ماہانہ کرائے کی واپسی لازم نہیں ہے ]]
سوال:
	 کسی شخص نے مکان کرایہ پر لیا اور عرف کے مطابق ماہانہ کرایہ بھی پیشگی اداکردیا ،اب اگر کسی مجبوری کے سبب کرایہ دار چند دن بعدہی مکان خالی کردے ،مثلاً آٹھ دن بعد مکان خالی کردیا ،تو کیا اب بقیہ22دن کا کرایہ واپس لینے کا حق دار ہے ،(منوراحمد ، ملیر )۔`
},
{
  pageNumber: 412,
  text: `جواب:
	 کرایہ پیشگی اداکرنے کی صورت میں جتنے ماہ کے لیے مکان کرائے پر دیا اتنی مدت کے لیے اجارہ منعقد اور لازم ہوگیا ،لہٰذا کرائے دار یک طرفہ اجارہ ختم نہیں کرسکتا ، یک طرفہ اجارہ ختم کرنے کی صورت میں باقی مدت کے کرائے کی واپسی کا مطالبہ نہیں کرسکتا ۔ 
علامہ نظا م الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: ثُمَّ الْاُجْرَۃُ تَسْتَحِقُّ بِاَحَدِ مَعَانٍ ثَلَاثَۃٍ: إِمَّا بِشَرْطِ التَّعْجِیْلِ أَوْ بِالتَّعْجِیْلِ أَوْ بِاسْتِیْفَاءِ الْمَعْقُوْدِ عَلَیہِ، فَإِذَا وُجِدَ أَحَدُ ہٰذِہِ الْاَشْیَاءِ الثَّلَاثَۃِ فَإِنَّہٗ یَمْلِکُہَا،کَذَا فِی شَرحِ الطَّحَاوِیْ وَکَمَا یَجِبُ الْاَجْرُ بِاِسْتِیْفَاءِ الْمَنَافِعِ یَجِبُ بِالتَّمَکُّنِ مِنْ اِسْتِیْفَاءِ الْمَنَافِعِ إِذَا کَانَتِ الْإِجَارَۃُ صَحِیْحَۃً حَتّٰی اَنَّ الْمُسْتَأجِرَ دَارًا أَوْ حَانُوْتًا مُدَّۃً مَعْلُوًمَۃً وَلَمْ یَسْکُنْ فِیْہَا فِی تِلْکَ الْمُدَّۃِ مَعَ تَمَکُّنِہٖ مِنْ ذٰلِکَ تَجِبُ الْاُجْرَۃُ، کَذَا فِی الْمُحِیْطِ ]]‘‘۔
ترجمہ:’’پھر اُجرت کا استحقاق تین باتوں میں سے کسی کے پائے جانے سے ہوتاہے یا تو تعجیلِ شرط ہو یا تعجیل کرکے اداکردے یا جس منفعت کے لیے اجارہ کیاہے ،وہ منفعت حاصل کرلے ،پس جب ان تین باتوں میں سے کوئی بات پائی گئی تو مُؤجِر(مکان یا دکان کا مالک یعنیLand Lord) اُجرت کا مالک ہوگیا ،جیساکہ ’’شرح الطّحاوی ‘‘ میں ہے ،اور جس طرح منفعت حاصل کرلینے سے اجرت واجب ہوتی ہے ،اسی طرح منفعت حاصل کرنے کی قدرت پائے جانے سے بھی واجب ہوجاتی ہے بشرطیکہ اجارہ صحیح ہو ،حتّٰی کہ اگر کسی شخص نے کوئی دکان یا مکان کسی معلوم مدت کے لیے کرایہ پر لیا ،اس مکان یا دکان میں اس مدت تک نہ رہاحالانکہ وہ اس پر قادر تھا(یعنی کوئی مانع نہ تھا)،وہ رہ سکتاتھا تو کرایہ واجب ہوگا ،’’محیط ‘‘ میں اسی طرح ہے،(فتاویٰ عالمگیری ،جلد4، ص:413)‘‘۔
	پس دریافت کردہ صورت میں کرایہ دار پر پورے مہینے کا کرایہ لازم ہے اور اگر وہ مہینے کے دوران خالی بھی کردے توبقیہ دنوں کا کرایہ واپس لینے کا حق دار نہیں ہے، کیونکہ پورے مہینے کاپیشگی کرایہ دینے کا مطلب ہی یہ ہے کہ اجارہ پورے مہینے کے لیے ہے ۔`
},
{
  pageNumber: 413,
  text: `[[heading: متفرق مسائل]]`
},
{
  pageNumber: 415,
  text: `[[heading: خواب کی تعبیر ]]
سوال:
	میری والدہ دو سال قبل فوت ہوئیں ،وہ کینسر کی مریضہ تھیں اور تکلیف کاٹتے فوت ہوگئی۔ میں ہر روز رات کو سونے سے پہلے اپنی والدہ کے ایصالِ ثواب کے لئے سورۂ فاتحہ، سورۂ بقرہ کے رکوع اور آیت الکرسی اور سورہ ٔملک ، درودپاک اور قل شریف پڑھتا ہوں ۔ اکثر و بیشتر ان کے نام کا صدقہ کھانے کی شکل میں غریبوں کو بانٹتا ہوں یا پیسوں کی شکل میں دیتا رہتا ہوں۔ ابھی ۱۰ محرم والے دن بھی غریبوں کو کھانا کھلایا ۔ کل رات غالباً فجر سے آدھا گھنٹہ قبل خواب میں دیکھا :میری والدہ بیمار نہیںہیں، بالکل ٹھیک ہیں، مجھے اپنے ساتھ لیا، گھر کی گیلری میں لے گئیںاور کرسی پر بیٹھ گئیںاور میرا سر پکڑ کر نیچے کیا، پھر میرے ماتھے پر بوسہ دیا، میرے ہاتھ میں پرانا زَرد چھوٹا سا کاغذ کا ٹکڑا تھا، اس پر سورۂ بقرہ کی آخری تین آیات :’’[[arabic: لِلّٰہِ مَا فِی السَّمٰوٰتِ]]‘‘ لکھی تھیں، خواب کے بعد میرا گمان بن گیا کہ یہ بھی امی کے لیے پڑھوں۔ یاد نہیں کہ انھوں نے اشارہ دیا یا خود سوچ لیا۔ پھر آج صبح میں نے امی کے لیے فجر کی نماز کے بعد وہ آخری تین آیات بھی احتیاطاً پڑھ دی۔پھر کل رات ہی ایک اور خواب دیکھا کہ میں نے گھرمیں ایک مرغی پکڑی اور اسکو ذبح کرنا چاہا لیکن ا س کا سر خود الگ ہوگیا اور خون بھی نہیں نکلا۔بہرحال میں نے فورا اسکے گلے پر چھری پھیری اور دور تک خون کی دھار کو جاتے دیکھا،(محمد طاہر مشتاق ، نئی دہلی، انڈیا)۔
جواب: 
	 آپ نے خواب میںکاغذ کے ٹکڑے پر سورہ بقرہ کی آخری آیات لکھی ہوئی دیکھیں، احادیث میںان آیات کی بڑی فضیلت واردہے ،خواب کی تعبیر کے حوالے سے بھی اس کی برکات مسلم ہیں ،حدیث پاک میں ہے :
’’[[arabic: عَنْ أَبِیْ مَسْعُوْدٍ الْاَنْصَارِیِّ قَالَ:قَالَ رَسُوْلُ اللَّہِ ﷺ:مَنْ قَرَأَ بِالْآیَتَیْنِ مِنْ]]`
},
{
  pageNumber: 416,
  text: `[[arabic: آخِرِ سُورَۃِ الْبَقَرَۃِ فِیْ لَیْلَۃٍ کَفَتَاہُ]]‘‘۔
ترجمہ:’’حضرت ابو مسعود رضی اللہ عنہ بیان کرتے ہیں:رسول اللہﷺ نے فرمایا:جو شخص رات کوسورہ ٔبقرہ کی آخری دو آیات پڑھے گا ،وہ(آیات) اس کو کافی ہوں گی،(صحیح البخاری:500)‘‘۔
	تعبیرالرویا کے مستند عالم علامہ عبدلغنی النابلسی اپنی کتاب میں لکھتے ہیں :
’’[[arabic: (وَمَنْ رَاٰی)اَنَّہٗ قَرَأَ(سُورَۃَ الْبَقَرۃِ)فِی الْمَنَامِ أَوْ شَیْئاًمِّنْہَا أَوْ تُلِیَتْ عَلَیْہِ،قَالَ نَافِعٌ وَابنُ کَثِیرٍ :یُرْزَقُ عِلْماً وَعُمُراً طَوِیْلاً وَصَلَاحًا فِیْ دِیْنِہٖ وَنَجَاۃً فِی وَلَدِہٖ وَوَافَقَہٗ الْکَسَائِی عَلٰی ذٰلِکَ، وَقَالَتْ عَائِشَۃُ رَضِیَ اللّٰہ عَنْہَا:مَنْ تَلَاہَا فِی مَنَامِہٖ أَوْ بَعْضَہَا اِنْتَقَلَ مِنْ مَوْضِعٍ إِلٰی مَوْضِعٍ وَیَکُوْنُ حَظُّہٗ فِی الْمَوْضِعِ الَّذِیْ یَنْتَقِلُ إِلَیْہِ، وَقَالَ ابْنُ فَضَالَۃَ رَحِمَہُ اللّٰہُ تَعَالٰی: إِنْ تَلَاہَا فِی النَّوْمِ إِنْ کَانَ قَاضِیًا قَرُبَتْ مُدَّتُہٗ وَإِنْ کَانَ عَالِماً طَالَ عُمُرُہٗ وَحَسُنَتْ حَالَتُہٗ ،وَقَالَ بَعْضُ الْعُلَمَاءِ:مَنْ قَرَأَ سُوْرَۃَ الْبَقَرَۃِ فَإنَّہٗ یَکُوْنُ جَامِعًا لِلدِّیْنِ مُسَارِعاً إِلٰی کُلِّ ثَوَابٍ وَیَکُوْنُ طَوِیْلَ الْعُمُرِ قَلِیْلَ الشَّرِّ صَابِرًا عَلَی الْاَذٰی]]‘‘۔
ترجمہ:’’اور جس نے خواب میں دیکھا کہ اس نے سور ۂ بقرہ  یا اس کا کوئی حصہ پڑھا یا اس کے سامنے پڑھا گیا،امام نافع اورعلامہ  ابن کثیر نے کہا:اس کو علم،درازیِ عمراور دین کی راستی اور اولاد میں کامیابی نصیب ہوگی اورامام کسائی نے ان کی موافقت کی ہے ۔حضرت عائشہ نے فرمایا :جو سورۂ بقرہ یا اس کے کچھ حصے کو خواب میں تلاوت کرے ،وہ ایک جگہ سے دوسری جگہ منتقل ہوگا اور اس کا حصہ اس جگہ ہوگا جہاں وہ منتقل ہوگا اورا بن فضالہ رحمۃ اللہ علیہ نے کہا:اگر قاضی خواب میں سورۂ بقرہ کی تلاوت کرے اس کی مدت قریب ہوگی اور اگر پڑھنے والا عالم ہے، تو اس کی عمردراز ہوگی اور اس کی حالت اچھی ہوگی اور بعض علماء نے کہا:جس نے سورۂ بقرہ (خواب میں)پڑھی تو وہ دین کا جامع اور ہر ثواب کی طرف جلدی کرنے والا ہوگا اور اس کی عمر طویل ہوگی اس کا شر کم ہو گا اور مصیبتوں پر صبر کرنے والا`
},
{
  pageNumber: 417,
  text: `ہوگا ، (تعطیرالانام:باب السین )‘‘۔
علامہ ابن سیرین رحمۃ اللہ علیہ لکھتے ہیں :
’’[[arabic: وَمن قَرَاَ سُوْرَۃَ الْبَقَرَۃِ فِی مَنَامِہٖ جَمَعَ اللّٰہُ لَہٗ دِیْنَہٗ وَسَارَعَ إِلٰی کُلِّ خَیْرٍ وَعَاشَ طَوِیْلاً]]‘‘۔
ترجمہ:’’اور جو خواب میںسورہ ٔبقرہ کی تلاوت کرے، اللہ اس کے لیے اس کے دین (کی سعادات) کوجمع فرماتاہے اور وہ ہر بھلائی کی طرف سبقت کرتا ہے اور لمبی عمر پاتاہے ، (تعبیرالرؤیا:بَابُ سُوَرِ القرآن)‘‘۔الغرض خواب میں سورۂ بقرہ یا اس کے کچھ حصے کی تلاوت کرنا یا سننا ،نیک فال ہے اور ہرشخص اپنے مقتضیٰ حال کے مطابق اس کی تعبیر مذکورہ بالا اکابر کی بیان کردہ تعبیرات کی روشنی میںاَخذ کر سکتا ہے ۔
	خواب میں مرغی دیکھنا بھی خیر ہی کے معنیٰ میں ہے، علامہ ابن سیرین فرماتے ہیں :
’’[[arabic: وَقِیْلَ:مَنْ رَاٰی اَنَّہٗ ذَبَحَ دَجَاجَۃً فَإِنَّہُ یَقْتَصُّ جَارِیَۃً وَمَنْ صَادَہَا نَالَ مَالًا مِنَ الْعَجَمِ]]‘‘۔
ترجمہ:’’اور بعض( ماہرین تعبیر ) نے کہا: جس نے خواب میں دیکھا کہ اس نے مرغی کو ذبح کیا تو وہ باکرہ خاتون سے نکاح کرے گااور جو اس کو شکار کرے تو اس کو عجم سے مال ملے گا ، (تعبیر الرو یا:باب حرف الدّال)‘‘۔اور جو آپ نے دیکھا کہ خود ہی مرغی کا سر کٹ گیا توآپ کوان میں سے جو خیر پہنچے گا وہ کسی اور کے توسط سے یااس کے ہاتھ سے نکل کر آپ تک پہنچے گا۔
	مجموعی طور پر آپ کا خواب ایک مبارک خواب ہے جو کہ صلہ رحمی اور والدین کے ساتھ بعد الوفات نیکی اور ان کے ایصال ثواب کے لیے خیرات وحسنات اور صدقات کی قبولیت اور دنیا وآخرت کی نعمتوں کا سبب ہونے پر دلالت کرتا ہے۔ آپ اپنے وظائف کو جاری رکھیں اور سور ۃالبقرہ کی آخری آیات کو اپنے وظائف میں شامل کریں ۔نبی صلی اللہ علیہ وسلم  کا ارشادہے :`
},
{
  pageNumber: 418,
  text: `’’[[arabic: عَنِ ابْنِ عَبَّاسٍ،قَالَ:بَیْنَمَاجِبْرِیْلُ قَاعِدٌ عِنْدَ النَّبِیِّ ﷺ، سَمِعَ نَقِیْضًا مِنْ فَوْقِہٖ،فَرَفَعَ رَأْسَہٗ،فَقَالَ:ہٰذَا بَابٌ مِنَ السَّمَاءِ فُتِحَ الْیَوْمَ لَمْ یُفْتَحْ قَطُّ إِلَّا الْیَوْمَ، فَنَزَلَ مِنْہٗ مَلَکٌ،فَقَالَ:ہٰذَا مَلَکٌ نَزَلَ إِلَی الْاَرْضِ لَمْ یَنْزِلْ قَطُّ إِلَّا الْیَوْمَ، فَسَلَّمَ، وَقَالَ:أَبْشِرْ بِنُوْرَیْنِ أُوْتِیْتَہُمَا لَمْ یُؤْتَہُمَا نَبِیٌّ قَبْلَکَ:فَاتِحَۃُ الْکِتَابِ،وَخَوَاتِیْمُ سُوْرَۃِ الْبَقَرَۃِ،لَنْ تَقْرَأَ بِحَرْفٍ مِنْہُمَا إِلَّا أُعْطِیْتَہُ]]‘‘۔
ترجمہ:’’حضرت ابن عباس رضی اللہ عنہ بیان کرتے ہیں: ایک دن جبریل علیہ السلام نبی صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے ،اچانک رسول اللہﷺ نے ایک آواز سنی ،نبی صلی اللہ علیہ وسلم نے سر اوپر اٹھایا ، حضرت جبریل نے کہا :یہ آسمان کا ایک دروازہ ہے ،جس کو صرف آج کھولاگیا ہے اور آج سے پہلے کبھی نہیں کھولا گیا پھر اس سے ایک فرشتہ نازل ہوا حضرت جبریل نے کہا :یہ فرشتہ جو آج نازل ہوا ہے ،آج سے پہلے کبھی نازل نہیں ہو ا،اُس فرشتے نے سلام کیا اور کہا : آپ کو ان دو نوروں کی بشارت ہو جو آپ کو دئیے گئے ہیں اور آپ سے پہلے کسی نبی کو نہیں دیے گئے ایک سورہ فاتحہ اور دوسرا سورہ بقرہ کی آخری آیات، ان میں سے آپ جو حرف بھی پڑھیںگے آپ کو اس کا مصداق مل جائے گا، (مسلم:806)‘‘۔
	آپ اپنی والدہ مرحومہ کے بارے میں حسنِ ظن رکھیں ،کینسر کی بیماری یقیناً تکلیف دہ ہوتی ہے ،مگر مومن کو رسول اللہ صلی اللہ علیہ وسلم نے ایسی بیماریوں میں بشارتیں بھی دی ہیں ، اَحادیثِ مبارکہ میں ہے : 
(۱)’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ:عَنِ النَّبِیِّ ﷺقَالَ:مَا یُصِیْبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلَا وَصَبٍ وَلَا ہَمٍّ وَلَاحُزْنٍ وَلَاأَذًی وَلَا غَمٍّ، حَتَّی الشَّوْکَۃِ یُشَاکُہَا،إِلَّا کَفَّرَ اللّٰہُ بِہَا مِنْ خَطَایَاہُ]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں:نبی صلی اللہ علیہ وسلم نے فرمایا: مسلمان کو جوبھی بیماری، تکلیف ،غم ،حزن ،اذیت اور غم پہنچے ،یہاں تک کہ اسے کانٹابھی چبھے ،تواللہ تعالیٰ اس کے سبب اس کے گناہ مٹادیتاہے ،(صحیح بخاری:5641)‘‘۔ 
(۲)’’[[arabic: مَا مِنْ مُسْلِمٍ یُصِیْبُہٗ أَذًی، مَرَضٌ فَمَا سِوَاہُ، إِلَّا حَطَّ اللّٰہُ لَہٗ سَیِّئَاتِہٖ،کَمَا تَحُطُّ]]`
},
{
  pageNumber: 419,
  text: `[[arabic: الشَّجَرَۃُ وَرَقَہَا]]‘‘۔
ترجمہ:’’مسلمان کوبیماری یا اس کے علاوہ جوبھی تکلیف پہنچتی ہے ،اللہ تعالیٰ (اس کے سبب) اس کے گناہوں کو ساقط کردیتاہے ،جیسے درخت سے پتے جھڑتے ہیں،(صحیح بخاری: 5660)‘‘۔
(۳)	
’’[[arabic: حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللّٰہِ،أَنَّ رَسُوْلَ اللّٰہِ ﷺدَخَلَ عَلٰی أُمِّ السَّائِبِ أَوْ أُمِّ الْمُسَیِّبِ ، فَقَالَ:مَا لَکِ یَا أُمَّ السَّائِبِ أَوْ یَا أُمَّ الْمُسَیَّبِ تُزَفْزِفِیْنَ، قَالَتْ:اَلْحُمَّی،لَا بَارَکَ اللّٰہُ فِیہَا،فَقَالَ:لَا تَسُبِّی الْحُمّٰی،فَإِنَّہَا تُذْہِبُ خَطَایَا بَنِی آدَمَ،کَمَا یُذْہِبُ الْکِیْرُ  خَبَثَ الْحَدِیْدِ]]‘‘۔
ترجمہ:’’ حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم اُمّ السائب یا اُمّ المسیّب کے ہاں تشریف لے گئے اور فرمایا:اے اُمّ السائب یا اُمّ المسیّب ! تمہیں کیا ہوا جو کانپ رہی ہو ،عرض کی:بخارہے ،خدااس میں برکت نہ کرے ،فرمایا:بخارکو برانہ کہو کہ وہ آدمی کی خطاؤں کو اس طرح دورکرتاہے ، جیسے بھٹی لوہے کے میل کو دور کرتی ہے ، (صحیح مسلم:2575)‘‘۔
(۴)’’[[arabic: عَنْ أَنَسِ بْنِ مَالِکٍ رَضِیَ اللّٰہُ عَنْہُ،قَالَ:سَمِعْتُ النَّبِیَّ ﷺ یَقُوْلُ:إِنَّ اللّٰہَ قَالَ: إِذَا ابْتَلَیْتُ عَبْدِیْ بِحَبِیْبَتَیْہِ فَصَبَرَ، عَوَّضْتُہٗ مِنْہُمَا الْجَنَّۃ، یُرِیْدُ:عَیْنَیْہِ]]‘‘۔
ترجمہ:’’ حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں : میں نے نبی صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا: اللہ تعالیٰ فرماتاہے: جب میں اپنے بندے کی آنکھوں کی بینائی لے لوں ،پھروہ اس پر صبر کرے ،تو آنکھوں کے بدلے میں اسے جنت عطا کروں گا ،(صحیح بخاری: 5653)‘‘۔
(۵)’’[[arabic: إِنَّ الْعَبْدَ إِذَا سَبَقَتْ لَہٗ مِنَ اللّٰہِ مَنْزِلَۃٌ،لَمْ یَبْلُغْہَا بِعَمَلِہٖ اِبْتَلَاہُ اللّٰہُ فِی جَسَدِہٖ أَوْ فِی مَالِہٖ أَوْفِی وَلَدِہٖ ،قَالَ أَبُوْ دَاوٗدَ:زَادَابْنُ نُفَیْلٍ:ثُمَّ صَبَّرَہٗ عَلٰی ذٰلِکَ،ثُمَّ اتَّفَقَا،حَتّٰی یُبْلِغَہُ الْمَنْزِلَۃَ الَّتِی سَبَقَتْ لَہٗ مِنَ اللّٰہِ تَعَالٰی]]‘‘۔`
},
{
  pageNumber: 420,
  text: `ترجمہ:’’ جب بندہ کے لیے علمِ الٰہی میں کوئی (بلند)مرتبہ مقرر ہوتاہے اوروہ اعمال کے سبب اس رتبہ کو نہیں پہنچ پاتا،تواللہ تعالیٰ بدن یا مال یا اولاد میں سے اسے کسی آزمائش میںمبتلا فرما دیتاہے ، امام ابو داؤد فرماتے ہیں : ابن نفیل نے اس پر اتنا زائد فرمایا: پھر اسے صبر(کی توفیق) دیتاہے ،یہاں تک کہ اسے اس مرتبے پر فائز فرمادیتاہے ،جو اس کے لیے علمِ الٰہی میںمقرر ہے ، (سُنن ابو داؤد:3090)‘‘۔
(۶)	’’[[arabic: عَنْ جَابِرٍ،قَالَ:قَالَ رَسُوْلَ اللّٰہِ ﷺ:یَوَدُّ أَہْلُ الْعَافِیَۃِ یَوْمَ الْقِیَامَۃِ حِیْنَ یُعْطٰی أَہْلُ الْبَلَاء ِ الثَّوَابَ لَوْ أَنَّ جُلُوْدَہُمْ کَانَتْ قُرِضَتْ فِی الدُّنْیَا بِالْمَقَارِیْضِ]]‘‘۔
ترجمہ:’’ حضرت جابر رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب قیامت کے دن (دنیامیں)مصیبت میں مبتلا لوگوں کو ثواب دیاجائے گا تو عافیت والے تمنا کریں گے ،کاش( دنیا میں) قینچیوں سے اُن کی کھالیں کاٹی جاتیں ،(سُنن ترمذی: 2402) ‘‘ ۔ تو وہ بھی اس اجر کے حق دار قرار پاتے۔
(۷)’’[[arabic: حَدَّثَنِی عَطَاءُ بْنُ أَبِیْ رَبَاحٍ،قَالَ:قَالَ لِی ابْنُ عَبَّاسٍ:أَلاَ أُرِیْکَ امْرَأَۃً مِنْ أَہْلِ الْجَنَّۃِ،قُلْتُ:بَلٰی،قَالَ:ہٰذِہِ الْمَرْأَۃُ السَّوْدَاءُ،أَتَتِ النَّبِیَّ ﷺ،فَقَالَتْ:إِنِّی أُصْرَعُ وَإِنِّی أَتَکَشَّفُ،فَادْعُ اللّٰہَ لِیْ،قَالَ:إِنْ شِئْتِ صَبَرْتِ وَلَکِ الْجَنَّۃُ،وَإِنْ شِئْتِ دَعَوْتُ اللّٰہَ أَنْ یُعَافِیَکِ فَقَالَتْ:أَصْبِرُ، فَقَالَتْ:إِنِّی أَتَکَشَّفُ، فَادْعُ اللّٰہَ لِیْ أَنْ لَا أَتَکَشَّفَ،فَدَعَا لَہَا]]‘‘۔
ترجمہ:’’ عطاء بن ابی رباح بیان کرتے ہیں: حضرت ابن عباس نے مجھ سے فرمایا: کیا میں تمہیں جنتی عورت نہ دکھاؤں،میں نے کہا:کیوں نہیں (ضرور دکھایئے)،انہوں نے کہا: یہ وہ سیاہ فام عورت ہے ، جو نبی صلی اللہ علیہ وسلم کے پاس آئی تھی اورعرض کی: مجھ پر مرگی کا دورہ پڑتاہے اورمیرا ستر کھل جاتاہے،آپ میرے لیے اللہ تعالیٰ سے دعاکیجیے ۔آپ صلی اللہ علیہ وسلم نے فرمایا : اگر تم چاہو تو تم صبر کرو اورتم کو جنت مل جائے گی اوراگر تم چاہو تومیں اللہ تعالیٰ سے دعاکرتاہوں کہ اللہ تعالیٰ تمہیں اس مرض سے شفادے ، اس عورت نے کہا : میں صبر کروں گی، لیکن (دورہ پڑنے پر )میرا ستر کھل جاتاہے ،آپ اللہ تعالیٰ سے دعاکریں کہ میرا ستر نہ`
},
{
  pageNumber: 421,
  text: `کھلے ،سو آپ صلی اللہ علیہ وسلم نے اس کی ستر پوشی کے لیے دعا فرمائی ،(صحیح بخاری:5652)‘‘۔
[[heading: ضرر رساں کتوں کومارنا ]]
سوال:
	 ہمارے اسکول میں کتوں کی بہتات ہوگئی ہے ، ان کے بچوں کی تعداد بھی بہت زیادہ ہے ،جو چند دنوں میں بڑے ہوکر مزید مسائل بڑھائیں گے ۔ اس کے سبب ہم بہت پریشان ہیں ،کیاہم دوا دے کر اُنہیں مار سکتے ہیں؟،(اساتذہ مسلم دستگیر گورنمنٹ گرلز سیکنڈری اسکول ،FBایریا ،کراچی)۔
جواب:
	کتے لوگوں کو نقصان پہنچاتے ہوں اور سگ گزیدگی کے واقعات کی کثرت ہو تو کتوں کو مارنے کا حکم دیاجائے گا ۔رسول اللہ صلی اللہ علیہ وسلم نے مدینے میں کتوں کی بہتات کے سبب اُن کے قتل کرنے کا حکم فرمایا :
(۱)’’[[arabic: عَنِ ابْنِ عُمَرقَالَ:أَمَرَ رَسُوْلُ اللّٰہِ ﷺ بِقَتْلِ الْکِلَابِ فَاَرْسَلَ فِیْ  أَقْطَارِ الْمَدِیْنَۃِ أَنْ تُقْتَلَ ]]‘‘۔
ترجمہ:’’ حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے کتوں کوقتل کرنے کا حکم دیا اور مدینہ کے اطراف میں کتوں کو قتل کرنے کے لیے لوگ روانہ کیے ،(صحیح مسلم:1570)‘‘۔
(۲)’’[[arabic: عَنْ عَبْدِ اللّٰہِ،قَالَ:کَانَ رَسُوْلُ اللّٰہِ ﷺیَأمُرُ بِقَتْلِ الْکِلَابِ،فَنَنْبَعِثُ فِی الْمَدِیْنَۃِ وَأَطْرَافِہَا فَلَا نَدَعُ کَلْبًا إِلَّا قَتَلْنَاہٗ، حَتّٰی إِنَّا لَنَقْتُلُ کَلْبَ الْمُرَیَّۃِ مِنْ أَہْلِ الْبَادِیَۃِ یَتْبَعُہَا]]‘‘۔
  ترجمہ:’’ حضرت عبداللہ بن عمر رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم کتوں کو قتل کرنے کا حکم دیتے تھے ،پھر مدینہ اور اس کے اطراف میں کتوں کا پیچھا کیاگیا اورہم نے کوئی کتا مارے بغیر نہیں چھوڑا ،حتّٰی کہ دیہاتیوں کی اونٹنی کے ساتھ جو کتا رہتاتھا ،ہم نے اس کو بھی مار`
},
{
  pageNumber: 422,
  text: `ڈالا ،(صحیح مسلم:1570)‘‘۔
(۳)’’[[arabic: جَابِرَ بْنَ عَبْدِ اللّٰہِ یَقُوْلُ:أَمَرَنَارَسُوْلُ اللّٰہِ ﷺ بِقَتْلِ الْکِلَابِ،حَتّٰی إِنَّ الْمَرْأَۃَ تَقْدَمُ مِنَ الْبَادِیَۃِ بِکَلْبِہَا فَنَقْتُلُہٗ،ثُمَّ نَہَی النَّبِیُّﷺعَنْ قَتْلِہَا، وَقَالَ:عَلَیْکُمْ بِالْاَسْوَدِ الْبَہِیْمِ ذِی النُّقْطَتَیْنِ،فَإِنَّہٗ شَیْطَانٌ]]‘‘۔
ترجمہ:’’حضرت جابر بن عبداللہ رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں کتوں کوقتل کرنے کا حکم دیا ،یہاں تک کہ کوئی عورت دیہات سے اپنا کتا لے کر آتی توہم اس کتے کوبھی قتل کردیتے ،پھر نبی صلی اللہ علیہ وسلم نے اس کو قتل کرنے سے منع کردیا اور فرمایا: اس کالے سیاہ کتے کو قتل کردوجو دو نقطے والاہو ، کیونکہ وہ شیطان ہے،(صحیح مسلم:1572) ‘‘ ۔
(۴)’’[[arabic: عَنِ ابْنِ الْمُغَفَّلِ،قَالَ:أَمَرَ رَسُوْلُ اللّٰہِ ﷺ بِقَتْلِ الْکِلَابِ،ثُمَّ قَالَ:مَابَالُہُمْ وَبَالُ الْکِلَابِ،ثُمَّ رَخَّصَ فِی کَلْبِ الصَّیْدِ وَکَلْبِ الْغَنَمِ]]‘‘۔
ترجمہ:’’ حضرت ابن مغفل رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے کتوں کوقتل کرنے کا حکم دیا ،پھر فرمایا: کتے لوگوں کوکیا تکلیف دیتے ہیں !پھر آپ صلی اللہ علیہ وسلم نے شکاری کتے اوربکریوں (کی حفاظت) کے کتوں کی اجازت دی،(صحیح مسلم:1573)‘‘۔
(5)’’[[arabic: عَنْ أَبِی الْحَکَمِ،قَالَ:سَمِعْتُ ابْنَ عُمَرَ یُحَدِّثُ عَنِ النَّبِیِّ ﷺقَالَ:مَنِ اتَّخَذَ کَلْبًاإِلَّاکَلْبَ زَرْعٍ أَوْ غَنَمٍ أَوْصَیْدٍ،یَنْقُصُ مِنْ أَجْرِہِ کُلَّ یَوْمٍ قِیْرَاطٌ]]‘‘۔
ترجمہ:’’ حضرت ابن عمر رضی اللہ عنہما بیان کرتے ہیں: نبی صلی اللہ علیہ وسلم نے فرمایا: جو شخص تین مقاصد یعنی کھیت اور مویشیوں کی نگرانی یا  شکار، کے علاوہ کتا رکھے تو اس کے اجر سے ہر روز ایک قیراط کم ہوتا رہے گا ،(صحیح مسلم:1574)‘‘۔
	فقہائے اَحناف کے نزدیک دشمن یا چور کے خطرہ سے گھر کی حفاظت کے لیے کتارکھنا جائز ہے ،علامہ کمال الدین ابن ہمام رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَأَمَّااقْتِنَاؤُہُ لِلصَّیْدِ وَحِرَاسَۃِ الْمَاشِیَۃِ وَالْبُیُوْتِ وَالزَّرْعِ فَیَجُوْزُ بِالْإِجْمَاعِ،لٰکِنْ لَا یَنْبَغِیْ أَنْ یَتَّخِذَہٗ فِی دَارِہٖ إلَّا إنْ خَافَ لُصُوْصًا أَوْ أَعْدَاءً لِلْحَدِیْثِ الصَّحِیْحِ:مَنِ اقْتَنَی کَلْبًا إلَّا کَلْبَ صَیْدٍ أَوْ مَاشِیَۃٍ نَقَصَ مِنْ أَجْرِہِ کُلَّ یَوْمٍ قِیْرَاطَانِ]]‘‘۔
ترجمہ:’’ شکار کے لیے، مویشیوں ،گھروں اور کھیتوں کی حفاظت کے لیے کتا رکھنا بالاجماع جائز ہے ،لیکن گھر کے اندر کتا نہیں رکھنا چاہیے ،البتہ چوروں اور دشمنوں کا خوف ہوتو جائز ہے ،صحیح حدیث(مسلم:1574) میں ہے : ’’جس شخص نے شکار کے کتوں یا مویشی کی حفاظت کے علاوہ کتا رکھا ، اس کے اجر سے ہر روز دو قیراط کم ہوتا رہے گا ‘‘،(فتح القدیر، جلد7،ص:119)‘‘۔
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ أَنَّ رَسُوْلَ اللّٰہِ ﷺ قَالَ:لَا تَصْحَبُ الْمَلَائِکَۃُ رُفْقَۃً فِیْہَا کَلْبٌ وَلَا جَرَسٌ ]]‘‘۔
ترجمہ:’’ حضرت ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: (رحمت کے) فرشتے ان مسافروں کے ساتھ نہیں رہتے ،جن کے پاس کتا یا گھنٹی ہو ،(صحیح مسلم: 2113)‘‘۔اس سے مراد رحمت اور استغفار کے فرشتے ہیں ،ورنہ کراماً کاتبین ہر وقت ساتھ رہتے ہیں ۔
علامہ نظام الدین رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَفِی:الْاَجْنَاسِ:لَایَنْبَغِیْ أَنْ یَّتَّخِذَ کَلْبًا إِلَّا أَنْ یَّخَافَ مِنَ اللُّصُوْصِ أَوْ غَیْرِہُمْ]]‘‘۔
ترجمہ:’’الاجناس میں ہے : کتا نہیں رکھنا چاہیے البتہ اگر چوروں وغیرہ کا خوف ہوتو پھر جائز ہے ،(فتاویٰ عالمگیری ،جلد5،ص:361)‘‘۔
علامہ کمال الدین الدمیریرحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَفِی الْکَلْبِ مِنَ اقْتِفَاءِ الْاَثَرِ،وَشَمِّ الرَّائِحَۃِ مَا لَیْسَ لِغَیْرِہٖ مِنَ الْحَیوَانَاتِ،وَالْجِیْفَۃُ أَحَبَّ إِلَیْہِ مِنَ اللَّحْمِ الْغَرِیْضِ وَیَاکُل الْعَذِرَۃَ وَیَرْجِعُ فِی قَیْئِہٖ]]‘‘۔
ترجمہ:’’قدموں کے نشانات کے پیچھے چلنا اور بو سونگھنے کا ملکہ کتوں کے علاوہ دوسرے جانوروں میں نہیں ہے ،لیکن کتا مردار اور ناپاکی کھانے کو تازہ گوشت سے زیادہ پسند کرتاہے، یہ اکثر گندی چیزیں ہی کھاتاہے ،بعض دفعہ اپنی قے چاٹ لیتاہے ‘‘۔
مزید لکھتے ہیں:
’’[[arabic: وَتَعْرِضُ لَہٗ أَمْرَاضٌ سَوْدَاوِیَۃ ٌ  فِیْ زَمَنٍ مَخْصُوْصٍ،وَیعْرِضُ لَہُ الْکَلَبُ(بِفَتْحِ اللَّام) وَہُوَ دَاءٌ یَشْبَہُ الْجُنُوْنَ،وَعَلَامَۃُ ذٰلِکَ أَنْ تَحْمِرَ عَیْنَاہٗ وَتَعْلُوْہُمَا غِشَاوَۃٌ،وَتَسْتَرْخِیْ أُذُنَاہُ،وَیَنْدَلِعُ لِسَانُہٗ وَیَکَثُرُ لُعَابُہٗ،وَسَیَلَانُ أَنفِہٖ،وَیَطَاطَیْئُ رَأسَہٗ وَیَنْحَدِبُ ظَہْرَہٗ، وَیَتَعَوّجُ صُلْبَہٗ إِلٰی جَانِبٍ،وَلَا یَزَالُ یَدْخُلُ ذَنَبَہٗ بَیْنَ رِجْلَیْہِ وَیْمْشِیْ خَائِفًا مَغْمُوْمًا کَاَنَّہٗ سُکْرَانُ،وَیَجُوْعُ فَلَا یَأکُلُ،وَیَعْطَشُ فَلَا یَشْرَبُ،وَرُبَمَارَأی الْمَآءَ فَیَفْزَعُ مِنْہٗ،وَرُبَمَا یَمُوْتُ مِنْہٗ خَوْفًا،وَإِذَا لَاحَ لَہٗ شِبْحٌ حَمْل عَلَیْہِ مِنْ غَیْرِ نَبْحٍ،وَالْکِلَابُ تَہْرُبُ مِنْہٗ،فَإِنْ دَنَا مِنْہَا غَفْلَۃً،بَصْبَصَتْ لَہٗ وَخَضَعَتْ،وَخَشَعَتْ بَیْنَ یَدَیْہِ،فَإِذَا عَقَرَ ہٰذَا الْکَلْبُ إِنْسَانًا عَرَضَ لَہٗ أَمْرَاضٌ رَدِیْئَۃٌ،مِنْہَا أَنْ یَمْتَنِعَ مِنْ شُرْبِ الْمَاءِ حَتّٰی یَہْلِکَ عَطَشًا، وَلَا یَزَالُ یَسْتَقِیْ حَتّٰی إِذَا سَقَی الْمَآءَ لَمْ یَشْرَبْہٗ،فَإِذَا اسْتَحْکَمَتْ ہٰذِہِ الْعِلّۃُ بِہٖ، فَقَعَدَ لِلْبَوْلِ خَرَجَ مِنْہٗ شَیْئٌ عَلٰی ہَیْئَۃِ الْکِلَابِ الصِّغَارِ]]‘‘۔
ترجمہ:’’کچھ خاص ایام میں کتے کو سوداوی امراض لاحق ہوتے ہیں ،اس کے اندر ایک قسم کا جنون جس کو ہَڑک کہتے ہیں ،عارض ہوتا ہے ۔اس مرض کی علامات یہ ہیں : دونوں آنکھوں کا سرخ ہونا اور ان پر تاریکی چھاجانا ،کانوں کا ڈھیلا پڑجانا،زبان کا لٹک جانا ، رال بکثرت بہنا ،ناک بہنا ،سر نیچے لٹک جانا اور کمر میں کبڑا پن اور پیٹھ کا ٹیڑھا ہوجانا یعنی ایک طرف جھکاؤ ہونا،دُم کا ٹانگوں کے درمیان داخل کردینا، چلنے میں لڑکھڑانا۔باؤلے پن کی حالت میں کتا غمزدہ اور خوف زدہ حالت میں اس طرح چلتاہے ،جیسے نشے کی حالت میں ہو ، بھوک، پیاس کے باوجود کھاتا پیتا نہیں ہے ۔اور بعض اوقات پانی کو دیکھ کر گھبرا جاتا ہے اور بعض اوقات اسی سے خوفزدہ ہوکر مر جاتا ہے۔جب جنون کی حالت میں کوئی بھی جاندار شے اس کے سامنے آتی ہے ،یہ بھونکے بغیر اس پر حملہ کرتا ہے ۔ایسی حالت میں صحت مند کتے بھی اس سے بھاگنے لگتے ہیں اور اگر کبھی غفلت میں کوئی کتا اس کے سامنے آبھی جاتا ہے ،توچاپلوسی کرتے ہوئے اس کے سامنے دُم ہلاتا ہے اور جھک جاتا ہے (یعنی مزاحمت نہیں کرتا )اور جب یہ پاگل کتا کسی انسان کو کاٹ لے تواسے مہلک بیماریاں لاحق ہوجاتی ہیں ، اُن میں سے ایک یہ ہے کہ پانی نہیں پی سکتا ،یہاں تک کہ پیاس سے ہلاک ہوجاتا ہے ، وہ پیاس کے سبب پانی مانگتا ہے ،یہاں تک کہ جب پانی پینے لگے تو پی نہیں سکتا ۔ اور جب یہ بیماری پختہ ہوجاتی ہے تو جب وہ پیشاب کرنے بیٹھتا ہے تو اس سے کتے کے چھوٹے پلّوں جیسی چیزیںخارج ہوتی ہیں،(حیاۃ الحیوان،جلد2، ص: 378-379 )‘‘ ۔ اللہ تعالیٰ ہم سب کو ایسی آفات سے اپنے حفظ وامان میں رکھے ۔ 
	ہم نے یہ تفصیل اس لیے لکھی ہے کہ شریعت کی نظر میں کتے میں جو نحوست اور بیماریاں ہیں ، اُن سے لوگ محتاط رہیں ۔ بعض عقل پرست لوگ کہتے ہیں کہ اہلِ مغرب کتے پالتے ہیں ، اُن کو اپنے ساتھ بٹھاتے اور لٹاتے ہیں ، وہ کتے اُنہیں چومتے چاٹتے ہیں اور اُنہیں کچھ نہیں ہوتا ،کیونکہ اُن کی صفائی اور غذا کا بہت اہتمام کرتے ہیں ، اُنہیں ان جرثوموں اور وائرس سے بچاؤ کے لیے خصوصی ویکسین بھی دیا جاتاہے ، سو اگر ہمارے ہاں بھی ایسے انتظامات ہوں تو کیا کتے پالنا ، کتوں کا چومنا چاٹناجائز ہوجائے گا ، جواب یہ ہے کہ ہرگز نہیں۔
	آپ کے سوال کا جواب یہ ہے کہ شریعت نے نابینا شخص پر نماز کی جماعت کے وجوب کو ساقط کردیا ہے ،لیکن اگر مسجد تک لانے اور لے جانے کے لیے کوئی معاون شخص دستیاب ہو ،تو اُسے جماعت میں حاضر ہونا چاہیے ،علامہ بدرالدین محمود بن احمد عینی لکھتے ہیں:
’’[[arabic: وَفِی التُّحْفَۃ :اَلْجَمَاعَۃُ إنّمَا تَجِبُ عَلٰی مَنْ قَدَّرَعَلَیْہَا مِنْ غَیْرِ حَرَجٍ وَتُسْقَطُ بِالْعُذْرِ حَتّٰی لَا تَجِبُ عَلَی الْمَرِیْضِ وَالْاَعْمٰی وَالزَمِنِ وَنَحوِہم إِذَا لَمْ یَجِدِ الْاَعْمٰی قَائِدًا، وَالزَّمِنُ مَنْ یَّحْمِلُہُ، وَکَذَا إِذَا وَجَدَ عِنْدَ أَبِیْ حَنِیْفَۃَ،وَعِنْدَہُمَا تَجِبُ]]‘‘۔
ترجمہ:’’’’تحفہ ‘‘ میں ہے :جماعت صرف اس پر واجب ہے جو کسی حرج کے بغیر اس پر قادر ہو اور عذر کی وجہ سے ساقط ہوجاتی ہے، یہاں تک کہ  مریض ،نابینا اور اپاہج پر واجب نہیں ہے،جب نابینا کو کوئی راہ دکھانے والا نہ ملے اور اپاہج کو کوئی اٹھانے والا نہ ہو ، امام ابو حنیفہرحمۃ اللہ علیہ کے نزدیک قائد مل جائے تب بھی واجب نہیں ہے اور صاحبین کے نزدیک قائد(معاون) ملنے کی صورت میں نابینا پر جماعت میں حاضر ہونا واجب ہے ،(البنایہ شرح الھدایہ، جلد2،ص:324)‘‘۔ اسی طرح اگر نابینا شخص حافظ وعالم ہے ،تو اُسے امام بنانے کے لیے دیکھناہوگا کہ جسم ولباس کی طہارت میں کوئی اس کا مددگار ہے یا نہیں ،نابینا شخص پر صاحبِ استطاعت ہونے کے باوجود حج کی فرضیت بھی ساقط ہوجاتی ہے ۔ پاکستان یا مسلم ممالک میں الحمد للہ اتنی دینی قدریں اب بھی باقی ہیں کہ لوگ نابینا شخص کی مدد کرنا کارِ ثواب سمجھتے ہیں، مغرب میں بھی نابیناؤں اور معذوروں کے لیے خصوصی رعایات ہوتی ہیں ۔ لہٰذا اگر مغربی معاشرے میں کتے اتنے تربیت یافتہ دستیاب ہوتے ہوں کہ اپنے مالک سے فاصلہ رکھ کر چلیں ، کتے کاخشک یا گیلا جسم بشرطیکہ اس پر ظاہری نجاست نہ لگی ہو، کپڑوں کے ساتھ ٹکرانے سے کپڑے ناپاک نہیں ہوتے ، تو ’’[[arabic: اَلضَّرُوْرَاتُ تُبِیْحُ الْمَحْظُوْرَات]]‘‘ (مجلۃ الاحکام العدلیہ ،ما دہ:21)کے تحت اس کی گنجائش نکل سکتی ہے۔البتہ ناروے وغیرہ کی بابت ہم نے سناہے کہ وہاں ایسے معذوروں کے لیے ریاست خدمت گار فراہم کرتی ہے ، اگر یہ درست ہے تو پھر کتے کی خدمات کا جواز نہیں رہتا ،کیونکہ عام حالات میں وہاں ذاتی طورپر ہر شخص کے لیے خادم رکھنا استطاعت سے باہر ہوتا ہے ۔
[[heading: ثالثی کا معیار ]]
سوال:
	 اکثر یہ دیکھنے میں آیا ہے کہ جب کوئی معاملہ ہو تو ایسے لوگ اس کا فیصلہ کرنے کے لیے جمع ہوتے ہیں جن کو شرعی احکام کا علم تو کجا نماز بھی درست پڑھنا نہیں آتی ، پھر ان فیصلوں پر عمل کرانے میں زبردستی کی جاتی ہے ،کیا ایسے فیصلوں میں کسی عالم یا مفتی کا ہونا لازم ہونا چاہیے ،اس بارے میں رہنمائی فرمائیں،(عابدعلی ترک، آگرہ تاج کالونی )۔
جواب:
	کسی تنازعے کے ایک سے زائد فریقوں کے درمیان تصفیہ کرنے کے لیے ثالث یا حَکَم بنانا قرآن وسنت سے ثابت ہے ، اسے ہمارے عرف میں ’’پنچ یا پنچایت‘‘ اور انگریزی میں ’’Arbitrator‘‘کہتے ہیں ، مغربی ممالک میں بھی عدالتیں اس بات کو ترجیح دیتی ہیں کہ لوگ عدالت سے باہر آپس میں معاملات طے کرلیں ، اللہ تعالیٰ کا ارشاد ہے:
’’ [[arabic: وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِّنْ أَهْلِهِ وَحَكَمًا مِّنْ أَهْلِهَا إِن يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا]]‘‘۔
ترجمہ: ’’اور (اے مسلمانو!) اگر تمہیں اُن دونوں (میاں بیوی) کے درمیان جھگڑے کا اندیشہ ہو ،تو ایک منصف مرد کے خاندان سے اور ایک منصف عورت کے خاندان سے مقرر کرو، اگروہ دونوں (ثالث ) صلح کرانا چاہیں گے تو اللہ تعالیٰ ان دونوں کے درمیان موافقت پیدا کردے گا، بے شک اللہ بڑا جاننے والا، بہت خبر رکھنے والا ہے،(النساء:35) ‘‘۔ 
	اس آیتِ مبارکہ سے معلوم ہوا کہ تنازعات کو طے کرنے کے لیے ایسے اشخاص کو ثالث`
  },
  {
    pageNumber: 476,
    text: `بنانا چاہیے، جو فسادی ذہن کے نہ ہوں ،بلکہ صلح پسند ہوں ، معاملہ فہم ہوں اورخاندانی وقبائلی عصبیت سے بالا تر ہوکر حق پسندی پر مبنی فیصلے کریں ، رسول اللہ صلی اللہ علیہ وسلم نے عصبیت کی تعریف یہ فرمائی ہے:’’عصبیت یہ ہے کہ تم ظلم پر اپنی قوم کی مدد کرو،(سنن ابودائود: 5119) ‘‘ ۔
	حضرت سعد بن معاذبنو قریظہ کے حلیف رہے تھے ،غزوۂ بنو قریظہ کے موقع پر جب اُن پر اللہ تعالیٰ نے مسلمانوں کو فتح عطا فرمائی تو یہ سوال پیدا ہوا کہ اُن کے ساتھ کیا سلو ک کیا جائے، بنو قریظہ حضرت سعد کو حَکَم مان کر قلعے سے اتر آئے اور پھر حضرت سعد نے اُن کے بارے میں جو فیصلہ کیا ،نبی کریم صلی اللہ علیہ وسلم نے فرمایا:’’[[arabic: حَکَمْتَ بِحُکْمِ اللّٰہِ]]، تم نے اللہ تعالیٰ کے فیصلے کے مطابق فیصلہ دیا ہے، (صحیح البخاری:3043)‘‘۔ فیصلے کی تفصیل یہاں موضوعِ بحث نہیں ہے۔
	باہمی تنازعات میں حَکَم بنانے کی مشروعیت قرآن وسنّت اور تَعَامل صحابہ سے ثابت ہے ۔فریقین کے مابین درست فیصلے کے لئے جس تیسرے شخص کو مقرر کیاجائے ، اُسے ’’حَکَم‘‘،’’ثالث ‘‘یا’’ پنچ ‘‘کہتے ہیں ۔تحکیم یعنی حَکَم بنانے کا رکن ایجاب وقبول ہے یعنی فریقین یہ کہیں کہ ہم نے فلاں کو حَکَم بنایااور وہ شخص جسے حَکَم بنایا،قبول کرلے۔ہر مسلمان عاقل ،بالغ ،آزاد ،صحت مند (یعنی دیکھنے اور بولنے کی صلاحیت کا حامل)،جس پر حَدِّ قذف نہ لگی ہو ،حلال وحرام اوراَحکامِ شرعیہ کا جاننے والا ہو ، فریقین کے مابین حَکَم بننے کی صلاحیت رکھتاہے ۔البتہ حدود وقصاص میں اُس کا حکم صحیح نہیں ،اگر کسی اجتہادی مسئلے میں وہ حکم دے اور وہ مسئلہ قاضی کے پاس لے جایاجائے تو قاضی اپنے اجتہاد سے اس حکم کو فسخ کرسکتاہے ۔
	جو شخص احکامِ شرعیہ سے واقف نہ ہو ،اُسے لوگوں کے درمیان حَکَم نہیں بننا چاہیے، ایسا شخص اگر اپنی رائے سے فیصلہ کرے گا تو اصلاح کے بجائے فساد کا سبب بنے گا اور لاعلمی کی وجہ سے غلط اور باطل فیصلے کرے گا ،حدیث پاک میں ہے :
’’[[arabic: عَنِ ابْنِ بُرَیْدَۃَعَنْ أَبِیْہِ عَنِ النَّبِیِّ ﷺقَالَ:اَلْقُضَاۃُ ثَلَاثَۃٌ:وَاحِدٌ فِی الْجَنَّۃِ، وَاثْنَانِ فِی النَّارِ،فَاَمَّاالَّذِیْ فِی الْجَنَّۃِ فَرَجُلٌ عَرَفَ الْحَقَّ فَقَضٰی بِہٖ،وَرَجُلٌ عَرَفَ]]`
  },
  {
    pageNumber: 477,
    text: `[[arabic: الْحَقَّ فَجَارَ فِی الْحُکْمِ،فَہُوَ فِی النَّارِ،وَرَجُلٌ قَضٰی لِلنَّاسِ عَلٰی جَہْلٍ فَہُوَ فِی النَّارِ ]]‘‘۔
ترجمہ:’’ حضرت بریدہ رضی اللہ عنہ بیان کرتے ہیں: نبی صلی اللہ علیہ وسلم نے فرمایا: قاضیوں کی تین قسمیں ہیں، ایک جنت میں ہوگا اور دو جہنم میں ہوں گے۔جنت میں وہ شخص ہوگا جس کو حق کا علم ہوگا اور وہ اس کے مطابق فیصلہ کرے گا اور جس شخص کو حق کا علم ہو اور پھر وہ فیصلہ میں ظلم کرے ،وہ جہنم میں ہوگا اور جو شخص بغیر علم کے لوگوں کے فیصلے کرے ،وہ بھی جہنم میں ہوگا،(سُنن ابوداؤد:3573)‘‘۔ البتہ اگر وہ علماء سے شرعی حکم معلوم کرکے حق اور انصاف کے مطابق فیصلہ کرے تو جائز ہے ، لیکن یہ قبیح لغیرہٖ ہے ۔
	کسی خاص شعبے کے بارے میں اُس شعبے کے ماہرین سے رہنمائی حاصل کرنا سنت ہے ،جیساکہ حضرت زید بن حارثہ اور اسامہ بن زید کی صحت نسب کے بارے میں نبی کریم صلی اللہ علیہ وسلم نے قیافہ شناس کی رائے کو تائیدی شاہد کے طورپر لیا او راس پر مسرت کا اظہار فرمایا، (صحیح مسلم:1459)‘‘۔
	اگر مسئلہ شرعی ہو تو اس کے لیے کسی مستند ،ثقہ اور صاحبِ علم مفتی کو حَکم بنایا جائے ۔ اگر مسئلہ کا تعلق کسی خاص شعبے سے ہے، جس کے لیے عرف ، عادت سے آگاہی یا فنی مہارت درکار ہے ،تو مفتی کو چاہیے کہ شرعی حکم کے اطلاق سے پہلے اس شعبے کے ماہرین سے ضروری معلومات حاصل کرلیں ۔آج کل پاکستان کے بعض علاقوں میں برادری کی پنچایت بیٹھ جاتی ہے اور جہالت پر مبنی غیر شرعی اور غیر قانونی فیصلے کرکے اسے برادری کے بڑوں کے دباؤ سے منواتے ہیں ، اس پر پابندی کے لیے باقاعدہ قانون سازی ہونی چاہیے۔ ثالثی کا ادارہ اپنی جگہ عوام کے لیے مفید بھی ہے اور بہت سی دشواریوں ، وکلاء کےناجائز فائدہ اٹھانے اور عدالتی پیچیدگیوں سے بچنے کا ذریعہ ہے، اگر حکومت اسے قانونی تحفظ دے تو لوگوں کے لیے آسانی پیداہوں گی ۔آزاد قبائل میں بھی ثالثی نظام ہمارے عدالتی نظام کے طولانی عمل کے مقابلے میں زیادہ سہل ہے اور فوری انصاف کی فراہمی کا ذریعہ ہے،اسلام کی آمد سے پہلے قریش کے قبائل میں بھی یہ نظام کارفرماتھا ۔`
  },
  {
    pageNumber: 478,
    text: `[[heading: مغرب میں دین پر چلنے میں مشکلات ]]
سوال:
	 ایک اچھے مسلمان نے ایک عیسائی عورت سے شادی کی اور وہ مسلمان ہو گئی، میں اُس مسلمان کے درج ذیل سوال کا جواب دینے میں کافی مشکل کا سامنا کر رہا ہوں :
	وہ مسلمان بتاتا ہے کہ اُس کی بیوی نماز (صلوۃ)باقاعدگی سے پڑھتی ہے، مگر جب وہ حیض یا جنابت کا غسل کرتی ہے تو سر کے بالوں پر پانی ڈالنے سے اجتناب کرتی ہے۔جب اُس کو وہ مسلمان خاوند بالوں کو بھی گیلا کرنے کو کہتا ہے تو بس سر پر گیلے ہاتھ پھیر لیتی ہے ۔ وہ بالوں کو گیلا کرنے سے اجتناب اس لیے کرتی ہے کیونکہ اُس نے بال خاص امریکن (مغربی)طرز پر بیوٹی پارلر سے بنوائے ہوتے ہیں اور اُن پر پانی ڈالنے سے بالکل خراب ہو جاتے ہیں اگرچہ وہ بال خشک کرنے کا آلہ (Hair Dryer)استعمال کرتی ہے۔اُس کی بیوی کا بالوں کا بنایا ہوا یہ ایک مشکل مسئلہ بن گیا ہے۔ وہ اُن بالوں کو خراب نہیں کرنا چاہتی اور غسل میں ایسا کرنے سے انکار کرتی ہے، خاوند نے پوچھاہے:کیا وہ غسل میں صرف گیلا ہاتھ پھیر کر نماز پڑھ سکتی ہے ؟ ،اگر وہ اِس کا انکار کرے کہ بالوں کو دھوئے تو کیا یہ اس کو مرتد بنا دے گا؟ ،وہ مسلمان خاوند زور نہیں دینا چاہتا کہ وہ کہیں اِس سے انکار کر کے مرتد نہ ہو جائے،(ڈاکٹر خالد اعوان،ورجینیا، امریکہ)۔
جواب:
قرآنِ مجید میں  اللہ تعالیٰ کا ارشاد ہے:
’’[[arabic: يَا أَيُّهَا الَّذِينَ آمَنُوا ادْخُلُوا فِي السِّلْمِ كَافَّةً وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ]]‘‘۔
ترجمہ:’’اے ایمان والو! اسلام میں پورے پورے داخل ہوجائو اور شیطان کے قدم بقدم`
  },
  {
    pageNumber: 479,
    text: `نہ چلو ،بے شک وہ تمہارا کھلا دشمن ہے، (البقرہ:۲۰۸)‘‘۔ 
اس آیت کی تفسیر میں امام ابن کثیررحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: يَقُولُ تَعَالٰی آمِرًا عِبَادَهُ الْمُوْمِنِيْنَ بِهِ الْمُصَدِّقِينَ بِرَسُوْلِهٖ: أنْ يَاْخُذُوا بِجَمِيْعِ عُرَى الْإِسْلَامِ وَشَرَائِعِهٖ، وَالْعَمَلِ بِجَمِيعِ أَوَامِرِهٖ وَتَرْكِ جَمِيعِ زَوَاجِرِهٖ مَا اسْتَطَاعُوا مِنْ ذٰلِكَ]]‘‘۔
ترجمہ:’’اللہ تعالیٰ نے اپنی ذات پر ایمان رکھنے والے اور اپنے رسول صلی اللہ علیہ وسلم کی تصدیق کرنے والے بندوں کو حکم دیتے ہوئے فرمایا : وہ اسلام اور اس کے تمام شرائع کو مضبوطی سے تھامے رکھیں ، اسلام کے جملہ احکامات پر عمل کریں اورناجائزامور سے اپنی استطاعت کے مطابق اجتناب کریں‘‘۔۔مزید لکھتے ہیں:
’’[[arabic: وَهُوَ أنَّهم أُمِرُوْا [كُلُّهُمْ] أَنْ يَعْمَلُوْا بِجَمِيْعِ شُعَبِ الْإِيمَانِ وَشَرَائِعِ الْإِسْلَامِ، وَهِيَ كَثِيْرَةٌ جِدًّا مَا اسْتَطَاعُوا مِنْهَا]]‘‘۔
ترجمہ: ’’ایمان کے شعبے بہت زیادہ ہیں، تمام اہلِ ایمان کو حکم دیا گیا ہے کہ وہ اپنی استطاعت کے مطابق ایمان کے تمام شعبوں اور اسلام کے جملہ احکامات پر عمل کریں،(تفسیر ابن کثیر:ج:۱، ص:۵۶۶)‘‘۔
نیز اللہ تعالیٰ کا ارشاد ہے:
’’[[arabic: فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِ أَنْ تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ]]‘‘۔
ترجمہ:’’پس جو لوگ رسول کے حکم کی خلاف ورزی کرتے ہیں ،وہ اس سے ڈریں کہ انہیں کوئی مصیبت پہنچ جائے یا انہیں کوئی دردناک عذاب پہنچ جائے،(النور:۶۳)‘‘۔
	نومسلم خاتون کا باقاعدگی سے نماز پڑھنا قابلِ تحسین فعل اور خوش آئند بات ہے ،اللہ تعالیٰ کا فرمان ہے :’’[[arabic: قُلْ لِلَّذِينَ كَفَرُوا إِنْ يَنْتَهُوا يُغْفَرْ لَهُمْ مَا قَدْ سَلَفَ]]‘‘، ترجمہ:’’سو آپ صلی اللہ علیہ وسلم  کافروں سے کہہ دیجیے ! اگر وہ (کفرسے )باز آجائیں تواُن کے پچھلے گناہ معاف کردیے جائیں گے ،(الانفال:38)‘‘۔رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:’’[[arabic: أِنَّ الْإِسْلَامَ یَہْدِمُ مَا کَانَ قَبْلَہٗ]]‘‘،ترجمہ:’’ اسلام گزشتہ گناہوں کو مٹادیتاہے ، (صحیح مسلم:`
  },
  {
    pageNumber: 480,
    text: ` 121)‘‘۔ کاش کہ کفر کو ترک کرکے اسلام قبول کرنے والے افراد فکری اورعملی طورپر ایک نئی پاکیزہ زندگی شروع کرنے پر آمادہ ہوجائیں، لیکن :
[[sher: یہ شہادت گہِ اُلفت میں قدم رکھنا ہے
لوگ آسان سمجھتے ہیں مسلماں ہونا]]
	اسی لیے مرتبۂ احسان کی ایک تعریف یہ کی گئی ہے :’’انسان کا باطن اس کے ظاہر سے زیادہ پاکیزہ ہوجائے ‘‘،ہماری اللہ تعالیٰ کے حضور عاجزانہ دعا ہے کہ اُس نومسلم دینی بہن کی روح کو اللہ تعالیٰ پاکیزہ فرمادے تاکہ اسلامی احکام پر عمل کرنا اسے بار اور ناگوار محسوس نہ ہو۔
	غسل ِ جنابت کا تیسرا اور آخری فرض تمام ظاہر بدن یعنی سر کے بالوں سے پیروں کے تلووں تک جسم کے ہر حصے پر اچھی طرح سے پانی بہانا ہے۔محض اوپرسے بال گیلے کرلینا کافی نہیںہوگابلکہ بالوں کی جڑیں تر ہونا ضروری ہے ،حدیث پاک میں ہے : 
’’[[arabic: عَنْ أُمِّ سَلَمَۃَ قَالَتْ: قُلْتُ:یَا رَسُوْلَ اللّٰہِ! إِنِّی امْرَأَۃٌ أَشُدُّ ضَفْرَ رَأْسِیْ فَاَنْقُضُہُ لِغُسْلِ الْجَنَابَۃِ،قَالَ:لَا.إِنَّمَا یَکْفِیْکِ أَنْ تَحْثِیْ عَلٰی رَأْسِکِ ثَلَاثَ حَثَیَاتٍ ثُمَّ تُفِیْضِیْنَ عَلَیْکِ الْمَاءَ فَتَطْہُرِیْنَ ]]‘‘۔
ترجمہ:’’ حضرت اُمِّ سلمہ رضی اللہ عنہا بیان کرتی ہیں: میں نے عرض کی : یارسول اللہ ! میں اپنے سرکی چوٹی مضبوط گوندھتی ہوں ،توکیا غسلِ جنابت کے لیے اسے کھولوں ؟، آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں !تجھ کو صرف یہی کفایت کرتاہے کہ سرپر تین لپ پانی ڈالے، پھر اپنے اوپر پانی بہالے، پاک ہوجائے گی ،(صحیح مسلم:330)‘‘۔یعنی جب کہ بالوں کی جڑیں تر ہوجائیں تو کافی ہے ،اگر اتنی سخت گُندھی ہوں کہ جڑ تک پانی نہیں پہنچے گا تو کھولنا فرض ہے ۔
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ قَالَ:قَالَ رَسُوْلُ اللّٰہِ ﷺ:إِنَّ تَحْتَ کُلِّ شَعْرَۃٍ جَنَابَۃً فَاغْسِلُوا الشَّعْرَوَأَنْقُوا الْبَشَرَ]]‘‘۔
ترجمہ:’’حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہربال کے نیچے جنابت ہے ،پس بال دھوؤ اور جلد کو صاف کرو،(سُنن ابوداؤد:248)‘‘۔`
  },
  {
    pageNumber: 481,
    text: `جمہور فقہاء کا مذہب یہی ہے کہ جب غسل کرنے والی عورت کے سر کے بالوں کو کھولے بغیرجڑوں تک پانی پہنچ جائے تواس کے لیے سر کے بالوں کو کھولنا ضروری نہیں ہے اوراگر بالوں کو کھولے بغیر جڑوں تک پانی نہ پہنچے تو بالوں کو کھولنا واجب ہے ۔
تنویر الابصار مع الدرّالمختار میں ہے:
’’[[arabic: وَکَفٰی،بَلُّ أَصْلِ ضَفِیْرَتِہَاأَیْ شَعْرِ الْمَرْأَۃِ الْمَضْفُوْرِ لِلْحَرَجِ،أَمَّا الْمَنْقُوْضُ فَیُفْرَضُ غَسْلُ کُلِّہٖ اتِّفَاقًاوَلَوْ لَمْ یَبْتَلَّ أَصْلُہَایَجِبُ نَقْضُہَا مُطْلَقًا ہُوَ الصَّحِیحُ، وَلَوْ ضَرَّہَا غَسْلُ رَأْسِہَا تَرَکَتْہُ، وَقِیلَ تَمْسَحُہٗ وَلَا تَمْنَعُ نَفْسَہَا عَنْ زَوْجِہَا]]‘‘۔
ترجمہ: عورت کے گُندھے ہوئے بالوں کی جڑوں کا تر ہونا کافی ہے ،یعنی حرج کی وجہ سے عورت کے گُندھے ہوئے بالوں کی جڑوں کو تر کرنا کافی ہے( ہرصورت میں بالوں کا کھولنا ضروری نہیں ہے) اور کھلے ہوئے تما م بالوں کا دھونا بالاتفاق فرض ہے ، اگر عورت کے بالوں کی جڑیں تر نہ ہوں تو مطلقاً ان کو کھولنا واجب ہے ،یہی صحیح ہے اور اگر سر دھونے کے سبب تکلیف بڑھنے کا اندیشہ ہو تو سر کو چھوڑدے ،بعض نے کہا: مسح کرلے اور اپنے شوہر کو حقوقِ زوجیت سے نہ روکے ، (حاشیہ ابن عابدین شامی ، ج:1، ص:509-511،دمشق)‘‘۔
علامہ امجدعلی اعظمی رحمۃ اللہ علیہ لکھتے ہیں:
 ’’سر کے بال گندھے نہ ہوں تو ہربال پر جڑ سے نوک تک پانی بہنا اور گندھے ہوںتو مرد پر فرض ہے کہ ان کو کھول کر جڑ سے نوک تک پانی بہائے اور عورت پر صرف جڑتر کرلینا ضروری ہے کھولنا ضروری نہیں ،ہاں اگر چوٹی اتنی سخت گُندھی ہو کہ کھولے بغیر جڑیں ترنہ ہوں گی تو کھولنا ضروری ہے ، (بہارِ شریعت ،جلد اول،ص:317)‘‘۔
ڈاکٹر وھبہ الزحیلی لکھتے ہیں:
 ترجمہ:’’ سر کے بالوں کا دھونا واجب ہے ،خواہ بال گھنے ہوں یا خفیف ،گُندھے ہوئے بالوں کے بارے میں علماء کی آراء میںاختلاف ہے ۔ فقہاء اَحناف کے نزدیک حرج اور تکلیف سے بچنے کے لیے ان بالوں کی جڑوں تک پانی پہنچانا کافی ہے ،ان کو کھولنے کی`
  },
  {
    pageNumber: 482,
    text: `ضرورت نہیں ہے ۔یہی فقہاء مالکیہ کامذہب ہے کہ اگر بالوں کو کھولے بغیر پانی بالوں کی جڑتک پہنچ سکتاہے تو بالوں کو کھولنے کی ضرورت نہیں ہے ۔امام احمد بن حنبل فرماتے ہیں: حیض ونفاس سے پاک ہونے کی صورت میں غسل کے وقت بالوں کو کھولنا واجب ہے ۔ البتہ غسلِ جنابت کے وقت کھولنا ضروری نہیں ہے جبکہ پانی بالوں کی جڑ تک پہنچے۔ امام شافعی فرماتے ہیں: اگرکھولے بغیر گُندھے ہوئے بالوں کی جڑوں تک پانی نہ پہنچ سکے ،تو غسلِ جنابت کے وقت کھولنا واجب ہے ۔خلاصہ کلام یہ ہے کہ اَئمۂ اربعہ کا اس پر اتفاق ہے کہ اگر گُندھے ہوئے بالوں کی جڑوں تک پانی پہنچے توبالوں کا کھولنا واجب نہیں ہے ، اس کی دلیل حضرت اُمّ سلمہ والی حدیث ہے ،
 (فقہ الاسلامی وأدّلتہٗ ، جلداول،ص:525،مُلخصاً)‘‘۔
	جنابت ، جس سے غسل واجب ہوتا ہے ،یہ محض حسّی نہیں بلکہ معنوی نجاست ہے اوریہ ظاہرِ بدن کے انگ انگ اور روئیں روئیں میں سرایت کرتی ہے ، لہٰذا اس کی تطہیر کے لیے ہربال کی جڑ تک پانی کا پہنچنا ضروری ہے ،اس کے بغیر غسلِ جنابت مکمل نہیں ہوگا اور عورت پاک نہیں ہوگی تاوقتیکہ پانی بالوں کی جڑوں تک پہنچ جائے ، جب عورت ناپاک رہے گی تو اس ناپاکی کے ساتھ نمازبھی ادا نہیں ہوگی ۔ اس نجاست کا مدار عقل پر نہیں ہے بلکہ مَہبَطِ وحی سیدالمرسلین صلی اللہ علیہ وسلم نے خود بیان فرمایاہے اوراسے ہم عقل کی بنیاد پر ردنہیں کرسکتے۔محض اوپر سے بالوں کو تر کرنے سے جنابت زائل نہیں ہوگی ۔شوہر کو چاہیے کہ اپنی بیوی کو طہارت کے احکام سکھائے اور اسے بتائے کہ کامل غسل کیے بغیر نماز ادا نہیں ہوسکتی ۔ فقہائے کرام نے لکھا ہے :اگر کوئی نماز کو ہلکا جان کر حالتِ جنابت میں یا کامل طہارت کے بغیر نماز کو جائز سمجھے ،تو یہ کفر ہے۔
تنویر الابصار مع الدرالمختار میںہے : 
’’[[arabic: مُنْکِرُ الْوُضُوْ ءِ ہَلْ یُکْفَرُ إنْ أَنْکَرَ الْوُضُوءَ لِلصَّلَاۃِ، نَعَمْ]]‘‘۔
 ترجمہ:’’ وضو کا منکر کیاکافر ہوگا اگر نماز کے لیے وضو کا انکار کرے ؟،(جواب یہ ہے :)`
  },
  {
    pageNumber: 483,
    text: `ہاں!‘‘۔علامہ ابن عابدین شامی رحمۃ اللہ علیہ اس کی شرح میں لکھتے ہیں:
’’[[arabic: قَوْلُہٗ:مُنْکِرُ الْوُضُوْ ءِ:أَوْ وُجُوبِہٖ،قَوْلُہٗ:نَعَمْ:لِإِنْکَارِہِ النَّصَّ الْقَطْعِیَّ وَہُوَ آیَۃُ:إِذَا قُمْتُمْ وَالْإِجْمَاعَ ]]‘‘۔
ترجمہ:’’منکر وضو یعنی وضو کے وجوب کا منکر، اس لیے کافر ہوگا کہ اُس نے نصِّ قطعی اور اجماع کا انکار کیا،نَصِّ قطعی یہ ہے :’’[[arabic: يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا]]‘‘۔
ترجمہ:’’اے ایمان والو جب تم نماز پڑھنے کا ارادہ کرو (اور تم بے وضو ہو)تو اپنے چہروں کو اور اپنے ہاتھوں کو کہنیوں سمیت دھولو اور اپنے سروں کا مسح کرو اور اپنے پاؤں کو ٹخنوں سمیت دھولو اور اگر تم جنبی ہو تو اچھی طرح پاکیزگی حاصل کرلو ،(المائدہ:6)،(حاشیہ ابن عابدین شامی، جلد1، ص:499،دمشق)‘‘۔
	 اگر اس کے شوہر کی مالی حیثیت اتنی ہے کہ وہ غسل جنابت کے بعد اپنی بیوی کو دوبارہ بال بنوانے کا خرچ دے سکتا ہے توایساکرلے ، ورنہ اسے اللہ تعالیٰ کے غضب اور ناراضی سے ڈرائیں اوردعاکرتے رہیں کہ اللہ تعالیٰ اس کے دل کو قبولِ حق کے لیے نرم فرمادے ، قرآن کریم میں مومن کا یہ وصف بیان فرمایاہے: 
’’[[arabic: اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُّتَشَابِهًا مَّثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ اللَّهِ ۚ ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَن يَشَاءُ ۚ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ]]‘‘۔
ترجمہ:’’ اللہ نے بہترین کلام کو نازل کیا، جس کے مضامین ایک جیسے ہیں ،بار بار دہرائے ہوئے ،جو اپنے رب سے ڈرتے ہیں ،اس سے اُن کے جسموں کے رونگٹے کھڑے ہوجاتے ہیں ،پھر ان کے جسم اور ان کے دل اللہ کے ذکر کے لیے نرم ہوجاتے ہیں، یہ اللہ کی ہدایت ہے ،وہ جس کو چاہتاہے ،اُسے ہدایت دیتاہے ، اور جس کو اللہ گمراہی پر چھوڑے ،`
  },
  {
    pageNumber: 484,
    text: `اسے کوئی ہدایت دینے والا نہیں ،(الزمر:23)‘‘۔
	بالوں کی جڑوں تک پانی پہنچائے بغیر یعنی مکمل غسلِ جنابت ادانہ کرنے کے سبب وہ مستقل حالتِ جنابت میں رہے گی۔اگر وہ غسلِ جنابت کی فرضیت کو مانتی ہے ،لیکن اپنی بشری کوتاہی کے سبب اُس پر عمل نہیں کرتی توفرض کے ترک کی وجہ سے وہ فاسقہ وفاجرہ ہوگی اور مستحقِ عذابِ الٰہی ہوگی، مگرگنہگار ہونے کے باوجود اس کو مرتدہ اور دائرۂ اسلام سے خارج قرار نہیں دیاجائے گا۔ فاسقہ عورت کو طلاق دینا مرد پر واجب نہیںاور اگر شوہر کو اندیشہ ہے کہ طلاق دینے سے وہ مرتدہ ہوجائے گی ، تو کبھی پیار سے اور کبھی سختی سے اُسے سمجھاتا رہے ، شاید اللہ تعالیٰ کسی وقت اُس کے دل کو قبولِ حق پر آمادہ فرمادے ، اللہ تعالیٰ شوہر کوصبر پر اجر عطافرمائے گا ۔ نبی کریم صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ عنہ سے فرمایاتھا :  ’’[[arabic: فَوَاللّٰہِ لَأنْ یَّھْدِیَ اللّٰہُ بِکَ رَجُلاً وَاحِداً خَیْرٌ لَّکَ مِنْ أَنْ یَکونَ لَکَ حُمرُ النَّعَمِ]]‘‘۔ ترجمہ:’’بخدا ! تمہاری وجہ سے اللہ ایک شخص کو ہدایت دیدے تو یہ تمہارے لیے سُرخ اونٹوں کے ریوڑ سے بہتر ہے ، (صحیح البخاری: 4210)‘‘۔واضح رہے کہ اس دور میں سُرخ اونٹوں کا ریوڑ بڑی دولت تھی ۔ نوٹ:سختی سے مراد مارپیٹ نہیں ہے ،بلکہ رویہ اور لہجے میں سختی کرنا مراد ہے ۔
 حضرت جریربن عبداللہ بیان رضی اللہ عنہ کرتے ہیں:
’’ [[arabic: اِنِّی أَتَیْتُ النَّبِیَّ ﷺ قُلْتُ:أُبَایِعُکَ عَلَی الْاِسلَامِ، فَشَرَطَ عَلَیَّ:وَالنُّصْحِ لِکُلِّ مُسْلِمٍ]]‘‘۔
ترجمہ:’’میں نے نبی کریم  صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوکر عرض کی: میں (آپ کے دست اقدس پر) بیعت علی الاسلام کرتاہوں،تو آپ صلی اللہ علیہ وسلم نے ہر مسلمان کے لیے خیرخواہی کی شرط پر میری بیعت لے لی، (صحیح بخاری :58)‘‘۔ابتدائے اسلام میں بیعت علی الاسلام کی اصطلاح قبولِ اسلام کے لیے استعمال ہوتی تھی اور بیعت کا لفظ ہی اس امر پر دلالت کرتاتھا کہ وہ شعوری طورپر اس پر آمادہ ہے کہ اسے اسلام میں داخل ہونے کے`
  },
  {
    pageNumber: 485,
    text: `بعد احکام کی پابندی کرنی ہوگی ۔

[[heading: اسلامی چینل کھولنا ]]
سوال:
	 میں ایک انجینئر ہوں ، حرکت پذیری اور ویڈیو گرافکس کا فن جانتا ہوں، میں youtube.comپر حرکت پذیر(Animation) چینل بنانا چاہتا ہوں، لیکن اس کے لیے مجھے اپنی ویڈیوز میں موسیقی شامل کرنا ہوتا ہے اور میں اس سے بچنا چاہتا ہوں ۔اس سے بچنے کے لیے میں نے یہ منصوبہ بنایا ہے کہ یوٹیوب پر ایک اسلامی چینل کھولوں ،لیکن اس پر میرے ذہن میں یہ اشکال پیدا ہوا کہ آیا قرآن کی تعلیم پر اجرت لینا جائز ہے ،ازراہِ کرم قرآن وسنت کی روشنی میں رہنمائی فرمائیں، (انجینئرفیصل رحمان)۔
جواب:
	قرآنِ مجید اور علومِ دینیہ کی تدریس وتعلیم پر اجرت لینا جائز ہے ،حفظِ قرآن اور دینی علوم کی تدریس کے لیے قائم دینی مدارس وجامعات میں بھی تدریسی وتعلیمی خدمات انجام دینے والے اساتذہ کرام کو مشاہرہ دیا جاتا ہے،تعلیمِ قرآن پر اجرت لینا اَحادیث صحیحہ سے ثابت ہے :
(۱)’’[[arabic: قَالَ ابْنُ عَبَّاسٍ:عَنِ النَّبِیِّ ﷺ:أَحَقُّ مَا أَخَذْتُمْ عَلَیْہِ أَجْرًا کِتَابُ اللّٰہِ]]‘‘۔
ترجمہ:’’ حضرت ابن عباس رضی اللہ عنہما بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جن چیزوں پر تم اجرت لیتے ہو ،اُن میں کتاب اللہ پر اجرت لینے کا سب سے زیادہ حق ہے ، (صحیح بخاری ،بَابُ مَا یُعْطٰی فِی الرُّقْیَۃِ عَلٰی أَحْیَاءِ الْعَرَبِ بِفَاتِحَۃِ الکِتَابِ)‘‘ ۔
(۲)’’[[arabic: عَنِ الْوَضِیْنِ بْنِ عَطَاءٍ،قَالَ:کَانَ بِالْمَدِیْنَۃِ ثَلَاثَۃُ مُعَلِّمِیْنَ یُعَلِّمُوْنَ الصِّبْیَانَ، فَکَانَ عُمَرُ بْنُ الْخَطَّابِ یَرْزُقُ کُلَّ وَاحِدٍ مِنْہُمْ خَمْسَۃَ عَشَرَ کُلَّ شَہْرٍ]]‘‘۔
ترجمہ:’’ وضین بن عطاء بیان کرتے ہیں: مدینہ میں تین معلم تھے ،جو بچوں کو تعلیم دیتے تھے ،حضرت عمر بن خطاب رضی اللہ عنہ ان میں سے ہرایک کو ماہانہ پندرہ درہم دیتے`
  },
  {
    pageNumber: 486,
    text: `تھے ، (مُصنف ابن ابی شیبہ:20835)‘‘۔
(۳)’’[[arabic: عَنْ أَبِی سَعِیْدٍ،أَنَّ رَہْطًا مِنْ أَصْحَابِ رَسُوْلِ اللّٰہِ ﷺانْطَلَقُوْا فِی سَفْرَۃٍ سَافَرُوْہَا،حَتّٰی نَزَلُوْا بِحَیٍّ مِنْ أَحْیَاءِ الْعَرَبِ،فَاسْتَضَافُوْہُمْ فَاَبَوْا أَنْ یُضَیِّفُوْہُمْ،فَلُدِغَ سَیِّدُ ذٰلِکَ الْحَیِّ،فَسَعَوْا لَہٗ بِکُلِّ شَیْئٍ لاَ یَنْفَعُہٗ شَیْئٌ،فَقَالَ بَعْضُہُمْ:لَوْ أَتَیْتُمْ ہٰؤُلَاءِ الرَّہْطَ الَّذِیْنَ قَدْ نَزَلُوْا بِکُمْ،لَعَلَّہٗ أَنْ یَکُوْنَ عِنْدَ بَعْضِہِمْ شَیْئٌ،فَاَتَوْہُمْ فَقَالُوْا:یَا أَیُّہَا الرَّہْطُ!إِنَّ سَیِّدَنَا لُدِغَ،فَسَعَیْنَا لَہٗ بِکُلِّ شَیْءٍلاَ یَنْفَعُہٗ شَیْئٌ،فَہَلْ عِنْدَ أَحَدٍمِنْکُمْ شَیْئٌ،فَقَالَ بَعْضُہُمْ:نَعَمْ،وَاللّٰہِ إِنِّی لَرَاقٍ،وَلٰکِنْ وَاللّٰہِ لَقَدِ اسْتَضَفْنَاکُمْ فَلَمْ تُضَیِّفُوْنَا، فَمَا أَنَا بِرَاقٍ لَکُمْ حَتّٰی تَجْعَلُوْا لَنَا جُعْلًا،فَصَالَحُوْہُمْ عَلٰی قَطِیْعٍ مِنَ الْغَنَمِ،فَانْطَلَقَ فَجَعَلَ یَتْفُلُ وَیَقْرَأُ:اَلْحَمْدُ لِلّٰہِ رَبِّ العَالَمِینَ حَتّٰی لَکَاَنَّمَا نُشِطَ مِنْ عِقَالٍ،فَانْطَلَقَ یَمْشِیْ مَا بِہٖ قَلَبَۃٌ،قَالَ:فَاَوْفَوْہُمْ جُعْلَہُمُ الَّذِیْ صَالَحُوْہُمْ عَلَیْہِ،فَقَالَ بَعْضُہُمْ: اقْسِمُوْا،فَقَالَ الَّذِیْ رَقٰی:اَ تَفْعَلُوْا حَتّٰی نَاْتِیَ رَسُوْلَ اللّٰہِ ﷺ فَنَذْکُرَ لَہُ الَّذِیْ کَانَ، فَنَنْظُرَ مَا یَاْمُرُنَا،فَقَدِمُوْا عَلٰی رَسُوْلِ اللّٰہِ ﷺفَذَکَرُوْا لَہٗ،فَقَالَ:وَمَا یُدْرِیْکَ أَنَّہَا رُقْیَۃٌ،أَصَبْتُمْ،اقْسِمُوْا وَاضْرِبُوْا لِیْ مَعَکُمْ بِسَہْمٍ]]‘‘۔
ترجمہ:’’حضرت ابوسعید رضی اللہ عنہ بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے چند لوگ ایک سفر میں گئے ،سفر کے دوران انہوں نے ایک عرب قبیلے کے پاس پڑاؤ کیا اور ان سے مہمانداری کے لیے کہا،انہوں نے صحابہ کی ضیافت سے انکار کردیا ،پھر اس قبیلے کے سردار کو بچھو نے ڈس لیا ،انہوں نے اس کے لیے ہر جتن کیا ،لیکن کسی چیز سے اس کو فائدہ نہ ہوا ،تو ان میں سے کسی نے کہا: اگرتم ان لوگوں کے پاس جاؤ جوتمہارے قبیلہ میں آکر ٹھہرے ہیں ،شاید ان کے پاس کوئی ایسی چیز ہو جس سے اس کو شفا ہو ،وہ صحابہ کے پاس آئے ،،پس انہوں نے کہا: اے جماعت!ہمارے سردار کو ڈس لیاگیا ہے ،ہم نے اس کے لیے ہرجتن کرلیا اورکسی سے اس کو فائدہ نہیں ہوا ،کیاتم میں سے کسی کے پاس کوئی چیز ہے ؟، پس ان میں سے ایک نے کہا: ہاں! اللہ کی قسم ! میں ضرور دَم کرنے والاہوں ،لیکن بخدا ہم`
  },
  {
    pageNumber: 487,
    text: `نے تم سے ضیافت طلب کی تھی ،تم نے ہماری ضیافت نہیں کی ،سواب میں تم کو دَم کرنے والا نہیں ہوں ،حتّٰی کہ تم ہمارے لیے اجرت مقررکرو ،پس انہوں نے چند بکریوں کے ریوڑ پر صلح کرلی۔ پھر وہ گئے اور تھوکتے تھے اور الحمد للہ رب العالمین پڑھتے تھے ،یہاں تک کہ اس کی برکت سے وہ ایساہوگیا جیسے اس کی رسی کھل گئی ہو اور اس طرح چلنے لگا ،جیسے اسے کوئی تکلیف ہی نہ رہی ہو ۔راوی کابیان ہے کہ انہوں نے مصالحت کے مطابق وعدہ پوراکردیا ، پس بعض صحابہ نے کہا : ان بکریوں کو تقسیم کرد و،سوجنہوں نے دَم کیاتھا ،انہوں نے کہا: ابھی نہ کرو ،حتّٰی کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس جائیں اور آپ سے اس کا ذکر کریں ، پھرہم دیکھیں گے کہ آپ ہمیں کیاحکم دیتے ہیں ؟، پھر لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس گئے اور اس کا آپ سے ذکرکیا ،آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں کیسے معلوم ہوا کہ یہ دَم ہے؟، تم نے صحیح کیا ،ان بکریوں کو تقسیم کرو اور اپنے ساتھ میرا حصہ بھی لگاؤ،(صحیح بخاری:5749)‘‘۔
	پس مُعلِّم قرآن کی اجرت یامشاہرہ العیاذ باللہ!تعلیمِ قرآن کا معاوضہ یا بدل نہیں ہوتا،بلکہ مدرس اپنے وقت کا معاوضہ لیتا ہے ،کیونکہ وہ ایک محدود وقت کے لیے اپنے آپ کو ایک خاص مقام پر ایک خاص فریضے کی ادائیگی کے لیے پابند کرتاہے ۔ اسی طرح آپ جو سیٹ اپ بنائیں گے اور اس نظام کو چلانے اورجاری رکھنے کے لیے آپ کے مصارف آئیں گے اور آپ کا وقت بھی خرچ ہوگا،تو اس کی اجرت لینا جائز ہے اور اس میں شرعاً کوئی قباحت نہیں ہے ۔جو لوگ اسلامی چینل چلا رہے ہیں ، وہ اس کے مصارف کو پورا کرنے کے لیے عام مخیر حضرات یا اپنے کارکنا ن سے عطیات لیتے ہیں ، ورنہ بصورتِ دیگر جیسے آپ کا منصوبہ ہے ،اس سے استفادہ کرنے والوں سے فیس بھی لے سکتے ہیں ۔ لیکن دینی تعلیمات کا چینل خرافات سے پاک ہونا چاہیے ، Animationاور میوزک کا استعمال نہیں ہونا چاہیے ۔ آپ یہ پروگرام کس طرح تشکیل دیتے ہیں ، اس کی تفصیلات جاننے کے بعد ہی فقہی حکم بیان کیا جاسکتا ہے۔ `
  },
  {
    pageNumber: 488,
    text: `[[heading: ذبیحہ سے متعلق چند سوالات ]]
	 میرے کچھ سوالات ہیں ،اگر جواب عنایت ہوجائیں تو نوازش ہوگی، یہاں کوئی عالم یا مفتی صاحبان نہیں ہیں، سنی بھی بہت تھوڑے سے ہیں۔ 
سوال:(1،2،3):
	یہاں جانور ذبح کرنے سے پہلے بیل یا گائے کو شوٹ کیا جاتا ہے ،رائفل میں بے ہوش کرنے کی گولیاں /چھرے ہوتے ہیں، کیا رائفل شوٹ کرنے والا مسلمان ہونا ضروری ہے یا پھر کافر بھی شوٹ کرسکتاہے، مسلمان شوٹ کرتے وقت کچھ پڑھے گا یا بغیر پڑھے ہی شوٹ کرسکتا ہے۔جانور شوٹ ہوجانے کے بعد اگر مرا نہ ہو تو ذبح کیا جاسکتا ہے اور اگر شوٹ کرنے کے بعد مر گیا تو کیا حلال ہوگا؟۔کیا بے ہوش کرنا جائز ہے ،ایک لاٹھی سے یا کسی چھوٹی مشین سے کرنٹ لگایا جاتا ہے جس سے جانور بے ہوش ہوجاتا ہے،بے ہوش کرنے والا مسلمان ہونا ضروری ہے یا کافر بھی کرسکتا ہے ،مسلمان کچھ پڑھ کر بے ہوش کرے گا یا بغیر پڑھے بھی کرسکتا ہے ، کیا آٹو میٹک مشین بے ہوش کرے تو وہ ذبیحہ حلال ہوگا۔(4):کیا ذبح کرتے وقت تکبیر کا زور سے کہنا ضروری ہے یا آہستہ آواز میں تکبیر کہی جاسکتی ہے اور دل میں تکبیر کہی جاسکتی ہے ؟  (5):اگر جانور کو حرام کھانا/غذا کھلائی جارہی ہو تو کیا ذبح حلال ہوگا؟،( عبدالرافع اشرفی ، معرفت مفتی محمد اطہر نعیمی، آکلینڈ، نیوزی لینڈ)۔	
جواب:
	 مغرب کے ذبح خانوں (Butcheries)میںیہ خود کار (Automatic)نظام ہے کہ گائے بیل کو ذبح کرنے سے پہلے لائن میں لگا کراس کے سر پر ہتھوڑا مارتے ہیں یا جیساکہ آپ نے بتایا اس کو چھرے دار گولی سے شوٹ کرتے ہیں تاکہ وہ سُن (Unconscious)ہوجائے اور ذبح کے وقت مزاحمت نہ کرے، اسے Stunکرنا کہتے ہیں۔اگر اس عمل سے جانور میں حیات باقی رہتی ہے اور ذبح کرتے وقت اس کی`
  },
  {
    pageNumber: 489,
    text: `رگوں سے دمِ مسفوح (ذبح کے وقت بہنے والا خون) نکل جاتا ہے ،تو یہ حلال ہے اگرچہ بے ہوش کرنے کا یہ عمل مکروہ ہے کہ جانور کو بلا وجہ ایذا دیناہے۔ جانور کے سر پر یہ ضرب کوئی بھی لگائے، جانورکا گوشت ذبح ہونے کے بعد حلال رہے گا، بشرطیکہ ذبح کے وقت وہ زندہ ہو اور دمِ مسفوح(Poured Blood) رگوں سے نکل جائے ، اس کے سر پر چوٹ لگانا یا اُسے شوٹ کرناذبح کا عمل نہیں ہے ۔ لیکن اگر وہ اس عمل سے مر جائے ،تو پھر وہ مردار ہے ، اسے ذبح کیا جائے یا نہ کیا جائے ،اس کا گوشت کھانا حلال نہیں ہے ، کیونکہ مردار ہونے کے بعد اس کا خون رگوں میں رہ جاتا ہے اور وہ حرام ہوجاتا ہے ۔ جانور کو بے ہوش کرتے وقت کچھ پڑھنا ضروری نہیں ہے ۔ ذبح کرتے وقت زبان سے بسم اللہ اللہ اکبر کہنا واجب ہے ، دل میں تکبیر پڑھ لینا کافی نہیں ہے ،یہ تکبیر کم از کم اتنی آواز سے پڑھی جائے کہ خود اپنے کانوں کو آواز آجائے اوربہتریہ ہے کہ آواز اتنی بلندہوکہ وہاں موجود دوسرے افراد سن سکیں، ذبح کرنے والے کا تکبیر کہنا واجب ہے ،سامنے کھڑے دوسرے شخص کا تکبیر پڑھنا ذبح کے حلال ہونے کے لیے کافی نہیں ہے ۔
	 جانور کی غذا کا حلال ہونا ضروری نہیں ہے ،بہت سے لوگ یہ سوال اس لیے کرتے ہیں کہ اُن کے کہنے کے مطابق مرغیوں کی خوراک (Feed)میں ذبیحے کا خون یا کوئی حرام اجزا ہوتے ہیں ۔ پرانے زمانے میں دیہاتی علاقوں میں مرغیاں چل پھر کر کیڑے مکوڑے بھی کھاتی تھیں ،غلاظت بھی کھالیتی تھیں ،آج کل ان کی خوراک کیمیائی طریقے سے تیار کی جاتی ہے اور جب ایک مرکب (Compound)بننے سے اس کے اجزا کی ماہیت بدل جائے ،تو اس کا حکم بھی بدل جاتا ہے ۔ جو مرغیاں کھلی پھرتی ہوں ،گندگی یا غلاظت کھاتی ہوں ،اُنہیں تین دن تک بند کرکے رکھاجائے اور پاک غذادی جائے تاکہ اس کے پیٹ سے کھائی ہوئی نجاست کا اثر زائل ہوجائے ۔ ان مسائل کی تفصیلات دس مجلّدات پر مشتمل ہمارے فتاویٰ کے مجموعہ ’’تفہیم المسائل‘‘میں موجود ہیں، آپ چاہیں تو قیمت اور ڈاک خرچ بھیج کر ڈی ایچ ایل کے ذریعے منگوا سکتے ہیں۔`
  },
  {
    pageNumber: 490,
    text: `[[heading: پرندوں کے لیے پانی اور باجرہ ڈالنا صدقہ ہے ]]
سوال: 
	کیا پرندوں کو پانی یا باجرہ ڈالنا صدقہ ہے؟،(انیس الرحمن ،کراچی)۔
جواب: 
	اللہ تعالیٰ انسان کی کسی نیکی کے اجر کو ضائع نہیں فرماتا ،اللہ تعالیٰ کا ارشاد ہے :
’’[[arabic: فَإِنَّ اللّٰہَ لاَ یُضِیْعُ أَجْرَ الْمُحْسِنِیْنَ]]‘‘۔ترجمہ:’’بے شک اللہ تعالیٰ نیکیاں کرنے والوں کے اجر کو ضائع نہیں فرماتا ، (یوسف : 90)‘‘۔ نیکی چھوٹی ہو یا بڑی ، اس کا فائدہ انسان کو پہنچے یا کسی دوسرے جاندارکو ، کہیں اسے حقیر نہیں سمجھنا چاہیے۔ 
	اَحادیثِ مبارکہ میں معمولی باتوں پر اجر کو بیان کیاگیا ہے ، آپ  صلی اللہ علیہ وسلم نے فرمایا:’’[[arabic: لَاتَحقِرَنَّ مِنَ الْمَعْرُوْفِ شَیْئًاوَّلَوْتَلْقیٰ اَخَاکَ بِوَجْہٍ طَلِیقٍ]]‘‘۔ترجمہ:’’کسی بھی نیک بات کو حقیر مت جانو ،خواہ تم اپنے بھائی کے ساتھ ہشاش بشاش چہرے کے ساتھ ملو، (صحیح مسلم: 6567)‘‘۔
	جس طرح انسانوں کے ساتھ نیکی کرنے کا اجروثواب ہے اسی طرح جانوروں کے ساتھ بھلائی کرنے کا بھی صلہ ملتا ہے، حدیث ِپاک میں ہے : 
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ رَضِیَ اللّٰہُ عَنْہُ:أَنَّ رَسُوْلَ اللّٰہِ ﷺ قَالَ: بَیْنَمَارَجُلٌ یَمْشِیْ،فَاشْتَدَّ عَلَیْہِ الْعَطَشُ،فَنَزَلَ بِئْرًا،فَشَرِبَ مِنْہَا، ثُمَّ خَرَجَ فَإِذَاہُوَبِکَلْبٍ یَلْہَثُ یَاْکُلُ الثَّرَی مِنَ الْعَطَشِ،فَقَالَ:لَقَدْبَلَغَ ہٰذَا مِثْلُ الَّذِیْ بَلَغَ بِیْ،فَمَلَاَ خُفَّہٗ،ثُمَّ أَمْسَکَہٗ بِفِیْہِ،ثُمَّ رَقِیَ، فَسَقَی الْکَلْبَ،فَشَکَرَ اللّٰہُ لَہٗ،فَغَفَرَ لَہٗ،قَالُوْا:یَارَسُوْلَ اللّٰہِ!وَإِنَّ لَنَا فِی الْبَہَائِمِ أَجْرًا، قَالَ:فِی کُلِّ کَبِدٍ رَطْبَۃٍ أَجْرٌ]]‘‘۔
ترجمہ:’’حضرت ابو ہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہﷺ نے فرمایا:ایک شخص جا رہا تھاکہ اسے شدید پیاس لگی، وہ ایک کنویں میں اترا،پھر اس نے پانی پیااور نکل آیا ،اس نے دیکھا کہ ایک کتا ہانپ رہا ہے اور پیاس کی شدت سے مٹی چاٹ رہا ہے، اُس نے اپنے دل`
  },
  {
    pageNumber: 491,
    text: `میں سوچا : اسے بھی پیاس اسی طرح ستارہی ہے ،جیسے مجھے لگی تھی۔پھر اس نے (کنویں میں اترکر) اپنے موزے میں پانی بھرا اورموزے کو منہ میں پکڑ کر کنویں سے باہر آیا اور پیاسے کتے کو پانی پلایا ۔ اللہ تعالیٰ نے اُس شخص کے اس نیک عمل کو قبول فرمایا اور اس کی مغفرت فرما دی۔ صحابہ نے عرض کی:یا رسول اللہ!کیا جانوروں کے ساتھ نیکی کرنے پر بھی ہمارے لیے اجر ہے ؟، آپ صلی اللہ علیہ وسلم نے فرمایا:ہر جاندار کے ساتھ نیکی کرنے کا ثواب ملتا ہے،(صحیح بخاری: 2363)‘‘۔اس حدیث سے معلوم ہوا کہ جانوروں کو کھلانا پلانا بھی نیکی ہے اورہر نیک عمل صدقہ ہے۔ حضرت جابر بن عبد اﷲرضی اللہ عنہما بیان کرتے ہیں : آپ صلی اللہ علیہ وسلم نے فرمایا:’’[[arabic: کُلُّ مَعْرُوفٍ صَدَقَۃٌ]]‘‘ترجمہ:’’ہر نیک کام صدقہ ہے،(صحیح بخاری: 6021)‘‘۔
	کسی شخص کے لگائے ہوئے پھل دار درخت، فصل یا اناج کو انسان، پرندے اور جانور کھاتے ہیں ،اس پر بھی اُسے اجر ملتا ہے ، حدیث پاک میں ہے :
(۱)’’[[arabic: عَنْ أَنَسِ بْنِ مَالِکٍ رَضِیَ اللّٰہُ عَنْہُ،قَالَ:قَالَ رَسُوْلُ اللّٰہِ ﷺ:مَامِنْ مُسْلِمٍ یَغْرِسُ غَرْسًاأَوْ یَزْرَعُ زَرْعًا،فَیَاْکُلُ مِنْہُ طَیْرٌ أَوْ إِنْسَانٌ أَوْ بَہِیْمَۃٌ،إِلَّا کَانَ لَہٗ بِہٖ صَدَقَۃٌ]]‘‘۔
ترجمہ:’’ حضرت انس بن مالکرضی اللہ عنہ  بیان کرتے ہیں: رسول اللہﷺ نے فرمایا:جو مسلمان بھی کوئی درخت لگاتا ہے یافصل کاشت کرتا ہے۔ پھر اس سے پرندے یا انسان یا مویشی کھاتے ہیں، تو وہ اس کے لیے صدقہ ہے،(صحیح بخاری: 2320)‘‘۔
(۲)’’[[arabic: عَنْ جَابِرٍ،قَالَ:قَالَ رَسُوْلَ اللّٰہِ ﷺ:مَنْ غَرَسَ غَرْسًا أَوْ زَرَعَ زَرْعًا،فَاَکَلَ مِنْہُ إِنْسَانٌ أَوْ طَیْرٌ أَوْ سَبُعٌ أَوْدَابَّۃٌ،فَہُوَ لَہٗ صَدَقَۃٌ]]‘‘۔
ترجمہ:’’ حضرت جابر رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلمنے فرمایا:جس نے درخت لگایا یا فصل کاشت کی ،پھر اس سے  انسان، پرندے، درندے یا چوپائے کھائیں تواس کے لیے صدقہ ہے،(مسنداحمد بن حنبل:15201)‘‘۔اس مضمون کی دیگر روایات بھی موجود ہیں ۔ الغرض انسان ہوں یا چرند وپرند یا درندے یا چوپائے یا حشرات الارض ، جس انسان`
  },
  {
    pageNumber: 492,
    text: `کی محنت سے اُنہیں روزی ملتی ہے ،وہ اُس انسان کے لیے باعثِ اجر ہے ، لہٰذا پرندوں کو پانی اور باجرہ ڈالنا بھی صدقہ ہے، البتہ اس بات کا خیال رکھاجائے کہ اس کے لیے مسجد کے صحن یا عام گزرگاہ سے ہٹ کر جگہ کا انتخاب کیاجائے  ۔
[[heading: اذکار واوراد کی محافل کا انعقاد ]]
سوال:
	 ہمارے گھر میں کچھ عورتیں جمعرات کے دن جمع ہوکر درود شریف پڑھتی ہیں ، ایک صاحب اعتراض کررہے ہیں کہ یہ بدعت ہے ،کیا یہ بدعت ہے ؟،(ایک سائل، بفرزون نارتھ کراچی )۔
جواب:
	اجتماعی طور پر درود شریف کا ورد کرنا شرعاً درست ہے، کارِخیر کے لئے لوگوں کو دعوت دینا باعثِ سعادت اور موجبِ خیر و برکت ہے۔اس حوالے سے صحیح مسلم میں باب کا عنوان ہے :’’[[arabic: بابُ فَضْلِ الْاِجْتِمَاعِ عَلٰی تِلاَوَۃِ الْقُرآنِ وَعَلَی الذِّکْرِ ]]‘‘(قرآن کی تلاوت اورذکر کے لیے اجتماع کی فضیلت )اس عنوان کے تحت ایک قدرے طویل حدیث نمبر6847درج ہے ،اس کے آخر میں لکھاہے : 
’’[[arabic: وَمَا اجْتَمَعَ قَومٌ فِیْ بَیْتٍ مِنْ بُیُوْتِ اللّٰہ، یَتْلُوْنَ کِتَابَ اللّٰہِ وَیَتَدَارَسُوْنَہٗ بَیْنَہُمْ، اِلَّانَزَلَتْ عَلَیْہِمُ السَّکِیْنَۃُ وَغَشِیَتْہُمُ الرَّحْمَۃُ وحَفَّتْہُمُ الْمَلَائِکَۃُ،وَذَکَرَہُمُ اللّٰہُ فِیْمَنْ عِنْدَہٗ وَمَن أَبَطَاَبِہٖ عَمَلُہٗ،لَم یُسْرِعْ بِہٖ نَسَبُہٗ]]‘‘۔  
ترجمہ:’’ جب بھی کچھ لوگ اللہ کے کسی گھر (یعنی مسجد) میں جمع ہوکر کتاب اللہ کی تلاوت کرتے ہیں اورقرآن کی تعلیم حاصل کرتے اور دیتے ہیں،تو (اللہ تعالیٰ کی جانب سے ) اُن پر تسکین نازل ہوتی ہے اوررحمتِ باری تعالیٰ اُنہیں ڈھانپ لیتی ہے اورملائکہ انہیں گھیرلیتے ہیں اوراللہ تعالیٰ اپنے مُقرّبین کی مجلس میں اُن کا ذکر فرماتا ہے اورجس کاعمل اُسے (خیر کو پانے کا) اہل نہ بناسکے تو(محض) نسب (کاشرف) اُسے سرخرو نہیں کرسکتا‘‘ ۔`
  },
  {
    pageNumber: 493,
    text: `اس کی شرح میں علامہ نَووَی لکھتے ہیں:
 ’’یہ حدیث مسجد میں جمع ہوکر قرآن کی تلاوت کرنے کی فضیلت پر دلیل ہے اور یہ ہمارا اور جمہور فقہائِ امت کا مذہب ہے ،اس کے بعد والی حدیث اس پر دلالت کرتی ہے کہ یہ فضیلت مسجد تک محدود نہیں ہے ، بلکہ مدرسہ ، رِباط اورتمام مقامات کے لیے عام ہے ،مسجد کا ذکر کثرتِ وقوع کے طورپر ہے (کیونکہ بالعموم ایسے اجتماعات مساجد میں ہوتے ہیں )‘‘۔
حضرت ابوہریرہ اور حضرت ابوسعید خدری رضی اللہ عنہما بیان کرتے ہیں : ان دونوں نے نبی کریم صلی اللہ علیہ وسلم کے متعلق یہ گواہی دی کہ آپ صلی اللہ علیہ وسلم نے فرمایا: 
’’[[arabic: لَا یَقْعُدُ قَوْمٌ یَذْکُرُوْنَ اللّٰہ عَزَّوَجلَّ اِلّاحَفَّتْہُمُ المَلَائِکَۃُ وَغَشِیَتْہُمُ الرَّحْمَۃُ،وَنَزَلَتْ عَلَیْہِمُ السَّکِیْنَۃُ،وَذَکَرَہُمُ اللّٰہُ فِیْمَنْ عِنْدَہٗ ]]‘‘۔
ترجمہ:’’ جوقوم بھی اللہ عزوجلّ کے ذکر کے لیے بیٹھتی ہے ،اس کو فرشتے گھیرلیتے ہیں ، رحمتِ باری تعالیٰ انہیں ڈھانپ لیتی ہے اوران پر سکینہ نازل ہوتی ہے اوراللہ تعالیٰ ان کا اپنے فرشتوں میں ذکر کرتاہے ،(صحیح مسلم:6849)‘‘۔
	درود شریف کی بابت اللہ تعالیٰ کا ارشاد ہے :’’[[arabic: إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا]]‘‘۔
ترجمہ:’’ بے شک اللہ اور اس کے فرشتے نبی پر درود پڑھتے ہیں ،اے ایمان والو! تم بھی ان  پر درود پڑھو اور بہ کثرت سلام پڑھو،(احزاب:56)‘‘۔
حدیث پاک میں ہے :
’’[[arabic: عَنْ أَبِی ہُرَیْرَۃَ عَنِ النَّبِیِّ ﷺ قَالَ:مَاجَلَسَ قَوْمٌ مَجْلِسًا لَمْ یَذْکُرُوا اللّٰہَ فِیْہِ،وَلَمْ یُصَلُّوْا عَلٰی نَبِیِّہِمْ،إِلَّا کَانَ عَلَیْہِمْ تِرَۃً، فَإِنْ شَاءَ عَذَّبَہُمْ وَإِنْ شَاءَ غَفَرَ لَہُمْ]]‘‘۔
ترجمہ:’’ حضرت ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگ کسی مجلس میں بیٹھیں اوراللہ کا ذکر نہ کریں اورنہ اس کے نبی صلی اللہ علیہ وسلم پر درود پڑھیں توقیامت کے دن ان کی وہ مجلس ان کے لیے باعثِ ندامت ہوگی ،اللہ چاہے گا تو ان کو معاف فرما`
  },
  {
    pageNumber: 494,
    text: `دے گا اوراگر چاہے گاتو مواخذہ فرمائے گا، (سُنن ترمذی:3380)‘‘۔		
حضرت ابی بن کعب رضی اللہ عنہ بیان کرتے ہیں : میں نے عرض کی:
’’[[arabic: یَارَسُوْلَ اللّٰہِ! إِنِّی أُکْثِرُ الصَّلاَۃَ عَلَیْکَ فَکَمْ أَجْعَلُ لَکَ مِنْ صَلاَتِیْ،فَقَالَ:مَا شِئْتَ.قَالَ: قُلْتُ:الرُّبُعَ،قَالَ:مَا شِئْتَ فَإِنْ زِدْتَ فَہُوَ خَیْرٌ لَکَ، قُلْتُ: النِّصْفَ، قَالَ:مَاشِئْتَ،فَإِنْ زِدْتَ فَہُوَ خَیْرٌ لَکَ،قَالَ:قُلْتُ:فَالثُّلُثَیْنِ، قَالَ:مَا شِئْتَ، فَإِنْ زِدْتَ فَہُوَ خَیْرٌ لَکَ، قُلْتُ:أَجْعَلُ لَکَ صَلاَتِی کُلَّہَاقَالَ:إِذًا تُکْفٰی ہَمَّکَ،وَیُغْفَرُ لَکَ ذَنْبُکَ]]‘‘۔
ترجمہ:’’ یا رسول اللہ ! میں آپ پر بہت درود پڑھتاہوں، میں اپنی دعاؤں میں سے آپ پر کتنا وقت درودکے لیے مختص کروں ؟،آپ صلی اللہ علیہ وسلم نے فرمایا: تم جتنا  چاہو ،میں نے عرض کی: کیامیں اپنی دعاؤں میں سے چوتھائی حصہ آپ پر درود پڑھوں؟،آپ صلی اللہ علیہ وسلم نے فرمایا: تم جتنا چاہواوراگر تم زیادہ کرو تووہ بہترہے ، میں نے عرض کی: کیا نصف حصہ؟،آپ صلی اللہ علیہ وسلم نے فرمایا:تم جتنا چاہواوراگر تم زیادہ کرو تووہ بہترہے ، میں نے عرض کی: دوتہائی ؟، آپ صلی اللہ علیہ وسلم نے فرمایا: تم جتنا چاہواور اگر تم زیادہ کرو تووہ بہترہے ،میں نے عرض کی: میں اپنی تمام دعاؤں کے اوقات میں آپ پر درود شریف پڑھوں گا ،آپ صلی اللہ علیہ وسلم نے فرمایا: یہ تمہاری مہم کے لیے کافی ہے اور تمہارا گناہ بخش دیاجائے گا ،(سُن ترمذی:2457 )‘‘۔
علامہ ابن عابدین شامیرحمۃ اللہ علیہ لکھتے ہیں:
’’ [[arabic: (قَوْلُہٗ وَمُسْتَحَبَّۃٌ فِی کُلِّ أَوْقَاتِ الْإِمْکَانِ)أَیْ حَیْثُ لَا مَانِعَ وَنَصَّ الْعُلَمَاءُ عَلَی اسْتِحْبَابِہَا فِیْ مَوَاضِعَ:یَوْمَ الْجُمُعَۃِ وَلَیْلَتَہَا،وَزِیدَ یَوْمَ السَّبْتِ وَالْاَحَدِ وَالْخَمِیْسِ، لِمَا وَرَدَ فِی کُلٍّ مِنَ الثَّلَاثَۃِ،وَعِنْدَ الصَّبَاحِ وَالْمَسَاءِ،وَعِنْدَ دُخُوْلِ الْمَسْجِدِ وَالْخُرُوْجِ مِنْہُ، وَعِنْدَ زِیَارَۃِ قَبْرِہِ الشَّرِیفِ ﷺ وَعِنْدَ الصَّفَا وَالْمَرْوَۃِ،وَفِی خُطْبَۃِ الْجُمُعَۃِ وَغَیْرِہَا،وَعَقِبَ إجَابَۃِ الْمُؤَذِّنِ، وَعِنْدَ الْإِقَامَۃِ،وَأَوَّلِ الدُّعَآءِ وَأَوْسَطِہٖ وَاٰخِرِہٖ،وَعَقِبَ دُعَاءِ الْقُنُوتِ،وَعِنْدَ الْفَرَاغِ مِنْ التَّلْبِیَۃِ،وَعِنْدَ الِاجْتِمَاعِ وَالِافْتِرَاقِ،وَعِنْدَ الْوُضُوْ ءِ، وَعِنْدَ طَنِینِ الْأُذُنِ،وَعِنْدَ نِسْیَانِ الشَّیْئِ،وَعِنْدَ الْوَعْظِ وَنَشْرِ الْعُلُومِ،وَعِنْدَ قِرَائَۃِ]]`
  },
  {
    pageNumber: 495,
    text: `[[arabic: الْحَدِیثِ ابْتِدَاءً وَانْتِہَاءً،وَعِنْدَ کِتَابَۃِ السُّؤَالِ وَالْفُتْیَا، وَلِکُلِّ مُصَنِّفٍ وَدَارِسٍ وَمُدَرِّسٍ وَخَطِیبٍ وَخَاطِبٍ وَمُتَزَوِّجٍ وَمُزَوِّجٍ.وَفِی الرَّسَائِلِ:وَبَیْنَ یَدَیْ سَائِرِ الْأُمُورِ الْمُہِمَّۃِ،وَعِنْدَذِکْرٍ أَوْ سَمَاعِ اسْمِہِ ﷺ أَوْ کِتَابَتِہٖ عِنْدَ مَنْ لَا یَقُوْلُ بِوُجُوبِہَا،کَذَا فِی شَرْحِ الْفَاسِیِّ عَلَی دَلَائِلِ الْخَیْرَاتِ مُلَخَّصًا]]‘‘۔
ترجمہ:’’ جب کوئی مانع نہ ہو توہر وقت صلوٰۃ وسلام پڑھنا مستحب ہے اور فقہاء نے حسبِ ذیل مواقع پر صلوٰۃ وسلام پڑھنے کے مستحب ہونے کی تصریح کی ہے : ’’جمعہ کے دن وشبِ جمعہ، ہفتہ ،اتوار اور جمعرات کے دن بھی ،کیونکہ ان تین دنوں کے متعلق احادیث وارد ہیں ، صبح اورشام کے اوقات میں ، مسجد میں داخل ہوتے اورباہر نکلتے وقت ، رسول اللہ صلی اللہ علیہ وسلم کی قبرِ انور کی زیارت کے وقت ، صفا ومروہ کے پاس ،جمعہ کے خطبہ وغیرہ میں، مؤذن کی اذان کے کلمات کے جواب دینے کے بعد، اقامت کے وقت ،دعا کے اول ،اَوْسَط اور آخر میں، دعاء قنوت کے بعد ،(حج میں)تلبیہ کہنے کے بعد ، لوگوں کے ساتھ باہم ملنے اور جداہونے کے وقت ، وضو کے وقت ، کان میں بھنبھناہٹ کے وقت ،کسی چیز کے بھولنے کے وقت ، وعظ کہنے ، علوم کی اشاعت کے وقت، حدیث پڑھنے کی ابتدا اور انتہاء کے وقت ،سوال اور فتویٰ لکھتے وقت ،ہر تصنیف ،درس اور خطبہ کے وقت ،منگنی اور نکاح پڑھانے کے وقت ،رسائل میں اورہر اہم کام کے وقت ،نبی صلی اللہ علیہ وسلم کا اسمِ مبارک لینے اور سننے اور آپ صلی اللہ علیہ وسلم کا اسمِ مبارک لکھتے وقت درود شریف لکھنے یا پڑھنے کا استحباب ان کے نزدیک ہے، جو ان مواقع پر درود پڑھنے کے وجوب کے قائل نہیں ہیں ، اس کی تفصیل علامہ فاسی نے دلائل الخیرات کی شرح میں کی ہے ،(ردالمحتار علی الدرالمختار ، جلد 2 ، ص:204،بیروت)‘‘۔ 
[[heading: مُقدّس اوراق کی حُرمت اور اُنہیں دوبارہ کارآمد بنانے کا جواز ]]
سوال:
	پاکستان میںاخبار پڑھنے کے علاوہ ردی اور صفائی وغیرہ کے کاموں میں بھی استعمال ہوتا ہے ،اخبار کے صفحات پر قرآنی آیات اور احادیث بھی درج ہوتی ہیں ،اخبار کے غیر`
  },
  {
    pageNumber: 496,
    text: `ضروری استعمال سے قرآنی آیات کی بے حرمتی ہوتی ہے ،کیا اخبار میں قرآنی آیات دینا ضروری ہیں ؟، (زینب، کراچی ) ۔
جواب:
	قرآن مجید اللہ تعالیٰ کا کلام ہے،اور اس کی تکریم ہر مومن پر لازم ہے بلکہ اس کے ایک ایک حرف کی تعظیم لازمی ہے اور کسی بھی قسم کی دانستہ بے حرمتی  ایمان سے محروم ہونے کا سبب ہے ۔ بلکہ مُصْحَف کے علاوہ کہیں بھی اور کسی بھی چیز پر قرآنی آیات تحریر ہوتو اس کا بھی ادب اورتعظیم لازمی ہے اور بے وضو ان کو ہاتھ لگانا ناجائز ہے ۔
	اخبارات میںدرج قرآنی آیات کا بھی یہی حکم ہے ۔اخبارات میں قرآنی آیات شائع نہیں کرنی چاہئیں ،ضرورت کے تحت آیات کے تراجم اور مفہوم پر اکتفا کیاجائے اور اُس کے بھی احترام کی ہدایت درج کی جائے ۔ایسا کاغذ جس پر آیاتِ قرآنی ، اسمائے الٰہی وغیرہ درج ہوں ،اُنہیں کسی دوسرے مقصد کے لیے استعمال کرنا یا اُن کی پڑیا وغیرہ بنانامکروہ ہے ، علامہ نظام الدینرحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَیُکْرَہٗ أَن یَّجْعَلَ شَیْئًا فِی کَاغَذَۃٍ فِیْہَا اِسْمُ اللّٰہ تَعَالٰی کَانَتِ الْکِتَابَۃُ عَلٰی ظَاہِرہَاأَوْ بَاطِنِہَا،بِخِلَاف الْکِیْسِ عَلَیہِ اِسْمُ اللّٰہ تَعَالٰی،فَإنَّہٗ لَا یُکْرَہُ،کَذَا فِی الْمُلْتَقَطْ  ۔۔ وَلَا یَجُوْزُ لَفُّ شَیٍٔ فِیْ کَاغَذٍ فِیْہِ مَکتُوْبٌ مِنَ الْفِقْہِ،وَفِی الْکَلَامِ أَوْلٰی أَن لَا یَفْعَل]]‘‘۔
ترجمہ:’’ جس کاغذ پر اللہ تعالیٰ کام نامِ مبارک درج ہو ،اس میں کوئی چیز رکھنا (خلافِ ادب ہونے کی بناپر)مکروہ ہے ،خواہ وہ تحریر اُس کاغذ کے اندر(کی جانب) ہو یا باہر درج ہو ، تھیلی پر اسمائے الٰہی لکھے ہوں ،اس میں روپیہ رکھنا مکروہ نہیں ہے، جیساکہ ’’مُلتقط‘‘ میں ہے‘‘ ۔۔۔آگے چل کر لکھتے ہیں: ’’ایسا کاغذ جس پر فقہی عبارات درج ہوں ،اُن میں کسی چیز کو لپیٹنا جائز نہیں ہے اور جس چیز پر علم الکلام (یعنی عقائد کے مسائل) درج ہوں ،اس میں تو بطریقِ اَولیٰ ایسانہیں کرنا چاہیے ،(فتاویٰ عالمگیری ،جلد5ِص:322)‘‘۔کیونکہ علم العقائدکی کتابوں میں لازما ً اللہ تعالیٰ ،انبیائے کرام علیہم السلام قرآن وحدیث اوردیگر مُقدسات`
  },
  {
    pageNumber: 497,
    text: `کے حوالے آتے ہیں۔اس سلسلے میں ضروری اُمور یہ ہیں :
(الف):	عام مشاہدہ یہ ہے کہ اخبارات و جرائد میں درج آیاتِ قرآنی یا اُن کے تراجم ، اسمائے مبارکہ کی بے حرمتی معمول بن گئی ہے ۔ حکومت ، اخباری اداروں اور عام مسلمانوں کو اس سنگینی کا پورا پورا احساس کرنا چاہئے، عوامی سطح پر زیادہ سے زیادہ یہ شعور اجاگر کیاجائے اور قرآنی آیات کے احترام کی بابت مسلسل اور نمایاں طورپر تشہیرکی جاتی رہے ۔
(ب):	 سرکاری سطح پر مُقدّس اوراق کی حفاظت کے لئے مساجد، رفاہی اداروں اور عام شاہراہوں پر جگہ جگہ کنستر رکھوا دئیے جائیں اور عوام کو ہدایت کی جائے کہ جس کو بھی کسی جگہ ایسا قابلِ احترام کاغذ پڑا ہوا ملے ،اسے ان ڈبوں میں محفوظ کردیا جائے اور مناسب وقت پر اُن کے خالی کرانے کا اہتمام ہوناچاہیے ۔بہت سی انجمنیں انفرادی طورپر یہ خدمات انجام دے رہی ہیں ،اُن کی سرپرستی کرکے اس کام میں بہتری لائی جاسکتی ہے ۔
(ج):	 ایسے کاغذات کو تلف کرنے کی مختلف صورتوں مثلاً زمین میں دفن کرنے یا بہتے ہوئے پانی یا سمندر میں ڈال دینے یا کیمیکل سے ان کی روشنائی اور تحریر مٹانے کے بعد بقیہ اوراق کو جلادینے کو فقہاء نے جائز قرار دیاہے ۔ زمین میں دفن کرنے کی صورت میں لحد بنائی جائے یاگڑھے میں ڈال کر اس کے اوپر چھت ڈال دی جائے ۔موجودہ دور میں بہترین صورت یہ ہے کہ کیمیکل کے ذریعے مطبوعہ حروف کو مٹا(Wash Out) دیا جائے اور اس کیمیکل سیّال مادّے (Liquid)کوکسی گہرے گڑھے میں بہادیاجائے ۔ اس طرح جو کچھ باقی بچے گا ، وہ کاغذ نہیں رہے گا بلکہ گودے (Pulp)کی شکل میں ہوگا، اُس کی ماہیّت بدل جائے گی، اس کے بارے میں ہمارا موقف یہ ہے کہ ماہیّت کے بدل جانے کے بعد چیز کا حکم بھی بدل جاتا ہے ، لہٰذا اب وہ اوراق قرآن نہیں ہیں ۔ پس انہیںدوبارہ کارآمد بناکر یعنی Recyclingکرکے کام میں لایا جاسکتا ہے، خواہ اس گودے سے کاغذ بنایاجائے یا گتا بنایاجائے یاکوئی اورچیز ،الغرض Recycling کے بعد اس کا استعمال جائز ہے ،اس کے لیے تفصیلی اور مُدلل فتویٰ ہمارے مجموعۂ فتاویٰ ’’تفہیم المسائل ‘‘ جلدششم ، ص:480میں`
  },
  {
    pageNumber: 498,
    text: `موجود ہے ،اہلِ علم اور فہمِ دین میں دلچسپی رکھنے والے حضرات اس کا مطالعہ فرمائیں ۔
[[heading: ٹریفک قوانین کی خلاف ورزی کا شرعی حکم ]]
سوال:
	کیا ٹریفک قوانین کی خلاف ورزی کرنا حرام ہے؟،(سید سعدعلی ، نارتھ کراچی )۔
جواب:
	 آج کل تمام متمدن ممالک میں شہری قوانین (Civic Laws)نافذہیں، ان میں ٹریفک قوانین بھی شامل ہیں، یہ قوانین بالعموم ٹریفک کو رواں دواں رکھنے اور ٹریفک حادثات کے امکان کو ممکن حد تک کم کرنے کے لیے ہوتے ہیں، اس لیے ان قوانین کی پابندی خود انسان کے اپنے مفاد میں ہوتی ہے، نیز رسول اللہ صلی اللہ علیہ وسلم کا فرمان ہے: 
’’مومن کو چاہیے کہ وہ اپنے آپ کو ذلت سے دوچار نہ کرے،صحابہ نے عرض کی: یارسول اللہ! کوئی اپنے آپ کو ذلت سے کیوں دوچار کرے گا، آپ صلی اللہ علیہ وسلم نے فرمایا: وہ اپنے آپ کو ایسی مصیبت سے دوچار کرے جس سے وہ (باعزت طور پر) نجات نہیں پاسکتا، (سنن ترمذی:2254)‘‘۔لہٰذا ٹریفک قوانین کا بنیادی طور پر اسلام کے احکامِ حلال وحرام سے تعلق نہیں ہے، لیکن چونکہ قانون شکنی کی صورت میںانسان ممکنہ طور پرحادثے سے دوچار ہوسکتا ہے اورمومن پراپنی جان کا تحفظ لازم ہے، مزید یہ کہ مومن کی عزت نفس خطرے سے دوچار ہوسکتی ہے،جس میں قید  وجرمانہ اورتحقیرشامل ہے، لہٰذا ہم اسے فقہی اعتبار سے ’’حرام لغیرہٖ‘‘ کہہ سکتے ہیں۔ فقہ میں’’حرام لغیرہٖ‘‘اُسے کہتے ہیں کہ شریعت کی رو سے کوئی چیز فی نفسہٖ حرام نہ ہو، لیکن ایک امرِ خارج لاحق ہونے کی وجہ سے وہ ممنوع قرار پائے۔مثلاً: دو افراد کا باہمی رضا مندی سے خرید وفروخت کا عقد کرناجائز ہے، لیکن سورۂ جمعہ میں فرمایا: ’’ جب نمازِجمعہ کے لیے پکارا جائے ،تواللہ کے ذکر (نماز) کی طرف دوڑے چلے آئو اور کاروبار چھوڑ دو، (الجمعہ:9)‘‘۔ مفسرین کرام نے فرمایا کہ اگر کوئی شخص’’ سعی الیٰ ذکر اللّٰہ‘‘ کو ترک کر کے کاروبار میں مشغول رہتا ہے ،تو یہ حرام ہے ،`
  },
  {
    pageNumber: 499,
    text: `لیکن اگر وہ کشتی میں یا گاڑی میں یا سواری پر بیٹھ کر نماز کے لیے چل پڑا ہے اور راستے میں چلتے ہوئے کسی کے ساتھ خرید وفروخت کی بات چیت کر رہا ہے ،تو یہ ممنوع نہیں ہے، کیونکہ یہ’’ سعی الیٰ ذکر اللہ ‘‘ میں حرج کا سبب نہیں ہے ۔پس ٹریفک قوانین کی خلاف ورزی بھی فقہی حکم کے اعتبار سے ’’حرام لغیرہٖ‘‘ ہے۔ 
[[heading: لا علاج مریض کو تکلیف سے نجات دینے کے لیے ]]
[[heading: موت کا انجیکشن لگانا جائز نہیں ]]
سوال:
	کیا شدید تکلیف میں مبتلا لاعلاج مریض زندگی کے کرب سے نجات پانے کے لیے موت کا انجیکشن لگوا سکتا ہے؟،(ایم۔منور،ملیر)۔
جواب:	
	بعض ممالک میں مرض الموت میں مبتلا مریضوں سے لائف سپورٹنگ آلات ہٹانے کی اجازت دی گئی ہے اور بعض میں زہریلے انجکشن یا کسی دوا کے ذریعے موت کو آسان بنانے کی بھی گنجائش رکھی گئی ہے، بشرطیکہ مریض خود بحالتِ ہوش یا اُس کے قانونی ورثا اور میڈیکل ٹیم اس کی اجازت دیں۔علاج سنت ہے ، زندگی اور موت اللہ تعالیٰ کی قدرت میں ہے، البتہ مومن کو اس ضمن میں بشارت ضرور دی گئی ہے ،رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:
(1):’’[[arabic: عَجَبًا لِاَمْرِ الْمُوْمِنِ، إِنَّ أَمْرَهُ كُلَّهٗ خَيْرٌ، وَلَيْسَ ذَاكَ لِاَحَدٍ إِلَّا لِلْمُوْمِنِ، إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ، فَكَانَ خَيْرًا لَهٗ  وَإِنْ أَصَابَتْهُ ضَرَّاءُ، صَبَرَ فَكَانَ خَيْرًا لَهٗ]]‘‘۔
ترجمہ:’’مومن کا معاملہ بھی عجیب ہے، اس کے ہر کام میں اس کے لیے بھلائی ہے اور یہ چیز مومن کے سوا کسی کو حاصل نہیں۔ اگر اسے خوش حالی پہنچتی ہے اوروہ اس پر اللہ کا شکر ادا کرتا ہے، تو یہ تشکر اس کے لیے بہتر ہے (یعنی اس میں اس کے لیے اجر ہے)اور اگر اسے تکلیف لاحق ہوتی ہے اور وہ اس پر صبر کرتا ہے تو یہ صبر کرنا اس کے لیے بہتر ہے (کیونکہ صبر کرنابجائے خود نیک عمل اور باعث اجر ہے)،(صحیح مسلم:2999)‘‘۔`
  },
  {
    pageNumber: 500,
    text: `(2):’’[[arabic: مَا يُصِيْبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلَا وَصَبٍ وَلَا هَمٍّ وَلَا حُزْنٍ وَلَا أَذًى وَلَا غَمٍّ، حَتّٰى الشَّوْكَةِ يُشَاكُهَا، إِلَّا كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ]]‘‘۔
ترجمہ:’’مسلمان کو جو بھی کوئی تکلیف ، مصیبت ،غم اور اذیت پہنچتی ہے یہاں تک کہ کانٹا جو اُسے چبھ جائے ،تو اللہ تعالیٰ (اس مصیبت پر صبر کرنے کے صلے میں) اسے اس کے گناہوں کا کفارہ بنا دیتا ہے، (صحیح البخاری: 5641)‘‘۔
 (3):’’[[arabic: إِنَّ الرَّجُلَ لِيَكُوْنُ لَهٗ عِنْدَ اللَّهِ الْمَنْزِلَةُ، فَمَا يَبْلُغُهَا بِعَمَلٍ فَمَا يَزَالُ اللَّهُ يَبْتَلِيْهِ بِمَا يَكْرَهُ، حَتّٰى يُبَلِّغَهٗ إِيَّاهَا]]‘‘۔
ترجمہ:’’بے شک جب اللہ کے ہاں کسی شخص کے لیے کوئی بلند مرتبہ مقدر ہوجاتا ہے اور وہ (اپنے اعمال کے ذریعے)اس کا حق دار نہیں بن پاتا تو اللہ تعالیٰ اُسے کسی ناگوار مصیبت میں مبتلا فرمادیتا ہے ( پھر وہ اس پر صبر کرتا ہے )یہاں تک کہ وہ اس مقام کا حق دار ہوجاتا ہے، (مسند ابویعلیٰ:6095)‘‘۔
(4):’’[[arabic: عَطَاءُ بْنُ أَبِي رَبَاحٍ، قَالَ: قَالَ لِي ابْنُ عَبَّاسٍ:أَلاَ أُرِيْكَ امْرَأَةً مِنْ أَهْلِ الْجَنَّةِ،  قُلْتُ:بَلٰی، قَالَ: هٰذِهِ الْمَرْأَةُ السَّوْدَاءُ أَتَتِ النَّبِيَّ ﷺ فَقَالَتْ: إِنِّي أُصْرَعُ، وَإِنِّي أَتَكَشَّفُ، فَادْعُ اللَّهَ لِي، قَالَ:إِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ، وَإِنْ شِئْتِ دَعَوْتُ اللَّهَ أَنْ يُعَافِيَكِ، فَقَالَتْ: أَصْبِرُ، فَقَالَتْ: إِنِّي أَتَكَشَّفُ، فَادْعُ اللَّهَ لِيْ أَنْ لَا أَتَكَشَّفَ، فَدَعَا لَهَا]]‘‘۔
ترجمہ:’’حضرت عبداللہ بن عباسرضی اللہ عنہما نے(عطابن ابی رباح سے) کہا: میں تمہیں جنتی عورت نہ دکھائوں؟، عطا بن ابی رباح نے کہا: ضرور دکھائیے، حضرت ابن عباس نے کہا:یہ وہ سیاہ فام عورت ہے جو نبی صلی اللہ علیہ وسلم کے پاس آئی اور عرض کی:مجھ پر مرگی کا دورہ پڑتا ہے اور میرا ستر کھل جاتا ہے ، آپ میرے لیے اس مرض سے شفا کی دعا فرمائیں ۔نبی صلی اللہ علیہ وسلم نے فرمایا:اگر تم چاہو تو صبر کرو اور تمہارے لیے جنت ہے اور اگر تم چاہو تو میں اللہ سے دعا کرتا ہوں کہ تمہیں اس مرض سے نجات دیدے ۔اس عورت نے عرض کی: میں صبر کروں`
  },
  {
    pageNumber: 501,
    text: `گی، اُس نے پھر یہ التجا کی: مرگی کے دورے کے دوران میرا ستر کھل جاتا ہے ،آپ بس اتنی دعا فرمادیجیے کہ دورے کے دوران میرا ستر قائم رہے، پس آپ صلی اللہ علیہ وسلم نے اس کے لیے (دورے کے دوران ستر قائم رہنے کی )دعافرمائی،(صحیح البخاری: 5652)‘‘۔
(5):’’[[arabic: يَوَدُّ أَهْلُ الْعَافِيَةِ يَوْمَ الْقِيَامَةِ حِينَ يُعْطٰى أَهْلُ الْبَلاَءِ الثَّوَابَ لَوْ أَنَّ جُلُوْدَهُمْ كَانَتْ قُرِضَتْ فِي الدُّنْيَا بِالْمَقَارِيضِ]]‘‘۔
ترجمہ:’’جب قیامت کے دن (دنیا میں)مصیبتیں برداشت کرنے والے لوگوں کو اُن کے صبر پر ثواب عطا کیاجائے گا تو(دنیا میں)عافیت میں زندگی گزارنے والے اس وقت تمنا کریں گے: کاش! دنیا میں قینچیوں سے ان کی کھالیں کاٹ دی گئی ہوتیں (اور وہ آج اس کا اجر پاتے)، (سنن ترمذی:2402)‘‘۔
	ایسا مُہلک مرض جس کی بابت ماہر طبیب یہ کہے کہ مریض کی صحت مند بحالی کے ظاہری امکانات معدوم ہیں ،اُسے زبردستی اذیت دے کر وینٹی لیٹر یا طبی مشینوں کے ذریعے زندہ رکھا جائے ،اسلام اس کا مکلف نہیں بناتا۔یہ بھی آخری درجے کے مریض کے لیے انتہائی کرب کے لمحات ہوتے ہیں، آلات پر صرف اس صورت میں زندہ رکھنے کی کوشش کی جائے، جب کہ بظاہراُس کے بچنے اورمفید زندگی گزارنے کے امکانات ظنِ غالب یا ظنِ محض کے درجے میں ہوں، ایسے مرحلے پر ماہر ڈاکٹر کی رائے کا اعتبار ہوگا، لیکن محض اسپتالوں کا بل بنانے کے لیے مریض کو کرب میں مبتلا کرنا شریعت کا مطلوب نہیں ہے۔ 
	لیکن اسلام اس کی بھی اجازت نہیں دیتا کہ ماہر ڈاکٹر کی رائے کے مطابق جس مریض کے بظاہر بچنے کے امکانات معدوم ہیں،کوئی زہریلا انجکشن لگاکر یا کسی کیمیکل طریقے سے تکلیف میں مبتلا اُس مریض کی موت کو آسان بنا دیا جائے ، خواہ اس میں اُس کی اپنی اور اس کے قانونی ورثا کی رضا مندی بھی شامل ہو۔ہر شخص جانتا ہے کہ حیات وموت کا قطعی علم اللہ کے پاس ہے ،انسان نیک نیتی سے اپنے علم اور تجربے کی روشنی میں قیاسات اور ظنیات پر رائے قائم کرسکتا ہے۔ `
  },
  {
    pageNumber: 502,
    text: `اللہ تعالیٰ کا ارشاد ہے:(1)’’[[arabic: وَلَا تَقْتُلُوا أَنفُسَكُمْ ۚ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا]]‘‘۔
ترجمہ:’’اور اپنے آپ کو قتل نہ کرو، بے شک اللہ تم پر نہایت مہربان ہے، (النساء:29)‘‘۔
(2):’’[[arabic: وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ]]‘‘،ترجمہ:’’ اور اپنے ہاتھوں آپ کو ہلاکت میں نہ ڈالو ،(البقرہ:195)‘‘۔ اسلام میں مطلقاً موت کی تمنا کرنا بھی منع ہے،نبی کریم صلی اللہ علیہ وسلم نے فرمایا:’’[[arabic: لاَ يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهٗ، فَإِنْ كَانَ لاَ بُدَّ فَاعِلًا، فَلْيَقُلْ:  اَللّٰهُمَّ أَحْيِنِيْ مَا كَانَتِ الْحَيَاةُ خَيْرًا لِيْ، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِيْ]]‘‘۔
ترجمہ: ’’تم میں سے کوئی شخص کسی تکلیف کے پہنچنے کے سبب موت کی تمنا نہ کرے اور اگر وہ ضرور ایسا کرنا ہی چاہتا ہے تو یہ کہے: اے اللہ!(تیرے علم کے مطابق )اگر   میرے لیے حیات بہتر ہے تو مجھے زندہ رکھ اوراگر(تیرے علم کے مطابق) وفات میرے لیے بہتر ہو تو مجھے وفات عطا کر،(صحیح البخاری:5671)‘‘۔یعنی یہ فیصلہ خود نہ کرے بلکہ اپنے آپ کو تقدیر الٰہی کے سپرد کردے ،احادیثِ مبارکہ میں ہے:
(1)’’رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:’[[arabic: مَنْ قَتَلَ نَفْسَهٗ بِحَدِيْدَةٍ فَحَدِيْدَتُهٗ فِي يَدِهٖ يَتَوَجَّاَ بِهَا فِي بَطْنِهٖ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيْهَا أَبَدًا، وَمَنْ شَرِبَ سُمًّا فَقَتَلَ نَفْسَهٗ فَهُوَ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيْهَا أَبَدًا، وَمَنْ تَرَدّٰى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهٗ فَهُوَ يَتَرَدّٰى فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيْهَا أَبَدًا]]‘‘۔
ترجمہ: جس نے اپنے آپ کو آہنی ہتھیار سے قتل کیا ،تو وہ ہتھیار اس کے ہاتھ میں ہوگا ، وہ نارِ جہنم میں ہمیشہ رہے گا اور وہ ہتھیار اپنے پیٹ میں گھونپتا رہے گااور جس نے زہر پی کر اپنے آپ کو ہلاک کیا ، تو وہ نارِ جہنم میں ہمیشہ رہے گا اور زہر پیتا رہے گا اور جس نے کسی پہاڑ سے گر کر اپنے آپ کو ہلاک کیا تو وہ نارِ جہنم میں ہمیشہ رہے گا اور (جہنم کی وادیوں میں )لڑھکتا چلا جائے گا،(صحیح مسلم:109)‘‘۔یعنی خود کشی اور اپنے آپ کو ہلاک کرناحرام فعل ہے اور اس پر آخرت میں سزا ہے ، کیونکہ انسان اپنی جان کا مالک نہیں ہے ۔`
  },
  {
    pageNumber: 503,
    text: `(2)’’حضرت جابرایک طویل حدیث میں بیان کرتے ہیں:
’’[[arabic: فَلَمَّا هَاجَرَ النَّبِيُّ ﷺ إِلَى الْمَدِينَةِ، هَاجَرَ إِلَيْهِ الطُّفَيْلُ بْنُ عَمْرٍو وَهَاجَرَ مَعَهٗ رَجُلٌ مِنْ قَوْمِهٖ، فَاجْتَوَوُا الْمَدِينَةَ، فَمَرِضَ، فَجَزِعَ، فَاَخَذَ مَشَاقِصَ لَهٗ، فَقَطَعَ بِهَا بَرَاجِمَهُ، فَشَخَبَتْ يَدَاهُ حَتّٰى مَاتَ، فَرَآهُ الطُّفَيْلُ بْنُ عَمْرٍو فِي مَنَامِهٖ، فَرَآهُ وَهَيْئَتُهُ حَسَنَةٌ، وَرَآهُ مُغَطِّيًا يَدَيْهِ، فَقَالَ لَهٗ: مَا صَنَعَ بِكَ رَبُّكَ، فَقَالَ: غَفَرَ لِيْ بِهِجْرَتِي إِلٰی نَبِيِّهٖ ﷺ، فَقَالَ:مَا لِيْ أَرَاكَ مُغَطِّيًا يَدَيْكَ، قَالَ: قِيْلَ لِيْ: لَنْ نُصْلِحَ مِنْكَ مَا أَفْسَدْتَ، فَقَصَّهَا الطُّفَيْلُ عَلٰی رَسُوْلِ اللهِ ﷺ، فَقَالَ رَسُوْلِ اللهِ ﷺ:اَللّٰهُمَّ وَلِيَدَيْهِ فَاغْفِرْ]]‘‘۔
ترجمہ:’’ جب نبی صلی اللہ علیہ وسلم نے مدینے کی طرف ہجرت کی تو آپ کے ساتھ حضرت طفیل بن عمرو دَوسی اور اُن کی قوم کے ایک شخص نے بھی ہجرت کی ، اس شخص کو مدینے کی آب وہوا راس نہ آئی ،سو وہ بیمار ہوگیااور فریاد کرنے لگا۔پس (تکلیف سے بے قابو ہوکر )اس نے چوڑے پھل کا ایک تیر لیا اور اپنی انگلیوں کو جوڑوں سے کاٹ دیااور اس کے ہاتھوں سے خون بہتا رہا یہاں تک کہ (خون کی کمی کے سبب )وہ فوت ہوگیا۔ پھر اسے طفیل بن عَمرو نے اپنے خواب میں اچھی حالت میں دیکھا ۔انہوں نے دیکھا کہ اس کے ہاتھوں پر ڈاٹا بندھا ہوا ہے ، طفیل نے اس سے پوچھا: آپ کے رب نے آپ کے ساتھ کیا سلوک کیا؟، اس نے جواب دیا: نبی صلی اللہ علیہ وسلم کے ساتھ ہجرت کی برکت سے اللہ نے مجھے بخش دیا ۔پھر انہوں نے پوچھا: یہ آپ کے ہاتھوں پر ڈاٹا بندھا ہوا میں کیا دیکھ رہا ہوں؟، اس نے جواب دیا: مجھے فرمایا گیا: جس چیز کو تم نے خود بگاڑا ہے ،ہم اُسے ہرگز درست نہیں کریں گے ، پس جب طفیل نے یہ خواب رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کیا تو آپ صلی اللہ علیہ وسلم نے دعا کی: اے اللہ! اس کے دونوں ہاتھوں کی خطا کو بھی بخش دے، (صحیح مسلم:116)‘‘۔صحابۂ کرام خوش نصیب تھے کہ اُن کی مشکل آسان کرنے کے لیے نبی کریم صلی اللہ علیہ وسلم اُن کے درمیان موجود تھے ، ہم صرف شرعی احکام پر سختی سے عمل کرنے کے پابند ہیں۔`
  },
  {
    pageNumber: 504,
    text: `[[heading: سوشل میڈیا کا استعمال ]]
سوال:
	کیا فیس بک ودیگر سوشل میڈیا کا استعمال جائز ہے،نیز ٹیلی ویژن کی مرمت کی آمدنی اور سوشل میڈیا اور یوٹیوب سے حاصل ہونے والی آمدنی جائز ہے،(محمدرمیز، سرجانی ٹاؤن)۔
جواب:	
	ٹیلی وژن ،فیس بک اور سوشل میڈیا وغیرہ دودھاری تلوار ہے، اس کا مثبت اور منفی دونوں طرح کا استعمال ہوسکتا ہے، مقاصد خیر کے لیے ان چیزوں کا استعمال جائز اور مباح ہے، واجب اور لازم نہیں ہے۔مباح امور کے لیے ان اشیاء کا استعمال مباح ہے اور حرام امور کے لیے حرام ہے، لیکن اگر قرائن وشواہد کی روشنی میں حکومت سمجھتی ہے کہ اس کا شر خیر پر غالب آرہا ہے تو وہ اس کے استعمال پر پابندی لگاسکتی ہے یاوہ ایسی مہارت حاصل کرے کہ ان پر چیک رکھا جائے اورنقصان دہ چیزوں کو فلٹر کرنے کا کوئی انتظام ہو۔ ابتدائے اسلام میں حرمت خمر کا قطعی حکم آنے سے پہلے اسلام نے اسی اصول کی بنیاد پرشراب اور جوئے کو روکا تھا،ارشادِ باری تعالیٰ ہے:’’(یہ)آپ سے خمر اور جوئے کے بارے میں پوچھتے ہیں، آپ کہہ دیجیے: ان دونوں میں بڑا گناہ ہے اور لوگوں کے لیے کچھ فوائد بھی ہیں،اور ان کا گناہ ان کے نفع سے زیادہ ہے،(البقرہ:219)‘‘۔ چنانچہ قرآنِ کریم نے گناہ کے غلبے کو قلیل نفع پر ترجیح دیتے ہوئے اس سے منع فرمایا،بعد میں شراب کی حرمت کا واضح حکم قرآنِ کریم میں نازل ہوااوراس کی حرمت کو کئی تاکیدات کے ساتھ مؤکد فرمایا۔ تاہم سوشل میڈیا اور انٹرنیٹ پر محرمات کو دیکھنے سے ہر صورت میں اجتناب لازم ہے،الغرض ان کا خیر ،خیر ہے اور شر،شر ہے۔ 
مفتی وقار الدین قادری رحمۃ اللہ علیہ لکھتے ہیں:
 ’’ریڈیو اور ٹیلی ویژن مشینی آلات ہیں، ان سے جائز کام بھی لیے جاتے ہیں اور ناجائز کام`
  },
  {
    pageNumber: 505,
    text: `بھی، یہ صرف حرام کاموں کے لیے استعمال نہیں ہوتے اور نہ محض غلط کاموں کے لیے بنائے جاتے ہیں، جس طرح چھری اور بندوق اور دیگر مہلک آلات سے جہاد بھی کیا جاتا ہے اور اپنے ذاتی کاموں اور شکار میں بھی استعمال کیے جاتے ہیں اور انہی سے انسان کو قتل کرنے والا قبیح فعل بھی کیا جاتا ہے۔ لہٰذا جو آلات صرف معصیت کے لیے متعین نہ ہوں، ان کا بنانا اور مرمت کرنا جائز ہے ،تو ریڈیو اور ٹیلی ویژن کی مرمت کرنا بھی جائز ہے، اسی طرح اس کی مرمت کی اجرت بھی حلال ہے، (وقارالفتاویٰ، ج:1،ص:219)‘‘۔
	آج کل سوشل میڈیا پر لوگ اپنے مخالفین کی تذلیل اور تضحیک کرتے ہیں،یہ کسی طور پر بھی جائز نہیں ہے ، حدیث پاک میں ہے:
’’[[arabic: وَیْلٌ لِلَّذِی یُحَدِّثُ بِالْحَدِیثِ لِیُضْحِکَ بِہِ الْقَوْمَ فَیَکْذِبُ، وَیْلٌ لَہٗ وَیْلٌ لَہٗ ]]‘‘۔
ترجمہ:’’اس کے لیے افسوس ہے جو قوم کو ہنسانے کے لیے جھوٹی باتیں گھڑ کر بیان کرتا ہے ، اس کے لیے افسوس ہے، اس کے لیے تباہی ہے،(سنن ترمذی:2315)‘‘۔اسی طرح جھوٹ پر مبنی باتیں پھیلانا بھی ناجائز ہے، جنہیں عرفِ عام میں ’’افواہ‘‘ سے تعبیر کیا جاتا ہے ، حدیث پاک میں ہے:
’’[[arabic: قَالَ رَسُوْلُ اللّٰہِ ﷺ:کَفٰی بِالْمَرْء ِ کَذِبًا أَنْ یُحَدِّثَ بِکُلِّ مَا سَمِعَ]]‘‘۔
ترجمہ: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:کسی شخص کے جھوٹا ہونے کے لیے اتنا ہی کافی ہے کہ وہ ہر سنی سنائی بات کو (تحقیق کے بغیر)آگے پھیلاتا پھرے،(صحیح مسلم:5)‘‘۔سوشل میڈیا کے غلط استعمال میں وقت کا ضیاع ،لوگوں کی اذیت رسانی ،غیر مستند اقوال کو حدیث بناکر پیش کرنا وغیرہ یہ سب امورشریعت کی روسے ممنوع ہیں ، البتہ اُسے امر بالمعروف اورنہی  عن المنکر کے لیے استعمال کرنا مستحسن ہے ۔
[[heading: خون کا عطیہ دینا ]]
سوال:
	کیا خون کاعطیہ کرنا اور اس کی خرید وفروخت جائز ہے،نیز غیر مسلم کو خون کا عطیہ دینا یا`
  },
  {
    pageNumber: 506,
    text: `لینا کیسا ہے؟،(آدم، ٹھٹھہ سندھ)۔
جواب:
	محض جسمانی تقویت کے لیے کسی کو خون دینا اور ایسے شخص کا لینا جائز نہیں ہے، البتہ ’’[[arabic: اَلضَّرُوْرَاتُ تُبِیْحُ الْمَحْظُوْرَاتِ]]‘‘ کے تحت کسی شخص کی زندگی بچانے کے لیے خون کا عطیہ دیا بھی جاسکتا ہے اور لیا بھی جاسکتا ہے، بشرطیکہ خود خون کا عطیہ دینے والے کی زندگی کو خطرہ لاحق نہ ہو۔ اجنبی مرداور عورت ایک دوسرے کو خون دے سکتے ہیںاور اس سے ان کے درمیان حرمتِ نکاح کا رشتہ قائم نہیں ہوتااوراگرشوہر اور بیوی بھی ایک دوسرے کو خون دیں تو ان کے نکاح پر کوئی اثر مرتب نہیں ہوتا۔ حرمتِ نکاح کا رشتہ صرف نسب، رضاعت اور مصاہرت سے قائم ہوتا ہے، کسی کا خون چڑھانے سے حرمتِ نکاح کا رشتہ قائم نہیں ہوتا۔اسی طرح جان بچانے کے لیے غیر مسلم کو خون دیابھی جاسکتا ہے اور لیا بھی جاسکتا ہے، تاہم مسلمان کے خون کو ترجیح دینی چاہیے ۔خون کی قیمتاً خرید وفروخت ناجائز اور حرام ہے ، حدیث پاک میں ہے:
’’[[arabic: إِنَّ رَسُوْلَ اللَّہِ ﷺ نَہٰی عَنْ ثَمَنِ الدَّمِ]]‘‘۔
ترجمہ:’’رسول اللہ صلی اللہ علیہ وسلم نے خون کا ثمن لینے سے منع فرمایا ہے، (صحیح البخاری: 2238)‘‘۔تاہم فقہائے کرام نے کہا ہے کہ اگر بقائے حیات کے لیے خون کی ضرورت ہو اور بلاقیمت خون دستیاب نہ ہو تو بر بنائے ضرورت قیمت دے کر خریدا جاسکتا ہے ،لیکن خون بیچنے والے کے لیے یہ قیمت لینا جائز نہیں ہے ۔جامعہ اشرفیہ مبارک پور (انڈیا)کی مجلس شرعی نے انتقالِ خون پر تفصیلی بحث کے بعد یہ فیصلہ صادر کیا:
مندرجہ ذیل صورتوں میں خون چڑھانے کی اجازت ہے:
(۱) مریض کی جان بچانے کے لیے ۔
(۲) اعضا کو بے کار ہونے سے بچانے کے لیے ۔
(۳) جمالِ مقصود کے تحفظ ،حلقۂ چشم کی حفاظت یا کسی اور عضو کی حفاظت کے لیے، بشرطیکہ کسی`
  },
  {
    pageNumber: 507,
    text: `اور جائز ذریعے سے اس کا تحفظ نہ ہوسکے، جمالِ غیر مقصود کے تحفظ کے لیے اجازت نہیں۔
 (۴) الف: خون نہ چڑھانے سے جب مریض کو زیادہ دنوں تک مرض کی تکلیف ہو، اگر یہ ناقابلِ برداشت حد تک ہو تو خون چڑھانا جائز ہے، ورنہ نہیں، ب:خون کی کمی کے باعث انسیجنل ھرنیا ہونے کا خطرہ ہو تو بھی جائز ہے، (جیساکہ آپریشن کے بعد خون کی کمی سے ایسا ہوجاتا ہے)۔
(۵) مریض ٹھیک ہے، کوئی گھبراہٹ یا تنائو نہیں ہے، خون کی کمی 15%سے کم ہے تو خون چڑھانا جائز نہیں،البتہ درج ذیل صورتوں میں خون چڑھانے کی اجازت ہے:
(الف) ہلکا تنائو، بے چینی، پیلا پن، بدن ٹھنڈا ہوجانا، پسینہ، پیاس، کھڑے ہونے سے اس طرح بے ہوشی طاری ہونا کہ گر جائے، خون کی کمی ایک سے دو لیٹر، یعنی 20%سے 39%۔
( ب) بہت زیادہ تنائو ،ہوش وحواس میں اختلال، شدید تنفس، یعنی تیز اور گہرا سانس چلنا، ہاتھ، پیر کا برف کی مانند ٹھنڈا ہوجانا، نیز پورے بدن کا ٹھنڈا ہوجانا، بہت زیادہ پیاس، خون کی کمی ۲ سے ساڑھے تین لیٹر یعنی 40%سے70%،پیشاب کی مقدار صفر۔
(ج) خون نہ چڑھانے کے باعث عضو کے بے کار ہوجانے کا ظنِ غالب ہو تو بھی خون چڑھانے کی اجازت ہے،ان تمام صورتوں میں اجازت بس اسی مقدار میں خون چڑھانے کی ہے جتنے سے کام چل سکے، واللہ تعالیٰ اعلم۔
 آخر میں لکھتے ہیں:
’’مریض کو حاجت وضرورت کی حالت میں خون اگر بلا عوض نہیں ملتا تو بعوض خریدنا جائز ہے ،مگر بائع کے لیے خون کا ثمن طیب نہیں، مسلم مریض کو مذکورہ حالت میں مسلم یا غیر مسلم کسی سے بھی خون لینا یا خریدنا جائز ہے، نوٹ: جو حضرات دلائل کا مطالعہ کرنا چاہیں، وہ اصل کتاب کا مطالعہ کریں،(مجلس شرعی کے فیصلے، ج:1،ص:193-194)‘‘۔`
  },
  {
    pageNumber: 508,
    text: `نیز مفتی نظام الدین رضوی مصباحی لکھتے ہیں: 
’’ان تفصیلات سے معلوم ہوا کہ کسی انسان کی جان بچانے کے لیے اپنے خون کا ہبہ یا عطیہ جائز ہے ۔غیر مسلم کو اگر خون کی ضرورت یا حاجت ہے ،تو اس سے خون کا معقول معاوضہ لے کر خون دینا جائز ہے ،جیسے غیر مسلم بچے کو دودھ پلانے کے لیے مسلم دایہ کا اجارہ جائز ہے ،درمختار کے قول:’’[[arabic: جَازَ اِجارَۃُ الظِّئْرِبِاَجْرٍ مُعَیَّنٍ ]]‘‘کے تحت علامہ ابن عابدین شامی لکھتے ہیں: ’’[[arabic: وَالْإِطْلَاقُ مُشِیْرٌ إلٰی أَنَّہٗ یَجُوْزُ لِلْمُسْلِمَۃِ أَنْ تُؤَجِّرَ نَفْسَہَا لِإِرْضَاعِ وَلَدِ الْکَافِرِ وَبِہٖ صَرَّحَ فِی الْخَانِیَّۃ]]‘‘۔
ترجمہ: ’’علامہ علاء الدین حصکفی کا اجازت کو مطلق رکھنا اس بات کی طرف مُشیر ہے کہ مسلمان عورت کو کافر کے بچے کو دودھ پلانے کے لیے اپنا اجارہ کرنا جائز ہے اورفتاویٰ ’’خانیہ‘‘ میںاس کی تصریح کی ہے‘‘،(ردالمحتار،ج:6،ص:53)‘‘۔
نیز آگے چل کر وہ لکھتے ہیں:
’’غیر مسلم سے خون لینا جائز ہے یا نہیں؟،مسلمان کو خون کی ضرورت یا حاجت متحقق ہے تو وہ مسلمان سے بھی خون لے سکتا ہے اور غیر مسلم سے بھی اور اس باب میں دارالحرب اور دارالاسلام میں کوئی فرق نہیں ، اس کی نظیر رَضاعت کا یہ مسئلہ ہے کہ اپنے بچے کو مسلم دایہ سے بھی دودھ پلوانا جائز ہے اور غیر مسلم دایہ سے بھی ،حضرت حلیمہ سعدیہ رضی اللہ عنہا حضور سید عالم صلی اللہ علیہ وسلم کی رضاعی ماں ہیں،جو آپ کی رضاعت کے وقت کافرہ تھیں، پھر بہت بعد میں مشرّف بہ اسلام ہوئیں، فقہ حنفی کی معتمد کتاب ’’مبسوط سرخسی‘‘میں ہے:
’’[[arabic: وَلَا بَاْسَ بِاَنْ یَسْتَاْجِرَ الْمُسْلِمُ الظِّئْرَ الْکَافِرَۃَ أَوِ الَّتِیْ قَدْ وَلَدَتْ مِنَ الْفُجُوْرِ، لِاَنَّ خُبْثَ الْکُفْرِ فِیْ اعْتِقَادِہَا دُوْنَ لَبَنِہَا وَالْاَنْبِیَاءُ عَلَیْہِمْ السَّلَامُ  وَالرُّسُلُ صَلَوَاتُ اللَّہِ عَلَیْہِمْ فِیْہِمْ مَنْ أُرْضِعَ بِلَبَنِ الْکَوَافِرِ، وَکَذٰلِکَ فُجُوْرُہَا لَا یُؤَثِّرُ فِی لَبَنِہَا]]‘‘۔
ترجمہ:اور اس میں کوئی حرج نہیں کہ مسلمان کافرہ دائی یا اس عورت کو جس کے ہاں ناجائز تعلق سے بچہ پیدا ہوا ،(اپنے بچے کو دودھ پلانے کے لیے )اجرت پر لے، کیونکہ کفر کا`
  },
  {
    pageNumber: 509,
    text: `خُبث اس کے اعتقاد میں ہے ،اس کے دودھ میں نہیں ہے، اور انبیائے کرام ورسل عظام علیہم الصلوٰۃ والسلام میں ایسی شخصیات ہیں کہ جن کو کافرہ کا دودھ پلایا گیا اور اسی طرح اس کا فجوراس کے  دودھ میں اثر انداز نہیں ہوتا،(المبسوط، ج:15، ص:127)‘‘۔ 
	آگے چل کر لکھتے ہیں: نیز ائمۂ مذاہب کے یہاں اس کی صراحت بھی ہے ،جیساکہ اُن کی عبارتیں گزشتہ صفحات میں منقول ہیں اور ان سب میں دم کا لفظ مطلق ہے، جو دمِ کافر کو بھی عام ہے، اس لیے بوقتِ ضرورت غیر مسلم کا خون لینے میں کوئی مضائقہ نہیں اور یہی حکم بوقتِ حاجت بھی ہونا چاہیے،(صحیفۂ مجلسِ شرعی، ج:2،ص:387-388)‘‘۔
	مفتی نظام الدین صاحب نے خون کے جواز کے مسئلے کو دودھ پر قیاس کیا ہے،یہ قیاس جزوِ انسان سے انتفاع کی حد تک تو درست ہے، ورنہ دودھ پاک ہے ،جب کہ خون ناپاک ہے۔ اگر کوئی غیر مسلم کی جان بچانے کے لیے اجرت کے بغیر خون دے دیتا ہے تو اپنی اصل کے اعتبار سے مباح ہے ،کیونکہ قرآنِ کریم میں ایک بے قصور انسان کی جان بچانے کو پوری انسانیت کی بقائے حیات سے تعبیر کیا ہے اور اس میں ’’نفس (جان)‘‘ مطلق آیا ہے ،نفسِ مسلم نہیں آیا ۔ہوسکتا ہے کوئی یہ کہے کہ غیر مسلم زندگی پاکر کفر وشرک کرے گا، تو عرض ہے کہ کوئی اس کے لیے ہدایت کی دعا بھی کرسکتا ہے اورکس کا انجام کس حالت پر ہوگا، اس کا حقیقی اور قطعی علم اللہ کے پاس ہے ، ہمیں سب کے لیے ہدایت کی دعا کرنی چاہیے ۔
ڈاکٹر وہبہ زحیلی لکھتے ہیں:
’’( فقہی اصول ہے):ضرورتیں ممنوعات کو مباح کردیتی ہیں،لیکن ان اعضاء کی کسی بھی صورت میں بیع جائز نہیں ہے جس طرح خون کی بیع جائز نہیں ہے ۔انسانی خون یا عضو کی بیع ناجائز ہے، بطورِ تبرُّع یا ہبہ دینا جائز ہے ۔ خون نہ ملنے کی صورت میں ہلاکت یاانتہائی نقصان کا اندیشہ ہو توتبرُّعاً خون دینا جائز ہے،اگر معاوضے پر ملنا یقینی ہو اور اقارب میں سے کوئی بھی تبرُّعاً دینے والا دستیاب نہ ہو تو بربنائے ضرورت (خون کا)مالی معاوضہ دینا جائز ہے ،(الفقہ الاسلامی وادلتہ، ج:4،ص:2609)‘‘۔البتہ معاوضہ لینا کسی صورت`
  },
  {
    pageNumber: 510,
    text: `میں جائز نہیں ہے ۔
علامہ نظام الدین لکھتے ہیں:
’’[[arabic: یَجُوْزُ لِلْعَلِیْلِ شُرْبُ الدَّمِ وَالْبَوْلِ وَاَکْلُ الْمَیْتَۃِ لِلتَّدَاوِیْ إِذَا اَخْبَرَہٗ طَبِیْبٌ مُسْلِمٌ اَنَّ شِفَاءَ ہٗ فِیْہِ وَلَمْ یَجِدْ مِنَ الْمُبَاحِ مَا یَقُوْمُ مَقَامَہٗ]]‘‘۔
ترجمہ:’’بیمار کے لیے خون اور پیشاب پینا اور بطورِ علاج مردار کھانا جائز ہے ،جب کہ مسلم طبیب اُسے بتائے کہ اس کی اس میں شفا ہے اور (اس کے متبادل)کوئی مباح چیز دستیاب نہ ہوجو اُس کے قائم مقام ہوسکے ،(فتاویٰ عالمگیری، ج:5،ص:355)‘‘۔اس عبارت کا مستفاد یہ ہے کہ ’’[[arabic: تَدَاوِیْ بِالْحَرَام ]]‘‘جائز ہے ،بشرطیکہ علاج کے لیے اس کے متبادل کوئی حلال چیز دستیاب نہ ہو۔
	صحیح البخاری:2263میں ہے کہ نبی کریم صلی اللہ علیہ وسلم اور حضرت ابوبکر نے سفرِ ہجرت کے موقع پر ایک غیر مسلم کو اُجرت پر رکھا اور ایک شخص کو راستے کے ماہر اور کھوجی کے طور پر رکھا،اس سے معلوم ہوا کہ ضرورت کے وقت غیر مسلم پر اعتماد کیا جاسکتا ہے اور اُسے رازدار بنایا جاسکتا ہے ۔
[[heading: جوتے پہن کر کھانا کھانے کا شرعی حکم ]]
سوال:
	 کھانے کے دوران جوتے پہنے رکھنے کا کیاحکم ہے ؟،(محمد ابدال ، سرجانی ٹاؤن )۔
جواب:
	 حدیث پاک میں کھانے کے وقت جوتے اتارنے کا ذکر آیا ہے :
’’[[arabic: عَنْ أَنَسِ بْنِ مَالِکٍ قَالَ:قَالَ رَسُوْلُ اللّٰہِ ﷺ:إِذَا قُرِّبَ إِلٰی أَحَدِکُمْ طَعَامُہٗ وَفِی رِجْلِہٖ نَعْلَانِ فَلْیَنْزِعْ نَعْلَیْہِ فَإِنَّہٗ أَرْوَحُ لِلْقَدَمَیْنِ]]‘‘۔
ترجمہ:’’ انس بن مالک رضی اللہ عنہ بیان کرتے ہیں:رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کسی کا کھانا چن لیا جائے اور اس کے پائوں میں جوتے ہیں ،تو وہ اپنے جوتے اتار لے ،`
  },
  {
    pageNumber: 511,
    text: `کیونکہ اس سے یہ پائوں کے لیے زیادہ راحت کا باعث ہے،(مجمع الزوائد:7911)‘‘۔ حدیث میں اس کا سبب آرام اور راحت بیان کیاگیا ہے ۔البتہ اگر جوتے اتارنا مشکل ہو یا اس میں سہولت نہ ہو جیسے میز کرسی پر کھانے کی صورت میںہوتا ہے ،تو جوتے پہن کرکھانا کھانا بھی جائز ہے ۔
امام اہلسنت اعلیٰ حضرت احمد رضا خان قادری قُدِّسَ سِرُّہُ الْعَزِیْزنے کئی کتب احادیث سے مندرجہ بالا حدیث نقل کرنے کے بعد لکھا: ’’کھانا کھاتے وقت جوتا اتار لینا سنت ہے،اگر اس عذر کے سبب جوتا پہن کر کھارہا ہو کہ فرش نہیں ہے ،تو یہ ایک سنتِ مستحبہ کا ترک ہے اور کرسی میز پر جوتا پہن کر کھانا خاص نصاریٰ کی وضع ہے ،اس سے اجتناب کرے،پھر انہوں نے اس حدیث کا حوالہ دیا: ’’[[arabic: مَنْ تَشَبَّہَ بِقَوْمٍ فَھُوَ مِنْہُمْ]]،فتاویٰ افریقہ ، بتصرف، ص:42-43)‘‘۔
	ہمارے علم کے مطابق موجودہ دور میں جوتا پہنے ہوئے کرسی میز پر کھانے کا شعار اکثر اقوام میں رائج ہے اور یہ نصاریٰ کا خاص مذہبی شعار نہیں ہے ، لہٰذا اس پر ’’[[arabic: تَشَبُّہْ بِالنَّصَاریٰ]]‘‘کا اطلاق دین میں یُسر کے منافی ہے اور ایسا کرنے والا اس وعید کا مستحق نہیں ہے ۔ بعض اوقات  لوگوں کو سنت پرکاربند رکھنے کے لیے اکابر علمائے امت شدّت فرماتے ہیں، اس کو اسی معنیٰ میں لینا چاہیے ۔ہوٹلوں ،اکثر دعوت اور بعض گھرانوں کی مجالس میںبھی طعام کے لیے کرسی میز ہی کا اہتمام ہوتاہے اور فرشی نشست کی سہولت نہیں ہوتی اور ایسے میں کسی کا الگ فرش پر بیٹھ کر کھاناعرف وعادت کے خلاف ہے ۔ ایسے اُمور پر ’’[[arabic: تَشَبُّہ بِالْکُفَّار ]]‘‘ کی بابت علامہ غلام رسول سعیدی رحمہ اللہ تعالیٰ لکھتے ہیں:’’تاہم اس پر یہ اشکال ہے کہ اس حدیث میں اُس مشابہت کی ممانعت ہے جو کفارومشرکین کے دینی شعائر میں سے ہو اور اُن کی کسی بدعقیدگی پر مبنی ہو، جیسے صلیب لٹکانا،مطلقاً مشابہت مراد نہیں ہے ،ورنہ بہت سی باتوں میں دیگر مذاہب کے ساتھ مشابہت پائی جاتی ہے، (شرح صحیح مسلم، ج:6،ص:282)‘‘۔`
  },
  {
    pageNumber: 512,
    text: `[[heading: والدین سے حسنِ سلوک ]]
سوال:
	میں یوکے میں رہتاہوں ،اپنی والدہ کو خرچہ کے لیے رقم بھیجتا تھا ،ایک بار میں نے صرف یہ جاننے کے لیے کہ ان کے اخراجات پورے ہوجاتے ہیں یا نہیں ، ان سے پوچھاکہ آپ ان پیسوں کا کیا کرتی ہیں ؟،انہیں یہ لگاکہ شاید میں پیسوں کا حساب مانگ رہاہوں ،جس کا اظہار انہوں نے کسی رشتے دار سے کیا ۔والدہ کے انتقال کے بعدمجھے یہ خلش ہے کہ کہیں مجھ سے نافرمانی یا بے ادبی یا دل آزاری تو نہیں ہوگئی ؟،(محمد منیر ، یو۔کے)۔
جواب:
	اسلام نے والدین کے ساتھ حسنِ سلوک اور اُن کے سامنے عاجزی سے پست آوازمیں بات کرنے کا حکم دیاگیاہے اور ایسی کوئی بات نہ کرے جس سے اُن کی دل شکنی ہو،اللہ تعالیٰ کا فرمان ہے : 
’’[[arabic: وَبِالْوَالِدَيْنِ إِحْسَانًا ۚ إِمَّا يَبْلُغَنَّ عِندَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا فَلَا تَقُل لَّهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُل لَّهُمَا قَوْلًا كَرِيمًا وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُل رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا]]‘‘۔
ترجمہ:’’ اورماں باپ کے ساتھ نیک سلوک کرنا اور اگر تمہاری زندگی میں وہ دونوں یاان میں سے کوئی ایک بڑھاپے کو پہنچ جائے تواُن کو اُف تک نہ کہنا اور نہ اُنہیں جھڑکنا اور ان سے ادب سے بات کرنا اور اُن کے سامنے عاجزی اور رحم دلی کا بازو جھکائے رکھنا اور یہ دعاکرنا : اے میرے رب! ان پر رحم فرمانا جیساکہ انہوں نے بچپن میں(شفقت ومحبت سے) میری پرورش کی تھی ،(بنی اسرائیل:23-24)‘‘۔
	عموماً والدین اولاد کی بڑی خطاؤں کو بھی معاف کردیاکرتے ہیں ،آپ کے بقول آپ نے صرف اُن کا بہتر خیال رکھنے کے لیے پیسوں کا مصرف پوچھاتھا ، بظاہر اس`
  },
  {
    pageNumber: 513,
    text: `میں کوئی بے ادبی کا پہلو نہیں ہے ، یہ اچھی بات ہے کہ آپ اس پر ندامت محسوس کررہے ہیں ۔ تاہم اگر کسی موقع پر آپ کی والدہ نے اظہار کیاہو کہ اس بات سے اُن کی دل آزاری ہوئی ہے ،تو آپ اُسی وقت اُن کی زندگی میں اپنے مقصد کی وضاحت کرکے معافی مانگ لیتے،البتہ اب آپ اپنے احساسِ ندامت کو دور کرنے کے لیے والدہ کے ایصالِ ثواب کے لیے دعائے مغفرت اور صدقاتِ جاریہ کا اہتمام فرمائیں ،حدیث پاک میں ہے: 
’’[[arabic: مَا عَلٰی أَحَدِکُمْ إِذَا تَصَدَّقَ بِصَدَقَۃٍ تَطَوُّعًا أَنْ یَجْعَلَہَا عَنْ أَبَوَیْہِ،فَیَکُوْنَ لَہُمَا أَجْرُہَا، وَلَا یُنْقَصُ مِنْ أَجْرِہٖ شَیْئٌ ]] ‘‘۔
ترجمہ:’’ تم میں سے کوئی شخص نفلی صدقہ کرے اور اس کو اپنے والدین کی طرف سے کردے،تو اس کے والدین کواس کا اجر ملتا ہے اور اس کے اجر سے کچھ کمی نہیں ہوتی ، (المعجم الاوسط: 7726)‘‘۔
[[heading: مالِ حرام کی بابت چند سوالات]]
سوال: (1)
	میری بہن اور بہنوئی یورپ(اسپین)میں رہتے ہیں ،بہنوئی پہلے ایک ریسٹورنٹ میں مینجر تھے ،وہاں سے جاب چھوٹ گئی ،اب وہ ایک شراب خانے میں جاب کرتے ہیں،اُن کے لیے کیا حکم ہے؟۔
جواب: 
	ہر وہ ملازمت جس میں براہِ راست اور بلاواسطہ اللہ تعالیٰ اور اُس کے رسول صلی اللہ علیہ وسلم کے اَحکام کی خلاف ورزی اور حرام وناجائز کاموں کا ارتکاب یااُن میںمعاونت کرنی پڑتی ہے،جیساکہ شراب خانوں میں شراب خریدنے بیچنے ، پینے پلانے اور اُس کے حساب کتاب یعنی کیشئرکی ملازمت کرنا یامثلاًبینک کے وہ ملازمین جن کے ذمے سود ی لین دین یااُس کا حساب کتاب ہو،ایسی ملازمت خواہ مسلم ممالک میں ہو یا غیرمسلم ممالک میں ، ناجائز وحرام ہے،اس پر دی جانے والی تنخواہ بھی حرام ہوگی ،خواہ اس کی تنخواہ خالص حلال مال سے`
  },
  {
    pageNumber: 514,
    text: `دی جاتی ہواور وہ مالِ حلال بھی اُس کے لئے حرام ہے اور اگر اُس کی تنخواہ مالِ حرام سے دی جاتی ہو تو ایسی صورت میں حرمت ددچندہوجاتی ہے۔
	قرآن مجید میں اللہ تعالیٰ کا ارشاد ہے:’’[[arabic: وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ]] ‘‘، ترجمہ:’’اور تم گناہ اور ظلم و زیادتی میں ایک دوسرے کی مددنہ کرو، (المائدہ: 2) ‘‘۔
حضرت انس بن مالک رضی اللہ عنہ فرماتے ہیں:
’’[[arabic: لَعَنَ رَسُوْلُ اللّٰہِ ﷺفِی الْخَمْرِعَشْرَۃً عَاصِرَہَا وَمُعْتَصِرَہَا وَشَارِبَہَا وَحَامِلَہَا وَالْمَحْمُولَۃَ إِلَیْہِ وَسَاقِیَہَا وَبَائِعَہَا وَآکِلَ ثَمَنِہَا وَالْمُشْتَرِیَ لَہَا وَالْمُشْتَرَاۃَ لَہٗ]]‘‘۔ ترجمہ:’’رسول اﷲصلی اللہ علیہ وسلم نے شراب کے حوالے سے دس لوگوں پر لعنت فرمائی ہے: شراب کشید کرنے اورکشید کرانے والا،شراب اُٹھانے والے اور جس کی طرف اُٹھاکر لے جائی جائے،شراب پلانے والا، شراب فروخت کرنیوالا ، شراب کی کمائی کھانے والا ، شراب خریدنے والا اور جس کے لیے خریدی جائے (ان سب پر لعنت ہے)،(سنن ترمذی: 1295) ‘‘۔
حضرت عبداللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں:
’’[[arabic: إِنَّ رَسُوْلَ اللّٰہِﷺاَتَاہٗ جِبْرِیْلُ فَقَالَ:یَا مُحَمَّدُ!إِنَّ اللّٰہَ لَعَنَ الْخَمْرَ وَعَاصِرَہَا وَمُعْتَصِرَہَاوَحَامِلَہَاوَالْمَحْمُولَۃَ إِلَیْہِ،وَشَارِبَہَاوَبَائِعَہَاوَمُبْتَاعَہَاوَسَاقِیَہَا َمُسْقَاہَا]]  ‘‘۔
ترجمہ:’’رسول اللہ صلی اللہ علیہ وسلم کے پاس جبریل امین آئے اور اُنہوں نے فرمایا:اے محمد صلی اللہ علیہ وسلم !بیشک اللہ تعالیٰ نے شراب پر ،اسے کشید کرنے والے ، کشید کرانے والے ،اُ سے اُٹھانے والے اور جس تک اُٹھاکرپہنچائی جائے،شراب پینے والے،اُسے فروخت کرنیوالے،خریدنے والے،اسے پلانے والے اور جسے پلائی جائے،(ان سب پر لعنت فرمائی ہے)، (صحیح ابن حبان: 5356،مسنداحمد:2897)‘‘ ۔
حضرت عبداللہ بن عمررضی اللہ عنہما بیان کرتے ہیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:
’’[[arabic: لَعَنَ اللّٰہُ الْخَمْرَ وَشَارِبَہَا وَسَاقِیَہَا وَبَائِعَہَا وَمُبْتَاعَہَا وَعَاصِرَہَا وَمُعْتَصِرَہَا وَحَامِلَہَا وَالْمَحْمُولَۃَ إِلَیْہِ]]‘‘۔
ترجمہ:’’شراب پر اللہ کی لعنت ہو،اُس کے پینے اور پلانے والے پر، اسے فروخت کرنیوالے اور خریدار پر،اسے کشید کرنے اور کشید کرانے والے پر،اُ سے اُٹھانے والے اور جس تک اُٹھاکرپہنچائی جائے اُس پر،(سنن ابوداؤد:3674،سنن ابن ماجہ:3380)‘‘ ۔ 
حضرت عبداللہ بن عباس رضی اللہ عنہما بیان کرتے ہیں : نبی کریم صلی اللہ علیہ وسلم نے فرمایا:
’’[[arabic: إِنَّ اللّٰہَ إِذَا حَرَّمَ عَلٰی قَوْمٍ اَکْلَ شَیْئٍ حَرَّمَ عَلَیْہِمْ ثَمَنَہٗ]]‘‘۔
ترجمہ:’’جب اللہ تعالیٰ کسی قوم پر کسی چیز کو حرام فرماتا ہے تو اُس کی کمائی کو بھی حرام فرمادیتا ہے،(سنن ابوداود:3488)‘‘ ۔
	پس آپ پراپنی استطاعت کے مطابق لازم ہے کہ آپ کسی کی ملامت کی پرواہ کیے بغیر اپنی بہن اور بہنوئی کو اِس حرام ملازمت کوچھوڑنے کی تلقین کریں ، اُنہیں نصیحت کریں اور حلال وطیب روزگا رکی تلاش وجستجو کی ترغیب دلائیں۔رزق حلال کے ذرائع بہت زیادہ ہیں ،اس کے لیے جستجو کرنی پڑتی ہے، البتہ یہ بات یقینی ہے کہ جو شخص اللہ تعالی سے ڈرے ، تو اللہ تعالی اسے عنایت بھی فرماتا ہے اور اس کی مدد بھی فرماتا ہے، اللہ تعالیٰ کا ارشاد ہے : 
’’[[arabic: وَمَن يَتَّقِ اللَّهَ يَجْعَل لَّهُ مَخْرَجًا وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا]]‘‘۔
ترجمہ:’’اور جو شخص اللہ سے ڈرے تو اللہ اس کے لیے مشکل سے نکلنے کا راستہ بنا دیتا ہے اور اُسے ایسی جگہ سے رزق دیتا ہے جہاں سے اسے اُمید بھی نہیں ہوتی اور جو اللہ تعالی پر توکل کرے تو وہی اسے کافی ہے، بیشک اللہ تعالی اپنا فیصلہ نافذکرنے والا ہے، یقیناً اللہ تعالی نے ہر چیز کی لیے مقدار مقرر کر دی ہے،(الطلاق:2-3)‘‘ ۔`
  },
  {
    pageNumber: 516,
    text: `سوال:(2)
	میری بہن ہمارے لیے تحائف لاتی ہے اور ہمارے ساتھ پکنک پر جاتی ہے تو ہمیں کچھ نہ کچھ لاکر کھلاتی ہیں تو کیا ہم وہ تحائف اور اُن کھانا قبول کرسکتے ہیں؟۔
جواب:
	 آپ کے لیے اپنی بہن سے تحفہ وصول کرنایااُن کی دعوت قبول کرنا حرام وناجائزتو نہیں ، مگراحتیاط بہتر ہے، امام محمد بن حسن الشیبانی رحمۃ اللہ علیہ فرماتے ہیں:
’’[[arabic: وَبِہٖ نَاْخُذُ مَا لَمْ نَعْرِفْ شَیْئًا حَرَامًا بِعَیْنِہٖ،وَہُوَ قَوْلُ اَبِی حَنِیفَۃَ رَحِمَہُ اللّٰہُ تَعَالٰی وَاَصْحَابِہٖ]]‘‘۔
ترجمہ:’’ہم اِسی بات کو اختیار کرتے ہیں کہ جب تک ہمیں کسی معین شے کے متعلق اُس کا حرام ہوناواضح نہ ہوجائے(ہمارے  لیے اُسے لینا جائز ہے)اور یہی امام ابوحنیفہ اور اُن کے اصحاب کا مذہب ہے،(فتاویٰ ہندیہ،ج:5،ص:342) ‘‘۔
	چنانچہ بعض فقہائے کرام واہلِ علم حضرات نے ذکر کیا ہے کہ حرام کمائی سے حاصل ہونے والی رقم سے خریدی ہوئی اشیاء مثلاً غلہ واناج اور دیگر سامان میں حرمت اُس وقت واقع ہوتی ہے جب عَقد ونقد دونوں اُسی مالِ حرام پر جمع ہوئے ہوں،مثلاً زید کے پاس شراب کی کمائی کے پانچ سو روپے تھے اور اُس نے شراب کی کمائی سے حاصل ہونے والاوہ پانچ سو کا نوٹ کسی دکاندار کو دکھایا اور کہا کہ اِس نوٹ کے عوض مجھے فلاں شے( مثلاً: پرس) دیدو،یہ حرام پر عقد کہلایا،پھر جب زید نے وہی پانچ سو کا نوٹ اُسے دیدیا تویہ حرام کا نقد ہوا ،سو جب عقد ونقد دونوں حرام پر ہوئے ہوں تو ایسی صورت  میں وہ خریدی ہوئی شے بھی حرام ہوجائے گی اورجب تک عقد ونقد دونوں حرام مال پر جمع نہیں ہونگے اُس وقت تک خریدی ہوئی شے میں حرمت واقع نہیں ہوگی اور ہمارے یہاں عام طور پر خریدو فروخت کا جو طریقہ کار ہوتا ہے،اُس میں چونکہ عقد ونقد دونوں جمع نہیں ہوتے،پس حرام کمائی کرنا اور اس سے کوئی چیز خریدنا بلاشبہ فعلِ حرام ہے اور گناہ ہے ،لیکن اس سے وہ خریدی ہوئی حلال`
  },
  {
    pageNumber: 517,
    text: `چیز حرام نہیں ہوجاتی ہے ۔
علامہ ابن عابدین شامی رحمۃ اللہ علیہ فرماتے ہیں:
ترجمہ:’’مختار قول تو یہ ہے کہ حرام مال کے ذریعے خریدی ہوئی اشیاء بھی حرام ہونی چاہئیں،لیکن ہمارے زمانے میں حرام کی کثرت کے پیشِ نظر لوگوں سے حرج ونقصان کو دورکرنے کے لیے فتویٰ امام کرخی کے قول پر ہے(یعنی اگر عقد ونقد جمع نہ ہوں تو حرام مال  سے خریدی ہوئی شے کی طرف حرمت سرایت نہیں کرے گی اور وہ شے حلال ہوگی)، (ردالمحتار، جلد 5،ص:235) ‘‘۔
اعلیٰ حضرت امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْزسے سوال ہوا:’’ایک شخص جُوئے باز ہے،جس کا جوئے کے علاوہ کوئی اورپیشه نہیں ہے یا کوئی طوائف ناچنے گانے والی یا کوئی حرافہ حرام پیشہ بارہویں شریف یا گیارہویں شریف میں آنحضرت صلی اللہ علیہ وسلم اور حضرت غوث اعظم قدس سرہٗ کی نیاز کرے، اُس کا کھانا شرعا ًجائز ہے یانہیں؟ ‘‘۔
اس کے جواب میں آپ لکھتے ہیں:’’جس شخص کا پیشہ خالص حرام کا ہو، اُس سے میل جول نہیں کرنا چاہیے،کیونکہ اللہ تعالیٰ نے فرمایا:’’[[arabic: وَإِمَّا يُنسِيَنَّكَ الشَّيْطَانُ فَلَا تَقْعُدْ بَعْدَ الذِّكْرَىٰ مَعَ الْقَوْمِ الظَّالِمِينَ]]‘‘۔
ترجمہ:’’اگر شیطان تمہیں نسیان میں ڈال دے، تو پھر یاد آنے کے بعد ہر گز ظالموں کے پاس مت بیٹھو،(الانعام:68)‘‘ ۔ایسے افرادکے ہاں کھانا اگرچہ بہت زیادہ معیوب ہے، مگر صحیح مذہب کے مطابق اُس کا وہ کھانا حرام نہیں ہے،ہاں !اگربعینہٖ وہ کھانا اُسے حرام وجہ سے ملا ہو،مثلاًگانے یا زنا کی اُجرت کے طور پر اُسے اناج دیاگیا اور وہ اناج اُس نے کھانے میں استعمال کیا تو پھر ایسی صورت میں وہ کھانا حرام ہے یا اُسے گانے،ناچ یا زنا کی اُجرت کے طور پررقم دی گئی اور اُس نے اُس رقم سے وہ اناج اِس طرح خریدا کہ خریداری میں عقد ونقد دونوں کو اُسی مالِ حرام پر جمع کردیا ،تواِس صورت میں بھی وہ کھانا حرام ہے، ان دو صورتوں میں وہ کھانا حرام ہے، ورنہ نہیں،(فتاویٰ رضویہ،ج21ص654)‘‘ ۔`
  },
  {
    pageNumber: 518,
    text: `سوال:(3)
	اگر ہم اپنی بہن کو سمجھائیں اور وہ ہماری بات مان جائے تو اُس کے پاس جو حرام کمائی کی بقایا رقم ہے وہ اُس کا کیا کرے؟۔
جواب:
	 کسی شخص کے پاس ایسا مال ہے، جو اُس نے ناجائز اور حرام طریقے سے کمایا ،مثلاً: شراب،سینما، رقص یا فحاشی پر مشتمل وڈیوکیسٹ کی آمدنی جمع کی ہو، پھر اس کے دل میں اللہ تعالیٰ کا خوف پیدا ہوجائے اور وہ اس ناجائز ما ل سے چھٹکارا حاصل کرنا چاہے، تو وہ اس مال کی ذمے داری سے بچنے کے لیے اسے فُقراء ومساکین پر خرچ کرے اور اس میں ثواب کی نیت نہ کرے ،بلکہ یہ نیت کرے کہ وہ اپنے ذمہ سے عہدہ برآ ہورہا ہے۔ 
[[heading: جسم پر گدوانے کا شرعی حکم ]]
سوال:
	میں آپ کا مستقل قاری اور دین کا طالب علم ہوں۔حضرت 7-6 سال قبل میں نے نادانی سے اپنے دائیں بازو پر انگریزی میں لفظ : G  لکھوایا تھا جو کہ انمٹ ہے، اب اگر مٹایا جائے تو شاید وہ تیزاب لگائیں جس سے مسئلہ تکلیف دہ اور نقصان والا ہو سکتا ہے۔ یہ سب کچھ نادانی نا سمجھی کی وجہ سے ہوا، جس پر میں شرمندہ ہوں۔ میں نے سنا ہے کہ اس طرح لکھوانے سے نماز نہیں ہوتی، اب کیا شرعی حکم ہوگا؟،(ایچ ۔اے ،خوشاب )۔
جواب: 
	بازو پر نام کھدوانایا ہاتھ کی پشت پرکوئی ڈیزائن بنوانا شرعاً ناجائزوممنوع ہے کہ یہ اللہ کی بنائی ہوئی چیز میں تبدیلی کرنا ہے اور اللہ کی تخلیق میں تبدیلی ناجائز وحرام ہے۔ نیز یہ نام اور ڈیزائن عموماً مشین یا سوئی کے ذریعے کھدوایا جاتا ہے،جس سے کافی تکلیف ہوتی ہے اور اپنے آپ کو بلا وجہ شرعی تکلیف پہنچانا بھی جائز نہیں۔اگر کسی شخص نے اپنے بازو پر اس طرح نام لکھوایا ہے تو اس پر توبہ لازم ہے اور اگردوبارہ تغییر کے بغیر اس نام کو ختم کرنا ممکن`
  },
  {
    pageNumber: 519,
    text: `ہو تو اس کو ختم کردے اوراگر تغییر کے بغیر ختم کروانا ممکن نہ ہوبلکہ ختم کروانے کے لیے دوبارہ اسی طرح کا عمل کرنا پڑے جیسا نام لکھواتے وقت کیا تھا تو اس کو اسی حال میں رہنے دے اور توبہ و استغفار کرتا رہے،اللہ تعالیٰ کا ارشاد ہے :
’’[[arabic: وَلَآمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللَّهِ ۚ وَمَن يَتَّخِذِ الشَّيْطَانَ وَلِيًّا مِّن دُونِ اللَّهِ فَقَدْ خَسِرَ خُسْرَانًا مُّبِينًا]]‘‘۔
ترجمہ:’’(شیطان نے کہا:)اورمیں ضرور ان کو حکم دوں گا تووہ ضرور اللہ کی بنائی ہوئی صورتوں کو تبدیل کریں گے اور جس نے اللہ کے بجائے شیطان کو اپنا کارساز بنالیا تووہ کھلے ہوئے نقصان میں مبتلا ہوگیا ،(النسا:119)‘‘۔
’’[[arabic: عَنْ عَبْدِ اللّٰہِ قَالَ:لَعَنَ اللّٰہُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ،وَالنَّامِصَاتِ وَالْمُتَنَمِّصَاتِ، وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَیِّرَاتِ خَلْقَ اللّٰہِ قَالَ:فَبَلَغَ ذٰلِکَ امْرَأَۃً مِنْ بَنِی أَسَدٍ یُقَالُ لَہَا:أُمُّ یَعْقُوبَ وَکَانَتْ تَقْرَأُ الْقُرْآنَ،فَاَتَتْہُ فَقَالَتْ:مَا حَدِیْثٌ بَلَغَنِی عَنْکَ أَنَّکَ لَعَنْتَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ، لِلْحُسْنِ الْمُغَیِّرَاتِ خَلْقَ اللّٰہِ، فَقَالَ عَبْدُ اللّٰہِ:وَمَا لِی لَا أَلْعَنُ مَنْ لَعَنَ رَسُوْلُ اللّٰہِﷺ،وَہُوَ فِی کِتَابِ اللّٰہِ فَقَالَتِ الْمَرْأَۃُ:لَقَدْ قَرَأْتُ مَا بَیْنَ لَوْحَیِ الْمُصْحَفِ فَمَا وَجَدْتُہٗ،فَقَالَ:لَئِنْ کُنْتِ قَرَأْتِیْہِ لَقَدْ وَجَدْتِیہِ، قَالَ اللّٰہُ عَزَّ وَجَلَّ:وَمَا آتَاکُمُ الرَّسُوْلُ فَخُذُوْہُ وَمَا نَہَاکُمْ عَنْہُ فَانْتَہُوْا]]، (الحشر:7)‘‘۔
ترجمہ:’’حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے: اللہ کی ان عورتوں پر لعنت ہو جو جسم کوگودنے کا کام کرتی ہیں اور جو اپنے جسم پر گدواتی ہیں اور جو جسم کے بال اکھیڑنے کا کام کرتی ہیں اور جو اپنے بال اکھڑواتی ہیں اور جوخوبصورتی پیدا کرنے کے لیے اپنے دانتوں کے درمیان جھری کرواتی ہیں اور اللہ کی بنائی ہوئی صورتوں کو بدلتی ہیں، اس بات کی اطلاع بنو اسد کی اُمِّ یعقوب نامی ایک عورت کو ہوئی،وہ قرآن پڑھتی تھیں ، پس وہ عبداللہ بن مسعود کے پاس آئیں اور کہا:میرے پاس یہ آپ کی کیسی حدیث پہنچی ہے کہ آپ نے جسم پر گودنے والیوں ، گدوانے والیوں ، بال اکھیڑنے والیوں اور اکھڑوانے والیوں اور دانتوں کے درمیان خوبصورتی کے لیے جھری بنانے والیوں پر لعنت کی ہے کہ وہ اللہ کی بنائی ہوئی صورت کو بدلتی ہیں، تو حضرت عبداللہ نے فرمایا: جس پر اللہ کے رسول صلی اللہ علیہ وسلم نے لعنت فرمائی ہو ، اس پر میں لعنت کیوں نہ کروں اور یہ اللہ کی کتاب میں ہے، اس عورت نے کہا: میں نے پورا قرآن پڑھا ہےتو میں نے اس میں کوئی ایسا حکم نہیں پایا، انہوں نے فرمایا: اگر تونے (سمجھ کر)قرآن پڑھا ہوتا تو تو اس حکم کو پالیتی، اللہ تعالیٰ نے فرمایا:’’ جو کچھ تمہیں رسول دیں،اُسے لے لواور جس کام سے وہ روکیں ،اُس سے رک جائو،(الحشر:7)‘‘، (صحیح مسلم: 2125)‘‘۔`
  },
  {
    pageNumber: 520,
    text: `	 لفظ’’ [[arabic: وَاشِمَات]]‘‘ کی شرح میں مفتی احمد یار خان نعیمی رحمۃ اللہ علیہ لکھتے ہیں :’’واشمہ :وہ عورت جو سوئی وغیرہ کے ذریعہ اپنے اعضاء میں سرمہ یا نیل گودوالے جیسا کہ ہندو عورتیں اور بعض ہندو مرد کرتے ہیں، مستوشمہ : جو دوسری عورت کو گودے ،دونوں پر لعنت فرمائی ،حرام کام فاعل ومفعول دونوں کی لعنت کا باعث ہوتاہے ،(مرآۃالمناجیح،جلد6،ص153)‘‘۔
	اسی طرح بازووغیرہ پرنام لکھوانا اپنے آپ کو تکلیف پہنچانا ہے اوربلا وجہ شرعی اپنے آپ کو تکلیف پہنچانا گناہ ہے، علامہ احمد بن محمد بن ابو بکر بن عبدالملک القسطلانی لکھتے ہیں:
’’ [[arabic: أِنَّ جِنَایۃَ الْإِنْسَانَ عَلٰی نَفْسِہٖ کَجِنَایَتِہٖ عَلٰی غَیْرِہٖ فِی الْإِثْمِ لِاَنَّ نَفسَہٗ لَیْسَتْ لَہٗ مِلْکًا مُطْلقًا بَلْ ہِیَ لِلّٰہِ فَلَا یَتَصَرَّفُ فِیْہَا إِلَّا فِیْمَا اُذِنَ فِیْہِ]]‘‘۔
ترجمہ:بے شک انسان کی اپنے نفس پر زیادتی گناہ ہے ،جیسا کہ دوسرے پر زیادتی گناہ ہے، کیونکہ انسان اپنے نفس کا مطلقاً مالک نہیں ہے ،بلکہ یہ اللہ تعالیٰ کی ملکیت ہے پس اس میں وہی تصرف جائز ہے ،جس کی اجازت دی گئی ہے،(ارشاد السّاری لشرح صحیح البخاری، جلد9،ص:379)۔
	آپ پر توبہ لازم ہے ،اگر بغیر تغییر کے ختم کرانا ممکن نہ ہو تو اس کو اسی حال میں رہنے دیں اور توبہ و استغفار کرتے رہیں۔
امام اہل سنت امام احمد رضا قادری قُدِّسَ سِرُّہُ الْعَزِیْزسے سوال ہوا:’’ میں نے اللہ تعالیٰ اور نبی کریم صلی اللہ علیہ وسلم کی محبت میں ایک بازو پر یا اللہ اور دوسرے پر یا محمد بذریعہ مشین کھدوایا ، میرا تعلق چشتیہ خاندان سے ہے اور تصوف کے چاروں بڑے سلسلوں سے مجھے نسبت ہے ، میں نے اپنی سوچ کے مطابق یہ کام اللہ اور اس کے رسول کی محبت  میں کیاہے ، یہ مٹانے سے مٹ اور چھیلنے سے چھل بھی نہیں سکتا ، شریعت کی رو سے یہ فعل جائز ہے یا نہیں ؟ ‘‘۔ آپ جواب میں لکھتے ہیں:’’یہ غالباً خون نکال کر اسے روک کر کیا جاتا ہے جیسے نیل گدوانا،اگر یہی صورت ہو تو اس کے ناجائز ہونے میں کلام نہیں اوراگر اس کا ازالہ نا ممکن یا باعثِ اذیت ہے تواب سوائے توبہ و استغفار کے اس کا کوئی حل نہیں ہے ، توبہ کرتے رہیں ، اللہ تعالیٰ توبہ قبول فرماتا ہے ،(فتاویٰ رضویہ ،جلد23،ص:387مُلخصاً)‘‘۔`
  },
  {
    pageNumber: 521,
    text: `	خلاصۂ کلام یہ کہ ضرورت شرعی اور حاجت ،جس میں آپریشن سمیت علاج کی تمام صورتیں شامل ہیں ،کے بغیر ایذائے نفس یا ایذائے غیر جائز نہیں ہے اور یقیناً گودنا یا ٹیٹو بنانا ضروریات وحاجات میں سے نہیں ہے ،یہ محض طبیعت کی اوباشی ، عیاشی اور آوارگی ہے اور اپنے آپ کودوسروں کے لیے مرکزِ نگاہ بنانا یاشمعِ محفل بنناہے ،البتہ خواتین کے جسم کے ظاہری حصے میں ایسا داغ یا عیب ہو ،جیسے چہرے پر بالوں کی کثرت وغیرہ اور اس کا چہرہ بدنما معلوم ہو تاہے تووہ اپنے شوہر کی رضاحاصل کرنے کے لیے ایساکرسکتی ہے ، فقہائے کرام نے بعض صورتوں کی اجازت دیتی ہے۔یہ اُن باحیا اور عفت مآب خواتین کے لیے جو اپنی جان اور جسم کا مالک اللہ تعالیٰ کو سمجھتی ہیں اور جن کاسلوگن ’’میرا جسم، میری مرضی‘‘ ہے ،ہم ان کی ہدایت کے لیے اللہ تعالیٰ کے حضور دست بدعا ہیں ۔

[[heading: افسر اعلیٰ کا قواعد کے خلاف ماتحت کو رعایت دینا ]]
سوال: 
	میں نے ایک سرکاری تعلیمی ادارے میں سربراہ کی حیثیت سے کام شروع کیاہے ، یہاں یہ روایت چلی آرہی ہے کہ اگر کوئی شخص بیمار ہوجائے یا اس کوکوئی ناگہانی حادثہ پیش آجائے تو ادارہ رجسٹر پر حاضری لگاکر اس کے اکاؤنٹ میں تنخواہ بھجواتارہتاہے ، یہ عمل کئی ماہ اور بعض اوقات سال بھر تک رہتاہے ۔ میں یہ معلوم کرنا چاہتاہوں :سوال: جو شخص بیمار ہے اور رخصت کے بغیر گھر بیٹھا بغیر کام کیے تنخواہ لے رہاہے ،کیا یہ اس کے لیے حلال ہے؟۔ ادارے کے جو افراد صرفِ نظر کرتے ہیں ،کیاوہ بھی اعانتِ جرم کے مرتکب ہوئے ؟۔ کیاایسے بیمار شخص کی اس انداز سے مدد کرنے کی کوئی شرعی گنجائش ہے ؟۔ ادارے کے مفادات کا تحفظ کرنے میں سربراہ کی فلاح ہے یا کسی شدید مرض میں مبتلا فرد کی اعانت کرنے میں ؟،(ڈاکٹر ابو حمیس ،  مسلم بازار ،حیدرآباد)۔
جواب: 
	جس دور میں ہم رہ رہے ہیں ،اس میں ملازمین کے لیے قانون میں کچھ مراعات مقرر ہیں ،مثلاً : با تنخواہ اتفاقی رخصت ، سال میں مقرر ہ ایام کی با تنخواہ  رخصت اور`
  },
  {
    pageNumber: 522,
    text: `طبی رخصت وغیرہ۔ اسی طرح حاملہ عورت کے لیے زچگی کے ایام کی رخصت ،بلکہ حال ہی میں حکومتِ پاکستان نے ایسے شوہر کے لیے بھی جس کی بیوی کے ہاں بچے کی ولادت ہوئی ہے ، دس دن کی رخصت کا اعلان کیاہے ، بیوہ کے لیے شوہر کی وفات کی صورت میں عدتِ وفات کی رخصت وغیرہ۔ مختلف اقسام کی ان رخصتوں میں انہیں مقررہ اجرت یامشاہرہ کا حق دار سمجھاجاتاہے ۔اس کے علاوہ ملازم کو بلاتنخواہ بھی رخصت کی  رعایت ہوتی ہے ،یعنی مقررہ اجرت یا تنخواہ نہیں دی جاتی ،لیکن ملازمت جاری رہتی ہے اور واپس آکر اپنی ڈیوٹی پر کام شروع کردیتاہے۔ان تمام صورتوں میں قواعدوضوابط (Service Rules)طے شدہ ہوں یا عرف وعادت میں مُسلّم اور معمول بہا(IN Practice)ہوں، ان پر عمل درآمد جائز ہے۔
	ایسا ملازم جو ڈیوٹی سے غیر حاضرہواور اس کے دفتر یا محکمے کے ساتھی رجسٹر پر اس کی حاضری لگادیتے ہوں اور وہ باقاعدگی سے تنخواہ لیتاہو ،تو شرعاً یہ تنخواہ اس کے لیے جائز نہیں ہے اور اس کے دفتر یا محکمے کے ساتھی کا اپنے غیر حاضر ساتھی کی جگہ دستخط کرنا خیانت ،جھوٹی شہادت اور گناہ میں تعاون ہے ،جو قرآن کریم کی رُو سے ممنوع ہے ۔ اللہ تعالیٰ کا ارشاد ہے:’’ [[arabic: وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ]] ‘‘،ترجمہ:’’ اورگناہ و ظلم پر ایک دوسرے کی مدد نہ کرو، (المائدہ:2)‘‘۔
	بیمار کے ساتھ ہمدردی اچھی بات ہے ،لیکن اس کے لیے نہ مالِ سرکار میں خیانت درست ہے اور نہ مُتعلقہ محکمے یا افسران کی منظوری کے بغیر ملازم کایہ تنخواہ لینا درست ہے ، البتہ اگر کسی ملازم کو دائمی مہلک بیماری یا معذوری لاحق ہوگئی ہواوروہ قابلِ کار نہ رہاہو،تو چونکہ حکومت کی حیثیت مُربّی کی سی ہوتی ہے ،اس لیے اسے ایسے لوگوں کی کفالت اپنے ذمے لینی چاہیے ،خواہ پوری تنخواہ یا اس کے نصف یاکسی حصے کے برابر ضابطہ بنالیں ۔اسی طرح جو بڑے صنعتی اور کاروباری ادارے ہیں،اُن کے ہاں بھی ایسے قوانین ہونے چاہییں ۔
	`
  },
  {
    pageNumber: 523,
    text: `بعض فقہائے کرام نے اپنے عہد کے اعتبار سے زیادہ سے زیادہ چھٹیوں یا غیرحاضری کی بناپر معزولی یا چھٹیوں کی تنخواہ کے استحقاق کے حوالے سے بات کی ہے،لیکن آج کل ملازمین کے لیے حکومتوں نے ملازمت کے قواعد وضوابط (Service Rules) کو قانونی شکل دیدی ہے، اب سرکاری ملازمین پر وہی قواعد وضوابط حاکم ہوں گے ،اسی طرح صنعتی اور کاروباری اداروں کے لیے لیبر لاز ہیں ، مگر آپ کا ادارہ چونکہ سرکاری ادارہ ہے ،تو آپ کو حکومتی قواعد وضوابط کی پابندی کرنی چاہیے ۔آپ کا منصب آپ پر اپنے ماتحت ملازمین کے حوالے سے جو ذمے داری عائد کرتاہے ،آپ پر اس کی پابندی لازم ہے ،آپ اپنے ماتحت ملازمین کو وہی مراعات دے سکتے ہیں ،جن کا اختیار قواعد ملازمت کی رُو سے آپ کو حاصل ہے ۔اپنے دائرہ ٔ اختیار سے زیادہ کسی ماتحت کو رعایت دینا خیانت ہے، قانون شکنی ہے اور شریعت کی روسے منع ہے ،یہ تو اردو محاورے کے مطابق ’’حلوائی کے دکان پر ناناجی کی فاتحہ ‘‘ والی بات ہوجائے گی ۔آپ اپنے ذاتی وسائل سے مصیبت میں مبتلا کسی شخص کی اعانت کریں تو عنداللہ اجر پائیں گے ۔ 	

[[heading: غیرمسلم ملک میں اسٹور پر ملازمت کا حکم ]]
سوال:
	 ایک شخص امریکا میں کسی پرائیویٹ کمپنی کی ٹیکسی چلاتا ہے ، کمپنی کی طرف سے آرڈر ملتاہے کہ فلاں ریسٹورنٹ سے کھانا لے کر فلاں گاہک کے گھر پہنچا دو،اُس میں حلال وحرام کچھ بھی ہوسکتا ہے ،کیا ایسا کرنا جائز ہے ؟۔اسی طرح ایک شخص امریکا میں اسٹور پر کیشیر ہے ،اسٹور میں حلال وحرام ہر طرح کی اشیاء ہوتی ہیں ،کیا ایسی جاب کرنا جائز ہے ؟، (سہیل عطاری ،کراچی )۔
جواب:
	مسلمان کو شریعتِ مُطہرہ رزقِ حلال کے حصول کے لیے جائز وحلال ذرائع اختیار کرنے اور حرام سے بچنے کا حکم دیتی ہے ۔بعض مواقع پر یُسر (آسانی ) اور رخصت وعزیمت کے پہلو بھی پیش کرتی ہے ،جس کا بنیادی مقصد یہ ہے کہ پیش آمدہ مسائل کا`
  },
  {
    pageNumber: 524,
    text: `آسان حل نکالا جائے ۔فقہی قاعدہ ہے : ’’[[arabic: اَلْأُمُوْرُ بِمَقَاصِدِھَا ]]‘‘ترجمہ:’’ اعمال اور معاملات کا مَدار اُن کے مقاصد پر ہے ،( المجلّہ ،مادہ:2)‘‘۔یعنی کسی چیز کے جائز یا ناجائز ہونے ،حلال یا حرام ہونے یا کسی عمل پر اجر یاسزا کا دارومدار اس کے مقصد اور نیت پر ہے ۔
	ٹیکسی ڈرائیور کا کسی سامان یا کھانے کو اس کے مقام تک پہنچانا اُس کے اجارہ میں شامل ہے اور اس کی اجرت اُس کے لیے حلال ہے۔
علامہ علاء الدین حصکفی رحمۃ اللہ علیہ لکھتے ہیں:
’’[[arabic: وَجَازَتَعْمِیْرُکَنِیْسَۃٍوَ(حَمْلُ خَمْرِ ذِمِّیٍّ)بِنَفْسِہٖ أَوْدَابَّتِہٖ(بِأَجْرٍ)لَا عَصْرُھَا لِقِیَامِ الْمَعْصِیَۃِ  بِعَیْنِہٖ ]] ‘‘۔
ترجمہ:’’اور(کسی شخص کا) کنیسہ (یہودیوں کی عبادت گاہ) کی تعمیر، غیر مسلم کی شراب خود یا اپنی سواری پر اجرت پر اٹھانا جائز ہے اور شراب نچوڑنے کی اجرت جائز نہیں کہ یہ بعینہٖ معصیت ہے، ( ردالمحتار علی الدرالمختار ،جلد9،ص:477-478، بیروت)‘‘۔
علامہ برہان الدین ابوالحسن علی بن ابی بکر فرغانی مرغینانی رحمۃ اللہ علیہ لکھتے ہیں :
’’ [[arabic: مَنْ حَمَلَ لِذمِّیٍّ خَمْراًفَاِنَّہٗ یَطِیْبُ لَہٗ الْأَجْرُعِنْدَ أَبِی حَنِیْفَۃَ وَقَالَ اَبُویُوسُفَ وَمُحَمَّدٌ رَّحِمَہُمَااللّٰہُ: یُکْرَہٗ لَہٗ ذٰلِکَ،لأَِنَّہٗ اِعَانَۃٌ عَلَی الْمَعْصِیَۃِ،وَقَدْ صَحَّ اَنَّ النَّبِیَّﷺ لَعَنَ فِی الْخَمْرِ عَشْراً حَامِلَھَاوَالْمَحْمُولَ اِلَیْہٖ،وَلَہٗ أَنَّ الْمَعْصِیَۃَ فِی شُرْبِھَا وَھُوَ فِعْلُ فَاعِلٍ مُخْتَارٍ،وَلَیْسَ الشُّربُ مِنْ ضَرُوْرَاتِ الْحَمْلِ،وَلَایُقْصَدُ بِہٖ،وَالْحَدِیْثُ مَحْمُولٌ عَلَی الْحَمْلِ الْمَقْرُوْنِ بِقَصْدِ الْمَعْصِیَۃِ ]]‘‘۔
ترجمہ:’’( امام محمد رحمۃ اللہ علیہ نے فرمایا:) جس نے غیر مسلم کے لیے شراب کی بار برداری کی ،تو امام اعظم ابو حنیفہ رحمۃ اللہ علیہ کے نزدیک اُس کے لیے اس کی اجرت حلال ہے ، امام ابو یوسف اورامام محمد رحمۃ اللہ علیہ نے فرمایا:یہ اُجرت اس کے لیے مکروہ ہے کیونکہ یہ معصیت پر مدد کرنا ہے اور حدیث صحیح میں رسول اللہ صلی اللہ علیہ وسلم نے شراب کے بارے میں دس اشخاص پر لعنت فرمائی : (ان میں) شراب اٹھانے والا اور جس کے لیے اٹھائی جائے (دونوں) شامل ہیں ، امام اعظم کی دلیل یہ ہے کہ معصیت پینے میں ہے اور وہ ایک فاعلِ مختار کا( دانستہ)`
  },
  {
    pageNumber: 525,
    text: `فعل ہے اور اٹھانے کے لیے پینا لازم نہیں ہے اورنہ یہ (ہر صورت  میں) مقصود ہوتا ہے اور حدیث میں بیان کی گئی لعنت اُس اٹھانے پر محمول ہے جو معصیت کے ارادے سے ہو ، (ہدایہ ، جلد7،ص:235)‘‘۔ 
	اسٹور پر کیشیر اپنے وقت کا اجارہ کرتاہے ، بظاہر اکثر سامان جس کا وہ بل بناکر قیمت وصول کرتاہے ، حلال اورمباح ہوتاہے ،لیکن اس میں ایک عنصر حرام کا بھی شامل ہوتاہے ، امام اعظم کے مذہب کے مطابق یہ مباح ہے اور صاحبین ( امام یوسف  و  امام محمد )کے مذہب کے مطابق مکروہ ہے ، پس اسے چاہیے کہ ناگواری کے ساتھ یہ کام کرے اورخالص حلال روزگار کے لیے کوشش کرتارہے ، خواہ اس کی تنخواہ نسبتاً کم ہو۔ تاہم شراب خانے اور جواخانے میں ملازمت کرنا بہر صورت ناجائز ہے ،کیونکہ وہاں متعین ہے کہ اجارہ حرام کام کے لیے ہورہاہے ۔مندرجہ بالا تفصیل کی روشنی میں مذکورہ شخص کی ملازمت جائز ہے ،کیونکہ اُس کا اجارہ یاملازمت حرام کام کے لیے مُتعین نہیں ہے ۔`
  },

// {
//   pageNumber: 73,
//   text: ``
// },
// {
//   pageNumber: 73,
//   text: ``
// },
// {
//   pageNumber: 73,
//   text: ``
// },
]
}
