// کتاب کی تمام جلدوں کا تفصیلی انڈیکس / فہرست مضامین
// آپ GitHub کی تمام فہرست کے آئٹمز کو اسی ارے (Array) میں ایڈ کر سکتے ہیں
const bookIndex = [

  {
    "topic": "اللہ تعالیٰ کے لیے جمع کا صیغہ استعمال کرنا",
    "volume": 2,
    "page": 11
  },
  {
    "topic": "ادب گاہیست زیرِ آسماں از عرش نازک تر",
    "volume": 2,
    "page": 14
  },
  {
    "topic": "رسول اللہ ﷺ کو سرورِ کائنات ، سرورِ کونین اور سیدُ المرسلین کہنا",
    "volume": 2,
    "page": 15
  },
  {
    "topic": "کُتبِ الٰہیہ",
    "volume": 9,
    "page": 15
  },
  {
    "topic": "یہ شعر شانِ باری تعالیٰ میں اہانت ہے",
    "volume": 12,
    "page": 15
  },
  {
    "topic": "صحابی کی تعریف",
    "volume": 13,
    "page": 15
  },
  {
    "topic": "مقامِ نبوت کے بارے میں باادب رہنا چاہیے",
    "volume": 10,
    "page": 17
  },
  {
    "topic": "عالمِ دین کا کہنا ہم احمدی ہیں",
    "volume": 11,
    "page": 17
  },
  {
    "topic": "کلمۂ کفر",
    "volume": 4,
    "page": 19
  },
  {
    "topic": "گفتگو کے دوران ”خدانخواستہ “استعمال کرنے کا حکم",
    "volume": 5,
    "page": 19
  },
  {
    "topic": "نبی اور رسول میں فرق",
    "volume": 6,
    "page": 19
  },
  {
    "topic": "یہ بے دینی ہے",
    "volume": 7,
    "page": 19
  },
  {
    "topic": "رسول اللہ ﷺ سے جو اُمور ثابت نہ ہوں ان کا اعلانِ عام نامناسب ہے",
    "volume": 8,
    "page": 19
  },
  {
    "topic": "عَلانیہ گناہ کی توبہ عَلانیہ ہوگی",
    "volume": 9,
    "page": 19
  },
  {
    "topic": "کیا ہر صحابی پر ایمان لانا ارکانِ ایمان میں داخل ہے",
    "volume": 11,
    "page": 19
  },
  {
    "topic": "نبی کریم ﷺکل جہاں کا آسرا ہے",
    "volume": 12,
    "page": 19
  },
  {
    "topic": "توہین نبی ﷺ",
    "volume": 4,
    "page": 20
  },
  {
    "topic": "نبی کریم ﷺکی طرف جھوٹی بات منسوب کرنا",
    "volume": 7,
    "page": 20
  },
  {
    "topic": "یہ کہنا میں لادین ہوں",
    "volume": 12,
    "page": 20
  },
  {
    "topic": "لاالٰہ الا اللہ چشتی رسول اللہ کہنے کا حکم",
    "volume": 14,
    "page": 20
  },
  {
    "topic": "رسول اللہ ﷺ کو ”اے حبیب !“کہنے کا جواز",
    "volume": 2,
    "page": 21
  },
  {
    "topic": "اللہ تعالیٰ پر افتراء باندھنا",
    "volume": 3,
    "page": 21
  },
  {
    "topic": "نبی کریم ﷺ کے والدین کے ایمان کے بارے میں",
    "volume": 4,
    "page": 21
  },
  {
    "topic": "جنت کی اہمیت کو کم کرنا",
    "volume": 9,
    "page": 21
  },
  {
    "topic": "کیا ”درود “تاج پڑھنا شرک ہے ؟",
    "volume": 2,
    "page": 22
  },
  {
    "topic": "عصمتِ آدم علیہ السلام",
    "volume": 3,
    "page": 23
  },
  {
    "topic": "اسلام میں بدشگونی منع ہے",
    "volume": 7,
    "page": 23
  },
  {
    "topic": "جس کپڑے پر اللہ تعالیٰ کا نام پرنٹ ہو اس کا حکم",
    "volume": 8,
    "page": 23
  },
  {
    "topic": "جنات نظر کیوں نہیں آتے",
    "volume": 2,
    "page": 24
  },
  {
    "topic": "امام مہدی کی تشریف آوری",
    "volume": 6,
    "page": 24
  },
  {
    "topic": "شش کلمات ، ایمان مُفصّل و مُجمل کی شرعی حیثیت",
    "volume": 7,
    "page": 24
  },
  {
    "topic": "صلاۃ و سلام پڑھنے کی کیفیت",
    "volume": 12,
    "page": 24
  },
  {
    "topic": "گمراہ پیر",
    "volume": 2,
    "page": 25
  },
  {
    "topic": "نعت کے شعر میں بھول کر ایک مصرعے کی جگہ دوسرا مصرعہ پڑھنے کا حکم",
    "volume": 5,
    "page": 25
  },
  {
    "topic": "رسول اللہ ﷺ کی رسالت و نبوت مستقل اور بالذات ہے",
    "volume": 6,
    "page": 25
  },
  {
    "topic": "بشر اور ملائکہ میں افضل کون",
    "volume": 6,
    "page": 25
  },
  {
    "topic": "دعا اللہ تعالیٰ سے کرنی چاہیے",
    "volume": 10,
    "page": 25
  },
  {
    "topic": "اسمِ جلالت کی ہیئت میں پنجتن پاک کے نام لکھنا",
    "volume": 11,
    "page": 25
  },
  {
    "topic": "غیر نبی پر مستقلا درود و سلام بھیجنا",
    "volume": 5,
    "page": 26
  },
  {
    "topic": "محاورہ کلمۂ کفر ہے",
    "volume": 2,
    "page": 27
  },
  {
    "topic": "تخلیق کائنات میں نورِ مصطفیٰ ﷺ کی جلوہ گری",
    "volume": 6,
    "page": 27
  },
  {
    "topic": "روزانہ 786 مرتبہ بسم اللہ پڑھنے پر خواہش کا پورا ہونا",
    "volume": 2,
    "page": 28
  },
  {
    "topic": "اہانتِ معاویہ",
    "volume": 4,
    "page": 28
  },
  {
    "topic": "رسول اللہ ﷺ کو اپنی مذہبی تنظیم میں کام کی دعوت دینا",
    "volume": 6,
    "page": 28
  },
  {
    "topic": "رسول اللہ ﷺ کی طرف گانا سننے کی نسبت کرنا",
    "volume": 7,
    "page": 28
  },
  {
    "topic": "گمبدِ خضرا کی شبیہ کا حکم",
    "volume": 9,
    "page": 28
  },
  {
    "topic": "اللہ میاں ، اللہ سائیں کہنا",
    "volume": 1,
    "page": 29
  },
  {
    "topic": "کیا رسول اللہ ﷺ کی ولادت با سعادت کے وقت کعبہ جھکا تھا ، جبریل امین علیہ السلام نے ہر ستر ہزار سال بعد طلوع ہونے والا ستارہ بہترہزار مرتبہ دیکھا تھا اس کا حوالہ",
    "volume": 2,
    "page": 29
  },
  {
    "topic": "نو مسلم کے ایمان کی غیر یقینی کیفیت",
    "volume": 4,
    "page": 29
  },
  {
    "topic": "تین حدیثوں کا حوالہ",
    "volume": 12,
    "page": 29
  },
  {
    "topic": "کعبے میں بت سرنگوں ہوگئے",
    "volume": 2,
    "page": 30
  },
  {
    "topic": "منقبت کے ایک شعرکاشرعی حکم",
    "volume": 7,
    "page": 30
  },
  {
    "topic": "عذاب قبر",
    "volume": 1,
    "page": 31
  },
  {
    "topic": "قادیانیوں سے محبت اور ہمدردی رکھنے والوں کا شرعی حکم",
    "volume": 13,
    "page": 31
  },
  {
    "topic": "شیعہ ذاکر کی شانِ نبوت میں ناپاک جسارت",
    "volume": 14,
    "page": 31
  },
  {
    "topic": "کلمہ طیبہ کا ذکر قران میں",
    "volume": 1,
    "page": 32
  },
  {
    "topic": "اللہ تعالیٰ کی حکمتِ تخلیق ، ایک دلچسپ عقلی سوال",
    "volume": 2,
    "page": 32
  },
  {
    "topic": "غیر صحابی کو ”رضی اللہ عنہ “کہنے کا جواز",
    "volume": 3,
    "page": 32
  },
  {
    "topic": "غیر مسلموں سے معاملات اور ان کی عبادت گاہوں میں جا کر ان کے طریقے سے عبادت کرنا",
    "volume": 4,
    "page": 32
  },
  {
    "topic": "مُتصوّفین اور اُن کے ارادتمندوں کے خلافِ شرع عقائد کا رَد",
    "volume": 6,
    "page": 32
  },
  {
    "topic": "اللہ تعالیٰ کے لیے آسمان والا کہنا",
    "volume": 7,
    "page": 32
  },
  {
    "topic": "اللہ تعالیٰ کو حاضر و ناظر کہنا",
    "volume": 11,
    "page": 33
  },
  {
    "topic": "قیامت کا دن",
    "volume": 1,
    "page": 34
  },
  {
    "topic": "دجال کی حقیقت",
    "volume": 1,
    "page": 34
  },
  {
    "topic": "انگریزی میں رسول اللہ ﷺ کے نام کے ساتھ SAWلکھنا حرام ہے",
    "volume": 5,
    "page": 34
  },
  {
    "topic": "دُخول جنت کے لیے اسلام شرط ہے",
    "volume": 10,
    "page": 34
  },
  {
    "topic": "جنت کے کھانے کیسے ہوں گے ؟",
    "volume": 1,
    "page": 36
  },
  {
    "topic": "برزخ سے کیا مراد ہے ؟",
    "volume": 1,
    "page": 37
  },
  {
    "topic": "مَوتُ العالِم مَوتُ العَالَمِ حدیث کے الفاظ نہیں ہیں",
    "volume": 13,
    "page": 37
  },
  {
    "topic": "کسی بندے کے بارے میں کہنا ”(العیاذ باللہ )ہمارے اللہ وہ ہیں “",
    "volume": 2,
    "page": 38
  },
  {
    "topic": "آثارِ قیامت میں ”تقارُبِ زمانی “کا مفہوم",
    "volume": 4,
    "page": 38
  },
  {
    "topic": "انبیاءِ کرام و عبادِ صالحین کے وسیلے سے دعا",
    "volume": 5,
    "page": 38
  },
  {
    "topic": "نعت میں بعض کلمات کے استعمال کا جواز",
    "volume": 7,
    "page": 38
  },
  {
    "topic": "نماز کی توہین کفر ہے",
    "volume": 11,
    "page": 38
  },
  {
    "topic": "نبی کریم ﷺ کے راستے میں کوڑا پھینکنے والی عورت کا واقعہ",
    "volume": 11,
    "page": 38
  },
  {
    "topic": "ذوالنورین لقب کی وجہ تسمیہ",
    "volume": 12,
    "page": 38
  },
  {
    "topic": "مقدس نام دیوار پر لکھنا بورڈ یا ہورڈنگز آویزاں کرنا",
    "volume": 13,
    "page": 38
  },
  {
    "topic": "ارشاد احمد حقانی سے مکالمہ لفظ ”مولانا“کا اطلاق",
    "volume": 1,
    "page": 39
  },
  {
    "topic": "تخلیق ارض و سماں سے پہلے عرش کہاں تھا",
    "volume": 2,
    "page": 39
  },
  {
    "topic": "مُتصوّفین کا ناجائز شعار",
    "volume": 6,
    "page": 39
  },
  {
    "topic": "قرآن مجید کی توہین",
    "volume": 7,
    "page": 39
  },
  {
    "topic": "صحابی کی تعریف کیا ہے",
    "volume": 11,
    "page": 40
  },
  {
    "topic": "عشرۂ مبشرہ صحابہ نے خلیفۂ اول کی بیعت کی تھی",
    "volume": 12,
    "page": 40
  },
  {
    "topic": "کافر ملت پر معلق کرکے قسم کھانا",
    "volume": 2,
    "page": 41
  },
  {
    "topic": "زمانے کو برا کہنے کی ممانعت",
    "volume": 4,
    "page": 41
  },
  {
    "topic": "رسول اللہ ﷺکی طرف بھول کی نسبت",
    "volume": 7,
    "page": 41
  },
  {
    "topic": "جنت کی حوریں کیا ہیں اور نیک خواتین کے لیے کیا ہوگا",
    "volume": 2,
    "page": 42
  },
  {
    "topic": "بعض امور حکمت دین کے تحت ترک کرنے اولیٰ ہیں",
    "volume": 10,
    "page": 42
  },
  {
    "topic": "موئے مبارک کے آداب",
    "volume": 5,
    "page": 43
  },
  {
    "topic": "اللہ تعالیٰ کی شان میں گستاخی",
    "volume": 1,
    "page": 44
  },
  {
    "topic": "ناگہانی مصیبت کا نزول",
    "volume": 2,
    "page": 44
  },
  {
    "topic": "حدیث باب العلم کی تحقیق",
    "volume": 12,
    "page": 44
  },
  {
    "topic": "دولت مندوں کی جنت سے دوری",
    "volume": 1,
    "page": 45
  },
  {
    "topic": "مفلس کون",
    "volume": 1,
    "page": 45
  },
  {
    "topic": "منقبت کے اشعار اور اس سے متعلق چند امور کی بابت شرعی حکم",
    "volume": 13,
    "page": 45
  },
  {
    "topic": "انتقال کرنے والے خواب میں نظر آتے ہیں",
    "volume": 2,
    "page": 46
  },
  {
    "topic": "”میرے فرشتوں کو بھی علم نہیں “، کیا کلمۂ کفر ہے",
    "volume": 2,
    "page": 46
  },
  {
    "topic": "تارکِ صلوٰۃ اور دینی شعائر کے ترک کا مطالبہ کرنے والی بیوی کا حکم",
    "volume": 6,
    "page": 46
  },
  {
    "topic": "اللہ تعالیٰ کے صفاتی ناموں کے ساتھ عبد کی اضافت",
    "volume": 10,
    "page": 46
  },
  {
    "topic": "کیا مولودِ کعبہ ہونا حضرت علی کی وجہِ فضیلت ہے",
    "volume": 6,
    "page": 47
  },
  {
    "topic": "یہ کہنا کہ : ”نہ شریعت پر میراایمان ہے اور نہ کبھی تھا “",
    "volume": 7,
    "page": 47
  },
  {
    "topic": "کپڑے کے ڈیزائن میں اسمِ ”محمد “ظاہر ہو تو اُس کا شرعی حکم",
    "volume": 5,
    "page": 48
  },
  {
    "topic": "علماء کی اہانت",
    "volume": 6,
    "page": 49
  },
  {
    "topic": "انبیاء کرام علیہم السلام کی تعداد کتنی ہے",
    "volume": 2,
    "page": 51
  },
  {
    "topic": "نبی کریم ﷺ کی عمر نوے سال بتانا",
    "volume": 10,
    "page": 51
  },
  {
    "topic": "اسلام میں کسی تاریخ یا دن کے نحس ہونے کوئی تصور نہیں",
    "volume": 10,
    "page": 53
  },
  {
    "topic": "اونٹ کو ”شیطان“ سے پیدا کیے جانے کی توجیہ",
    "volume": 14,
    "page": 53
  },
  {
    "topic": "قیامت کے دن کس کی نسبت سے پکارا جائے گا ؟",
    "volume": 2,
    "page": 54
  },
  {
    "topic": "ذکر صحابہ امام طحاوی کی نظر میں",
    "volume": 12,
    "page": 54
  },
  {
    "topic": "کیا ورقہ بن نوفل صحابی تھے",
    "volume": 11,
    "page": 57
  },
  {
    "topic": "مسلکی اختلافات سے ذہنی اضطراب",
    "volume": 2,
    "page": 58
  },
  {
    "topic": "سورج اور چاند گرہن کا اسلامی تصور",
    "volume": 10,
    "page": 60
  },
  {
    "topic": "استاذ کی فضیلت کی بابت ایک روایت کی تحقیق",
    "volume": 12,
    "page": 62
  },
  {
    "topic": "جنّات میں رسولوں کا ہونا",
    "volume": 10,
    "page": 63
  },
  {
    "topic": "ملک الموت کا کیا نام ہے",
    "volume": 11,
    "page": 64
  },
  {
    "topic": "اَصحُّ الکتب بعد کتاب اللہ کا مفہوم",
    "volume": 12,
    "page": 66
  },
  {
    "topic": "انسان کے جسم میں جنّات کا تصرف",
    "volume": 10,
    "page": 67
  },
  {
    "topic": "نِسیان کے وقت درود شریف پڑھنے کا حکم",
    "volume": 13,
    "page": 69
  },
  {
    "topic": "غیر اللہ کی قسم اور قسم کے چند ضروری مسائل",
    "volume": 12,
    "page": 71
  },
  {
    "topic": "ان الفاظ کے ساتھ یہ حدیث ثابت نہیں ہے",
    "volume": 13,
    "page": 71
  },
  {
    "topic": "غیر صحابی کے لیے رضی اللہ عنہ کہنے کا جواز",
    "volume": 13,
    "page": 74
  },
  {
    "topic": "ناموس کے لغوی معنیٰ کی تحقیق",
    "volume": 12,
    "page": 76
  },
  {
    "topic": "قادیانی کا اپنے نام کے ساتھ ”سید“کا سابقہ لگانے کا حکم",
    "volume": 14,
    "page": 76
  },
  {
    "topic": "کافر کے لیے بعد از وفات دعائے مغفرت جائز نہیں ہے",
    "volume": 13,
    "page": 78
  },
  {
    "topic": "خلاف شرع رواج",
    "volume": 12,
    "page": 80
  },
  {
    "topic": "حضرت امیر معاویہ رضی اللہ عنہ کے لیے دعا کرنے سے روکنے والے مؤذن کا شرعی حکم",
    "volume": 13,
    "page": 80
  },
  {
    "topic": "خالی قبر کو مزار قرار دینا",
    "volume": 12,
    "page": 82
  },
  {
    "topic": "حضرتِ بلال کی لکنت کے بارے میں موضوع روایت",
    "volume": 13,
    "page": 83
  },
  {
    "topic": "غیر مسلم سے محفلِ میلاد میں خطاب کرانا",
    "volume": 12,
    "page": 85
  },
  {
    "topic": "نبی کریم ﷺ کے والدین کریمین جنتی ہیں",
    "volume": 14,
    "page": 85
  },
  {
    "topic": "الفقر فخری موضوع روایت ہے",
    "volume": 13,
    "page": 86
  },
  {
    "topic": "دعوتِ حق کا قرآنی اسلوب",
    "volume": 12,
    "page": 89
  },
  {
    "topic": "نعلینِ مبارک پہن کر عرش پر جانے کی موضوع روایت",
    "volume": 13,
    "page": 89
  },
  {
    "topic": "عشقِ مصطفیٰ میں حضرت اویس قرنی کے دانت توڑنے کی موضوع روایت",
    "volume": 13,
    "page": 90
  },
  {
    "topic": "عفو و درگزر مکارمِ اخلاق میں سے ہے",
    "volume": 12,
    "page": 92
  },
  {
    "topic": "زندگی میں پڑھے جانے والے اذکار و تلاوت کاذخیرۂ آخرت بننا",
    "volume": 13,
    "page": 92
  },
  {
    "topic": "خانقاہ کو خوامخواہ قراردینا",
    "volume": 14,
    "page": 93
  },
  {
    "topic": "اللہ تعالٰی کے بارے میں عامیانہ کلمات استعمال کرنا گستاخی ہے",
    "volume": 14,
    "page": 94
  },
  {
    "topic": "بسم اللہ شریف کی معکوس کتابت کا شرعی حکم",
    "volume": 13,
    "page": 95
  },
  {
    "topic": "قدم بوسی کی روایت",
    "volume": 14,
    "page": 97
  },
  {
    "topic": "حضرت معاویہ رضی اللہ عنہ کے بارے میں باطل نظریہ رکھنے والے شخص کے کے لیے دعائے مغفرت",
    "volume": 13,
    "page": 98
  },
  {
    "topic": "بناتِ طیباتِ رسول",
    "volume": 14,
    "page": 102
  },
  {
    "topic": "دینی مُقدّس شخصیات کی خیالی تصاویر بنا کر آویزاں کرنا ممکنہ مفاسد کا پیش خیمہ ہے",
    "volume": 14,
    "page": 108
  },
  {
    "topic": "نوحہ خوانی کا شرعی حکم",
    "volume": 14,
    "page": 111
  },
  {
    "topic": "قبر میں ابلیس کابہکانا",
    "volume": 14,
    "page": 116
  },
  {
    "topic": "نام رکھنے کا طریقہ",
    "volume": 1,
    "page": 352
  },
  {
    "topic": "نام تبدیل کرنا",
    "volume": 1,
    "page": 353
  },
  {
    "topic": "عبدالنبی نام",
    "volume": 1,
    "page": 354
  },
  {
    "topic": "”پرویز“ اور ”قیصر“نام رکھنا",
    "volume": 1,
    "page": 356
  },
  {
    "topic": "نام بگاڑنا",
    "volume": 9,
    "page": 400
  },
  {
    "topic": "عائشہ نام رکھنا",
    "volume": 9,
    "page": 401
  },
  {
    "topic": "محمد نام رکھنا",
    "volume": 11,
    "page": 426
  },
  {
    "topic": "شرجیل نام",
    "volume": 11,
    "page": 433
  },
  {
    "topic": "نام رکھنے سے متعلق ضروری مسائل",
    "volume": 6,
    "page": 509
  },
  {
    "topic": "ارباز نام کے معنی",
    "volume": 10,
    "page": 518
  },
  {
    "topic": "بیٹی کی پیدائش اظہار رنج و غم",
    "volume": 1,
    "page": 367
  },
  {
    "topic": "شادی شدہ عورت اور چوڑیاں",
    "volume": 1,
    "page": 368
  },
  {
    "topic": "عورتوں کی محفل میلاد",
    "volume": 1,
    "page": 368
  },
  {
    "topic": "عورتوں کا قبرستان جانا",
    "volume": 1,
    "page": 368
  },
  {
    "topic": "عورتوں کا آپس میں مصافحہ و معانقہ",
    "volume": 1,
    "page": 369
  },
  {
    "topic": "عدت کے دوران ٹی وی دیکھنا",
    "volume": 1,
    "page": 369
  },
  {
    "topic": "خواتین کی تزئین جائز ، ناجائز",
    "volume": 1,
    "page": 370
  },
  {
    "topic": "شوہر کو بتائے بغیر خرچ کرنا",
    "volume": 1,
    "page": 370
  },
  {
    "topic": "شوہر کو مذاقاً پاگل بدتمیز کہنا",
    "volume": 1,
    "page": 372
  },
  {
    "topic": "بہو کے ساتھ ناروا سلوک",
    "volume": 1,
    "page": 372
  },
  {
    "topic": "ضبط تولید کا مسئلہ",
    "volume": 1,
    "page": 374
  },
  {
    "topic": "شوہر والدین سے ملنے نہیں دیتے",
    "volume": 2,
    "page": 405
  },
  {
    "topic": "خاتون مبلغہ کا غیر شرعی طرزِ عمل",
    "volume": 4,
    "page": 408
  },
  {
    "topic": "خواتین /لڑکیوں کے ساتھ جنسی ومعاشرتی تشدد",
    "volume": 8,
    "page": 413
  },
  {
    "topic": "لڑکے اور لڑکی یا عورت ومرد کے درمیان حسن معاشرت",
    "volume": 8,
    "page": 431
  },
  {
    "topic": "شوہر کا غیر شرعی اور غیر اخلاقی مطالبہ",
    "volume": 7,
    "page": 444
  },
  {
    "topic": "خواتین کا علماء سے مسائل دریافت کرنا",
    "volume": 5,
    "page": 458
  },
  {
    "topic": "عورتوں کے حجاب کی شرعی حیثیت",
    "volume": 7,
    "page": 460
  },
  {
    "topic": "عورتوں کے پرفیوم لگانے کا حکم",
    "volume": 10,
    "page": 499
  },
  {
    "topic": "بہو پر سسر کی خدمت فرض نہیں ہے",
    "volume": 10,
    "page": 514
  },
  {
    "topic": "ڈیلر یا کمیشن ایجنٹ کی اجرت کا تعین ضروری ہے",
    "volume": 9,
    "page": 225
  },
  {
    "topic": "عقد مضاربت میں نفع میں کمی بیشی پر اختلاف",
    "volume": 9,
    "page": 227
  },
  {
    "topic": "بیع بالتقسیط کی ایک صورت",
    "volume": 9,
    "page": 228
  },
  {
    "topic": "کسی شراکت دار کے لیے نفع کے حصے میں باہمی رضامندی سے اضافہ",
    "volume": 9,
    "page": 229
  },
  {
    "topic": "حق شفعہ میں ترجیح شریک کا حق پڑوسی پر مقدّم ہے",
    "volume": 9,
    "page": 232
  },
  {
    "topic": "شراکتی کاروبار میں نقصان کا ضمان",
    "volume": 9,
    "page": 239
  },
  {
    "topic": "حدّ سرقہ کے لیے شرعی ثبوت ضروری ہے",
    "volume": 9,
    "page": 240
  },
  {
    "topic": "استحقاق کے بغیر ملنے والے اضافے کا شرعی حکم",
    "volume": 9,
    "page": 243
  },
  {
    "topic": "ویزوں کی خریدوفروخت",
    "volume": 9,
    "page": 244
  },
  {
    "topic": "کتے کی خرید وفروخت کا شرعی حکم",
    "volume": 9,
    "page": 246
  },
  {
    "topic": "تکافل اور انشورنس میں فرق",
    "volume": 7,
    "page": 259
  },
  {
    "topic": "حرمت کی اشیاءکا حکم",
    "volume": 7,
    "page": 270
  },
  {
    "topic": "ویزے کی خریدوفروخت",
    "volume": 7,
    "page": 271
  },
  {
    "topic": "حق شفعہ کی شرعی حیثیت",
    "volume": 7,
    "page": 272
  },
  {
    "topic": "عقد معاوضہ کا شرعی حکم",
    "volume": 7,
    "page": 277
  },
  {
    "topic": "فیکٹری کے متصل غیر قانونی مکانات کا انخلا",
    "volume": 7,
    "page": 279
  },
  {
    "topic": "حلال جانور کے دَمِ مسفوح اور بعض دیگر ممنوعہ اَعضاء کی بیع",
    "volume": 7,
    "page": 280
  },
  {
    "topic": "الکحل کا شرعی حکم",
    "volume": 7,
    "page": 288
  },
  {
    "topic": "خنزیر کی کھال کے استعمال کا شرعی حکم",
    "volume": 7,
    "page": 298
  },
  {
    "topic": "مردار جانور کی کھال کے استعمال کا شرعی حکم",
    "volume": 7,
    "page": 301
  },
  {
    "topic": "قرض پر دی ہوئی رقم پر مضاربت جائز نہیں",
    "volume": 7,
    "page": 303
  },
  {
    "topic": "موبائل ری چارج",
    "volume": 8,
    "page": 303
  },
  {
    "topic": "قسطوں کے کاروبار کا شرعی حکم",
    "volume": 8,
    "page": 303
  },
  {
    "topic": "شراکت کی ایک قسم",
    "volume": 7,
    "page": 304
  },
  {
    "topic": "سونے کی بیع",
    "volume": 8,
    "page": 304
  },
  {
    "topic": "بیع منعقد نہ ہونے پر ایڈوانس کی رقم کا استحقاق",
    "volume": 7,
    "page": 306
  },
  {
    "topic": "منزل واٹر کا کاروبار",
    "volume": 8,
    "page": 306
  },
  {
    "topic": "سیلز انوائس کی خرید وفروخت",
    "volume": 7,
    "page": 308
  },
  {
    "topic": "ثالث کا مدعی اور مدّعیٰ علیہ کے بجائے اپنے حق میں فیصلہ باطل ہے",
    "volume": 7,
    "page": 310
  },
  {
    "topic": "اقساط پر بیع کی واجب الادا رقم میں قبل از وقت ادائیگی کا جواز",
    "volume": 8,
    "page": 310
  },
  {
    "topic": "مشترکہ کاروبار میں منافع کی تقسیم کا اصول",
    "volume": 7,
    "page": 312
  },
  {
    "topic": "بیعانے کو ضبط کرنے کا حکم",
    "volume": 7,
    "page": 314
  },
  {
    "topic": "بیعِ صرف کا حکم",
    "volume": 8,
    "page": 314
  },
  {
    "topic": "مضاربت در مضاربت کا جواز",
    "volume": 7,
    "page": 316
  },
  {
    "topic": "قبل از وقت ادائیگی کی صورت میں تخفیف کا مسئلہ",
    "volume": 8,
    "page": 316
  },
  {
    "topic": "بینک کو کرائے پر جگہ دینا",
    "volume": 7,
    "page": 318
  },
  {
    "topic": "بیع مرابحہ میں قیمت کی کمی",
    "volume": 8,
    "page": 319
  },
  {
    "topic": "مضاربت کا شرعی حکم",
    "volume": 8,
    "page": 319
  },
  {
    "topic": "عقدِ فاسد کو فسخ کرنا واجب ہے",
    "volume": 7,
    "page": 320
  },
  {
    "topic": "سونے کی تجارت کا جائز طریقہ",
    "volume": 7,
    "page": 321
  },
  {
    "topic": "منافع کی حد کا تعین",
    "volume": 8,
    "page": 323
  },
  {
    "topic": "مارکیٹ میں دوکان داروں کا باہم لین دین",
    "volume": 7,
    "page": 324
  },
  {
    "topic": "قبضے سے پہلے بیع کا شرعی حکم",
    "volume": 7,
    "page": 325
  },
  {
    "topic": "سونے کے کاروبار میں شراکت",
    "volume": 1,
    "page": 327
  },
  {
    "topic": "اسلام میں نیلام عام",
    "volume": 1,
    "page": 327
  },
  {
    "topic": "گاہک کو ’’آخری دام‘‘ بتاکر پھر تخفیف کرنا",
    "volume": 2,
    "page": 327
  },
  {
    "topic": "کمیشن پر عقد جائز ہے",
    "volume": 7,
    "page": 327
  },
  {
    "topic": "آڑھت کا کاروبار",
    "volume": 7,
    "page": 327
  },
  {
    "topic": "نیلام کا جواز",
    "volume": 1,
    "page": 328
  },
  {
    "topic": "قسطوں پر اشیاء کی خریداری",
    "volume": 2,
    "page": 328
  },
  {
    "topic": "تیس سال پہلے کی ایڈوانس رقم اب کتنی وصول کرے",
    "volume": 2,
    "page": 328
  },
  {
    "topic": "اسلامی بینک کا منافع حلال ہے",
    "volume": 7,
    "page": 328
  },
  {
    "topic": "ہنڈی کی بیع",
    "volume": 1,
    "page": 329
  },
  {
    "topic": "گنے کا پیشگی سودا",
    "volume": 1,
    "page": 329
  },
  {
    "topic": "ایڈوانس دے کر مال نہ اٹھانا",
    "volume": 2,
    "page": 329
  },
  {
    "topic": "کاروبار میں سود کی ایک صورت",
    "volume": 7,
    "page": 329
  },
  {
    "topic": "ٹھیکے کے حصول اور بل کی وصولی کے لیے رشوت کا لین دین",
    "volume": 1,
    "page": 330
  },
  {
    "topic": "کیا ’’نیوتا‘‘ یا ’’عذر‘‘ پر سود کا اطلاق ہوسکتا ہے؟",
    "volume": 2,
    "page": 330
  },
  {
    "topic": "چلتے ہوئے کاروبار میں شرکت کا شرعی حکم",
    "volume": 8,
    "page": 330
  },
  {
    "topic": "’’قرضِ حسن‘‘ کی تعریف",
    "volume": 2,
    "page": 331
  },
  {
    "topic": "لائسنسوں کی فروخت",
    "volume": 1,
    "page": 332
  },
  {
    "topic": "بطور قرض دی ہوئی رقم پر زیادہ وصول کرنا سود ہے",
    "volume": 7,
    "page": 332
  },
  {
    "topic": "فلیٹ، دکان کی پگڑی",
    "volume": 1,
    "page": 333
  },
  {
    "topic": "منافع کی شرح",
    "volume": 1,
    "page": 333
  },
  {
    "topic": "کرنسی نوٹ کے تبادلے کا حکم",
    "volume": 8,
    "page": 333
  },
  {
    "topic": "انعامی بانڈز پر انعام",
    "volume": 1,
    "page": 334
  },
  {
    "topic": "رہن رکھی ہوئی شئے سے نفع اٹھانے کا شرعی حکم",
    "volume": 8,
    "page": 334
  },
  {
    "topic": "کروڑ پتی، مالا مال اسکیم اور پرائز بانڈ",
    "volume": 1,
    "page": 335
  },
  {
    "topic": "انعامی بانڈز کی پرچیوں کا کاروبار",
    "volume": 1,
    "page": 336
  },
  {
    "topic": "انعامی بانڈز ر انعام کے جواز کا مسئلہ",
    "volume": 1,
    "page": 337
  },
  {
    "topic": "کاروباری اداروں کی انعامی اسکیمیں",
    "volume": 1,
    "page": 337
  },
  {
    "topic": "انٹرنیٹ کیفے کا کاروبار",
    "volume": 8,
    "page": 337
  },
  {
    "topic": "قومی بچت اسکیمیں، سود یا منافع",
    "volume": 1,
    "page": 338
  },
  {
    "topic": "بنک کی ملازمت",
    "volume": 1,
    "page": 338
  },
  {
    "topic": "دینی اداروں میں اجارے کے احکام",
    "volume": 8,
    "page": 340
  },
  {
    "topic": "اجرت مقرر نہ ہونے سے اجارہ فاسد ہوتا ہے",
    "volume": 8,
    "page": 345
  },
  {
    "topic": "کیا یہ سود ہے",
    "volume": 12,
    "page": 345
  },
  {
    "topic": "کمیٹی کا یہ طریقہ غیر شرعی اور سود پر مبنی ہے",
    "volume": 12,
    "page": 346
  },
  {
    "topic": "قرض پر نفع لینا حرام ہے",
    "volume": 8,
    "page": 347
  },
  {
    "topic": "فکس منافع پر معاہدہ",
    "volume": 12,
    "page": 350
  },
  {
    "topic": "بیع معجّل کا صحیح طریقہ",
    "volume": 8,
    "page": 351
  },
  {
    "topic": "مالِ تجارت پر زکوٰۃ واجب ہے",
    "volume": 12,
    "page": 351
  },
  {
    "topic": "کرایہ پر لیے گئے مکان کی سپردگی اور انتفاع سے قبل کرایہ لینے کا حق نہیں بنتا",
    "volume": 12,
    "page": 352
  },
  {
    "topic": "عقدِ مضاربت",
    "volume": 8,
    "page": 354
  },
  {
    "topic": "یہ معاہدہ حرام ہے",
    "volume": 8,
    "page": 356
  },
  {
    "topic": "مضارب کا کاروبار میں خیانت کرنا",
    "volume": 8,
    "page": 358
  },
  {
    "topic": "ایکسپورٹ فنانسنگ یا LCڈسکائونٹ کا شرعی حل",
    "volume": 8,
    "page": 362
  },
  {
    "topic": "بائع کا مبیع کی مکمل قسطیں وصول کرنے سے پہلے وہی شے واپس خریدنا",
    "volume": 12,
    "page": 362
  },
  {
    "topic": "دین کی وصولی کے لیے کسی کو وکیل یا اجیر بنانا",
    "volume": 8,
    "page": 364
  },
  {
    "topic": "منصب کا ناجائز فائدہ اٹھانا",
    "volume": 8,
    "page": 365
  },
  {
    "topic": "روزگار دلانے کا اجارہ",
    "volume": 12,
    "page": 366
  },
  {
    "topic": "قانونی حیثیت کا تعین عدالت کرے گی",
    "volume": 13,
    "page": 377
  },
  {
    "topic": "بیع کو یکطرفہ فسخ کرنے کا اختیار",
    "volume": 13,
    "page": 378
  },
  {
    "topic": "بیع بالاقساط",
    "volume": 11,
    "page": 381
  },
  {
    "topic": "زراعت کا سامان قسطوں پر خریدنے کا شرعی حکم",
    "volume": 13,
    "page": 381
  },
  {
    "topic": "یہ بیع فاسد ہے",
    "volume": 11,
    "page": 384
  },
  {
    "topic": "دوا فروشی کا لائسنس کرائے پر دینا",
    "volume": 13,
    "page": 384
  },
  {
    "topic": "گروپ انشورنس کا حکم",
    "volume": 11,
    "page": 386
  },
  {
    "topic": "مضارب کا صرف منافع میں مقررہ حصہ ہے",
    "volume": 13,
    "page": 386
  },
  {
    "topic": "اجارے پر اجارہ",
    "volume": 13,
    "page": 388
  },
  {
    "topic": "کاروبار میں شراکت",
    "volume": 6,
    "page": 391
  },
  {
    "topic": "بیع کے فسخ کرنے کا حق",
    "volume": 6,
    "page": 392
  },
  {
    "topic": "بینک ملازمین کی ایڈوانس تنخواہوں پر اضافی وصولی ناجائز ہے",
    "volume": 11,
    "page": 392
  },
  {
    "topic": "سیکیورٹی کی ملازمت",
    "volume": 11,
    "page": 393
  },
  {
    "topic": "سپروائزری سرٹیفکیٹ کا معاوضہ",
    "volume": 11,
    "page": 394
  },
  {
    "topic": "کمپنی کا تاخیر سے آنے پر جرمانہ عائد کرنا",
    "volume": 11,
    "page": 395
  },
  {
    "topic": "رہن رکھی ہوئی چیز سے نفع",
    "volume": 6,
    "page": 396
  },
  {
    "topic": "سونا قرض پر لے کر ادا کرنے کا طریقہ",
    "volume": 11,
    "page": 396
  },
  {
    "topic": "غنی کا قرض کی ادائی میں تاخیر کرنا مذموم ہے",
    "volume": 11,
    "page": 398
  },
  {
    "topic": "قسطوں پر قیمت طے کر کے کاروبار جائز ہے",
    "volume": 6,
    "page": 399
  },
  {
    "topic": "سونے کا ادھار لین دین",
    "volume": 11,
    "page": 399
  },
  {
    "topic": "طے شدہ اجرت سے وضع کرنا",
    "volume": 6,
    "page": 400
  },
  {
    "topic": "قرض کی واپسی",
    "volume": 11,
    "page": 401
  },
  {
    "topic": "جھوٹی قسم کے ذریعے کسی کا مال غصب کرنا",
    "volume": 6,
    "page": 403
  },
  {
    "topic": "قرعہ اندازی کے ذریعے کسی ایک فرد کو کمیٹی کی رقم دینے کا حکم",
    "volume": 11,
    "page": 404
  },
  {
    "topic": "عقدِ مضاربت میں نفع کی مقدار مقرر کرنا فساد کا باعث ہے",
    "volume": 5,
    "page": 405
  },
  {
    "topic": "ٹوکن والے مال کی خرید وفروخت",
    "volume": 11,
    "page": 405
  },
  {
    "topic": "نفلی خیراتی ٹرسٹ کی رقم کی شرعی سرمایہ کاری",
    "volume": 5,
    "page": 406
  },
  {
    "topic": "سودی لین دین کا معاہدہ حرام ہے",
    "volume": 6,
    "page": 406
  },
  {
    "topic": "ایڈوانس کی رقم پر زیادہ لینا ناجائز ہے",
    "volume": 6,
    "page": 406
  },
  {
    "topic": "اسلامی بنک کا منافع حلال ہے",
    "volume": 5,
    "page": 408
  },
  {
    "topic": "کسی چیز کے بیچنے کے لیے دوسرے کو ایجنٹ بنانا",
    "volume": 6,
    "page": 408
  },
  {
    "topic": "عاقدین کاباہمی رضامندی سے بیع کو فسخ کرنا",
    "volume": 11,
    "page": 408
  },
  {
    "topic": "قرعہ اندازی پر موٹر سائیکل",
    "volume": 6,
    "page": 409
  },
  {
    "topic": "سود سے حاصل کردہ رقم کی خیرات پر اجرِ آخرت کی نیت کا حکم",
    "volume": 5,
    "page": 410
  },
  {
    "topic": "انعامی رقم ٹیکس کی مد میں ادا کرنا",
    "volume": 11,
    "page": 410
  },
  {
    "topic": "پیشگی ماہانہ کرائے کی واپسی لازم نہیں ہے",
    "volume": 11,
    "page": 411
  },
  {
    "topic": "پراویڈنٹ فنڈ پر سود",
    "volume": 5,
    "page": 412
  },
  {
    "topic": "پراویڈنٹ فنڈ میں ادارے کی جانب سے اضافی رقم سود نہیں",
    "volume": 5,
    "page": 412
  },
  {
    "topic": "کیا انعامی بانڈز کا انعام سود میں شامل ہے",
    "volume": 5,
    "page": 414
  },
  {
    "topic": "ایک رفاہی ادارے کا کسی دوسرے رفاہی ادارے کو منفعت کے عوض قرض دینا",
    "volume": 5,
    "page": 415
  },
  {
    "topic": "بیع کے انعقاد کے بعد شرط فاسد غیر مؤثر ہوتی ہے",
    "volume": 14,
    "page": 438
  },
  {
    "topic": "آن لائن قرآن کی تعلیم اور اس کی اجرت کا شرعی حکم",
    "volume": 14,
    "page": 440
  },
  {
    "topic": "غیر شرعی اور غیر قانونی کمیٹیاں",
    "volume": 10,
    "page": 441
  },
  {
    "topic": "امریکا میں غیر مسلم کے گیس اسٹیشن پر ملازمت کا حکم",
    "volume": 10,
    "page": 442
  },
  {
    "topic": "آرڈر پر سونے کے زیورات بنوانا",
    "volume": 10,
    "page": 443
  },
  {
    "topic": "فلیٹ کو کرائے پر دینے میں شریعت وقانون کی پابندی شرط",
    "volume": 14,
    "page": 443
  },
  {
    "topic": "مکان رہن رکھنے کی صورت میں نفع اٹھانے کی ممانعت اور متبادل صورت",
    "volume": 10,
    "page": 447
  },
  {
    "topic": "غبن کی ایک صورت",
    "volume": 10,
    "page": 454
  },
  {
    "topic": "سود کی رقم کا حکم",
    "volume": 10,
    "page": 455
  },
  {
    "topic": "دوائوں پر ڈاکٹر کے لیے ڈسکائونٹ",
    "volume": 10,
    "page": 455
  },
  {
    "topic": "اشیائے صرف کی قیمت مقرر کرنا",
    "volume": 10,
    "page": 457
  },
  {
    "topic": "مردار جانور کے گوشت کی خرید وفروخت",
    "volume": 10,
    "page": 463
  },
  {
    "topic": "بیع اور برطانیہ کا قانون",
    "volume": 3,
    "page": 464
  },
  {
    "topic": "انٹرنیٹ پر خریداری کے ضروری مسائل",
    "volume": 12,
    "page": "<355/td>"
  },
  {
    "topic": "ملاوٹ شدہ دودھ بتا کر بیچنا",
    "volume": 14,
    "page": 449
  },
  {
    "topic": "تعدّی سے ہونے والا نقصان مُضارب کے ذمے ہے",
    "volume": 14,
    "page": 451
  },
  {
    "topic": "عقدِ مضاربت کا طریقہ",
    "volume": 14,
    "page": 455
  },
  {
    "topic": "انڈر انوائسنگ اور غیر دستاویزی کاروبار کے مسائل",
    "volume": 14,
    "page": 459
  },
  {
    "topic": "کاروباری شراکت کے مسائل",
    "volume": 14,
    "page": 459
  },
  {
    "topic": "کاشتکار کا قرض کے بدلے تیار فصل آڑھتی کو فروخت کرنے کا شرعی حکم",
    "volume": 14,
    "page": 464
  },
  {
    "topic": "کاروباری شراکت کا ایک مسئلہ",
    "volume": 14,
    "page": 468
  },
  {
    "topic": "سرکاری زمین پر تصرف کی صورت",
    "volume": 14,
    "page": 472
  },
  {
    "topic": "سیل ڈیڈ پراپرٹی کی قیمت کم لکھنے کا شرعی حکم",
    "volume": 14,
    "page": 473
  },
  {
    "topic": "قرض یا شراکت کے لین دین کا ایک پیچیدہ مسئلہ",
    "volume": 14,
    "page": 474
  },
  {
    "topic": "قرض کے ایک دعوے کا شرعی حکم",
    "volume": 14,
    "page": 476
  },
  {
    "topic": "عید الفطرخوشی اور شکریہ کا دن ہے ، عید کا تاریخی پس منظر ، عظمت اور فلسفہ",
    "volume": 2,
    "page": 219
  },
  {
    "topic": "لفظ عید کے معنی اور وجہ تسمیہ",
    "volume": 2,
    "page": 219
  },
  {
    "topic": "عید انسانی فطرت کا تقاضا",
    "volume": 2,
    "page": 220
  },
  {
    "topic": "قرآنِ مجید میں ذکرِ عید",
    "volume": 2,
    "page": 220
  },
  {
    "topic": "عید میلادِ مصطفیٰﷺ کا ثبوت ایک لطیف پیرائے میں",
    "volume": 2,
    "page": 221
  },
  {
    "topic": "اسلام میں عید کا آغاز",
    "volume": 2,
    "page": 221
  },
  {
    "topic": "عید کے ایام کو مقرر کرنے کی حکمت",
    "volume": 2,
    "page": 222
  },
  {
    "topic": "یومِ عید کے مستحبات",
    "volume": 2,
    "page": 223
  },
  {
    "topic": "عیدگاہ جاتے وقت راستہ تبدیل کرنا",
    "volume": 2,
    "page": 223
  },
  {
    "topic": "ون وے ٹریفک کا نظریہ",
    "volume": 2,
    "page": 223
  },
  {
    "topic": "عید نہ منانا",
    "volume": 2,
    "page": 223
  },
  {
    "topic": "وراثت کا حکم",
    "volume": 9,
    "page": 255
  },
  {
    "topic": "ترکہ کا مسئلہ",
    "volume": 9,
    "page": 256
  },
  {
    "topic": "زندگی میں کچھ دے کر وراثت سے محروم نہیں کیا جاسکتا",
    "volume": 9,
    "page": 257
  },
  {
    "topic": "یتیم پوتے پوتیوں اور نواسے نواسیوں کی بابت قرآن کا ترغیب وترحم پر مبنی ارشاد",
    "volume": 9,
    "page": 260
  },
  {
    "topic": "وراثت سے محض دست برداری معتبر نہیں ہے",
    "volume": 9,
    "page": 263
  },
  {
    "topic": "ترکے کا مسئلہ",
    "volume": 9,
    "page": 267
  },
  {
    "topic": "ترکے کی تقسیم",
    "volume": 9,
    "page": 268
  },
  {
    "topic": "گمشدہ فرد کی موت کا حکم",
    "volume": 9,
    "page": 269
  },
  {
    "topic": "بہنوں کو حصے سے محروم کرنا ظلم ہے",
    "volume": 9,
    "page": 271
  },
  {
    "topic": "اولاد کے درمیان ہبہ میں مساوات",
    "volume": 2,
    "page": 295
  },
  {
    "topic": "وراثت کے متفرق مسائل",
    "volume": 2,
    "page": 296
  },
  {
    "topic": "ترکے کے مسائل",
    "volume": 2,
    "page": 300
  },
  {
    "topic": "میرے سوالات",
    "volume": 2,
    "page": 300
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 301
  },
  {
    "topic": "ورثہ کی تقسیم",
    "volume": 2,
    "page": 302
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 302
  },
  {
    "topic": "وارث کون ہیں؟",
    "volume": 2,
    "page": 303
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 303
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 304
  },
  {
    "topic": "ورثہ کی تقسیم",
    "volume": 2,
    "page": 304
  },
  {
    "topic": "عقدِ ثانی سے سابق شوہر کے ترکے میں بیوہ کا حقِ وراثت ساقط نہیں ہوتا",
    "volume": 2,
    "page": 306
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 307
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 308
  },
  {
    "topic": "فوت شدہ قرض خواہ کی رقم کو وارثوں کی مرضی کے بغیر ایصالِ ثواب میں لگانا",
    "volume": 2,
    "page": 309
  },
  {
    "topic": "فاتحہ کس کے مال سے دی جائے",
    "volume": 2,
    "page": 310
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 311
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 2,
    "page": 312
  },
  {
    "topic": "مسئلہ وصیت",
    "volume": 2,
    "page": 313
  },
  {
    "topic": "مسئلہ امانت",
    "volume": 2,
    "page": 314
  },
  {
    "topic": "ادارے کے واجبات کی تقسیم",
    "volume": 12,
    "page": 314
  },
  {
    "topic": "میں (بیوہ) آپ سے مدد اور تعاون کی طلب گار",
    "volume": 2,
    "page": 315
  },
  {
    "topic": "اصحاب فرائض اور عصبات کی موجودگی میں ذَوی الارحام کو ترکے سے حصہ نہیں ملتا",
    "volume": 12,
    "page": 316
  },
  {
    "topic": "وراثت کے حق میں وصیت معتبر نہیں ہے",
    "volume": 12,
    "page": 317
  },
  {
    "topic": "باپ کے اولاد کے درمیان مساوات کا رویہ",
    "volume": 2,
    "page": 319
  },
  {
    "topic": "ترکے کا تعین",
    "volume": 12,
    "page": 319
  },
  {
    "topic": "وقف اراضی سے متعلق چند سوالات",
    "volume": 12,
    "page": 320
  },
  {
    "topic": "والدین کی نافرمانی کا وبال اور اولاد کو عاق کرنے کی شرعی حیثیت",
    "volume": 3,
    "page": 327
  },
  {
    "topic": "ترکے کی تقسیم",
    "volume": 12,
    "page": 329
  },
  {
    "topic": "ترکے کی تقسیم سے قبل دی جانے والی رقم کی شرعی حیثیت",
    "volume": 12,
    "page": 330
  },
  {
    "topic": "نواسی کے لیے وسیت",
    "volume": 12,
    "page": 331
  },
  {
    "topic": "خَنثیٰ مشکل کا وراثت میں حصہ",
    "volume": 12,
    "page": 334
  },
  {
    "topic": "مسئلہ وراثت وہبہ",
    "volume": 3,
    "page": 335
  },
  {
    "topic": "مسئلہ ہبہ",
    "volume": 3,
    "page": 336
  },
  {
    "topic": "مرحومہ بیوی کے ترکے کا مسئلہ",
    "volume": 3,
    "page": 337
  },
  {
    "topic": "ترکے کی تقسیم اور مشترکہ کاروبار کا شرعی حکم",
    "volume": 7,
    "page": 337
  },
  {
    "topic": "زندگی میں ہبہ ہوتا ہے ، وراثت نہیں",
    "volume": 12,
    "page": 337
  },
  {
    "topic": "تقسیمِ ترکہ (دو بیوی، تین بیٹے، تین بیٹیاں)",
    "volume": 3,
    "page": 338
  },
  {
    "topic": "ترکے کی تقسیم سے قبل زکوٰۃ کی ادائیگی",
    "volume": 12,
    "page": 338
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 3,
    "page": 339
  },
  {
    "topic": "باہمی رضامندی سے جائیداد کی تقسیم کے بعد مزید حصے کا مطالبہ درست نہیں",
    "volume": 7,
    "page": 339
  },
  {
    "topic": "ترکے میں شراکت کا ایک مسئلہ",
    "volume": 12,
    "page": 339
  },
  {
    "topic": "تقسیم وراثت کا مطالبہ کرنا",
    "volume": 3,
    "page": 340
  },
  {
    "topic": "مرضِ وفات میں جائداد میں تصرُّف",
    "volume": 12,
    "page": 340
  },
  {
    "topic": "ذوی الارحام میں ترکے کی تقسیم",
    "volume": 7,
    "page": 341
  },
  {
    "topic": "تہائی مال پر وصیت کا اطلاق",
    "volume": 12,
    "page": 341
  },
  {
    "topic": "بیوہ کی شادی سے اس کا حق وراثت باطل نہیں ہوتا",
    "volume": 3,
    "page": 342
  },
  {
    "topic": "دفتر کے واجبات میں ورثاء کا حق",
    "volume": 3,
    "page": 342
  },
  {
    "topic": "کسی کی زمین یا مکان پر ظلماً قبضے کی سزا",
    "volume": 7,
    "page": 342
  },
  {
    "topic": "تقسیم ترکہ یا ہبہ؟",
    "volume": 3,
    "page": 345
  },
  {
    "topic": "قاتل وارث نہیں بنتا",
    "volume": 7,
    "page": 345
  },
  {
    "topic": "اولاد کو ہبہ کرنا",
    "volume": 3,
    "page": 346
  },
  {
    "topic": "ترکے کی تقسیم میں تاخیر سے جائیداد کی قیمت فرق پر تاوان نہیں",
    "volume": 7,
    "page": 347
  },
  {
    "topic": "بچے کی تربیت کا حق",
    "volume": 7,
    "page": 348
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 3,
    "page": 349
  },
  {
    "topic": "تقسیمِ ترکہ اور زکوٰۃ کا حکم",
    "volume": 7,
    "page": 350
  },
  {
    "topic": "مناسخہ",
    "volume": 3,
    "page": 351
  },
  {
    "topic": "غیر مسلم ہونے کے شک کی بناء پر وراثت میں حصے کا حکم",
    "volume": 3,
    "page": 352
  },
  {
    "topic": "ترکے کا مسئلہ",
    "volume": 7,
    "page": 352
  },
  {
    "topic": "تقسیمِ ترکہ",
    "volume": 3,
    "page": 353
  },
  {
    "topic": "شادی کا خرچ ترکے سے منہا نہیں کیا جائے گا",
    "volume": 7,
    "page": 353
  },
  {
    "topic": "تقسیمِ ترکہ",
    "volume": 3,
    "page": 354
  },
  {
    "topic": "ترکہ میں نواسے اور نواسیوں کو حصہ ملے گا یا نہیں؟",
    "volume": 3,
    "page": 355
  },
  {
    "topic": "حادثات وسانحات میں وفات پانے والوں کی امدادی رقوم کی تقسیم",
    "volume": 7,
    "page": 355
  },
  {
    "topic": "تقسیم ترکہ",
    "volume": 3,
    "page": 356
  },
  {
    "topic": "ترکے کی تقسیم سے قبل مکان استعمال کرنے والے وارث سے دیگر ورثاء کا کرائے کا مطالبہ",
    "volume": 7,
    "page": 356
  },
  {
    "topic": "تقسیم ترکہ",
    "volume": 3,
    "page": 357
  },
  {
    "topic": "لے پالک بیٹی کا شرعاً کوئی حصہ نہیں",
    "volume": 3,
    "page": 357
  },
  {
    "topic": "ترکہ کی تقسیم",
    "volume": 4,
    "page": 357
  },
  {
    "topic": "تقسیم وراثت وہبہ",
    "volume": 3,
    "page": 358
  },
  {
    "topic": "وارث کے حق میں وصیت معتبر نہیں ہے",
    "volume": 7,
    "page": 358
  },
  {
    "topic": "تقسیم ترکہ (بیوہ، تین بیٹے، تین بیٹیاں)",
    "volume": 3,
    "page": 359
  },
  {
    "topic": "ترکے کا ایک مسئلہ",
    "volume": 11,
    "page": 359
  },
  {
    "topic": "اسلامی قانونِ وراثت اجباری ہے",
    "volume": 11,
    "page": 359
  },
  {
    "topic": "دادی اور پھوپھیاں محروم رہیں گی",
    "volume": 3,
    "page": 360
  },
  {
    "topic": "ایک یا دو اشخاص کا دیگر ورثاء کی موجودگی میں تمام جائیداد پر قابض ہوجانا",
    "volume": 4,
    "page": 360
  },
  {
    "topic": "وصیت میں زیادتی یا خلاف شرع بات کی اصلاح کی جا سکتی ہے",
    "volume": 11,
    "page": 360
  },
  {
    "topic": "تقسیمِ وراثت",
    "volume": 3,
    "page": 361
  },
  {
    "topic": "لا وصیۃ لوارث",
    "volume": 4,
    "page": 361
  },
  {
    "topic": "تقسیم ترکہ (بیوہ، چار بیٹے، ایک بیٹی)",
    "volume": 3,
    "page": 362
  },
  {
    "topic": "وراثت میں حق تلفی کا عذاب",
    "volume": 3,
    "page": 362
  },
  {
    "topic": "غیر شادی شدہ یا لا ولد بیٹے کا کل ترکہ باپ کو ملے گا",
    "volume": 7,
    "page": 362
  },
  {
    "topic": "تقسیم ترکہ وہبہ",
    "volume": 3,
    "page": 363
  },
  {
    "topic": "تقسیم ترکہ میں مقدم کون؟",
    "volume": 4,
    "page": 363
  },
  {
    "topic": "مشترکہ جائیداد کا شرعی حکم",
    "volume": 7,
    "page": 363
  },
  {
    "topic": "قاتل ،مقتول کا وارث نہیں ہو سکتا",
    "volume": 11,
    "page": 364
  },
  {
    "topic": "ترکے کا ایک مسئلہ",
    "volume": 11,
    "page": 364
  },
  {
    "topic": "ترکے کی تقسیم کا ایک مسئلہ",
    "volume": 7,
    "page": 365
  },
  {
    "topic": "مسئلہ ہبہ",
    "volume": 3,
    "page": 366
  },
  {
    "topic": "ذوی الارحام کا تقسیم ترکہ میں حصہ",
    "volume": 7,
    "page": 366
  },
  {
    "topic": "مسئلہ وراثت وہبہ",
    "volume": 3,
    "page": 367
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 3,
    "page": 367
  },
  {
    "topic": "تقسیم ترکہ اور برٹش لاء",
    "volume": 4,
    "page": 367
  },
  {
    "topic": "غیر منقسم ترکے میں شرکتِ ملک کی ایک صورت",
    "volume": 13,
    "page": 367
  },
  {
    "topic": "زندگی میں والد نے جو کچھ دیا ترکے سے منہا نہیں ہوگا",
    "volume": 3,
    "page": 368
  },
  {
    "topic": "دوسرے کی جائداد پر مسجد ومدرسہ کی تعمیر",
    "volume": 7,
    "page": 368
  },
  {
    "topic": "ہبہ اور ترکہ کی تقسیم",
    "volume": 11,
    "page": 368
  },
  {
    "topic": "مسلمان اور غیر مسلم کے درمیان وراثت",
    "volume": 3,
    "page": 369
  },
  {
    "topic": "لاولد چچا کے ترکے میں بھتیجے اور بھتیجیوں کا حقِ وراثت",
    "volume": 4,
    "page": 369
  },
  {
    "topic": "ذوی الفروض اور عصبات کی عدم موجودگی میں ذوی الارحام کو ترکہ ملے گا",
    "volume": 13,
    "page": 369
  },
  {
    "topic": "لاولد پھوپھی کے ترکے میں مقدم سگے یا سوتیلے بھتیجے",
    "volume": 4,
    "page": 370
  },
  {
    "topic": "تقسیم سے قبل ترکے میں یک طرفہ تصرف جائز نہیں ہے",
    "volume": 7,
    "page": 370
  },
  {
    "topic": "وارثت کا حصہ لینے کے بعد دوبارہ مطالعہ کرنا",
    "volume": 11,
    "page": 370
  },
  {
    "topic": "ترکے کی تقسیم سے قبل فوت ہونے والے وارث کا حصہ کسے ملے گا",
    "volume": 13,
    "page": 370
  },
  {
    "topic": "ترکے کی تقسیم",
    "volume": 7,
    "page": 371
  },
  {
    "topic": "ترکے کا ایک پیچیدہ مسئلہ",
    "volume": 8,
    "page": 371
  },
  {
    "topic": "ترکے سے محروم رکھنا ظلم ہے",
    "volume": 11,
    "page": 371
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 3,
    "page": 372
  },
  {
    "topic": "مسلمان اور غیر مسلم کے درمیان وراثت",
    "volume": 4,
    "page": 372
  },
  {
    "topic": "ٹریفک حادثہ کی دیت",
    "volume": 7,
    "page": 372
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 3,
    "page": 373
  },
  {
    "topic": "وارث کے حق میں وصیت معتبر نہیں",
    "volume": 3,
    "page": 373
  },
  {
    "topic": "مُورِث کی وفات سے پہلے فوت شدہ وارث نہیں بنتا",
    "volume": 11,
    "page": 373
  },
  {
    "topic": "زوجین پر ترکہ رَد کرنے کا شرعی حکم",
    "volume": 13,
    "page": 373
  },
  {
    "topic": "تقسیم وراثت سے متعلق چند اہم اصولی امور کی وضاحت",
    "volume": 4,
    "page": 374
  },
  {
    "topic": "تقسیمِ وراثت",
    "volume": 3,
    "page": 375
  },
  {
    "topic": "بالغ ورثاء صرف اپنے حصے کی دیت معاف کرسکتے ہیں",
    "volume": 7,
    "page": 375
  },
  {
    "topic": "ترکے کا ایک مسئلہ",
    "volume": 11,
    "page": 375
  },
  {
    "topic": "بیٹے کا باپ سے تقسیم وراثت کا مطالبہ",
    "volume": 3,
    "page": 376
  },
  {
    "topic": "شوہر اور بیوی کی مشترکہ کمائی سے بنائی ہوئی جائیداد اور تقسیمِ ترکہ",
    "volume": 4,
    "page": 376
  },
  {
    "topic": "مسئلہ وراثت",
    "volume": 3,
    "page": 377
  },
  {
    "topic": "بیوی کا واجب الادا قرضہ کس کے ذمے ہوگا؟",
    "volume": 4,
    "page": 377
  },
  {
    "topic": "زندگی میں وراثت تقسیم نہیں ہوتی",
    "volume": 4,
    "page": 379
  },
  {
    "topic": "کیا سوتیلا بیٹا اکیلا وارث بن سکتا ہے",
    "volume": 4,
    "page": 379
  },
  {
    "topic": "ترکے کی تقسیم موجودہ قیمت کے مطابق",
    "volume": 4,
    "page": 380
  },
  {
    "topic": "غیرِ وارث کو ترکے سے حصہ",
    "volume": 4,
    "page": 381
  },
  {
    "topic": "فوت شدہ ملازم کی پنشن اور جی پی فنڈ کا استحقاق",
    "volume": 8,
    "page": 381
  },
  {
    "topic": "دیت قصاص نہیں بلکہ خون بہا ہے",
    "volume": 8,
    "page": 382
  },
  {
    "topic": "تقسیمِ ترکہ",
    "volume": 4,
    "page": 383
  },
  {
    "topic": "Inheritance",
    "volume": 4,
    "page": 384
  },
  {
    "topic": "تقسیم ترکہ اور حق ملکیت کے درمیان فرق",
    "volume": 8,
    "page": 384
  },
  {
    "topic": "ترکے میں سوتیلی اولاد کا حصہ نہیں",
    "volume": 4,
    "page": 385
  },
  {
    "topic": "پنشن ترکے میں شامل نہیں",
    "volume": 4,
    "page": 386
  },
  {
    "topic": "مرحوم کے بہن بھائی محروم رہیں گے",
    "volume": 4,
    "page": 388
  },
  {
    "topic": "زندگی میں مال کی تقسیم کا حکم",
    "volume": 8,
    "page": 388
  },
  {
    "topic": "امدادی رقم اور بیمہ پالیسی بطور ترکہ تقسیم ہونے کا ایک مسئلہ",
    "volume": 8,
    "page": 390
  },
  {
    "topic": "بیٹی کو باپ کے ترکے سے محروم نہیں کیا جاسکتا",
    "volume": 8,
    "page": 391
  },
  {
    "topic": "مرض الموت میں وصیت معتبر نہیں اور جو ہوش وحواس میں نہ ہو اس کے مال پر تصرف جائز نہیں",
    "volume": 8,
    "page": 392
  },
  {
    "topic": "ترکے کی تقسیم میں تاخیر کا شرعی حکم",
    "volume": 8,
    "page": 394
  },
  {
    "topic": "بیٹی کو باپ کی وراثت سے محروم کرنا غصب اور ظلم ہے",
    "volume": 8,
    "page": 396
  },
  {
    "topic": "ترکے کے کاروبار میں سب ورثاء کا حق ہے",
    "volume": 8,
    "page": 397
  },
  {
    "topic": "ترکے کا ایک مسئلہ",
    "volume": 8,
    "page": 400
  },
  {
    "topic": "مسلمان اور کافر ایک دوسرے کے وارث نہیں بن سکتے",
    "volume": 8,
    "page": 401
  },
  {
    "topic": "تقسیم ترکہ کا ایک مسئلہ",
    "volume": 14,
    "page": 402
  },
  {
    "topic": "حقِ وراثت محض دست برداری سے ثابت نہیں ہوتا",
    "volume": 14,
    "page": 403
  },
  {
    "topic": "منفعت تقسیم نہیں ہوتی",
    "volume": 8,
    "page": 404
  },
  {
    "topic": "یتیم پوتے کو دادا کا ہبہ",
    "volume": 14,
    "page": 404
  },
  {
    "topic": "دست برداری کی کوئی شرعی حیثیت نہیں",
    "volume": 8,
    "page": 405
  },
  {
    "topic": "بیٹے کے مال میں باپ کے تصرُّف کا دائرۂ اختیار",
    "volume": 14,
    "page": 406
  },
  {
    "topic": "مُتوفٰی شخص کو ملنے والے سرکاری واجبات میں ورثاء کے حصص کا تعین",
    "volume": 14,
    "page": 412
  },
  {
    "topic": "مخلوط مال کی صورت میں ترکے کی تقسیم",
    "volume": 6,
    "page": 414
  },
  {
    "topic": "جھوٹی گواہی کے ذریعے بنہن کو ترکے سے محروم کرنے کا شرعی حکم",
    "volume": 14,
    "page": 414
  },
  {
    "topic": "زندگی میں وراثت تقسیم نہیں ہوتی",
    "volume": 6,
    "page": 416
  },
  {
    "topic": "حج فارم میں نامزد شخص کی حیثیت",
    "volume": 6,
    "page": 417
  },
  {
    "topic": "اولاد کو ہبہ اور وصیت کا حکم",
    "volume": 14,
    "page": 417
  },
  {
    "topic": "مقروض پر لازم ہے کہ قرض خواہ کے وارثوں کو قرض ادا کرے",
    "volume": 6,
    "page": 418
  },
  {
    "topic": "نافرمان اولاد کو جائداد سے محروم کرنا",
    "volume": 14,
    "page": 418
  },
  {
    "topic": "شوہر کی وفات کے وقت جو عورت نکاح میں ہے، وارث بنے گی",
    "volume": 5,
    "page": 419
  },
  {
    "topic": "تقسیم ترکہ",
    "volume": 6,
    "page": 420
  },
  {
    "topic": "اولاد کو وصیت کا حکم",
    "volume": 14,
    "page": 420
  },
  {
    "topic": "تقسیم سے پہلے ترکے میں تصرُّف",
    "volume": 14,
    "page": 420
  },
  {
    "topic": "مسلمان اور غیر مسلم میں باہمی وراثت کا مسئلہ",
    "volume": 5,
    "page": 421
  },
  {
    "topic": "عقد ثانی کی صورت میں بیوہ کا حصہ متاثر نہیں ہوتا",
    "volume": 6,
    "page": 421
  },
  {
    "topic": "زندگی میں کسی کو حصہ دے کر وراثت سے دستبردار کرنا",
    "volume": 6,
    "page": 422
  },
  {
    "topic": "مُورِث کی وفات کے بعد جو زندہ ہوں، وہی وارث بنتے ہیں",
    "volume": 14,
    "page": 422
  },
  {
    "topic": "ترکے کی تقسیم اور صدقہ جاریہ",
    "volume": 5,
    "page": 424
  },
  {
    "topic": "بہنوں کی شادی پر جو خرچ کیا ، وہ بطور فضل واحسان ہے",
    "volume": 14,
    "page": 424
  },
  {
    "topic": "مورث کی وفات کے وقت جو حیات ہوں وہی حصہ پائیں گے",
    "volume": 14,
    "page": 425
  },
  {
    "topic": "سرکاری ملازم کی بیوہ بچوں کا عطیہ اور ورثاء کا استحقاق",
    "volume": 5,
    "page": 426
  },
  {
    "topic": "ترکہ کسے ملے گا؟",
    "volume": 6,
    "page": 426
  },
  {
    "topic": "ترکے کے چند مسائل",
    "volume": 14,
    "page": 426
  },
  {
    "topic": "تقسیمِ ترکہ",
    "volume": 6,
    "page": 427
  },
  {
    "topic": "پینشن ترکہ نہیں",
    "volume": 6,
    "page": 428
  },
  {
    "topic": "بیوی کو کوئی شئے ہبہ کرنے کے بعد رجوع کا حق حاصل نہیں",
    "volume": 6,
    "page": 429
  },
  {
    "topic": "کسی مصلحت کے تحت بیٹوں کے نام لگائی ہوئی جائداد والد ہی کی شمار ہوگی",
    "volume": 14,
    "page": 429
  },
  {
    "topic": "ذوی الفروض، عصبات اور ذوی الارحام کے درمیان تقسیمِ ترکہ میں ترتیب",
    "volume": 5,
    "page": 430
  },
  {
    "topic": "گاہک ترکے میں تقسیم نہیں ہوتے",
    "volume": 14,
    "page": 430
  },
  {
    "topic": "قرابت داروں کو ہبہ کر کے رجوع نہیں کیا جاسکتا",
    "volume": 6,
    "page": 431
  },
  {
    "topic": "ہبہ میں ملی ہوئی جائیداد پر مالکانہ تصرف کا حق",
    "volume": 5,
    "page": 432
  },
  {
    "topic": "یہ آپ کے والد کا ترکہ نہیں ہے",
    "volume": 14,
    "page": 432
  },
  {
    "topic": "وصیت کی تعریف اور اس کی مقدار، مُوصی کی زندگی میں وصیت نافذ نہیں ہوتی",
    "volume": 5,
    "page": 433
  },
  {
    "topic": "والدہ کے ورثاء میں کون شامل ہیں",
    "volume": 6,
    "page": 433
  },
  {
    "topic": "ترکے کی تقسیم جلد ہونی چاہیے",
    "volume": 14,
    "page": 433
  },
  {
    "topic": "قتلِ عمد میں صلح کا اختیار",
    "volume": 14,
    "page": 433
  },
  {
    "topic": "تقسیم کا ایک پیچیدہ مسئلہ",
    "volume": 6,
    "page": 434
  },
  {
    "topic": "زندگی میں وصیت سے رجوع کا حق ہے",
    "volume": 5,
    "page": 435
  },
  {
    "topic": "غیر مملوکہ چیز کی وصیت",
    "volume": 5,
    "page": 436
  },
  {
    "topic": "جائیداد کے مختلف حصوں میں ترکے کا تعین",
    "volume": 6,
    "page": 436
  },
  {
    "topic": "اولاد نہ ہونے کی صورت میں بیوی کے ترکے سے شوہر کو نصف حصہ ملے گا",
    "volume": 5,
    "page": 437
  },
  {
    "topic": "ہبہ محض زبانی کہہ دینے سے مکمل نہیں ہوتا",
    "volume": 6,
    "page": 438
  },
  {
    "topic": "عینی اور اخیافی بہن بھائی کے درمیان ترکے کی تقسیم",
    "volume": 5,
    "page": 439
  },
  {
    "topic": "بیوی کا ترکہ کیسے تقسیم ہوگا",
    "volume": 6,
    "page": 439
  },
  {
    "topic": "مالی معاملات میں ابہام نہیں ہونا چاہیے",
    "volume": 5,
    "page": 440
  },
  {
    "topic": "ذوی الارحام کس صورت میں وارث بنتے ہیں",
    "volume": 6,
    "page": 440
  },
  {
    "topic": "ترکے سے ضرورت کے وقت لی گئی رقم کی تقسیم",
    "volume": 5,
    "page": 442
  },
  {
    "topic": "ملازمت کے سرکاری قوانین اور ترکے کا حکم",
    "volume": 6,
    "page": 442
  },
  {
    "topic": "بیوی کے پہلے شوہر سے اولاد دوسرے خاوند کی وارث نہیں بنتی",
    "volume": 5,
    "page": 443
  },
  {
    "topic": "حقیقی بھائی کی موجودگی میں علاتی بھائی ساقط ہوجاتے ہیں",
    "volume": 5,
    "page": 443
  },
  {
    "topic": "بیٹے کے گھر میں باپ کی رہائش کا حق",
    "volume": 6,
    "page": 443
  },
  {
    "topic": "ورثاء سے کرائے کا مطالبہ",
    "volume": 10,
    "page": 467
  },
  {
    "topic": "ترکے میں پوتوں کے حصے کی شرعی حیثیت",
    "volume": 10,
    "page": 468
  },
  {
    "topic": "ہبہ کے شرعی اصول",
    "volume": 10,
    "page": 469
  },
  {
    "topic": "سیونگ سرٹیفکیٹس میں نامزد کی حیثیت",
    "volume": 10,
    "page": 473
  },
  {
    "topic": "والدہ کی اولاد کے حق میں وصیت",
    "volume": 10,
    "page": 475
  },
  {
    "topic": "مطلقہ عورت وارث نہیں بنتی",
    "volume": 10,
    "page": 476
  },
  {
    "topic": "اپنی زندگی میں وصیت سے رجوع کرنے کا حکم",
    "volume": 10,
    "page": 478
  },
  {
    "topic": "ہبہ کا ایک مسئلہ",
    "volume": 10,
    "page": 479
  },
  {
    "topic": "زندگی میں صرف ایک بیٹے کو ہبہ کرنا اور دوسروں کو محروم رکھنا",
    "volume": 10,
    "page": 480
  },
  {
    "topic": "ترکے کا ایک مسئلہ",
    "volume": 10,
    "page": 487
  },
  {
    "topic": "ترکے کا مسئلہ",
    "volume": 10,
    "page": 487
  },
  {
    "topic": "وراثت کا مسئلہ",
    "volume": 10,
    "page": 488
  },
  {
    "topic": "اولاد کی موجودگی میں دادا کی وراثت میں پوتوں کا حق نہیں",
    "volume": 10,
    "page": 489
  },
  {
    "topic": "حج کا بیان",
    "volume": 3,
    "page": 167
  },
  {
    "topic": "استطاعت",
    "volume": 3,
    "page": 167
  },
  {
    "topic": "عمرہ ادا کرنے سے حج فرض نہیں ہوتا",
    "volume": 3,
    "page": 169
  },
  {
    "topic": "خواتین کا محرم کے بغیر حج",
    "volume": 3,
    "page": 170
  },
  {
    "topic": "روانگیٔ حج سے پہلے اگر ماہواری کا خون آجائے تو کیا کرنا چاہیے",
    "volume": 3,
    "page": 172
  },
  {
    "topic": "عمرہ ادا کرنے سے حج فرض نہیں ہوتا، بھائی کو نفلی عمرہ کرانا جائز ہے، بھائی سے قطع تعلق کرنا",
    "volume": 3,
    "page": 172
  },
  {
    "topic": "خواتین کے لیے حج وعمرے کی شرائط",
    "volume": 3,
    "page": 175
  },
  {
    "topic": "عمرے کے متعلق چند سوالات",
    "volume": 7,
    "page": 175
  },
  {
    "topic": "مقروض کا عمرہ کرنا",
    "volume": 7,
    "page": 176
  },
  {
    "topic": "والد کا حج بدل پہلے یا اپنا فریضۂ حج",
    "volume": 3,
    "page": 177
  },
  {
    "topic": "عورت کا شوہر کے بغیر عمرے پر جانا",
    "volume": 7,
    "page": 177
  },
  {
    "topic": "اپنے ناراض رشتے داروں سے صلح کرنا افضل ہے",
    "volume": 7,
    "page": 177
  },
  {
    "topic": "عمرے کی شرعی حیثیت",
    "volume": 7,
    "page": 179
  },
  {
    "topic": "فریضۂ حج سے بریٔ الذمہ ہونے کے لیے حج بدل کے شرائط",
    "volume": 3,
    "page": 182
  },
  {
    "topic": "رسول اللہ ﷺ کے عمروں کی تعداد",
    "volume": 7,
    "page": 182
  },
  {
    "topic": "حج اور عید الاضحی کا باہم تعلق",
    "volume": 7,
    "page": 184
  },
  {
    "topic": "عمرے کا طریقہ",
    "volume": 9,
    "page": 184
  },
  {
    "topic": "مخصوص ایام میں احرام باندھنے کا شرعی حکم",
    "volume": 9,
    "page": 186
  },
  {
    "topic": "عمرہ کے بعد حج کی فرضیت کا حکم",
    "volume": 9,
    "page": 187
  },
  {
    "topic": "مخصوص ایام میں احرام باندھنے کا شرعی حکم",
    "volume": 7,
    "page": 188
  },
  {
    "topic": "فلسفہ وروح حج",
    "volume": 4,
    "page": 189
  },
  {
    "topic": "جعلی میڈیکل سرٹیفکیٹ پر حج وعمرہ کرنا",
    "volume": 7,
    "page": 189
  },
  {
    "topic": "رمیِ جمرات کا مسئلہ",
    "volume": 7,
    "page": 191
  },
  {
    "topic": "ایک عمرہ کے بعد دوسرا عمرہ کرنے کی صورت میں حلق کا مسئلہ",
    "volume": 8,
    "page": 191
  },
  {
    "topic": "حج وعمرہ گروپ کا زائد رقم وصول کرنا",
    "volume": 8,
    "page": 192
  },
  {
    "topic": "کنکریوں کی تعداد",
    "volume": 7,
    "page": 193
  },
  {
    "topic": "سعی کے درمیان کمزوری کی بنا پر توقف جائز ہے",
    "volume": 8,
    "page": 193
  },
  {
    "topic": "قرعہ اندازی اسکیم پر حج",
    "volume": 4,
    "page": 194
  },
  {
    "topic": "مرد وعورت کے احرام میں فرق",
    "volume": 7,
    "page": 194
  },
  {
    "topic": "معتمر کا حلق یا قصر کرائے بغیر حدودِ حرم سے نکل جانے کا حکم",
    "volume": 8,
    "page": 194
  },
  {
    "topic": "طوافِ وداع کی شرعی حیثیت",
    "volume": 7,
    "page": 195
  },
  {
    "topic": "اسقاطِ فرض کے لیے حجِ بدل سے متعلق ایک اہم مسئلہ",
    "volume": 4,
    "page": 196
  },
  {
    "topic": "طوافِ زیارت اور طوافِ وداع الگ الگ ہیں",
    "volume": 7,
    "page": 196
  },
  {
    "topic": "حج کا حکم",
    "volume": 8,
    "page": 196
  },
  {
    "topic": "حجِ قران میں جنایت پر صورتِ مسئلہ کے مطابق ایک دم یا ایک صدقہ لازم آئے گا یا دو دو",
    "volume": 4,
    "page": 197
  },
  {
    "topic": "حج کی قربانی کے دن",
    "volume": 7,
    "page": 197
  },
  {
    "topic": "ایک سے زائد عمرے کرنے پر حلق کا مسئلہ",
    "volume": 7,
    "page": 198
  },
  {
    "topic": "دم کی ادائیگی حدودِ حرم میں",
    "volume": 4,
    "page": 199
  },
  {
    "topic": "لباسِ احرام کا سائز",
    "volume": 7,
    "page": 199
  },
  {
    "topic": "احرام کی حالت میں دانت سے خون آنا یا بواسیر کا خون اور اس کا حکم",
    "volume": 4,
    "page": 200
  },
  {
    "topic": "دورانِ حج ناپاکی",
    "volume": 4,
    "page": 202
  },
  {
    "topic": "حج وعمرہ کے مسائل",
    "volume": 4,
    "page": 203
  },
  {
    "topic": "فرض کی ادائیگی مقدم ہے",
    "volume": 10,
    "page": 203
  },
  {
    "topic": "فرض حج کی ادائیگی کی ایک صورت",
    "volume": 10,
    "page": 206
  },
  {
    "topic": "قرض لے کر والد کو عمرہ کرانا",
    "volume": 10,
    "page": 207
  },
  {
    "topic": "حج فرض ادا نہ کیا تو کیا حکم ہے",
    "volume": 1,
    "page": 223
  },
  {
    "topic": "غیر شادی شدہ بالغ بیٹی گھر پر بیٹھی ہو اور حج پر جانا",
    "volume": 1,
    "page": 223
  },
  {
    "topic": "عورت ،احرام اور ایام",
    "volume": 1,
    "page": 224
  },
  {
    "topic": "عورتوں کا بغیر محرم کے سفر حج",
    "volume": 1,
    "page": 224
  },
  {
    "topic": "دورانِ حج عورتوں کو ایام مخصوصہ شروع ہوجانا",
    "volume": 1,
    "page": 225
  },
  {
    "topic": "دورانِ حج ایام مخصوصہ",
    "volume": 1,
    "page": 226
  },
  {
    "topic": "عمرہ، حج میں مانع حیض دوائیوں کا استعمال",
    "volume": 1,
    "page": 227
  },
  {
    "topic": "قرض لے کر حج کرنا",
    "volume": 2,
    "page": 227
  },
  {
    "topic": "حج بدل کے لیے کسے بھیجا جائے",
    "volume": 1,
    "page": 228
  },
  {
    "topic": "حج بدل کا شرعی حکم",
    "volume": 1,
    "page": 228
  },
  {
    "topic": "حج بدل کی وصیت پوری کرنا",
    "volume": 1,
    "page": 228
  },
  {
    "topic": "عمرے کی ادائیگی کے لیے محرم",
    "volume": 4,
    "page": 228
  },
  {
    "topic": "مرحومین کا حج بدل",
    "volume": 1,
    "page": 229
  },
  {
    "topic": "قرعہ اندازی کے ذریعے حج پر بھیجنا",
    "volume": 2,
    "page": 229
  },
  {
    "topic": "ایامِ حج میں اگر عورت کے مخصوص ایام شروع ہوجائیں",
    "volume": 2,
    "page": 229
  },
  {
    "topic": "حج سے تمام گناہوں کا معاف ہوجانا",
    "volume": 4,
    "page": 229
  },
  {
    "topic": "احرام باندھتے وقت عورت اگر حالتِ حیض میں ہو تو کیا کرے",
    "volume": 2,
    "page": 230
  },
  {
    "topic": "پانچ سال کے بچے کو عمرے پر لے جانا",
    "volume": 2,
    "page": 230
  },
  {
    "topic": "دورانِ حج شوہر کا انتقال ہوجائے تو عورت کیا کرے",
    "volume": 1,
    "page": 231
  },
  {
    "topic": "آخری عشرے میں عمرے کی ادائیگی اور ابتدائے شوال میں واپسی",
    "volume": 2,
    "page": 231
  },
  {
    "topic": "عمرے کا احرام باندھا ہوا ہے فلائٹ پر سیٹ نہیں ملی",
    "volume": 2,
    "page": 231
  },
  {
    "topic": "شوال اور ذوالقعدہ کے ابتدائی دنوں میںعمرے کی ادائیگی",
    "volume": 6,
    "page": 235
  },
  {
    "topic": "اجنبی عورت کا محرم بن کر عمرہ کرنا",
    "volume": 6,
    "page": 240
  },
  {
    "topic": "عمرے کا طریقہ",
    "volume": 6,
    "page": 243
  },
  {
    "topic": "رمضان میں عمرے کے بعد شوال تک قیام اور حج کی فرضیت",
    "volume": 6,
    "page": 245
  },
  {
    "topic": "گیارہ اور بارہ ذی الحج کی رمی کا وقت",
    "volume": 12,
    "page": 263
  },
  {
    "topic": "منی عرفہ و مزدلفہ میں نمازِ قصر کا مسئلہ",
    "volume": 12,
    "page": 268
  },
  {
    "topic": "نابینا شخص پر بذاتِ خود حج کرنا فرض نہیں ہے، اسے حجِ بدل کرانا ہوگا",
    "volume": 5,
    "page": 277
  },
  {
    "topic": "قرض پر عمرہ کی ادائیگی",
    "volume": 5,
    "page": 279
  },
  {
    "topic": "دورانِ حج حلق یا قصر کا حکم",
    "volume": 5,
    "page": 280
  },
  {
    "topic": "محرم کے بغیر ارکانِ حج کی ادائیگی",
    "volume": 5,
    "page": 281
  },
  {
    "topic": "حاجی پر قربانی کا واجب ہونا",
    "volume": 5,
    "page": 284
  },
  {
    "topic": "طوافِ زیارت کے وقت طواف وداع کی نیت کرنے سے طواف زیارت ہی ہوگا",
    "volume": 13,
    "page": 285
  },
  {
    "topic": "جنایت پر دم ساقط ہونے کی ایک صورت",
    "volume": 13,
    "page": 287
  },
  {
    "topic": "سودی معاہد حرام ہے ، فریضۂ حج ادا ہوجائے گا",
    "volume": 14,
    "page": 302
  },
  {
    "topic": "مکہ مکرمہ کا مستقل باسی یا عارضی رہائشی عمرے کا احرام تنعیم سے باندھے",
    "volume": 11,
    "page": 303
  },
  {
    "topic": "حج لائسنس کی ملکیت کا شرعی حکم",
    "volume": 14,
    "page": 304
  },
  {
    "topic": "حج و عمرے کے حوالے سے خواتین کے مسائل",
    "volume": 11,
    "page": 305
  },
  {
    "topic": "عمرہ کرنے والی خاتون کا باجماعت نماز میں شامل ہونا",
    "volume": 14,
    "page": 306
  },
  {
    "topic": "حالتِ احرام میں بچے کو گود میں لینے کا حکم",
    "volume": 14,
    "page": 308
  },
  {
    "topic": "حج و عمرے کےلیے محرم کی شرط",
    "volume": 11,
    "page": 309
  },
  {
    "topic": "نیت کے بغیر میقات سے گزرنے کا حکم",
    "volume": 14,
    "page": 309
  },
  {
    "topic": "حج وعمرہ کے ٹکٹ",
    "volume": 11,
    "page": 310
  },
  {
    "topic": "حدود حرم کی نشاندہی",
    "volume": 14,
    "page": 312
  },
  {
    "topic": "وقوف عرفہ کے موقع پر عورت کو حیض آجانا",
    "volume": 11,
    "page": 316
  },
  {
    "topic": "پیدل حج کرنے کی منت ماننا",
    "volume": 11,
    "page": 318
  },
  {
    "topic": "مال حرام سے حج کی قبولیت کا حکم",
    "volume": 11,
    "page": 327
  },
  {
    "topic": "غیر مسلم معلمہ کے ذریعے اسلامیات کی تعلیم",
    "volume": 9,
    "page": 277
  },
  {
    "topic": "غیر مسلم ممالک سے درآمد شدہ کپڑوں کا حکم",
    "volume": 9,
    "page": 280
  },
  {
    "topic": "چھپکلی مارنے کا حکم",
    "volume": 9,
    "page": 281
  },
  {
    "topic": "ضرورت کے تحت جانوروں کا مارنا",
    "volume": 9,
    "page": 284
  },
  {
    "topic": "ڈی این اے ٹیسٹ کا حکم",
    "volume": 9,
    "page": 286
  },
  {
    "topic": "قتلِ عمد میں باہمی رضامندی سے مال پر صلح جائز ہے",
    "volume": 9,
    "page": 289
  },
  {
    "topic": "خنزیر کے بالوں کا ضرورت کے تحت استعمال",
    "volume": 9,
    "page": 291
  },
  {
    "topic": "عاقدین کی باہمی رضامندی سے بیع منعقد ہونے کے بعد کسی ایک فریق کو یک طرفہ طور پر فسخ کرنے کا اختیار نہیں ہے",
    "volume": 9,
    "page": 296
  },
  {
    "topic": "جادو حرام ہے",
    "volume": 9,
    "page": 298
  },
  {
    "topic": "استخارہ",
    "volume": 9,
    "page": 301
  },
  {
    "topic": "غیر صحابی کے نام کے ساتھ ’’رضی اللہ عنہ‘‘ کہنا یا لکھنا؟",
    "volume": 2,
    "page": 347
  },
  {
    "topic": "کیا ’’۷۸۶‘‘ لکھنا صحیح ہے",
    "volume": 2,
    "page": 349
  },
  {
    "topic": "مصنوعی طریقے سے شوہر کا تولیدی جرثومہ (Sperm) اپنی بیوی کے رحم میں پہنچانے کا جواز",
    "volume": 2,
    "page": 355
  },
  {
    "topic": "فاتحہ کا طریقہ",
    "volume": 2,
    "page": 358
  },
  {
    "topic": "امریکہ میں ایک مسلم مذبح کے متعلق مسائل",
    "volume": 2,
    "page": 358
  },
  {
    "topic": "منت کی چادریں اور تالے",
    "volume": 2,
    "page": 361
  },
  {
    "topic": "ربیع الاول میں چراغاں",
    "volume": 2,
    "page": 365
  },
  {
    "topic": "خون سے فاتحہ لکھنا",
    "volume": 2,
    "page": 366
  },
  {
    "topic": "بطور صدقہ ملی ہوئی چیز کو فروخت کرنے یا ہبہ کرنے کا حکم",
    "volume": 12,
    "page": 371
  },
  {
    "topic": "نذرانہ یا رشوت",
    "volume": 12,
    "page": 374
  },
  {
    "topic": "مالک کی اجازت کے بغیر دیگ سے کھانا نکالنا",
    "volume": 12,
    "page": 376
  },
  {
    "topic": "رجب کے کونڈے",
    "volume": 2,
    "page": 377
  },
  {
    "topic": "اجتماعی قرآن خوانی",
    "volume": 2,
    "page": 378
  },
  {
    "topic": "شوہر کی طرف نسبت کا شرعی حکم",
    "volume": 12,
    "page": 378
  },
  {
    "topic": "وظیفے کی تعریف",
    "volume": 1,
    "page": 379
  },
  {
    "topic": "بدشگونی کا شرعی حکم",
    "volume": 1,
    "page": 379
  },
  {
    "topic": "ہومیو پیتھک ادویات کی تیاری میں الکحل کے استعمال کا شرعی حکم",
    "volume": 7,
    "page": 379
  },
  {
    "topic": "قبر بیٹھ جائے تو کیا کریں؟",
    "volume": 2,
    "page": 380
  },
  {
    "topic": "تعویذات کا شرعی حکم",
    "volume": 7,
    "page": 380
  },
  {
    "topic": "تیرہ تیزی کیا ہے؟",
    "volume": 1,
    "page": 381
  },
  {
    "topic": "حالت جنابت میں قرآن کی تلاوت",
    "volume": 3,
    "page": 381
  },
  {
    "topic": "آخری بدھ",
    "volume": 1,
    "page": 382
  },
  {
    "topic": "یوم عاشور اور کاروبار",
    "volume": 1,
    "page": 382
  },
  {
    "topic": "غیر آل ابوبکر صدیق کا اپنے نام کے ساتھ صدیقی لکھنا",
    "volume": 2,
    "page": 382
  },
  {
    "topic": "سورۃ الرحمٰن کی آیت کا جواب دینا",
    "volume": 3,
    "page": 382
  },
  {
    "topic": "نابالغ سے نکاح کے متعلق ایک سوال",
    "volume": 12,
    "page": 382
  },
  {
    "topic": "نظرِ بد سے بچنے کے لیے مکان پرسینگ، کالا کپڑا لٹکانا یا کالا دھاگا باندھنا",
    "volume": 1,
    "page": 383
  },
  {
    "topic": "جس کا کوئی پیر نہ ہو، کیا اس کا پیر شیطان ہوتا ہے؟",
    "volume": 2,
    "page": 383
  },
  {
    "topic": "مسجد میں تلاوتِ قرآن اور درس ووعظ میں لائوڈ اسپیکر کا استعمال",
    "volume": 3,
    "page": 383
  },
  {
    "topic": "نظر لگنے کا حکم",
    "volume": 1,
    "page": 385
  },
  {
    "topic": "ستاروں کی تاثیر",
    "volume": 1,
    "page": 385
  },
  {
    "topic": "سورج گرہن اور ستاروں کی تاثیر کی بابت اسلام کا نظریہ",
    "volume": 1,
    "page": 387
  },
  {
    "topic": "قرآن مجید کی تلاوت کے آداب",
    "volume": 2,
    "page": 387
  },
  {
    "topic": "مسجد کے ملبے کا استعمال",
    "volume": 3,
    "page": 387
  },
  {
    "topic": "قرآن مجید کی تلاوت کن مواقع اور مقامات پر منع ہے",
    "volume": 2,
    "page": 388
  },
  {
    "topic": "تلاوت ، اذکار وتسبیحات اور نعت کو تشہیر کے لیے استعمال کرنا استقبال کے لیے قیام کا مطالبہ یا خواہش کرنا",
    "volume": 12,
    "page": 388
  },
  {
    "topic": "مکروہ اوقات میں قرآن مجید کی تلاوت",
    "volume": 2,
    "page": 389
  },
  {
    "topic": "نوجوان لڑکوں کا گھٹنوں سے اوپر والی نیکر پہن کر گھومنا",
    "volume": 2,
    "page": 389
  },
  {
    "topic": "نومسلم بالغ کا ختنہ",
    "volume": 2,
    "page": 390
  },
  {
    "topic": "ماں باپ کی قدم بوسی",
    "volume": 2,
    "page": 390
  },
  {
    "topic": "مزارات پر حاضری",
    "volume": 3,
    "page": 390
  },
  {
    "topic": "صلوٰۃ کسوف",
    "volume": 1,
    "page": 391
  },
  {
    "topic": "اگر پیدائش کے موقع پر بچے کا عقیقہ نہ کیا جاسکا ہو تو بعد میں کیا جاسکتا ہے",
    "volume": 2,
    "page": 391
  },
  {
    "topic": "ستاروں کی تاثیر",
    "volume": 1,
    "page": 392
  },
  {
    "topic": "قتل خطا",
    "volume": 4,
    "page": 393
  },
  {
    "topic": "جانوروں کی افزائشِ نسل کا جدید طریقہ",
    "volume": 13,
    "page": 393
  },
  {
    "topic": "اوجھڑی حلال یا حرام",
    "volume": 1,
    "page": 394
  },
  {
    "topic": "فاتحہ کا مفہوم، طریقہ، مروّجہ فاتحہ کی شرعی حیثیت",
    "volume": 3,
    "page": 394
  },
  {
    "topic": "سرکاری زمینوں پر قبضے کا شرعی حکم",
    "volume": 13,
    "page": 394
  },
  {
    "topic": "پولٹری فارم کی مرغیوں کی خوراک",
    "volume": 1,
    "page": 395
  },
  {
    "topic": "قتل شبہ عمد",
    "volume": 4,
    "page": 395
  },
  {
    "topic": "مرد کے لیے زیور پہننا",
    "volume": 1,
    "page": 396
  },
  {
    "topic": "اعتراف جرم",
    "volume": 1,
    "page": 396
  },
  {
    "topic": "V.C.D کیا ہے اور کیا یہ دینی معلومات اور تبلیغ کے لیے استعمال کی جاسکتی ہے؟",
    "volume": 2,
    "page": 396
  },
  {
    "topic": "بالوں میں خضاب لگانا یارنگنا",
    "volume": 1,
    "page": 397
  },
  {
    "topic": "کمپنی کے منظور شدہ پٹرول میں خیانت",
    "volume": 7,
    "page": 397
  },
  {
    "topic": "ہبہ کی تکمیل کی چند صورتیں",
    "volume": 13,
    "page": 397
  },
  {
    "topic": "خودکشی حرام کیوں؟",
    "volume": 1,
    "page": 398
  },
  {
    "topic": "غیر مسلم کا چیف جسٹس یا قائم مقام بننا",
    "volume": 4,
    "page": 399
  },
  {
    "topic": "لباسِ شہرت کا حکم",
    "volume": 7,
    "page": 399
  },
  {
    "topic": "چوری شدہ مال",
    "volume": 1,
    "page": 400
  },
  {
    "topic": "حلال کمائی اور دوسرے لوگ",
    "volume": 1,
    "page": 401
  },
  {
    "topic": "تعویذ کی شرعی حیثیت",
    "volume": 1,
    "page": 401
  },
  {
    "topic": "نادہند سے اپنی واجب الادا رقم کی وصولی کا اختیار",
    "volume": 13,
    "page": 401
  },
  {
    "topic": "محافل میلاد کے بارے میں یہ کہنا کہ ’’اس میں حضور تشریف لائے ہوئے ہیں اور اس میں وحدہٗ لا شریک بھی شریک ہوتا ہے‘‘",
    "volume": 4,
    "page": 402
  },
  {
    "topic": "رات کے وقت ناخن کاٹنا",
    "volume": 1,
    "page": 403
  },
  {
    "topic": "’’اذان‘‘ کے نام سے فلم بنانا",
    "volume": 1,
    "page": 403
  },
  {
    "topic": "سود حرام ہے",
    "volume": 7,
    "page": 403
  },
  {
    "topic": "آنکھوں کی گناہ سے حفاظت",
    "volume": 1,
    "page": 404
  },
  {
    "topic": "حُرمتِ مصاہرت کا مسئلہ",
    "volume": 13,
    "page": 404
  },
  {
    "topic": "دوسروں کی چیزیں استعمال کرنا",
    "volume": 1,
    "page": 405
  },
  {
    "topic": "انسان کا گھر میں اور باہر الگ الگ رویہ",
    "volume": 1,
    "page": 405
  },
  {
    "topic": "شادی کی قسم کھانا",
    "volume": 3,
    "page": 405
  },
  {
    "topic": "اپنے نام کے ساتھ شامل لفظِ محمد پر درود کا اشارہ لکھنا",
    "volume": 7,
    "page": 405
  },
  {
    "topic": "دوسرے لوگوں کو تکلیف دینا",
    "volume": 1,
    "page": 406
  },
  {
    "topic": "بزرگان دین کے مزارات پر عقیدت",
    "volume": 1,
    "page": 406
  },
  {
    "topic": "بلاضرورت قسم کھانے کا حکم",
    "volume": 3,
    "page": 406
  },
  {
    "topic": "کھانے کے دوران سلام کرنا اور جواب دینا",
    "volume": 7,
    "page": 406
  },
  {
    "topic": "میت کے لیے ایصال ثواب کا اہتمام",
    "volume": 1,
    "page": 407
  },
  {
    "topic": "میت کو دوسری جگہ دفن کرنا",
    "volume": 1,
    "page": 407
  },
  {
    "topic": "عورت کا غیر محرم کے ساتھ مشترکہ خاندان میں رہنا",
    "volume": 3,
    "page": 407
  },
  {
    "topic": "مصنوعی جنسی آلات کا استعمال",
    "volume": 13,
    "page": 407
  },
  {
    "topic": "قرآن مجید سفر میں کیسے لے جائیں",
    "volume": 1,
    "page": 408
  },
  {
    "topic": "خاتون مبلغہ کا غیر شرعی طرزِ عمل",
    "volume": 4,
    "page": 408
  },
  {
    "topic": "کیا سینے میں دو دل ہوسکتے ہیں؟",
    "volume": 1,
    "page": 409
  },
  {
    "topic": "انبیائے کرام وصحابہ کرام کے کردار پر مبنی فلمیں وڈرامے",
    "volume": 7,
    "page": 409
  },
  {
    "topic": "ہندوستان سے مسلمان کی کمپنی کے درآمد شدہ حلال ذبیحہ کا حکم",
    "volume": 3,
    "page": 410
  },
  {
    "topic": "پینشن اور پراویڈنٹ فنڈ میں حکومت کی طرف سے اضافی رقم",
    "volume": 3,
    "page": 411
  },
  {
    "topic": "مختلف معاشرتی وگھریلو مسائل پر اسلام کے مدبرانہ ورہنما اصول",
    "volume": 8,
    "page": 411
  },
  {
    "topic": "سن بلوغت اور اس میں رونما ہونے والی تبدیلیاں",
    "volume": 8,
    "page": 411
  },
  {
    "topic": "شیخ محمد یوسف لدھیانوی سے کچھ مسائل میں اختلاف",
    "volume": 1,
    "page": 412
  },
  {
    "topic": "مسجد کے چندے پر حق الخدمت",
    "volume": 3,
    "page": 412
  },
  {
    "topic": "نامحرم عورت کو سلام کرنا",
    "volume": 7,
    "page": 412
  },
  {
    "topic": "طلبہ و طالبات کو ضابطے کی خلاف ورزی سے کیسے بچایا جائے",
    "volume": 13,
    "page": 412
  },
  {
    "topic": "والدین کی نصیحت",
    "volume": 1,
    "page": 413
  },
  {
    "topic": "خواتین /لڑکیوں کے ساتھ جنسی اور معاشرتی تشدد",
    "volume": 8,
    "page": 413
  },
  {
    "topic": "کارخانوں اور دفاتر میں نماز جمعہ",
    "volume": 1,
    "page": 414
  },
  {
    "topic": "ڈبے سمیت مٹھائی کی خرید وفروخت",
    "volume": 7,
    "page": 414
  },
  {
    "topic": "نادرا کی صنف کی شناخت پر مبنی مردم شماری (Gender)",
    "volume": 13,
    "page": 414
  },
  {
    "topic": "مرد پر ریشم کا لباس حرام ہے",
    "volume": 4,
    "page": 415
  },
  {
    "topic": "ٹی وی، وڈیو کا مسئلہ",
    "volume": 1,
    "page": 417
  },
  {
    "topic": "مالک کو بتائے بغیر بھی حقوق ادا کرنے سے انسان بری الذمہ ہوجاتا ہے",
    "volume": 4,
    "page": 417
  },
  {
    "topic": "ٹریول ایجنٹ سے پاسپورٹ گم ہونے کی ذمے داری اور اس کا حکم",
    "volume": 7,
    "page": 417
  },
  {
    "topic": "ملتانی مٹی کھانے کا شرعی حکم",
    "volume": 13,
    "page": 418
  },
  {
    "topic": "اختلاف امت اور صراطِ مستقیم",
    "volume": 1,
    "page": 419
  },
  {
    "topic": "سود کی حرمت کا حکم",
    "volume": 7,
    "page": 419
  },
  {
    "topic": "جذباتی عوامل",
    "volume": 8,
    "page": 419
  },
  {
    "topic": "شبیہ بیت اللہ کا طواف",
    "volume": 1,
    "page": 420
  },
  {
    "topic": "قبروں پر منتیں اور چڑھاوے",
    "volume": 1,
    "page": 420
  },
  {
    "topic": "گانے باجے کی محافل کی شرعی حکم",
    "volume": 7,
    "page": 421
  },
  {
    "topic": "ترجمہ میں علمی خیانت",
    "volume": 1,
    "page": 422
  },
  {
    "topic": "شرعاً قسم منعقد نہیں ہوئی",
    "volume": 4,
    "page": 422
  },
  {
    "topic": "لڑکے اور لڑکی کا ہم عمر دوست/سہیلی کے ساتھ میل جول",
    "volume": 8,
    "page": 422
  },
  {
    "topic": "پرائز بانڈز اور شیئرز کا شرعی حکم",
    "volume": 4,
    "page": 423
  },
  {
    "topic": "خاندانی منصوبہ بندی",
    "volume": 8,
    "page": 423
  },
  {
    "topic": "ٹریفک سگنل توڑنے کا شرعی حکم",
    "volume": 4,
    "page": 424
  },
  {
    "topic": "صفات باری تعالیٰ کا مظہر بننے کا مفہوم",
    "volume": 1,
    "page": 425
  },
  {
    "topic": "کامرس یا اکائونٹنگ کی تعلیم میں سودی اندراج",
    "volume": 4,
    "page": 425
  },
  {
    "topic": "بجلی کی چوری",
    "volume": 4,
    "page": 425
  },
  {
    "topic": "جنسی اور تولیدی نظام",
    "volume": 8,
    "page": 426
  },
  {
    "topic": "انجکشن کے ذریعے جانوروں کی افزائش نسل کا جواز",
    "volume": 4,
    "page": 428
  },
  {
    "topic": "روحانی علاج کی شرعی حیثیت",
    "volume": 4,
    "page": 428
  },
  {
    "topic": "جنسی تعلق سے پیدا ہونے والی بیماریاں",
    "volume": 8,
    "page": 428
  },
  {
    "topic": "لڑکے اور لڑکی یا عورت ومرد کے درمیان حسنِ معاشرت",
    "volume": 8,
    "page": 431
  },
  {
    "topic": "قادیانیوں کے ساتھ کاروباری معاملات",
    "volume": 8,
    "page": 435
  },
  {
    "topic": "رشوت دینے اور لینے کا حکم",
    "volume": 8,
    "page": 436
  },
  {
    "topic": "ویلن ٹائن ڈے یا دیگر غیر اسلامی تہوار",
    "volume": 8,
    "page": 442
  },
  {
    "topic": "قرآنی آیات پر مشتمل تعویذ کا حکم",
    "volume": 5,
    "page": 447
  },
  {
    "topic": "سوشل بائیکاٹ اور نمازِ جنازہ سے روکنے کا حکم",
    "volume": 8,
    "page": 447
  },
  {
    "topic": "تعویذ پر قرآن عظیم ومصحف کریم کا قیاس نہیں ہوسکتا",
    "volume": 5,
    "page": 448
  },
  {
    "topic": "برقی مچھر مار آلے کا استعمال",
    "volume": 6,
    "page": 449
  },
  {
    "topic": "لائوڈ اسپیکر کی آواز بلا ضرورت بلند کرنا",
    "volume": 5,
    "page": 450
  },
  {
    "topic": "قانون کو ہاتھ میں لینا",
    "volume": 6,
    "page": 451
  },
  {
    "topic": "عرس کی تقریبات میں محرمات، مکروہات اور بدعات کا ارتکاب",
    "volume": 5,
    "page": 453
  },
  {
    "topic": "موٹر سائیکل سوار کا اپنی غلطی سے موت سے دوچار ہونا",
    "volume": 6,
    "page": 453
  },
  {
    "topic": "گواہی کا معیار",
    "volume": 6,
    "page": 456
  },
  {
    "topic": "ایام عرس میں مزارات کو غسل دینے کے لیے دن مخصوص کرنے کا شرعی حکم",
    "volume": 5,
    "page": 457
  },
  {
    "topic": "راستے سے تکلیف دہ چیز ہٹانا",
    "volume": 6,
    "page": 457
  },
  {
    "topic": "خواتین کا علماء سے مسائل دریافت کرنا",
    "volume": 5,
    "page": 458
  },
  {
    "topic": "مسجد کی دیوار پر ٹی وی نصب کرنا",
    "volume": 11,
    "page": 459
  },
  {
    "topic": "مصنوعی بال لگوانا اور بال اگانا",
    "volume": 6,
    "page": 460
  },
  {
    "topic": "سرکاری مکان کا غیر قانونی استعمال",
    "volume": 11,
    "page": 460
  },
  {
    "topic": "مکان کے دروازوں اور پیشانی پر قرآنی آیات لکھنا",
    "volume": 5,
    "page": 461
  },
  {
    "topic": "ملازم کا خیانت کرنا اور ظلم میں معاون بننا",
    "volume": 11,
    "page": 461
  },
  {
    "topic": "زنا کا الزام",
    "volume": 6,
    "page": 462
  },
  {
    "topic": "درآمد کردہ کھاد کے استعمال کا جواز",
    "volume": 5,
    "page": 463
  },
  {
    "topic": "غیر مسلم کا مال ناجائز طریقے سے کھانا",
    "volume": 11,
    "page": 463
  },
  {
    "topic": "ذخیرہ اندوز کا شرعی حکم",
    "volume": 6,
    "page": 464
  },
  {
    "topic": "کسی کو کافر کہنے کا حکم",
    "volume": 5,
    "page": 465
  },
  {
    "topic": "نا بینا کارہنمائی کے لیے کتا رکھنا",
    "volume": 11,
    "page": 468
  },
  {
    "topic": "دوسروں کو کافر کہنے والے کا حکم",
    "volume": 5,
    "page": 471
  },
  {
    "topic": "جی۔ پی فنڈ میں اضافہ",
    "volume": 6,
    "page": 472
  },
  {
    "topic": "ڈرائیور کا پیٹرول میں خیانت کرنا",
    "volume": 5,
    "page": 473
  },
  {
    "topic": "فرائض ومستحبات سے روکنا",
    "volume": 6,
    "page": 473
  },
  {
    "topic": "بجلی کی چوری کا مسئلہ اور اس کا شرعی حکم",
    "volume": 5,
    "page": 475
  },
  {
    "topic": "ثالثی کا معیار",
    "volume": 11,
    "page": 475
  },
  {
    "topic": "مغرب میں دین پر چلنے میں مشکلات",
    "volume": 11,
    "page": 478
  },
  {
    "topic": "نا مکمل ہبہ کا شرعی حکم",
    "volume": 14,
    "page": 480
  },
  {
    "topic": "شارک مچھلی کا حکم",
    "volume": 14,
    "page": 481
  },
  {
    "topic": "فاریکس ٹریڈنگ /ڈیجٹل کرنسی کا شرعی حکم",
    "volume": 14,
    "page": 484
  },
  {
    "topic": "اسلامی چینل کھولنا",
    "volume": 11,
    "page": 485
  },
  {
    "topic": "ذبیحہ سے متعلق چند سوالات",
    "volume": 11,
    "page": 488
  },
  {
    "topic": "پرندوں کے لیے پانی اور باجرہ ڈالنا صدقہ ہے",
    "volume": 11,
    "page": 490
  },
  {
    "topic": "اذکار و اوراد کی محفل کا انعقاد",
    "volume": 11,
    "page": 492
  },
  {
    "topic": "مقدس اوراق کی حُرمت اور انہیں دوبارہ کار آمد بنانے کا جواز",
    "volume": 11,
    "page": 495
  },
  {
    "topic": "ٹریفک قوانین کی خلاف ورزی کا شرعی حکم",
    "volume": 11,
    "page": 498
  },
  {
    "topic": "لا علاج مریض کو تکلیف سے نجات دینے کے لیے موت کا انجیکشن لگانا جائز نہیں",
    "volume": 11,
    "page": 499
  },
  {
    "topic": "سوشل میڈیا کا استعمال",
    "volume": 11,
    "page": 504
  },
  {
    "topic": "خون کا عطیہ دینا",
    "volume": 11,
    "page": 505
  },
  {
    "topic": "جوتے پہن کر کھانا کھانے کا شرعی حکم",
    "volume": 11,
    "page": 510
  },
  {
    "topic": "والدین سے حسنِ سلوک",
    "volume": 11,
    "page": 512
  },
  {
    "topic": "مالِ حرام کی بابت چند سوالات",
    "volume": 11,
    "page": 513
  },
  {
    "topic": "جسم پر گدوانے کا شرعی حکم",
    "volume": 11,
    "page": 518
  },
  {
    "topic": "افسر اعلٰی کا قواعد کے خلاف ماتحت کو رعایت دینا",
    "volume": 11,
    "page": 521
  },
  {
    "topic": "غیر مسلم ملک میں اسٹور پر ملازمت کا حکم",
    "volume": 11,
    "page": 523
  },
  {
    "topic": "بچی کی پرورش کا حق",
    "volume": 8,
    "page": 293
  },
  {
    "topic": "حقِ پرورش کا مسئلہ",
    "volume": 8,
    "page": 295
  },
  {
    "topic": "حرمت کا رشتہ",
    "volume": 8,
    "page": 296
  },
  {
    "topic": "حقیقی والدین کے حقوق معطل نہیں ہوتے",
    "volume": 8,
    "page": 298
  },
  {
    "topic": "دورانِ عدت ملک سے باہر جانے کی اجازت؟",
    "volume": 3,
    "page": 309
  },
  {
    "topic": "عدت کے دوران بیوہ کو سسرال والے گھر سے نکالتے ہیں",
    "volume": 3,
    "page": 312
  },
  {
    "topic": "عدت",
    "volume": 4,
    "page": 345
  },
  {
    "topic": "کیا میں دورانِ عدت طلاق گھر سے باہر جاسکتی ہوں؟",
    "volume": 4,
    "page": 346
  },
  {
    "topic": "عدتِ وفات",
    "volume": 4,
    "page": 347
  },
  {
    "topic": "مدتِ وفات",
    "volume": 4,
    "page": 349
  },
  {
    "topic": "ازدواجی تعلقات نہ ہوں تب بھی عدت ضروری ہے",
    "volume": 4,
    "page": 351
  },
  {
    "topic": "دورانِ عدت جنازے میں شرکت",
    "volume": 4,
    "page": 352
  },
  {
    "topic": "بوجہ مرض حیض نہ آنے والی عورت کی عدت",
    "volume": 6,
    "page": 385
  },
  {
    "topic": "عدت کب سے ہوگی؟",
    "volume": 5,
    "page": 397
  },
  {
    "topic": "ناشزہ (نافرمان) عورت نفقہ کی حقدار نہیں",
    "volume": 5,
    "page": 397
  },
  {
    "topic": "طلاق کے بعد بیوی کو رہائش کا حق",
    "volume": 5,
    "page": 399
  },
  {
    "topic": "غیر حائض مطلقہ عورت کی عدت",
    "volume": 10,
    "page": 416
  },
  {
    "topic": "عدت کے دوران دینی مقاصد کے لیے نکلنے کا حکم",
    "volume": 10,
    "page": 417
  },
  {
    "topic": "حاملہ بیوہ کی عدت",
    "volume": 10,
    "page": 432
  },
  {
    "topic": "نمازِ جنازہ کی امامت کا سب سے زیادہ حقدار کون؟",
    "volume": 3,
    "page": 93
  },
  {
    "topic": "جنازہ اٹھاتے اور لے جاتے وقت بلند آواز سے کلمۂ شہادت پڑھنا",
    "volume": 3,
    "page": 96
  },
  {
    "topic": "ماں کے انتقال کے بعد بچے کی نگہداشت وتربیت کا اولین حق کس کو حاصل ہے",
    "volume": 3,
    "page": 106
  },
  {
    "topic": "نماز جنازہ کی شرعی حیثیت",
    "volume": 3,
    "page": 107
  },
  {
    "topic": "میت کی باقیات کو نکلوا کر دوسری زمین میں منتقل کرنے کا حکم",
    "volume": 3,
    "page": 109
  },
  {
    "topic": "میت کے غسل کے لیے دوسرے مسلک کی تنظیم کی خدمات لینا",
    "volume": 7,
    "page": 111
  },
  {
    "topic": "سانحۂ گھوٹکی میں جاں بحق ہونے والوں کی اجتماعی وامانتاً تدفین",
    "volume": 3,
    "page": 113
  },
  {
    "topic": "کسی کی زمین میں اس کی اجازت کے بغیر میت دفن کرنا",
    "volume": 7,
    "page": 113
  },
  {
    "topic": "قبر کا پختہ کرنا",
    "volume": 7,
    "page": 114
  },
  {
    "topic": "لحد میں سیمنٹ اور بلاکوں کی چنائی کرنا",
    "volume": 7,
    "page": 115
  },
  {
    "topic": "سانحۂ گھوٹکی میں غیر مسلم کی نماز جنازہ",
    "volume": 3,
    "page": 117
  },
  {
    "topic": "قبر پر نام کی تختی یا کتبہ لگانا",
    "volume": 7,
    "page": 117
  },
  {
    "topic": "دعا بعدالجنازہ",
    "volume": 3,
    "page": 118
  },
  {
    "topic": "کتبے پر آیات قرآنی لکھنا",
    "volume": 7,
    "page": 118
  },
  {
    "topic": "نا محرم عورت کی میت کو کاندھا دینا",
    "volume": 7,
    "page": 120
  },
  {
    "topic": "شرابی کی نماز جنازہ کا حکم",
    "volume": 7,
    "page": 122
  },
  {
    "topic": "چند سوالات",
    "volume": 7,
    "page": 123
  },
  {
    "topic": "قبر کی حرمت کا شرعی حکم",
    "volume": 7,
    "page": 124
  },
  {
    "topic": "دعا بعد الجنازہ ضرب مومن کے مفتی محمد کا جواب اور ہمارا جواب الجواب",
    "volume": 3,
    "page": 125
  },
  {
    "topic": "قبرستان کی تبدیلی",
    "volume": 7,
    "page": 127
  },
  {
    "topic": "غیر مسلم قبرستان کا حکم",
    "volume": 7,
    "page": 128
  },
  {
    "topic": "نماز جنازہ کے بعد دعا کی شرعی حیثیت",
    "volume": 7,
    "page": 130
  },
  {
    "topic": "نماز جنازہ کی تکرار",
    "volume": 7,
    "page": 132
  },
  {
    "topic": "رسول اللہ ﷺ کا کفن کیسا تھا؟",
    "volume": 7,
    "page": 134
  },
  {
    "topic": "حضرت خدیجہ رضی اللہ عنہا کی نماز جنازہ",
    "volume": 7,
    "page": 136
  },
  {
    "topic": "غسل میت سے پہلے ایصالِ ثواب یا قرآن خوانی",
    "volume": 4,
    "page": 149
  },
  {
    "topic": "مصنوعی دانتوں کے ساتھ تدفین",
    "volume": 4,
    "page": 150
  },
  {
    "topic": "اپنے یا احباب کے لیے زندگی میں قبر تیار کرنا",
    "volume": 2,
    "page": 151
  },
  {
    "topic": "تدفین کے بعد میت کا قبر سے نکالنا",
    "volume": 2,
    "page": 151
  },
  {
    "topic": "نمازِ جنازہ کا سلام ہاتھ باندھے ہوئے پھیرے یا ہاتھ چھوڑ کر",
    "volume": 2,
    "page": 153
  },
  {
    "topic": "پوسٹ مارٹم کی شرعی حیثیت",
    "volume": 4,
    "page": 153
  },
  {
    "topic": "متعدد جنازے ایک ساتھ کیسے پڑھے جائیں",
    "volume": 2,
    "page": 154
  },
  {
    "topic": "دعا بعد الجنازۃ",
    "volume": 2,
    "page": 155
  },
  {
    "topic": "غسل میت کا طریقہ",
    "volume": 6,
    "page": 155
  },
  {
    "topic": "قاتل اور ڈاکو کی نماز جنازہ کا شرعی حکم",
    "volume": 6,
    "page": 156
  },
  {
    "topic": "جھوٹی قبر بنانا اور اس کی تعظیم کرنا",
    "volume": 4,
    "page": 158
  },
  {
    "topic": "نمازِ جنازہ کی تکرار جائز نہیں",
    "volume": 6,
    "page": 158
  },
  {
    "topic": "مردہ پیدا ہونے والے بچے کے کفن دفن کا طریقہ",
    "volume": 4,
    "page": 159
  },
  {
    "topic": "غسال پر غسل یا وضو واجب ہے؟",
    "volume": 5,
    "page": 159
  },
  {
    "topic": "مغفرت وایصالِ ثواب کے لیے اجتماعی دعا",
    "volume": 6,
    "page": 160
  },
  {
    "topic": "شوہر، بیوی کا وارث ہے، ولی نہیں",
    "volume": 6,
    "page": 162
  },
  {
    "topic": "کفن کا رنگ اور کپڑے کی کوالٹی",
    "volume": 5,
    "page": 163
  },
  {
    "topic": "میت کا چبوترے پر رکھ کر نماز جنازہ پڑھنا",
    "volume": 5,
    "page": 165
  },
  {
    "topic": "قبروں کو مسمار کرنا یا ان کی بے حرمتی ناجائز ہے",
    "volume": 6,
    "page": 165
  },
  {
    "topic": "قبرستان میں نماز جنازہ پڑھنے کا حکم",
    "volume": 5,
    "page": 167
  },
  {
    "topic": "نمازِ جنازہ سے متعلق چند سوالات",
    "volume": 5,
    "page": 168
  },
  {
    "topic": "مقتدی کا درمیان میں آکر نماز جنازہ میں شامل ہونا",
    "volume": 5,
    "page": 169
  },
  {
    "topic": "مزارات پر حاضری کا طریقہ",
    "volume": 6,
    "page": 169
  },
  {
    "topic": "نماز جنازہ کی چوتھی تکبیر کے بعد ہاتھ چھوڑ دے اور سلام پھیرے",
    "volume": 5,
    "page": 171
  },
  {
    "topic": "خود کشی کرنے والے کی نماز جنازہ",
    "volume": 5,
    "page": 172
  },
  {
    "topic": "قبروں /مزارات پر پھول ڈالنے کا حکم شرعی",
    "volume": 6,
    "page": 172
  },
  {
    "topic": "خود کشی کرنے والے کو ایصالِ ثواب",
    "volume": 5,
    "page": 174
  },
  {
    "topic": "قبروں کو سجدہ کرنے اور بوسا دینے کا حکم",
    "volume": 6,
    "page": 174
  },
  {
    "topic": "خود کشی کی شرعی حیثیت",
    "volume": 5,
    "page": 176
  },
  {
    "topic": "عورتوں کا مزارات پر جانا",
    "volume": 6,
    "page": 176
  },
  {
    "topic": "میت کو دفن کرنے کے بعد آیا ہاتھ دھونا ضروری ہے؟",
    "volume": 5,
    "page": 177
  },
  {
    "topic": "میت کی تدفین والے دن میت کے گھر کھانے کا اہتمام",
    "volume": 5,
    "page": 178
  },
  {
    "topic": "غیر شرعی منت کا حکم",
    "volume": 6,
    "page": 178
  },
  {
    "topic": "قبر میں عہد نامہ رکھنا",
    "volume": 5,
    "page": 179
  },
  {
    "topic": "مزارات پر ڈھول اور رقص وغیرہ جیسی خرافات کا حکم",
    "volume": 6,
    "page": 179
  },
  {
    "topic": "لوگوں میں مشہور باتوں کا شرعی حکم",
    "volume": 5,
    "page": 182
  },
  {
    "topic": "جمعرات کو ارواحِ اموات کا آنا",
    "volume": 5,
    "page": 182
  },
  {
    "topic": "جنازہ قبرستان لے جاتے وقت میت کے پائوں قبلے کی جانب ہونے کا حکم",
    "volume": 5,
    "page": 188
  },
  {
    "topic": "میت کو دفن کرنے کے بعد قبر کھودنا جائز نہیں",
    "volume": 5,
    "page": 190
  },
  {
    "topic": "ایصال ثواب اور چہلم کی رسوم میں غیر شرعی باتیں",
    "volume": 5,
    "page": 193
  },
  {
    "topic": "چہلم میں تین چاند گزرنے کی شرعی حیثیت",
    "volume": 5,
    "page": 195
  },
  {
    "topic": "خود کشی کرنے والے اور مقروض کی نماز، جنازہ",
    "volume": 13,
    "page": 205
  },
  {
    "topic": "نماز جنازہ کی چوتھی تکبیر کے بعد ہاتھ چھوڑ کر سلام پھیرنے کا مسئلہ",
    "volume": 13,
    "page": 208
  },
  {
    "topic": "گھر میں جنازہ اٹھانے سے پہلے دعا مانگنا",
    "volume": 12,
    "page": 215
  },
  {
    "topic": "کیا شوہر بیوی کی میت کو غسل دے سکتا ہے",
    "volume": 12,
    "page": 216
  },
  {
    "topic": "نمازِ جنازہ میں قیام کی حیثیت",
    "volume": 13,
    "page": 219
  },
  {
    "topic": "نماز جنازہ میں تکبیرات میں سہو",
    "volume": 13,
    "page": 221
  },
  {
    "topic": "نماز جنازہ میں زائد تکبیر کہنے کا حکم",
    "volume": 13,
    "page": 222
  },
  {
    "topic": "بحری جہاز میں میت کا جنازہ اور تکفین و تدفین",
    "volume": 12,
    "page": 225
  },
  {
    "topic": "کرونا سے متاثر میت کے کفن دفن کا حکم",
    "volume": 12,
    "page": 229
  },
  {
    "topic": "تدفین میں تاخیر مکروہ ہے",
    "volume": 13,
    "page": 229
  },
  {
    "topic": "پاکستان کے تناظر میں کرونا وائرس کے نتیجے میں فوت شدہ میت کے لیے غسل اور جنازے کا مسئلہ",
    "volume": 12,
    "page": 230
  },
  {
    "topic": "خاص حالات میں ایک قبر میں ایک سے زیادہ میتوں کی تدفین",
    "volume": 12,
    "page": 231
  },
  {
    "topic": "نماز جنازہ کی نیت کا مسئلہ",
    "volume": 13,
    "page": 231
  },
  {
    "topic": "میت اور نماز جنازہ کی تصاویر اور وڈیو بنانا",
    "volume": 13,
    "page": 232
  },
  {
    "topic": "سید المرسلین ﷺ کی نماز جنازہ",
    "volume": 11,
    "page": 233
  },
  {
    "topic": "میت بیرون مسجد رکھ کر مسجد میں جنازے میں شریک ہونا",
    "volume": 12,
    "page": 233
  },
  {
    "topic": "نمازِ جنازہ کی امامت کا سب سے زیادہ حقدار کون؟",
    "volume": 10,
    "page": 235
  },
  {
    "topic": "متعدد اموات کی ایک ساتھ نماز جنازہ",
    "volume": 12,
    "page": 236
  },
  {
    "topic": "نمازِ جنازہ کی یہ صورت درست ہے",
    "volume": 10,
    "page": 239
  },
  {
    "topic": "نمازِ جنازہ کے وقت امام کہاں کھڑا ہو",
    "volume": 10,
    "page": 240
  },
  {
    "topic": "مجنون کی دعائے جنازہ",
    "volume": 10,
    "page": 242
  },
  {
    "topic": "میت کی مسہری پر پرچم رکھنا",
    "volume": 11,
    "page": 249
  },
  {
    "topic": "زوال کے وقت نمازِ جنازہ پڑھنا",
    "volume": 11,
    "page": 253
  },
  {
    "topic": "ایک قبر سے ستر مُردے اٹھائے جانے کی روایت",
    "volume": 11,
    "page": 259
  },
  {
    "topic": "میت کو کاندھادینا",
    "volume": 11,
    "page": 260
  },
  {
    "topic": "پیدا ہوتے ہی مرنے والے بچے کی نماز جنازہ کا حکم",
    "volume": 11,
    "page": 260
  },
  {
    "topic": "مجنون کی نماز جنازہ (پاگل)",
    "volume": 11,
    "page": 262
  },
  {
    "topic": "وقف قبرستان کو بدلا نہیں جا سکتا",
    "volume": 11,
    "page": 265
  },
  {
    "topic": "قبر پکی کرنے کا حکم",
    "volume": 11,
    "page": 266
  },
  {
    "topic": "عام قبرستان اور کمیونٹی کے لیے مختص قبرستان کا فرق",
    "volume": 14,
    "page": 266
  },
  {
    "topic": "میت کو عمامہ کے ساتھ دفن کرنے کا شرعی حکم",
    "volume": 11,
    "page": 268
  },
  {
    "topic": "تابوت میں میت کو دفنانے کا حکم",
    "volume": 11,
    "page": 269
  },
  {
    "topic": "جنازے کو لے کر چلنے کا طریقہ",
    "volume": 14,
    "page": 269
  },
  {
    "topic": "میت کو غسل کے لیے کس طرح رکھا جائے",
    "volume": 14,
    "page": 271
  },
  {
    "topic": "میت کے گھر کا کھانا",
    "volume": 9,
    "page": 307
  },
  {
    "topic": "قبر کی بے حرمتی کی رسم",
    "volume": 9,
    "page": 315
  },
  {
    "topic": "وقف قبرستان کی حیثیت تبدیل نہیں کی جاسکتی",
    "volume": 9,
    "page": 318
  },
  {
    "topic": "جوتے پہن کر نماز جنازہ پڑھنا",
    "volume": 9,
    "page": 319
  },
  {
    "topic": "تنگ علاقوں میں مسجد میں نماز جنازہ پڑھنے کا حکم",
    "volume": 9,
    "page": 323
  },
  {
    "topic": "قبر کے لیے مترادف کلمات",
    "volume": 9,
    "page": 325
  },
  {
    "topic": "تعزیت کی ناپسندیدہ رسومات",
    "volume": 9,
    "page": 327
  },
  {
    "topic": "ایصال ثواب کی مشروعیت اور اس کا مستحسن طریقہ اور اجتماعی قرآن خوانی کی شرعی حیثیت",
    "volume": 9,
    "page": 331
  },
  {
    "topic": "وقف کا شرعی حکم",
    "volume": 7,
    "page": 99
  },
  {
    "topic": "قبرستان میں اپنے لیے جگہ مخصوص کرنے کا شرعی حکم",
    "volume": 7,
    "page": 102
  },
  {
    "topic": "وقف میں تبدیلی جائز نہیں",
    "volume": 7,
    "page": 103
  },
  {
    "topic": "مسجد کا نام واقف کی نسبت سے ہوسکتا ہے",
    "volume": 7,
    "page": 105
  },
  {
    "topic": "مسجد میں توسیع کا شرعی حکم",
    "volume": 7,
    "page": 106
  },
  {
    "topic": "مسجد کے وقف کا حکم",
    "volume": 8,
    "page": 113
  },
  {
    "topic": "مسجد میں کنڈا لگا کر بجلی لینے کا حکم",
    "volume": 9,
    "page": 113
  },
  {
    "topic": "مسجد کی تعمیرِ نو کے بعد اضافات کا شرعی حکم",
    "volume": 9,
    "page": 115
  },
  {
    "topic": "مسجد کی افطاری کا مصرف",
    "volume": 9,
    "page": 119
  },
  {
    "topic": "مسجد کی حدود میں موبائل ٹاور لگانے کی شرعی حیثیت",
    "volume": 8,
    "page": 120
  },
  {
    "topic": "مسجد کے غیر ضروری سامان کا حکم",
    "volume": 9,
    "page": 120
  },
  {
    "topic": "مسجد کی چھت پر بالغ طالبات کے مدرسے کا حکم",
    "volume": 4,
    "page": 121
  },
  {
    "topic": "سیڑھی بھی مسجد کا حصہ ہے",
    "volume": 8,
    "page": 121
  },
  {
    "topic": "مسجد کے فنڈ کا شرعی حکم",
    "volume": 8,
    "page": 122
  },
  {
    "topic": "مسجد کا چندہ سڑک پر صرف کرنا",
    "volume": 9,
    "page": 123
  },
  {
    "topic": "مسجد کے قیام کے بعد اس کی حیثیت کو تبدیل کرنا",
    "volume": 4,
    "page": 125
  },
  {
    "topic": "وقف کو بدلا نہیں جاسکتا",
    "volume": 8,
    "page": 125
  },
  {
    "topic": "منبر نبوی ﷺ کی سیڑھیاں",
    "volume": 4,
    "page": 127
  },
  {
    "topic": "فلیٹس اور کاروبار مراکز قائم مساجد کا شرعی حکم",
    "volume": 8,
    "page": 127
  },
  {
    "topic": "مسجد کے بیت الخلاء میں پانی کا استعمال",
    "volume": 9,
    "page": 128
  },
  {
    "topic": "مسجد کی بالائی منزل پر جماعت",
    "volume": 4,
    "page": 129
  },
  {
    "topic": "ٹرسٹ کو سرمایہ کاری کی رقم میں نامزد کرنا",
    "volume": 9,
    "page": 129
  },
  {
    "topic": "فنائے مسجد کا حکم",
    "volume": 4,
    "page": 130
  },
  {
    "topic": "مسجد کا ویران کرنا حرام ہے",
    "volume": 8,
    "page": 130
  },
  {
    "topic": "وقتی نماز جنازے پر مقدم ہے",
    "volume": 9,
    "page": 131
  },
  {
    "topic": "چندہ جس مقصد کے لیے جمع کیا گیا ہے، اسے اس کے بجائے دوسرے مصارف پر صَرف کرنا",
    "volume": 4,
    "page": 132
  },
  {
    "topic": "امام کی اہلیت",
    "volume": 8,
    "page": 132
  },
  {
    "topic": "مسجد میں نمازِ جنازہ کا حکم",
    "volume": 9,
    "page": 132
  },
  {
    "topic": "کسی کی ذاتی زمین پر مسجد بنانا یا اُسے مسجد میں شامل کرنا",
    "volume": 6,
    "page": 133
  },
  {
    "topic": "مسجد فنڈ کا عید گاہ پر استعمال",
    "volume": 8,
    "page": 134
  },
  {
    "topic": "مسجد کا استعمال شدہ سامان کسی دوسری مسجد میں دینا",
    "volume": 4,
    "page": 135
  },
  {
    "topic": "مسجد فنڈ سے وضو خانہ کی تعمیر",
    "volume": 6,
    "page": 135
  },
  {
    "topic": "امام کو مواقع تہمت سے بچنا چاہیے",
    "volume": 8,
    "page": 135
  },
  {
    "topic": "خزانچی کے گھر سے مسجد کی رقم کی چوری",
    "volume": 4,
    "page": 136
  },
  {
    "topic": "دیہات میں عید گاہ کا شرعی حکم",
    "volume": 6,
    "page": 136
  },
  {
    "topic": "مسجد اور مسلک",
    "volume": 4,
    "page": 137
  },
  {
    "topic": "مسجد فنڈ سے ضعیف امام کی اعانت اور کفالت اور امام کی چھٹیوں کی تنخواہ",
    "volume": 6,
    "page": 137
  },
  {
    "topic": "سرکاری زمین پر مسجد کا قیام",
    "volume": 9,
    "page": 137
  },
  {
    "topic": "مسجد کی حیثیت کو تبدیل کرنا",
    "volume": 6,
    "page": 138
  },
  {
    "topic": "مسجد میں نمازِ جنازہ پڑھنے کی کراہت اور عذر کی بنا پر جواز کی صورتیں",
    "volume": 4,
    "page": 139
  },
  {
    "topic": "مسجد میں اسکرین لگاکر ٹیلی ویژن کے دینی پروگرام چلانا",
    "volume": 5,
    "page": 139
  },
  {
    "topic": "متولیِ وقف کو بغیر شرعی عذر معزول نہیں کیا جاسکتا",
    "volume": 8,
    "page": 139
  },
  {
    "topic": "دینی مدارس اور مساجد سے Withholding Taxکی کٹوتی",
    "volume": 9,
    "page": 140
  },
  {
    "topic": "مسجد میں انگلیاں چٹخانے کا شرعی حکم",
    "volume": 6,
    "page": 141
  },
  {
    "topic": "مسجد امامت کا اجارہ اور امام کی معزولی",
    "volume": 9,
    "page": 141
  },
  {
    "topic": "مسجد کے فنڈ سے مسجد کے عملے کو علاج معالجے کی سہولت دینا",
    "volume": 5,
    "page": 143
  },
  {
    "topic": "مسجد میں فتنہ وفساد برپا کرنے والے کا شرعی حکم",
    "volume": 6,
    "page": 143
  },
  {
    "topic": "نامکمل وقف",
    "volume": 4,
    "page": 144
  },
  {
    "topic": "عام گزرگاہ کو روک کر قرآن کی تعلیم دینا",
    "volume": 5,
    "page": 144
  },
  {
    "topic": "مسجد عطیات/فنڈز پر زکوٰۃ نہیں",
    "volume": 9,
    "page": 144
  },
  {
    "topic": "انجمن کے فنڈ سے قرض حسن دینے کا حکم",
    "volume": 9,
    "page": 144
  },
  {
    "topic": "مسجد کو ہبہ کیے گئے مکان کی فروخت",
    "volume": 5,
    "page": 146
  },
  {
    "topic": "محراب مسجد میں شامل ہے",
    "volume": 6,
    "page": 146
  },
  {
    "topic": "زکوٰۃ کا مصرف",
    "volume": 9,
    "page": 146
  },
  {
    "topic": "وقف کو منسوخ نہیں کیا جاسکتا",
    "volume": 5,
    "page": 148
  },
  {
    "topic": "ایک سے زائد متولیان کی حیثیت",
    "volume": 5,
    "page": 150
  },
  {
    "topic": "مدرسے کے لیے وقف پلاٹ کی تبدیلی",
    "volume": 5,
    "page": 152
  },
  {
    "topic": "سرکاری زمین پر بغیر لیز یا الاٹمنٹ کے مسجد کی تعمیر اور شرعی حیثیت",
    "volume": 13,
    "page": 165
  },
  {
    "topic": "فٹ پاتھ اور عام گزرگاہ کوجائے نماز بنانے کا حکم",
    "volume": 13,
    "page": 167
  },
  {
    "topic": "مسجد کی چھت پر نماز پڑھنا",
    "volume": 13,
    "page": 169
  },
  {
    "topic": "وقف مکمل ہونے کے بعد کی جانے والی تعمیر کا شرعی حکم",
    "volume": 13,
    "page": 171
  },
  {
    "topic": "مسجد کے اندر ٹوپیاں اور عطر بیچنے کا کاروبار",
    "volume": 13,
    "page": 174
  },
  {
    "topic": "نمازِ جمعہ کے لیے اذنِ عام کی شرط/td>",
    "volume": 13,
    "page": 176
  },
  {
    "topic": "کیا وقف سے رجوع ممکن ہے ؟",
    "volume": 13,
    "page": 180
  },
  {
    "topic": "مساجد کی صفوں کے درمیان پٹی کی شرعی حیثیت",
    "volume": 13,
    "page": 183
  },
  {
    "topic": "مسجد کے فنڈ میں تَعدّ کا شرعی حکم",
    "volume": 13,
    "page": 187
  },
  {
    "topic": "مسجد کے عطیات اور وقف کے بارے میں شرعی حکم",
    "volume": 13,
    "page": 190
  },
  {
    "topic": "مساجد و مدارس کے عملے کا بونس",
    "volume": 13,
    "page": 194
  },
  {
    "topic": "وقف کی بیع حرام ہے",
    "volume": 13,
    "page": 196
  },
  {
    "topic": "مسجد پر تصدُّق کیے گئے مکان کا شرعی حکم",
    "volume": 14,
    "page": 198
  },
  {
    "topic": "مسجد کے وسائل رفاہِ عامہ کے کاموں میں صرف نہیں کیے جا سکتے",
    "volume": 13,
    "page": 200
  },
  {
    "topic": "چندہ جس مقصد کے لیے جمع کیا گیا ہے ، اسے اس کے بجائے دوسرے مصارف پر صرف کرنا",
    "volume": 14,
    "page": 200
  },
  {
    "topic": "مسلمانوں کا دینی وقف مسلمانوں کے لیے ہے",
    "volume": 14,
    "page": 202
  },
  {
    "topic": "مسجد کے مین ہال میں اگلی تین صفیں چھوڑ کر صف بندی کا مسئلہ",
    "volume": 14,
    "page": 203
  },
  {
    "topic": "فنائے مسجد میں رفاہِ عام کے لیے فلٹر پلانٹ لگانا",
    "volume": 12,
    "page": 205
  },
  {
    "topic": "تعمیر شدہ مسجد کی پہلی چھت کے درمیان کٹاؤ کا مسئلہ",
    "volume": 14,
    "page": 205
  },
  {
    "topic": "قدیم قبرستان کے درختوں کی ملکیت",
    "volume": 12,
    "page": 206
  },
  {
    "topic": "امام کا مشاہرہ اور دیگر مصارف",
    "volume": 11,
    "page": 207
  },
  {
    "topic": "مساجد میں مفاد عامہ کے اعلانات کا جواز",
    "volume": 14,
    "page": 207
  },
  {
    "topic": "مسجد کے سامان کا حکم",
    "volume": 11,
    "page": 209
  },
  {
    "topic": "مسجد میں محرابی دیوار پر شیشے لگانا",
    "volume": 11,
    "page": 210
  },
  {
    "topic": "مسجد میں افطار کرنے کا حکم",
    "volume": 12,
    "page": 210
  },
  {
    "topic": "پہلی مسجد کو ویران کرنا ناجائز ہے",
    "volume": 12,
    "page": 210
  },
  {
    "topic": "مسجد میں تعلیم وتعلم کے لیے پروجیکٹر کا استعمال",
    "volume": 10,
    "page": 211
  },
  {
    "topic": "مسجد کی انتظامیہ کا رکن بننے کی اہلیت",
    "volume": 10,
    "page": 212
  },
  {
    "topic": "سرد علاقوں کی مساجد میں نمازیوں کے سامنے گیس ہیٹر کا جواز",
    "volume": 11,
    "page": 212
  },
  {
    "topic": "وقف درست ہوگیا",
    "volume": 14,
    "page": 212
  },
  {
    "topic": "فنائے مسجد میں طالبات کا مدرسہ قائم کرنے کی شرعی حیثیت",
    "volume": 10,
    "page": 213
  },
  {
    "topic": "مالک کی اجازت کے بغیر کسی کی زمین کو مسجد میں شامل کرنا جائز نہیں ہے",
    "volume": 14,
    "page": 214
  },
  {
    "topic": "خُدّامسجد کے لیے چندہ",
    "volume": 11,
    "page": 215
  },
  {
    "topic": "مسجد کے قیام کے بعد اس کی مسجدیت کو باطل یا متغیر نہیں کیا جا سکتا",
    "volume": 14,
    "page": 215
  },
  {
    "topic": "مسجد میں مانگنے کا رواج",
    "volume": 11,
    "page": 217
  },
  {
    "topic": "صدقاتِ واجبہ کی رقم کو انویسٹ کرنا",
    "volume": 14,
    "page": 217
  },
  {
    "topic": "مسجد کی سہولتوں کا ناجائز استعمال منع ہے",
    "volume": 10,
    "page": 218
  },
  {
    "topic": "مسجد کی چھت میں نعلین پاک کا نقش بنانا",
    "volume": 14,
    "page": 218
  },
  {
    "topic": "مسجد کے ہال میں کھانا کھلانا",
    "volume": 10,
    "page": 220
  },
  {
    "topic": "مسجد سے مکان میں پانی کا کنکشن دینا",
    "volume": 14,
    "page": 220
  },
  {
    "topic": "مسجد کے نام پر وقف کے لیے زمین کا معین ہونا ضروری ہے",
    "volume": 10,
    "page": 221
  },
  {
    "topic": "قائم مسجد میں تغیر و تبدیل جائز نہیں",
    "volume": 14,
    "page": 221
  },
  {
    "topic": "مسجد کے لوح افتتاح کی شرعی حیثیت",
    "volume": 10,
    "page": 223
  },
  {
    "topic": "مسجد کے نام غیر موقوفہ جائیداد کی فروخت کا جواز",
    "volume": 11,
    "page": 223
  },
  {
    "topic": "غصب شدہ زمین کو مسجد کے لیے وقف کرنے کا حکم",
    "volume": 14,
    "page": 223
  },
  {
    "topic": "قبرستان میں مسجد کی توسیع منع ہے",
    "volume": 10,
    "page": 225
  },
  {
    "topic": "مسجد میں دوڑنا احترام اور وقار کے منافی ہے",
    "volume": 11,
    "page": 225
  },
  {
    "topic": "ایک مسجد کے اثاثے دوسری مسجد کو منتقل کرنا",
    "volume": 14,
    "page": 226
  },
  {
    "topic": "مسجد کی تعمیرِ نو",
    "volume": 11,
    "page": 227
  },
  {
    "topic": "وقف ذاتی ملکیت نہیں",
    "volume": 14,
    "page": 229
  },
  {
    "topic": "مسجد میں کاروبار کی ممانعت",
    "volume": 10,
    "page": 230
  },
  {
    "topic": "واقف پر لازم ہے کہ وقف میں خیانت اور ناجائز تصرُّف پر مُتولی کو معزول کردے",
    "volume": 14,
    "page": 230
  },
  {
    "topic": "عطیہ دہندہ یا تعمیر میں حصہ لینے والا وقف کا مالک نہیں بن جاتا",
    "volume": 14,
    "page": 232
  },
  {
    "topic": "وقف ختم نہیں کیا جا سکتا",
    "volume": 14,
    "page": 233
  },
  {
    "topic": "وقف کے بارے میں مزید سوالات",
    "volume": 14,
    "page": 234
  },
  {
    "topic": "مسجد کے پرانے پنکھے دے کر نئے خریدنے کا حکم",
    "volume": 14,
    "page": 235
  },
  {
    "topic": "رفاہی پلاٹ پر مسجد بنانے کی جائز صورت",
    "volume": 14,
    "page": 236
  },
  {
    "topic": "مسجد میں نماز جنازہ ادا کرنا مکروہ ہے",
    "volume": 14,
    "page": 238
  },
  {
    "topic": "اعتکاف کے لیے مسجد میں پنجوقتہ نماز باجماعت کا اہتمام کافی ہے",
    "volume": 14,
    "page": 240
  },
  {
    "topic": "مسجد کے مال میں تصرُّف کا مسئلہ",
    "volume": 14,
    "page": 244
  },
  {
    "topic": "انتظامیہ مسجد عملے کی مشاہرے میں اضافہ کرسکتی ہے",
    "volume": 14,
    "page": 246
  },
  {
    "topic": "مسجد میں بیٹھ کر اجرت پر پڑھانے کا شرعی حکم",
    "volume": 14,
    "page": 247
  },
  {
    "topic": "مسجد میں شخصی نوعیت کے اعلانات منع ہیں",
    "volume": 14,
    "page": 250
  },
  {
    "topic": "مسجد کے لیے وقف جگہ پر تدفین",
    "volume": 14,
    "page": 253
  },
  {
    "topic": "تکمیل وقف کے بعد وقف میں تبدیلی کی شرعی حیثیت",
    "volume": 14,
    "page": 255
  },
  {
    "topic": "مسجد کے مکان پر مؤذن یا امام کا ملکیت کا دعویٰ",
    "volume": 14,
    "page": 257
  },
  {
    "topic": "مسجد میں ڈراموں کی ریکارڈنگ",
    "volume": 14,
    "page": 259
  },
  {
    "topic": "محض ارادے سے وقف قائم نہیں ہوتا",
    "volume": 14,
    "page": 261
  },
  {
    "topic": "فلاحی و رفاہی ادارے ایک الگ وقف کی حیثیت رکھتے ہیں",
    "volume": 14,
    "page": 262
  },
  {
    "topic": "مسجد میں تلاوت قرآن اور درس ووعظ میں لائوڈ اسپیکر کا استعمال",
    "volume": 3,
    "page": 383
  },
  {
    "topic": "مسجد کے ملبے کا استعمال",
    "volume": 3,
    "page": 387
  },
  {
    "topic": "مسجد کے چندے پر حق الخدمت کی ادائیگی",
    "volume": 3,
    "page": 412
  },
  {
    "topic": "کثرتِ استغفار کی برکات اور حکمتیں",
    "volume": 9,
    "page": 357
  },
  {
    "topic": "گم شدہ گائے کا حکم",
    "volume": 9,
    "page": 360
  },
  {
    "topic": "طبی تحقیق کے لیے جانوروں کا استعمال",
    "volume": 9,
    "page": 362
  },
  {
    "topic": "اچھے اور برے خواب",
    "volume": 9,
    "page": 363
  },
  {
    "topic": "رسمِ آمین",
    "volume": 9,
    "page": 365
  },
  {
    "topic": "کیا حجرۂ انور یا روضۂ انور بھی جنت کی کیاری ہے",
    "volume": 9,
    "page": 369
  },
  {
    "topic": "بزرگانِ دین کی تصویر لٹکا کر اس کی تعظیم کرنا اور اس سے حاجات مانگنا",
    "volume": 9,
    "page": 372
  },
  {
    "topic": "عَلانیہ شرعی مجرم کا سماجی مقاطعہ",
    "volume": 9,
    "page": 376
  },
  {
    "topic": "وظائف اور دعائیں پڑھنا",
    "volume": 9,
    "page": 381
  },
  {
    "topic": "تبلیغِ دین فرضِ کفایہ ہے",
    "volume": 9,
    "page": 382
  },
  {
    "topic": "اسلامی یا شرعی لباس کا کم از کم معیار",
    "volume": 9,
    "page": 389
  },
  {
    "topic": "نامناسب نظر آنے والے بالوں کا ازالہ",
    "volume": 9,
    "page": 391
  },
  {
    "topic": "نعت خوان کے خلاف شرعی ریمارکس",
    "volume": 9,
    "page": 394
  },
  {
    "topic": "کیا یہ ناشکری ہے",
    "volume": 9,
    "page": 396
  },
  {
    "topic": "نام بگاڑنا",
    "volume": 9,
    "page": 400
  },
  {
    "topic": "عائشہ نام رکھنا",
    "volume": 9,
    "page": 401
  },
  {
    "topic": "اللہ تعالیٰ رحیم ہے تو اپنے بندوں کو آگ میں کیوں ڈالے گا؟",
    "volume": 2,
    "page": 402
  },
  {
    "topic": "گم شدہ چیز کے ملنے کے لیے دعا",
    "volume": 2,
    "page": 402
  },
  {
    "topic": "برصغیر کے کس عالم نے سب سے زیادہ فتاویٰ لکھے ہیں",
    "volume": 2,
    "page": 403
  },
  {
    "topic": "برسی پر کھانا پکا کر تقسیم کرنا",
    "volume": 2,
    "page": 403
  },
  {
    "topic": "رزق میں برکت کے لیے دعا",
    "volume": 2,
    "page": 403
  },
  {
    "topic": "کھانے اور پھل وغیرہ پر فاتحہ",
    "volume": 2,
    "page": 404
  },
  {
    "topic": "غیر قانونی واٹر کنکشن کا مسئلہ",
    "volume": 9,
    "page": 404
  },
  {
    "topic": "بند دکان میں بلی مرگئی",
    "volume": 2,
    "page": 405
  },
  {
    "topic": "شوہر والدین سے ملنے نہیں دیتے",
    "volume": 2,
    "page": 405
  },
  {
    "topic": "کبوتروں کو دانہ ڈالنا",
    "volume": 2,
    "page": 405
  },
  {
    "topic": "میاں بیوی کے متعلق چند سوالات",
    "volume": 12,
    "page": 405
  },
  {
    "topic": "دعوتِ دین کا اسلوب",
    "volume": 2,
    "page": 406
  },
  {
    "topic": "محفلِ قراءت و نعت میں تالیاں بجانا",
    "volume": 9,
    "page": 409
  },
  {
    "topic": "محافلِ میلاد میں منکرات کا ارتکاب",
    "volume": 9,
    "page": 410
  },
  {
    "topic": "خواب کی تعبیر",
    "volume": 11,
    "page": 415
  },
  {
    "topic": "فکرِ رضا کی روشنی میں نعت خوانی اور خطابت کے نذرانوں کی جائز و ناجائز صورتیں",
    "volume": 9,
    "page": 417
  },
  {
    "topic": "کیا عصری علوم کے ماہرین بھی قرآن وحدیث میں بیان کردہ فضیلتِ علم کے حقدار ہیں",
    "volume": 3,
    "page": 419
  },
  {
    "topic": "ضرر رساں کتوں کو مارنا",
    "volume": 11,
    "page": 421
  },
  {
    "topic": "نو مولود بچے کا مزار پر عقیقہ کرنا یا نو بیاہتا جوڑے کی مزار پر حاضری",
    "volume": 11,
    "page": 424
  },
  {
    "topic": "یتیم کی تعریف",
    "volume": 11,
    "page": 424
  },
  {
    "topic": "مقررہ تعداد میں اوراد ووظائف اور تسبیحات واذکار کی حکمت",
    "volume": 3,
    "page": 425
  },
  {
    "topic": "بعض دنوں میں ناخن تراشنے کی ممانعت",
    "volume": 12,
    "page": 425
  },
  {
    "topic": "گیس/بجلی/پانی کی چوری کا مسئلہ اور اس کا شرعی حکم",
    "volume": 7,
    "page": 427
  },
  {
    "topic": "عام لنگر پر صدقاتِ واجبہ کی رقم نہیں لگائی جاسکتی",
    "volume": 9,
    "page": 429
  },
  {
    "topic": "الیکٹرانک سگریٹ کا شرعی حکم",
    "volume": 13,
    "page": 429
  },
  {
    "topic": "ناخن تراشنے کی بابت شرعی حکم",
    "volume": 12,
    "page": 430
  },
  {
    "topic": "حفظ کے بچوں کے لیے سجدہ تلاوت کا مسئلہ اور تلاوت کا ایصالِ ثواب",
    "volume": 3,
    "page": 431
  },
  {
    "topic": "والدین کی خدمت کے وسیلے سے دعا کرنے پر اجرِ آخرت باطل نہیں ہوتا",
    "volume": 4,
    "page": 433
  },
  {
    "topic": "لطیف طنز و مزاح اور ہزل و استہزاء میں فرق",
    "volume": 12,
    "page": 433
  },
  {
    "topic": "فساد فی الارض",
    "volume": 7,
    "page": 434
  },
  {
    "topic": "ڈاکوؤں سے مزاحمت میں مارا جانا",
    "volume": 9,
    "page": 434
  },
  {
    "topic": "ابلیس نے آدم علیہ السلام کو کہاں سے بہکایا",
    "volume": 11,
    "page": 434
  },
  {
    "topic": "پرائیوٹ اسکولوں/کالجوں میں ایامِ تعطیلات کی فیس کا شرعی حکم، قوم کا اصل مسئلہ طبقاتی نظامِ تعلیم ہے",
    "volume": 4,
    "page": 435
  },
  {
    "topic": "”اپنا گھر اسکیم “ اور اسلامی بینکاری",
    "volume": 13,
    "page": 435
  },
  {
    "topic": "ہلالِ رمضان، یوم النحر وعاشورہ کی تعیین کے لیے",
    "volume": 3,
    "page": 436
  },
  {
    "topic": "قیاسات وتخمینی ضابطوں کی شرعی حیثیت",
    "volume": 3,
    "page": 436
  },
  {
    "topic": "داڑھی کا مذاق اڑانا",
    "volume": 9,
    "page": 436
  },
  {
    "topic": "استخارہ کا مفہوم، شرعی حیثیت اور استخارہ کے نام پر ماضی کے احوال بتانا",
    "volume": 4,
    "page": 437
  },
  {
    "topic": "ڈرائیونگ کے دوران موبائل فون کے استعمال کا شرعی حکم",
    "volume": 9,
    "page": 437
  },
  {
    "topic": "ہبہ کے متعلق ایک مسئلہ",
    "volume": 11,
    "page": 437
  },
  {
    "topic": "طنز و مزاح کی شرعی حدود",
    "volume": 12,
    "page": 437
  },
  {
    "topic": "حسنِ کارکردگی پر ترقی یا انعام",
    "volume": 7,
    "page": 438
  },
  {
    "topic": "خواب میں رسول اللہ ﷺ کی زیارت",
    "volume": 9,
    "page": 439
  },
  {
    "topic": "وقف میں تبدیلی جائز نہیں",
    "volume": 13,
    "page": 439
  },
  {
    "topic": "وسوسے کا علاج",
    "volume": 9,
    "page": 440
  },
  {
    "topic": "اولاد کو عاق کرنے کی شرعی حیثیت",
    "volume": 13,
    "page": 440
  },
  {
    "topic": "کھانے کے آداب اور مسنون طریقہ",
    "volume": 3,
    "page": 441
  },
  {
    "topic": "کارکردگی میں تساہل وتغافل",
    "volume": 7,
    "page": 441
  },
  {
    "topic": "مرد کے لیے سترِ عورت کی مقدار",
    "volume": 7,
    "page": 441
  },
  {
    "topic": "قیامِ تعظیمی کا شرعی حکم",
    "volume": 4,
    "page": 442
  },
  {
    "topic": "چان دیکھ کر اس کی طرف پیٹھ پھیر کر دعا کرنا",
    "volume": 13,
    "page": 443
  },
  {
    "topic": "شوہر کا غیر شرعی اور غیر اخلاقی مطالبہ",
    "volume": 7,
    "page": 444
  },
  {
    "topic": "نوچندی جمعرات",
    "volume": 12,
    "page": 444
  },
  {
    "topic": "مخلوط نظام تعلیم کا شرعی حکم",
    "volume": 13,
    "page": 444
  },
  {
    "topic": "مساجد میں جوتوں کی حفاظت کا مسئلہ",
    "volume": 7,
    "page": 446
  },
  {
    "topic": "نیاز کا مفہوم اور جواز",
    "volume": 4,
    "page": 448
  },
  {
    "topic": "قبر اور زائر کے درمیان حائل پردہ",
    "volume": 12,
    "page": 448
  },
  {
    "topic": "رجب کے کونڈے اور ’’تبارک‘‘ کی روٹیاں",
    "volume": 4,
    "page": 449
  },
  {
    "topic": "نام کا شخصیت پر اثر",
    "volume": 12,
    "page": 449
  },
  {
    "topic": "جارحیت کرتے ہوئے مارے جانے والے کا خون رائیگاں ہے",
    "volume": 13,
    "page": 449
  },
  {
    "topic": "عمرے کا ٹکٹ آپ کا استحقاق نہیں تھا",
    "volume": 7,
    "page": 450
  },
  {
    "topic": "حدِ قذف",
    "volume": 3,
    "page": 451
  },
  {
    "topic": "تعطیلات کے ایام کی تنخواہ کا جواز",
    "volume": 7,
    "page": 451
  },
  {
    "topic": "دس سال کی عمر میں بستر الگ کرنے کا حکم",
    "volume": 12,
    "page": 452
  },
  {
    "topic": "قیامت کے دن اعمال کا وزن کس طرح ہوگا",
    "volume": 4,
    "page": 453
  },
  {
    "topic": "برادری کا غیر شرعی رسوم کا خاتمہ کرنا",
    "volume": 8,
    "page": 453
  },
  {
    "topic": "مزارات پر چڑھائی جانے والی چادروں کے بارے میں شرعی احکام",
    "volume": 13,
    "page": 453
  },
  {
    "topic": "ہبہ کا ارادہ ظاہر کرنے سے ہبہ لازم نہیں آتا",
    "volume": 11,
    "page": 454
  },
  {
    "topic": "خود کو غیر مسلم ظاہر کرنے کا حکم",
    "volume": 3,
    "page": 455
  },
  {
    "topic": "لقطہ کے بارے میں شرعی حکم",
    "volume": 7,
    "page": 455
  },
  {
    "topic": "صدقے کا وسیع تر اطلاق",
    "volume": 8,
    "page": 455
  },
  {
    "topic": "آیتِ مداینہ میں بیان کردہ مالی معاملات کے احکام",
    "volume": 12,
    "page": 455
  },
  {
    "topic": "انجمن یا کمیٹی کو اللہ تعالیٰ کے احکام کو بدلنے کا اختیار نہیں ہے",
    "volume": 12,
    "page": 456
  },
  {
    "topic": "امانت رکھنے اور واپس کرنے کا حکم",
    "volume": 3,
    "page": 457
  },
  {
    "topic": "کسی تقصیر یا تعدی کے بغیر امانت ضائع ہونے پر ضمان نہیں",
    "volume": 7,
    "page": 458
  },
  {
    "topic": "بچوں کے سامنے بھی جھوٹ بولنا منع ہے",
    "volume": 12,
    "page": 458
  },
  {
    "topic": "ایصالِ ثواب کا کھانا اور صدقۂ جاریہ",
    "volume": 4,
    "page": 459
  },
  {
    "topic": "اپنے دل، سے فتویٰ لو “سے کیا مراد ہے ”",
    "volume": 12,
    "page": 459
  },
  {
    "topic": "بوسیدہ اور ناقص قرآنی نسخہ جات اور اوراقِ قرآنی کا مسئلہ",
    "volume": 3,
    "page": 460
  },
  {
    "topic": "عورتوں کے حجاب کی شرعی حیثیت",
    "volume": 7,
    "page": 460
  },
  {
    "topic": "قطع رحمی کرنے والے کی عبادت کے اجر سے محرومی",
    "volume": 8,
    "page": 460
  },
  {
    "topic": "اسمائے مُقدّسہ کی تعظیم",
    "volume": 13,
    "page": 460
  },
  {
    "topic": "غیر مصدقہ خبر کو پھیلانا ناجائز ہے",
    "volume": 8,
    "page": 461
  },
  {
    "topic": "مقبوضہ جموں وکشمیر میں غیر ریاستی ہندوؤں کو ریاست میں غیر منقولہ جائداد کی فروخت کا حکم اور غیر مسلموں کے تعلق کے بارے میں اسلامی تعلیمانت",
    "volume": 12,
    "page": 461
  },
  {
    "topic": "گداگری کی لعنت",
    "volume": 7,
    "page": 463
  },
  {
    "topic": "ضرورت سے زیادہ بلند آواز سے تلاوت کرنے کا حکم",
    "volume": 8,
    "page": 463
  },
  {
    "topic": "بیع اور برطانیہ کا قانون",
    "volume": 3,
    "page": 464
  },
  {
    "topic": "پنچایت یا مصالحتی کمیٹی کو کرائے میں کٹوتی کا اختیار حاصل نہیں",
    "volume": 13,
    "page": 464
  },
  {
    "topic": "یومِ میلاد النبی ﷺ کی صحیح تاریخ کا تعین",
    "volume": 4,
    "page": 465
  },
  {
    "topic": "موبائل فون پر SMS یا ٹیکسٹ میسج",
    "volume": 8,
    "page": 465
  },
  {
    "topic": "قرآن وسنت کی روشنی میں ’’تحفظ خواتین بل‘‘ کی شرعی حیثیت",
    "volume": 3,
    "page": 466
  },
  {
    "topic": "خواب میں میت کا کہنا : میں زندہ ہوں مجھے قبر سے نکالو",
    "volume": 13,
    "page": 466
  },
  {
    "topic": "معافی دینے کے لیے ہاتھ جوڑنے یا پاؤں پکڑنے کا مطالبہ کرنا ناجائز ہے",
    "volume": 7,
    "page": 467
  },
  {
    "topic": "میڈیا پر کسی کے راز فاش کرنے کا حکم",
    "volume": 8,
    "page": 467
  },
  {
    "topic": "اُمورِ خانہ داری کے بارے میں شرعی احکام",
    "volume": 13,
    "page": 467
  },
  {
    "topic": "قرضِ حسن کا مطالبہ",
    "volume": 7,
    "page": 470
  },
  {
    "topic": "مرشد یا شیخِ طریقت کا معیار",
    "volume": 8,
    "page": 470
  },
  {
    "topic": "بیوی کا کھانا پکانا کن حالات پر موقوف ہے",
    "volume": 13,
    "page": 470
  },
  {
    "topic": "محافلِ میلاد میں مخلوط اجتماعات",
    "volume": 4,
    "page": 471
  },
  {
    "topic": "بے نمازی پیر کا حکم",
    "volume": 8,
    "page": 471
  },
  {
    "topic": "تبرکاتِ انبیائے کرام کا احترام",
    "volume": 4,
    "page": 472
  },
  {
    "topic": "موبائل فون میں رِنگ ٹون کی جگہ تلاوت، اذان، درود یا نعت فیڈ کرنا",
    "volume": 8,
    "page": 473
  },
  {
    "topic": "مروجہ نعت خوانی کے حوالے سے چند سوالات",
    "volume": 8,
    "page": 473
  },
  {
    "topic": "غیر مسلموں پر صدقہ کرنے کا حکم",
    "volume": 12,
    "page": 473
  },
  {
    "topic": "قبر پر سائبان بنانے کا شرعی حکم",
    "volume": 13,
    "page": 473
  },
  {
    "topic": "نااہل کو علم سکھانے کی ممانعت کی توجیہہ",
    "volume": 13,
    "page": 474
  },
  {
    "topic": "دکان سے چوری کا ذمہ دار کون؟",
    "volume": 7,
    "page": 475
  },
  {
    "topic": "عوام کا یہ کہنا کہ ہم سب اللہ کے سامنے غریب ہیں",
    "volume": 4,
    "page": 476
  },
  {
    "topic": "نمازِ تراویح کی امامت کا معیار",
    "volume": 4,
    "page": 476
  },
  {
    "topic": "مساجد، دینی وتعلیمی اور صنعتی کاروباری اداروں میں مسلح حفاظتی انتظامات",
    "volume": 6,
    "page": 476
  },
  {
    "topic": "مدرسے کی سالانہ رپورٹ میں تصاویر کی اشاعت",
    "volume": 4,
    "page": 477
  },
  {
    "topic": "بطورِ جرمانہ وصول کی گئی رقم کا شرعی حکم",
    "volume": 7,
    "page": 479
  },
  {
    "topic": "غیر مسلم کے قبولِ اسلام کے بعد نام تبدیل کرنے کی شرعی حیثیت",
    "volume": 13,
    "page": 479
  },
  {
    "topic": "قرآن مجید کے بوسیدہ اوراق کے گودے (Pulp) کو دوبارہ استعمال میں لانے کا جواز",
    "volume": 6,
    "page": 480
  },
  {
    "topic": "قتلِ خطا میں قاتل پر کفارہ واجب ہے",
    "volume": 7,
    "page": 480
  },
  {
    "topic": "نابالغ بچوں کو دی ہوئی اشیاء کا شرعی حکم",
    "volume": 7,
    "page": 482
  },
  {
    "topic": "یوٹیوب چینل پر اشہتارات کی آمدنی",
    "volume": 13,
    "page": 482
  },
  {
    "topic": "قتلِ ناحق کا شرعی حکم",
    "volume": 3,
    "page": 485
  },
  {
    "topic": "کرائے کی ماں کی شرعی حیثیت",
    "volume": 12,
    "page": 485
  },
  {
    "topic": "غیر مسلموں کے حقوق",
    "volume": 13,
    "page": 485
  },
  {
    "topic": "عدالت میں قرآن ہاتھ میں اٹھاکر جھوٹی گواہی دینا",
    "volume": 6,
    "page": 487
  },
  {
    "topic": "ای سگریٹ کا کاروبار",
    "volume": 14,
    "page": 489
  },
  {
    "topic": "قرآن مجید پر ہاتھ رکھ کر قسم کھانا",
    "volume": 6,
    "page": 490
  },
  {
    "topic": "بالغ نو مسلم کا ختنہ",
    "volume": 6,
    "page": 491
  },
  {
    "topic": "قرض کی واپسی کس صورت میں ہونی چاہیے",
    "volume": 14,
    "page": 491
  },
  {
    "topic": "کیا استخارے سے چوری کا جرم ثابت ہوسکتا ہے؟",
    "volume": 6,
    "page": 493
  },
  {
    "topic": "غیر آلِ رسول کے لیے سید کا استعمال",
    "volume": 10,
    "page": 493
  },
  {
    "topic": "برتھ سرٹیفکیٹ میں تاریخ پیدائش کا غلط اندارج",
    "volume": 14,
    "page": 493
  },
  {
    "topic": "اسلامک سینٹر یا مسجد سے متصل اسپورٹس کلب کا انتظام",
    "volume": 14,
    "page": 494
  },
  {
    "topic": "مخنث (ہیجڑوں) سے متعلق ضروری مسائل",
    "volume": 6,
    "page": 495
  },
  {
    "topic": "صفائی کا کام معیوب نہیں ہے",
    "volume": 14,
    "page": 495
  },
  {
    "topic": "سوفٹ ویئر کے ذریعے انسانی شکل کو کارٹون میں تبدیل کرنا",
    "volume": 10,
    "page": 497
  },
  {
    "topic": "رخصتی سے قبل شوہر کے انتقال پر عدت، مہر، تقسیمِ ترکہ وغیرہ سے متعلق 12 سوالات پر مشتمل تفصیلی فتویٰ",
    "volume": 6,
    "page": 498
  },
  {
    "topic": "عورتوں کے پرفیوم لگانے کا حکم",
    "volume": 10,
    "page": 499
  },
  {
    "topic": "گالی دینا فسق ہے",
    "volume": 10,
    "page": 499
  },
  {
    "topic": "وسوسوں کو ذہن سے جھٹک دینا چاہیے",
    "volume": 14,
    "page": 499
  },
  {
    "topic": "شراب کے کاروبار کی ممانعت کا مقدمہ",
    "volume": 10,
    "page": 500
  },
  {
    "topic": "حوصلہ افزائی کے لیے بچوں کو انعام دینے میں مساوات کا حکم",
    "volume": 14,
    "page": 501
  },
  {
    "topic": "تجربے کے لیے جانوروں پر ویکسین کا استعمال",
    "volume": 12,
    "page": 502
  },
  {
    "topic": "معلّم کا حق تادیب",
    "volume": 14,
    "page": 502
  },
  {
    "topic": "پرندے پالنے کا حکم",
    "volume": 10,
    "page": 506
  },
  {
    "topic": "ہبہ میں رجوع کا مسئلہ",
    "volume": 14,
    "page": 506
  },
  {
    "topic": "روڈ انشورنس کی رقم پر کس کا استحقاق ہے؟",
    "volume": 6,
    "page": 508
  },
  {
    "topic": "قتل بالسَّبب اور اس کی دیت",
    "volume": 14,
    "page": 508
  },
  {
    "topic": "نام رکھنے سے متعلق ضروری مسائل",
    "volume": 6,
    "page": 509
  },
  {
    "topic": "تلاوتِ قرآن کے بارے میں ابتدائی قواعد",
    "volume": 10,
    "page": 510
  },
  {
    "topic": "باسی روٹی کے بارے میں شرعی حکم",
    "volume": 10,
    "page": 512
  },
  {
    "topic": "ضعیف والدہ کی کفالت",
    "volume": 14,
    "page": 513
  },
  {
    "topic": "بہو پر سسر کی خدمت فرض نہیں ہے",
    "volume": 10,
    "page": 514
  },
  {
    "topic": "نام کا شخصیت پر اثر",
    "volume": 14,
    "page": 514
  },
  {
    "topic": "تقریبات میں پابندیِ وقت کا فقدان",
    "volume": 6,
    "page": 515
  },
  {
    "topic": "حیلہ کی شرعی حیثیت",
    "volume": 10,
    "page": 515
  },
  {
    "topic": "دیوار پر قرآنی آیات لکھنا",
    "volume": 6,
    "page": 518
  },
  {
    "topic": "ارباز نام کے معنی",
    "volume": 10,
    "page": 518
  },
  {
    "topic": "حکمت و مَصلحتِ دین",
    "volume": 14,
    "page": 518
  },
  {
    "topic": "سرکاری محکمے عاقلہ بننے کی صلاحیت رکھتے ہیں",
    "volume": 6,
    "page": 519
  },
  {
    "topic": "تنوین والے کلمے کو بعد والے کلمے کے ساتھ نون لگا کر ملانا",
    "volume": 10,
    "page": 519
  },
  {
    "topic": "چھوٹے کا بڑے کو کام کے لیے کہنا",
    "volume": 10,
    "page": 520
  },
  {
    "topic": "واعظین اور مقررینِ علماء کا مانگ کر معاوضہ لینا",
    "volume": 10,
    "page": 523
  },
  {
    "topic": "بچوں کو حسنِ سلوک کی تلقین کریں",
    "volume": 6,
    "page": 526
  },
  {
    "topic": "مدرسہ اور طالب علم کے درمیان معاہدے کا خلاصہ",
    "volume": 10,
    "page": 526
  },
  {
    "topic": "دس محرم اور نیاز کی تقسیم",
    "volume": 6,
    "page": 527
  },
  {
    "topic": "غیر مسلم کے سلام کا جواب",
    "volume": 6,
    "page": 530
  },
  {
    "topic": "اجارہ پر قبرستان کے لیے حاصل کردہ زمین کا حکم",
    "volume": 10,
    "page": 533
  },
  {
    "topic": "اشارات برائے یادداشت وحوالہ",
    "volume": 6,
    "page": 536
  },
  {
    "topic": "ڈی این اے کے بارے میں چشم کشا حقائق",
    "volume": 10,
    "page": 546
  },
  {
    "topic": "حرمت نکاح",
    "volume": 3,
    "page": 187
  },
  {
    "topic": "مہر مؤجل اور معجّل کا حکم",
    "volume": 3,
    "page": 187
  },
  {
    "topic": "شوہر کے کلمات کفر کہنے سے نکاح باطل ہوجاتا ہے",
    "volume": 3,
    "page": 188
  },
  {
    "topic": "ارتداد سے لازم شدہ مہر ساقط نہیں ہوتا",
    "volume": 9,
    "page": 191
  },
  {
    "topic": "دو بہنوں سے نکاح",
    "volume": 9,
    "page": 193
  },
  {
    "topic": "نابالغہ کا نکاح",
    "volume": 9,
    "page": 194
  },
  {
    "topic": "عقد ثانی کے لیے پہلی بیوی کی اجازت کا مسئلہ",
    "volume": 3,
    "page": 195
  },
  {
    "topic": "نکاح پر نکاح کا شرعی حکم",
    "volume": 3,
    "page": 196
  },
  {
    "topic": "محرمات کے بارے میں شرعی حکم",
    "volume": 9,
    "page": 196
  },
  {
    "topic": "ستر وحجاب کا فرق",
    "volume": 9,
    "page": 197
  },
  {
    "topic": "صورت یا رنگ کی مشابہت نہ ہونے کی وجہ سے نسب میں شک کرنا",
    "volume": 9,
    "page": 201
  },
  {
    "topic": "مہر مؤجل یا معجّل کی شرعی حیثیت",
    "volume": 3,
    "page": 206
  },
  {
    "topic": "جہیز وبری کے سامان کی ملکیت کا مسئلہ اور ایام عدت کا نفقہ",
    "volume": 3,
    "page": 211
  },
  {
    "topic": "بیوی کا الگ جائے رہائش کا حق",
    "volume": 3,
    "page": 213
  },
  {
    "topic": "مہر کا معاہدہ اور مہر کی رقم میں اختلاف",
    "volume": 3,
    "page": 215
  },
  {
    "topic": "سالی اور دیور سے بدکاری کے نکاح پر اثرات",
    "volume": 8,
    "page": 217
  },
  {
    "topic": "عورت اپنے والدین سے ملاقات کے لیے کتنے وقت کے بعد جائے",
    "volume": 8,
    "page": 219
  },
  {
    "topic": "مطلقہ لڑکی کو کنواری ظاہر کرنے سے نکاح پر اثر نہیں پڑتا",
    "volume": 8,
    "page": 220
  },
  {
    "topic": "مجلسِ نکاح کا ایک ہونا شرط ہے",
    "volume": 7,
    "page": 221
  },
  {
    "topic": "گواہوں کی موجودگی میں براہِ راست ایجاب وقبول سے نکاح صحیح ہے",
    "volume": 8,
    "page": 221
  },
  {
    "topic": "محض رشتہ طے کرنے سے نکاح نہیں ہوجاتا",
    "volume": 7,
    "page": 222
  },
  {
    "topic": "نکاح بدستور قائم ہے",
    "volume": 7,
    "page": 223
  },
  {
    "topic": "نکاح میں تفویضِ اختیار",
    "volume": 8,
    "page": 223
  },
  {
    "topic": "بلوغت سے قبل نکاح کا شرعی حکم",
    "volume": 7,
    "page": 224
  },
  {
    "topic": "لے پالک کے نکاح کے وقت ولدیت کا مسئلہ",
    "volume": 3,
    "page": 226
  },
  {
    "topic": "پیغامِ نکاح پر پیغام دینا",
    "volume": 7,
    "page": 226
  },
  {
    "topic": "جرگے کا فیصلہ",
    "volume": 8,
    "page": 227
  },
  {
    "topic": "مہر معاف کرنے کی شرعی حیثیت",
    "volume": 7,
    "page": 228
  },
  {
    "topic": "منکوحۃ سے دوبارہ ایجاب وقبول",
    "volume": 7,
    "page": 229
  },
  {
    "topic": "محض علیحدہ رہنے سے نکاح ختم نہیں ہوجاتا",
    "volume": 8,
    "page": 229
  },
  {
    "topic": "مہر کی مقدار میں اضافہ",
    "volume": 7,
    "page": 231
  },
  {
    "topic": "بیوی کے حقوق اور والدین کی اطاعت",
    "volume": 8,
    "page": 231
  },
  {
    "topic": "اخیافی (ماں شریک) ماموں سے نکاح حرام ہے",
    "volume": 7,
    "page": 232
  },
  {
    "topic": "دعوتِ ولیمہ کی شرعی حیثیت",
    "volume": 7,
    "page": 234
  },
  {
    "topic": "حرمتِ رضاعت",
    "volume": 4,
    "page": 235
  },
  {
    "topic": "لاوارث بچے کی ولدیت کا مسئلہ",
    "volume": 3,
    "page": 236
  },
  {
    "topic": "ثبوتِ رضاعت",
    "volume": 4,
    "page": 237
  },
  {
    "topic": "کفارۂ ظہار",
    "volume": 8,
    "page": 237
  },
  {
    "topic": "عقدِ نکاح کے بعد رخصتی میں تاخیر وازدواجی حیثیت",
    "volume": 3,
    "page": 238
  },
  {
    "topic": "زوجِ متعنت",
    "volume": 3,
    "page": 238
  },
  {
    "topic": "خالہ کے نکاح میں رہتے ہوئے اس کی بھانجی سے نکاح حرام ہے",
    "volume": 4,
    "page": 238
  },
  {
    "topic": "پھوپھی زاد بھائی کی بیٹی سے نکاح کا حکم",
    "volume": 7,
    "page": 238
  },
  {
    "topic": "مہر زیورات کی صورت میں ادا کیا جاسکتا ہے",
    "volume": 7,
    "page": 239
  },
  {
    "topic": "مطلقہ بیوی کی عدت کے اندر اس کی بہن سے نکاح",
    "volume": 8,
    "page": 239
  },
  {
    "topic": "محض لوگوں کی بدگمانی سے زنا ثابت نہیں ہوتا",
    "volume": 8,
    "page": 240
  },
  {
    "topic": "خفیہ نکاح کا شرعی حکم",
    "volume": 1,
    "page": 241
  },
  {
    "topic": "کیا یہ نکاح جائز ہے",
    "volume": 2,
    "page": 241
  },
  {
    "topic": "غیر کتابیہ کافرہ عورت سے نکاح",
    "volume": 2,
    "page": 241
  },
  {
    "topic": "حرمتِ مصاہرت",
    "volume": 4,
    "page": 241
  },
  {
    "topic": "ٹیلی فون پر نکاح",
    "volume": 1,
    "page": 242
  },
  {
    "topic": "دلہن کا پالکی میں بٹھا کر لے جانا",
    "volume": 2,
    "page": 242
  },
  {
    "topic": "برادری سے باہر نکاح کا حکم",
    "volume": 8,
    "page": 242
  },
  {
    "topic": "سول میرج کی شرعی حیثیت",
    "volume": 1,
    "page": 243
  },
  {
    "topic": "محرم وصفر میں نکاح",
    "volume": 1,
    "page": 243
  },
  {
    "topic": "مایوں اور مہندی کی شرعی حیثیت",
    "volume": 1,
    "page": 244
  },
  {
    "topic": "قرآن میں نکاح کا لکھنا",
    "volume": 1,
    "page": 244
  },
  {
    "topic": "قادیانی مرد سے مسلمان عورت کا نکاح",
    "volume": 1,
    "page": 244
  },
  {
    "topic": "بھابھی اور چچی محرم نہیں",
    "volume": 2,
    "page": 244
  },
  {
    "topic": "تہمتِ زنا اور حدود کے شرعی احکام",
    "volume": 8,
    "page": 244
  },
  {
    "topic": "تجدید ایمان اور تجدید نکاح",
    "volume": 1,
    "page": 245
  },
  {
    "topic": "بیوی کا شوہر سے یہ کہنا کہ میرا تم سے کوئی رشتہ نہیں",
    "volume": 2,
    "page": 245
  },
  {
    "topic": "مسئلہ رضاعت",
    "volume": 2,
    "page": 245
  },
  {
    "topic": "ماں کو رضاعت پر مجبور کرنا",
    "volume": 2,
    "page": 245
  },
  {
    "topic": "نامناسب حرکت",
    "volume": 1,
    "page": 246
  },
  {
    "topic": "مہر کی شرعی مقدار",
    "volume": 1,
    "page": 246
  },
  {
    "topic": "حرمت رضاعت کا ایک پیچیدہ مسئلہ",
    "volume": 2,
    "page": 246
  },
  {
    "topic": "سوتیلی بیٹی سے نکاح",
    "volume": 3,
    "page": 246
  },
  {
    "topic": "حرمتِ مصاہرت ثابت نہیں",
    "volume": 4,
    "page": 246
  },
  {
    "topic": "حضور ﷺ اور حضرت خدیجہ کا خطبۂ نکاح",
    "volume": 1,
    "page": 247
  },
  {
    "topic": "جہیز کا سامان ضائع ہونے کی صورت میں تاوان نہیں",
    "volume": 8,
    "page": 247
  },
  {
    "topic": "شادی اور تقریبات پر فائرنگ اور آتش بازی",
    "volume": 4,
    "page": 248
  },
  {
    "topic": "رضاعی بہن سے نکاح کا شرعی حکم",
    "volume": 8,
    "page": 248
  },
  {
    "topic": "جبری نکاح کا حکم",
    "volume": 4,
    "page": 250
  },
  {
    "topic": "ظہار کا معنی اور احکام",
    "volume": 8,
    "page": 250
  },
  {
    "topic": "منگنی کے بعد لڑکے اور لڑکی کا آپس میں بلا تکلف بے حجاب ملاقاتیں کرنا",
    "volume": 2,
    "page": 252
  },
  {
    "topic": "جعلی نکاح نامے کی حیثیت",
    "volume": 4,
    "page": 252
  },
  {
    "topic": "نکاح سے قبل ظہار نہیں",
    "volume": 8,
    "page": 252
  },
  {
    "topic": "جہیز وبری کے سامان کی ملکیت کا مسئلہ",
    "volume": 2,
    "page": 253
  },
  {
    "topic": "غیر رجسٹرڈ نکاح کی شرعی حیثیت",
    "volume": 4,
    "page": 253
  },
  {
    "topic": "میاں بیوی کے ایک دوسرے پر الزامات لگانے سے از خود نکاح باطل نہیں ہوتا",
    "volume": 4,
    "page": 254
  },
  {
    "topic": "میاں بیوی کا ایک دوسرے کو ماں، بہن ، باپ ،بھائی کہنے سے ظہار نہیں ہوتا",
    "volume": 8,
    "page": 254
  },
  {
    "topic": "عاقدین گونگے بہرے ہوں تو ایجاب وقبول کی صورت",
    "volume": 8,
    "page": 256
  },
  {
    "topic": "نکاح کے وقت ولدیت میں سوتیلے باپ کا نام لینا، نکاح نامے میں سوتیلے باپ کا نام لکھنا ،ایسے نکاح کا شرعی حکم",
    "volume": 2,
    "page": 257
  },
  {
    "topic": "منگنی وعدۂ نکاح ہے، نکاح نہیں ہے",
    "volume": 8,
    "page": 259
  },
  {
    "topic": "حرمتِ نکاح",
    "volume": 4,
    "page": 260
  },
  {
    "topic": "حقیقی بھائی کی رضاعی بہن سے نکاح",
    "volume": 4,
    "page": 261
  },
  {
    "topic": "شوہر کے انتقال کی خبر سننے کے بعد عدت گزار کر عورت کا دوسرا نکاح کرنا اور پھر پہلے شوہر کی واپسی",
    "volume": 2,
    "page": 263
  },
  {
    "topic": "لا علمی میں بہن بھائی کا نکاح",
    "volume": 4,
    "page": 263
  },
  {
    "topic": "تحلیلِ شرعی کے لیے زوجِ غیر کے ساتھ نکاحِ صحیح ضروری ہے",
    "volume": 4,
    "page": 263
  },
  {
    "topic": "عنین کا حکم",
    "volume": 4,
    "page": 266
  },
  {
    "topic": "حرمتِ مصاہرت زنا سے بھی ثابت ہوتی ہے",
    "volume": 4,
    "page": 268
  },
  {
    "topic": "حضرت محمد ﷺ اور حضرت خدیجہ کا نکاح",
    "volume": 6,
    "page": 271
  },
  {
    "topic": "نکاح میں ایک بار ایجاب وقبول کافی ہے",
    "volume": 6,
    "page": 273
  },
  {
    "topic": "خطبۂ نکاح کب پڑھا جائے اور کیسے (کھڑے ہوکر یا بیٹھ کر)",
    "volume": 6,
    "page": 273
  },
  {
    "topic": "ٹیلی فون پر لڑکی اور لڑکے کا ایجاب وقبول",
    "volume": 6,
    "page": 274
  },
  {
    "topic": "حقیقی چچا، رضاعی بھائی اور اس کی اولاد سے نکاح",
    "volume": 6,
    "page": 277
  },
  {
    "topic": "پسند کی شادی اور کفو کا مسئلہ",
    "volume": 12,
    "page": 277
  },
  {
    "topic": "حقیقی خالہ کی نواسی سے نکاح جائز ہے",
    "volume": 6,
    "page": 278
  },
  {
    "topic": "سالی کی نواسی سے نکاح جائز نہیں",
    "volume": 6,
    "page": 279
  },
  {
    "topic": "بیوی کے انتقال کے بعد اس کی بہن سے نکاح جائز ہے",
    "volume": 6,
    "page": 281
  },
  {
    "topic": "کلمۂ کفر نکاح پر اثر",
    "volume": 12,
    "page": 281
  },
  {
    "topic": "حرمتِ نکاح کا ایک مسئلہ",
    "volume": 6,
    "page": 282
  },
  {
    "topic": "پہلے شوہر سے طلاق یا خلع لیے بغیر دوسرے نکاح کا حکم",
    "volume": 6,
    "page": 283
  },
  {
    "topic": "عیسائی عورت سے نکاح کا حکم",
    "volume": 6,
    "page": 285
  },
  {
    "topic": "ہبہ اور خلع کا مسئلہ",
    "volume": 6,
    "page": 290
  },
  {
    "topic": "غیر مدخولہ عورت کا مہر",
    "volume": 6,
    "page": 293
  },
  {
    "topic": "عدت کے اندر نکاح کے بارے میں عدالتِ عالیہ کا فیصلہ اور اس کے بارے میں تحفظات",
    "volume": 13,
    "page": 293
  },
  {
    "topic": "زیور اور مہر کا فرق",
    "volume": 6,
    "page": 294
  },
  {
    "topic": "عورت کا رقم دے کر خریدنا",
    "volume": 6,
    "page": 295
  },
  {
    "topic": "بیوی کا علیحدگی کا مطالبہ کرنا",
    "volume": 6,
    "page": 296
  },
  {
    "topic": "عورت کے لیے کھانا پکانا ان کے حالات پر موقوف ہے",
    "volume": 6,
    "page": 297
  },
  {
    "topic": "خاتون کے پہلے شوہر سے اولاد کی کفالت دوسرے شوہر کی ذمے داری نہیں ہے",
    "volume": 6,
    "page": 300
  },
  {
    "topic": "اجباری شادی کا شرعی حکم",
    "volume": 13,
    "page": 301
  },
  {
    "topic": "حق پرورش کا استحقاق کسے حاصل ہے",
    "volume": 6,
    "page": 305
  },
  {
    "topic": "قطع رحمی حرام ہے",
    "volume": 6,
    "page": 307
  },
  {
    "topic": "وڈیو لنک سے نکاح کے جواز کا مسئلہ",
    "volume": 13,
    "page": 311
  },
  {
    "topic": "شادی کی رسم",
    "volume": 5,
    "page": 313
  },
  {
    "topic": "بیوی کے علیحدہ رہنے سے از خود نکاح ختم نہیں ہوتا",
    "volume": 12,
    "page": 313
  },
  {
    "topic": "مایوں، مہندی اور سہرا بندی کی رسومات کی شرعی حیثیت",
    "volume": 5,
    "page": 315
  },
  {
    "topic": "تہمت کی بنا پر نکاح فسخ نہیں ہوگا",
    "volume": 13,
    "page": 315
  },
  {
    "topic": "مہر مقررہ مقدار سے زیادہ ہوسکتا ہے",
    "volume": 5,
    "page": 316
  },
  {
    "topic": "جہیز کی ٹوٹ پھوٹ پر تاوان کس کے ذمے ہے",
    "volume": 13,
    "page": 316
  },
  {
    "topic": "حُرمت نکاح کا ایک مسئلہ",
    "volume": 13,
    "page": 316
  },
  {
    "topic": "خالہ کے ساتھ بھانجی کو نکاح میں جمع کرنا حرام ہے",
    "volume": 13,
    "page": 318
  },
  {
    "topic": "مہر شرعی کیا ہے",
    "volume": 5,
    "page": 319
  },
  {
    "topic": "ایک شخص کے بیٹے کا اس کی مطلقہ کے دوسرے شوہر سے بیٹی سے نکاح",
    "volume": 5,
    "page": 321
  },
  {
    "topic": "نکاحِ شغار یا وٹّا سٹّا",
    "volume": 5,
    "page": 322
  },
  {
    "topic": "مذاق میں نکاح",
    "volume": 13,
    "page": 322
  },
  {
    "topic": "خطبۂ نکاح کے بغیر نکاح کا انعقاد",
    "volume": 5,
    "page": 324
  },
  {
    "topic": "باپ کا بیٹے کی خواہر نسبتی (سالی) سے نکاح",
    "volume": 5,
    "page": 325
  },
  {
    "topic": "بیٹی کے ساتھ بدفعلی کرنے سے بیوی حرام ہوجاتی ہے",
    "volume": 5,
    "page": 326
  },
  {
    "topic": "بیوی کی بھتیجی کے ساتھ زنا سے نکاح باطل نہیں ہوتا",
    "volume": 5,
    "page": 327
  },
  {
    "topic": "دو بیویوں کے درمیان باری مقرر کرنا",
    "volume": 5,
    "page": 328
  },
  {
    "topic": "دوسری شادی کی بابت شرعی حکم اور مسائل",
    "volume": 5,
    "page": 331
  },
  {
    "topic": "محرم الحرام اور صفر المظفر میں نکاح کا حکم",
    "volume": 10,
    "page": 331
  },
  {
    "topic": "نکاح کے بعد رخصتی کب ضروری ہے",
    "volume": 11,
    "page": 331
  },
  {
    "topic": "دودھ پلانے والی ماں کے بیٹے یا پوتے سے نکاح نہیں ہو سکتا",
    "volume": 11,
    "page": 331
  },
  {
    "topic": "دو بیویوں کے درمیان ایام کی تقسیم",
    "volume": 5,
    "page": 332
  },
  {
    "topic": "دوسری بیوی کو طلاق دلانے کے جتن کرنا",
    "volume": 5,
    "page": 333
  },
  {
    "topic": "نکاح سے متعلق جاہلیت پر مبنی غیر شرعی رسوم (غگ، قرآن سے نکاح، عام مطلقہ اور متبنیّٰ کی مطلقہ سے نکاح)",
    "volume": 10,
    "page": 333
  },
  {
    "topic": "دوسری بیوی سے ملنے سے روکنا",
    "volume": 5,
    "page": 334
  },
  {
    "topic": "رضاعت کی مدت دو یا ڈھائی سال",
    "volume": 11,
    "page": 334
  },
  {
    "topic": "شوہر کے فرائض",
    "volume": 5,
    "page": 335
  },
  {
    "topic": "نافرمان ہو کر گھر سے چلی جانے والی بیوی کا نفقہ شوہر پر لازم نہیں ہے",
    "volume": 11,
    "page": 336
  },
  {
    "topic": "نفقہ شوہر کی ذمہ داری ہے",
    "volume": 14,
    "page": 336
  },
  {
    "topic": "بیوی کے دائمی مریض ہونے کی صورت میں دوسری شادی کا حق",
    "volume": 5,
    "page": 339
  },
  {
    "topic": "جہیز کی شرعی حیثیت",
    "volume": 10,
    "page": 339
  },
  {
    "topic": "بہو سے زنا",
    "volume": 11,
    "page": 339
  },
  {
    "topic": "فسخِ نکاح کی صورت",
    "volume": 14,
    "page": 339
  },
  {
    "topic": "خلع کے بعد دوبارہ نکاح کا حکم",
    "volume": 5,
    "page": 340
  },
  {
    "topic": "نکاح میں لڑکے اور لڑکی کی رضامندی ضروری ہے",
    "volume": 5,
    "page": 341
  },
  {
    "topic": "خُسر محرم ہے",
    "volume": 11,
    "page": 342
  },
  {
    "topic": "غیر مسلم عورت کے قبول نکاح کی شرعی حیثیت",
    "volume": 14,
    "page": 342
  },
  {
    "topic": "نکاح پر نکاح کا حکم",
    "volume": 5,
    "page": 343
  },
  {
    "topic": "بیوی کی بد مزاجی پر صبر کیجیے",
    "volume": 10,
    "page": 343
  },
  {
    "topic": "باپ کی بیوی کی (سابق شوہر سے) بیٹی سے بیٹے کا نکاح",
    "volume": 5,
    "page": 344
  },
  {
    "topic": "عدت کے دوران نکاح کا حکم",
    "volume": 14,
    "page": 344
  },
  {
    "topic": "بالغہ لڑکی کی رضا مندی کے بغیر نکاح منعقد نہیں ہوتا",
    "volume": 5,
    "page": 345
  },
  {
    "topic": "بلوغت کے بعد نابالغ لڑکی کے نکاح کے فسخ کا مسئلہ",
    "volume": 5,
    "page": 347
  },
  {
    "topic": "ماں شریک بھائی نامحرم نہیں ہے",
    "volume": 10,
    "page": 347
  },
  {
    "topic": "یہ نکاح منعقد نہیں ہوا",
    "volume": 14,
    "page": 347
  },
  {
    "topic": "مسئلہ خیارِ بلوغ کی وضاحت",
    "volume": 5,
    "page": 348
  },
  {
    "topic": "سیدہ کا غیر سید سے نکاح",
    "volume": 10,
    "page": 349
  },
  {
    "topic": "نافرمان بیوی",
    "volume": 5,
    "page": 351
  },
  {
    "topic": "یہ نکاح منعقد نہیں ہوا",
    "volume": 10,
    "page": 351
  },
  {
    "topic": "ڈراموں میں فرضی کرداروں کے درمیان نکاح و طلاق کا شرعی حکم",
    "volume": 14,
    "page": 351
  },
  {
    "topic": "ولیمہ کی شرعی حیثیت اور برا ولیمہ",
    "volume": 10,
    "page": 353
  },
  {
    "topic": "خاتون کے پہلے شوہر سے اولاد کی کفالت دوسرے شوہر کی ذمے داری نہیں ہے",
    "volume": 5,
    "page": 354
  },
  {
    "topic": "مہر لازم ہے",
    "volume": 10,
    "page": 357
  },
  {
    "topic": "مفقود الخبر کی زوجہ کب تک اس کا انتظار کرے",
    "volume": 14,
    "page": 357
  },
  {
    "topic": "برادری سے باہر نکاح کا حکم",
    "volume": 5,
    "page": 359
  },
  {
    "topic": "جہیز کی شرعی حیثیت کے بارے میں حکومت سندھ کا استفسار اور سزا کے نفاذ کی سفارشات",
    "volume": 10,
    "page": 359
  },
  {
    "topic": "شرعاً کفو کا معیار مرد کی جانب سے معتبر ہوتا ہے",
    "volume": 5,
    "page": 361
  },
  {
    "topic": "رضاعت کا رشتہ صرف ایک طرف سے متعدی ہوتا ہے",
    "volume": 5,
    "page": 363
  },
  {
    "topic": "والدین کی لاعلمی میں کیے جانے والے نکاح کا شرعی حکم",
    "volume": 14,
    "page": 363
  },
  {
    "topic": "لاپتا بیوی کی بہن سے نکاح",
    "volume": 14,
    "page": 365
  },
  {
    "topic": "جنّات سے نکاح کرنا",
    "volume": 10,
    "page": 366
  },
  {
    "topic": "نکاح صحیح منعقد ہوگیا",
    "volume": 14,
    "page": 367
  },
  {
    "topic": "دائمی حرمت اور عارضی حرمت نکاح میں فرق",
    "volume": 14,
    "page": 369
  },
  {
    "topic": "مہر کی ادائی کیسے کی جائے",
    "volume": 14,
    "page": 372
  },
  {
    "topic": "حُرمتِ مصاہرت کا ایک مسئلہ",
    "volume": 14,
    "page": 373
  },
  {
    "topic": "بیوی کی وفات کے بعد اس کی بہن سے شادی کرنا",
    "volume": 10,
    "page": 376
  },
  {
    "topic": "مسئلہ رضاعت",
    "volume": 3,
    "page": 317
  },
  {
    "topic": "شک سے حرمت رضاعت ثابت نہیں ہوتی",
    "volume": 3,
    "page": 317
  },
  {
    "topic": "رضاعی بھتیجی سے نکاح جائز نہیں",
    "volume": 3,
    "page": 319
  },
  {
    "topic": "رضاعت کا مرضعہ کے اقرار یا گواہوں سے ہوگا",
    "volume": 3,
    "page": 321
  },
  {
    "topic": "مسئلہ رضاعت",
    "volume": 3,
    "page": 322
  },
  {
    "topic": "تیس رمضان کو دن کے وقت چاند نظر آنے سے متعلق شرعی مسائل، رویتِ ہلال سے متعلق چند اہم مسائل",
    "volume": 6,
    "page": 211
  },
  {
    "topic": "مسئلہ رویتِ ہلال",
    "volume": 5,
    "page": 227
  },
  {
    "topic": "اہلِ علم، اہل فکر ونظر اور اہل وطن کی خدمت میں چند گزارشات",
    "volume": 5,
    "page": 241
  },
  {
    "topic": "سعودی عرب کے ساتھ رمضان وعیدین کیوں نہیں؟",
    "volume": 5,
    "page": 250
  },
  {
    "topic": "دعاء اذان سے پہلے درود شریف",
    "volume": 3,
    "page": 43
  },
  {
    "topic": "دورانِ نماز موبائل فون بجنے کا شرعی حکم",
    "volume": 8,
    "page": 43
  },
  {
    "topic": "اذان سے قبل یا بعد با آواز بلند درود وسلام پڑھنا",
    "volume": 3,
    "page": 44
  },
  {
    "topic": "نماز کے دوران موبائل فون آف کرنا",
    "volume": 8,
    "page": 45
  },
  {
    "topic": "عورتوں کی نماز کی ہیئت",
    "volume": 9,
    "page": 45
  },
  {
    "topic": "عمامہ کے بغیر پرھی جانے والی نماز کا حکم",
    "volume": 8,
    "page": 46
  },
  {
    "topic": "رسول اللہ ﷺکے بذات خود اذان دینے کا ثبوت",
    "volume": 3,
    "page": 47
  },
  {
    "topic": "ٹوپی پہن کر نماز پڑھنا مکروہ نہیں ہے",
    "volume": 8,
    "page": 48
  },
  {
    "topic": "نماز میں عورت کے سجدہ کرنے کا طریقہ",
    "volume": 9,
    "page": 48
  },
  {
    "topic": "اذان کا جواب دینے کا طریقہ",
    "volume": 9,
    "page": 49
  },
  {
    "topic": "معذور پر نماز جمعہ فرض نہیں ہے",
    "volume": 3,
    "page": 50
  },
  {
    "topic": "نمازوں میں سورت مقرر کرلینا",
    "volume": 8,
    "page": 50
  },
  {
    "topic": "نماز کے دونوں سجدوں کی شرعی حیثیت",
    "volume": 3,
    "page": 51
  },
  {
    "topic": "ایک سے زائد اذان کا جواب دینا",
    "volume": 9,
    "page": 51
  },
  {
    "topic": "نماز میں سلام پھیرنے کی شرعی حیثیت",
    "volume": 8,
    "page": 52
  },
  {
    "topic": "صلوٰۃ کی اہانت",
    "volume": 9,
    "page": 52
  },
  {
    "topic": "فاسق امامت کا اہل نہیں",
    "volume": 3,
    "page": 53
  },
  {
    "topic": "طلوع آفتاب سے پہلے نماز عید",
    "volume": 4,
    "page": 53
  },
  {
    "topic": "قیام کے دوران دونوں قدموں کا درمیانی فاصلہ",
    "volume": 8,
    "page": 53
  },
  {
    "topic": "نمازِ تراویح کی امامت کا حکم",
    "volume": 8,
    "page": 54
  },
  {
    "topic": "نماز کے اندر قراءت میں غلطی پر امام کو لقمہ دینا",
    "volume": 3,
    "page": 55
  },
  {
    "topic": "تارکِ صلوٰۃ کا شرعی حکم",
    "volume": 4,
    "page": 55
  },
  {
    "topic": "نمازِ ظہر کا وقت",
    "volume": 8,
    "page": 55
  },
  {
    "topic": "نمازوں کی قضا",
    "volume": 9,
    "page": 55
  },
  {
    "topic": "باب الاذان ، دعا بعد الاذان ودعا کے کلمات",
    "volume": 1,
    "page": 57
  },
  {
    "topic": "وقتِ زوال کتنی دیر تک رہتا ہے",
    "volume": 8,
    "page": 58
  },
  {
    "topic": "طہر کے پہلے کی چار سنتیں چھوٹ جائیں تو کب پڑھے ؟",
    "volume": 4,
    "page": 59
  },
  {
    "topic": "مختلف طرقِ قراءت پر مشتمل قرآن مجید کے نسخوں کی طباعت",
    "volume": 7,
    "page": 59
  },
  {
    "topic": "مسجد کے عملے کی رہائش مصالحِ مسجد میں سے ہے",
    "volume": 9,
    "page": 59
  },
  {
    "topic": "فرسٹ فلور پر نماز با جماعت کا حکم اور گراؤنڈ فلور پر نمازیوں کا جماعت میں شامل ہونا",
    "volume": 3,
    "page": 60
  },
  {
    "topic": "نماز عصر کا وقت",
    "volume": 8,
    "page": 60
  },
  {
    "topic": "معذور کے لیے اشارے سے رکوع و سجود کرنا",
    "volume": 3,
    "page": 61
  },
  {
    "topic": "جہاں زمین کے نیچے سیوریج لائن گزررہی ہے ، اس جگہ پر نماز پڑھنا",
    "volume": 4,
    "page": 62
  },
  {
    "topic": "بالغ بے ریش کی امامت کا حکم",
    "volume": 8,
    "page": 62
  },
  {
    "topic": "نماز کی نیت اور تکبیرِ تحریمہ کا طریقہ",
    "volume": 9,
    "page": 62
  },
  {
    "topic": "معذور کے لیے اشارے سے رکوع و سجود کرنا",
    "volume": 3,
    "page": 63
  },
  {
    "topic": "قعدۂ اولیٰ بھول کر کھڑا ہوجانا",
    "volume": 3,
    "page": 63
  },
  {
    "topic": "مسجد میں اپنے لیے اور دوسرے کےلیے جگہ مختص کرنا یا کپڑا رکھ کر محفوظ کرنا",
    "volume": 4,
    "page": 63
  },
  {
    "topic": "التحیات پوری پڑھ کر امام کی متابعت کرے",
    "volume": 8,
    "page": 63
  },
  {
    "topic": "بے وضو شخص کی اذان کا حکم",
    "volume": 9,
    "page": 63
  },
  {
    "topic": "نماز میں اقامت کہنے والے کا امام بننا یا امام کا خود ہی اقامت کہہ دینا",
    "volume": 4,
    "page": 64
  },
  {
    "topic": "نماز کے بعد امام کے بیٹھنے کی ہیئت",
    "volume": 9,
    "page": 64
  },
  {
    "topic": "تثویب کیا ہے؟",
    "volume": 1,
    "page": 65
  },
  {
    "topic": "بیت الخلاء میں اذان کا جواب",
    "volume": 1,
    "page": 65
  },
  {
    "topic": "دورانِ نماز موبائل فون بجنے کا شرعی حکم",
    "volume": 7,
    "page": 65
  },
  {
    "topic": "نماز میں سلام پھیرتے وقت ”السلام علیکم کہنا چاہے “",
    "volume": 9,
    "page": 65
  },
  {
    "topic": "خطبے کے دوران کلام و نشست کے آداب",
    "volume": 1,
    "page": 66
  },
  {
    "topic": "نماز کی نیت میں تاخیر",
    "volume": 1,
    "page": 66
  },
  {
    "topic": "چلتی ہوئی ٹرین اور ہوائی جہاز میں نماز پڑھنے کا شرعی حکم",
    "volume": 7,
    "page": 66
  },
  {
    "topic": "رکوع اور سجود میں کتنی دیر ٹھہرے",
    "volume": 1,
    "page": 67
  },
  {
    "topic": "تشہد میں انگشت شہادت سے اشارہ کرنا",
    "volume": 1,
    "page": 67
  },
  {
    "topic": "مسجد میں لڑائی جھگڑے اور شور و شغب کا حکم",
    "volume": 3,
    "page": 67
  },
  {
    "topic": "امام یا مؤذن کا غیر شادی شدہ ہونا",
    "volume": 4,
    "page": 67
  },
  {
    "topic": "مسبوق مقتدی تشہُّد میں شامل ہو تو کیا کرے",
    "volume": 6,
    "page": 67
  },
  {
    "topic": "سجدۂ سہو کب واجب ہوتا ہے",
    "volume": 8,
    "page": 67
  },
  {
    "topic": "امام کا اقامت سے پہلے مصلّٰی پر بیٹھنا ضروری نہیں ہے",
    "volume": 9,
    "page": 67
  },
  {
    "topic": "نمازی امام کو رکوع میں پائے تو کیا کرے؟",
    "volume": 1,
    "page": 68
  },
  {
    "topic": "ایک مسجد میں تراویح کی دو جماعتیں",
    "volume": 3,
    "page": 68
  },
  {
    "topic": "تراویح کی امامت کا استحقاق",
    "volume": 4,
    "page": 68
  },
  {
    "topic": "مسجد میں سنتوں کے درمیان جماعت کے دوران نمازی کھڑے نہ ہوں",
    "volume": 7,
    "page": 68
  },
  {
    "topic": "امام کا سنتِ غیر مؤکدہ کا التزام نہ کرنا",
    "volume": 9,
    "page": 68
  },
  {
    "topic": "نابالغ بچے کی امامت",
    "volume": 1,
    "page": 69
  },
  {
    "topic": "سورۃ الکوثر کی صرف دو آیتیں پڑھنا",
    "volume": 1,
    "page": 69
  },
  {
    "topic": "نماز قصر کی بابت ایک مفتی صاحب کا فتویٰ",
    "volume": 3,
    "page": 69
  },
  {
    "topic": "جسمانی نقص سے امامت میں فرق",
    "volume": 4,
    "page": 69
  },
  {
    "topic": "فرض میں تیسری ، چوتھی رکعت میں فاتحہ کے بعد سورت پڑھنا",
    "volume": 8,
    "page": 69
  },
  {
    "topic": "نماز میں قراءت (قرآن کی لفظاً ادائیگی) فرض ہے",
    "volume": 6,
    "page": 70
  },
  {
    "topic": "فرض کی پانچویں رکعت پڑھنے کے بعد نماز کا حکم",
    "volume": 7,
    "page": 70
  },
  {
    "topic": "سجدۂ سہو اور اس کا طریقہ",
    "volume": 8,
    "page": 70
  },
  {
    "topic": "سجدۂ سہو سے متعلق احادیث",
    "volume": 8,
    "page": 70
  },
  {
    "topic": "نابینا کی امامت",
    "volume": 4,
    "page": 71
  },
  {
    "topic": "رکوع اور سجدے میں تسبیحات کے ساتھ دعائیں پڑھنا",
    "volume": 6,
    "page": 71
  },
  {
    "topic": "عادی طور پر ہیر پھیر کا مرتکب ہونا",
    "volume": 9,
    "page": 71
  },
  {
    "topic": "نمازِ قصر میں سفر کی شرعی مقدار",
    "volume": 3,
    "page": 72
  },
  {
    "topic": "مسجد میں داخل ہوتے وقت اونچی آواز میں کلام کرنا",
    "volume": 2,
    "page": 73
  },
  {
    "topic": "سرکاری زمین پر بغیر لیز یا الاٹمنٹ مسجد کی تعمیر اور شرعی حیثیت",
    "volume": 3,
    "page": 73
  },
  {
    "topic": "امام کی رہائش",
    "volume": 4,
    "page": 73
  },
  {
    "topic": "نماز میں خلافِ ترتیب قراءت کا حکم",
    "volume": 4,
    "page": 74
  },
  {
    "topic": "مسجد سے نمازیوں کو روکنے کا حکم",
    "volume": 9,
    "page": 74
  },
  {
    "topic": "درود وسلام اور اذان کے درمیان اعلان کرنے کا حکم",
    "volume": 3,
    "page": 75
  },
  {
    "topic": "اذان کے بعد \"تثویب \" (اعلان ثانی) کا جواز",
    "volume": 5,
    "page": 75
  },
  {
    "topic": "ایک رکن تاخیر کی مقدار",
    "volume": 8,
    "page": 75
  },
  {
    "topic": "نمازی کے آگے سے گزرنے کا حکم",
    "volume": 6,
    "page": 76
  },
  {
    "topic": "گزشتہ انبیاء کرام علیہم السلام کی شریعتوں میں نماز کا تذکرہ",
    "volume": 2,
    "page": 77
  },
  {
    "topic": "قراءت کی غلطی سے فسادِ نماز",
    "volume": 4,
    "page": 77
  },
  {
    "topic": "ضرورت کے بغیر متبادل جگہ جمعے کا قیام",
    "volume": 8,
    "page": 77
  },
  {
    "topic": "نمازی کا اپنے سامنے سے گزرنے والے کوروکنے کا حکم",
    "volume": 11,
    "page": 77
  },
  {
    "topic": "قراءت میں متشابہ لگنا اور یاد آنے پر واپسی اسی جگہ سے پڑھنا",
    "volume": 4,
    "page": 78
  },
  {
    "topic": "فرض اور سنت کے درمیان قضا پڑھنے کی اجازت",
    "volume": 8,
    "page": 78
  },
  {
    "topic": "نمازِ چاشت واشراق کے اوقات",
    "volume": 9,
    "page": 78
  },
  {
    "topic": "تائب کی امامت کا حکم",
    "volume": 2,
    "page": 79
  },
  {
    "topic": "ریڈیو ، ٹی وی پر آیت سجدہ سن کر سجدۂ تلاوت کرنے کا حکم",
    "volume": 4,
    "page": 79
  },
  {
    "topic": "دفتر میں اذان دیے بغیر باجماعت نماز پڑھنے کا حکم",
    "volume": 5,
    "page": 79
  },
  {
    "topic": "ننگے سر نماز پڑھنے کا حکم",
    "volume": 7,
    "page": 79
  },
  {
    "topic": "مسجد میں جماعتِ ثانی",
    "volume": 4,
    "page": 80
  },
  {
    "topic": "نائب امام کی موجودگی میں امامت کا استحقاق",
    "volume": 5,
    "page": 80
  },
  {
    "topic": "امام کا صفیں درست کرنے کی ہدایت کرنا",
    "volume": 2,
    "page": 81
  },
  {
    "topic": "قضاءِ عمری پڑھے جانے کے لیے کون سا وقت موزوں ہے",
    "volume": 3,
    "page": 81
  },
  {
    "topic": "امام کا ترک نماز",
    "volume": 5,
    "page": 81
  },
  {
    "topic": "گھاس/قالین پر سجدے کا حکم",
    "volume": 8,
    "page": 81
  },
  {
    "topic": "نماز تراویح میں عورت کی امامت کا حکم",
    "volume": 9,
    "page": 81
  },
  {
    "topic": "نماز جمعہ کے دونوں خطبوں کے درمیان ہاتھ اٹھا کر دعا مانگنا",
    "volume": 11,
    "page": 81
  },
  {
    "topic": "اوّابین کے نوافل پڑھنے کا طریقہ",
    "volume": 2,
    "page": 82
  },
  {
    "topic": "مسبوق کی نماز میں سہو",
    "volume": 3,
    "page": 82
  },
  {
    "topic": "جماعت کے لیے اقامت کے موقع پر امام تکبیرِ تحریمہ کب کہے",
    "volume": 5,
    "page": 82
  },
  {
    "topic": "قضائے عمری ادا کرنے کا طریقہ",
    "volume": 6,
    "page": 82
  },
  {
    "topic": "باجماعت نماز میں امام کا توقف",
    "volume": 8,
    "page": 82
  },
  {
    "topic": "پہلی صف کے فضائل",
    "volume": 3,
    "page": 83
  },
  {
    "topic": "نماز میں سورت ملانا بھول گیا",
    "volume": 2,
    "page": 84
  },
  {
    "topic": "نماز میں سہو کے مسائل",
    "volume": 2,
    "page": 84
  },
  {
    "topic": "خواتین کے مخصوص ایام کی نمازوں کی قضا نہیں ، صرف روزوں کی قضا ہے",
    "volume": 4,
    "page": 84
  },
  {
    "topic": "عیدین و جمعہ میں غیر عربی میں خطبہ پڑھنا",
    "volume": 7,
    "page": 84
  },
  {
    "topic": "قرآن مجید کی سورتوں کا ترتیب سے پڑھنا",
    "volume": 1,
    "page": 85
  },
  {
    "topic": "امام کا دو رکعت یا چار رکعت والی نماز میں قعدۂ اخیرہ بھول کر کھڑا ہو جانا",
    "volume": 5,
    "page": 85
  },
  {
    "topic": "امام معین کا حق امامت کے لیے مقدم ہے",
    "volume": 8,
    "page": 85
  },
  {
    "topic": "طواف اور سعی کے دوران افضل اذکار",
    "volume": 9,
    "page": 85
  },
  {
    "topic": "اِقامت کا مفصل و مدلل مسئلہ",
    "volume": 11,
    "page": 85
  },
  {
    "topic": "نماز میں قرأت کا مسئلہ",
    "volume": 1,
    "page": 86
  },
  {
    "topic": "التحیات نماز میں ہے ، قرآن میں نہیں",
    "volume": 1,
    "page": 86
  },
  {
    "topic": "مقتدی امام کو رکوع میں پائے تو کیا کرے",
    "volume": 2,
    "page": 86
  },
  {
    "topic": "بیٹھ کر نماز پڑھانے والے امام کی اقتداء",
    "volume": 3,
    "page": 86
  },
  {
    "topic": "نمازِ قصر میں وطن کی اصطلاح",
    "volume": 4,
    "page": 86
  },
  {
    "topic": "قضاء نمازیں زیادہ ہوں تو تسبیحات میں تخفیف",
    "volume": 6,
    "page": 86
  },
  {
    "topic": "قبلے کی جانب سے معمولی انحراف ہو تو نماز جائز ہے",
    "volume": 8,
    "page": 86
  },
  {
    "topic": "وتر میں دعائے قنوت کی جگہ ”قل ھو اللہ“ پڑھنا",
    "volume": 1,
    "page": 87
  },
  {
    "topic": "مسجد میں دوبارہ جماعت کرانا",
    "volume": 1,
    "page": 87
  },
  {
    "topic": "اذان یا اقامت میں کوئی کلمہ رہ جائے تو کیا حکم ہے",
    "volume": 2,
    "page": 87
  },
  {
    "topic": "نماز کی رکعات میں تخفیف کس صورت میں جائز ہے",
    "volume": 6,
    "page": 87
  },
  {
    "topic": "ایک امام کا دو جگہ نمازِ عید پڑھانا",
    "volume": 7,
    "page": 87
  },
  {
    "topic": "عورت، مرد کی نماز",
    "volume": 1,
    "page": 88
  },
  {
    "topic": "امام مقدارواجب تلاوت کرلے اوراس کے بعد اس سے غلطی ہوجائے تو مقتدی لقمہ دے سکتا ہے",
    "volume": 2,
    "page": 88
  },
  {
    "topic": "نمازِ جمعہ میں فرض کے بعد بقیہ رکعات کی ادائیگی بھی ضروری ہے",
    "volume": 6,
    "page": 88
  },
  {
    "topic": "سترہ کے مسئلے پر ایک علمی بحث",
    "volume": 1,
    "page": 89
  },
  {
    "topic": "نماز کے بعد سر پر ہاتھ رکھ کر دعا کرنا",
    "volume": 2,
    "page": 89
  },
  {
    "topic": "اذانِ جمعہ اور نماز کی سعی",
    "volume": 4,
    "page": 89
  },
  {
    "topic": "نماز مغرب کی دونوں رکعتوں میں ایک ہی سورت کی تکرار",
    "volume": 5,
    "page": 89
  },
  {
    "topic": "نماز جمعہ و عیدین کی امامت کا استحقاق",
    "volume": 7,
    "page": 89
  },
  {
    "topic": "بارش کی وجہ سے ترکِ جمعہ اور جمع بین الصلوٰتین",
    "volume": 8,
    "page": 89
  },
  {
    "topic": "مسجد میں امام کا مصلے پر بیٹھ کر ہنسنا",
    "volume": 9,
    "page": 89
  },
  {
    "topic": "مقتدی امام کو رکوع میں پائے تو کیا کرے",
    "volume": 2,
    "page": 90
  },
  {
    "topic": "غیر مسلم ملک میں نماز باجماعت ، جمعہ اور روزے کا مسئلہ",
    "volume": 2,
    "page": 90
  },
  {
    "topic": "نماز میں خلافِ ترتیب قراءت کا حکم",
    "volume": 5,
    "page": 90
  },
  {
    "topic": "ناپاکی کی حالت میں نماز پڑھنا",
    "volume": 2,
    "page": 91
  },
  {
    "topic": "بڑی مسجد کی تعریف",
    "volume": 2,
    "page": 91
  },
  {
    "topic": "فرض نماز کی آخری دو رکعات میں فاتحہ کے بعد تلاوت پر سجدۂ سہو واجب نہیں",
    "volume": 7,
    "page": 91
  },
  {
    "topic": "فاسق کی اذان",
    "volume": 2,
    "page": 92
  },
  {
    "topic": "نمازِ جمعہ کی دوسری جماعت جائز نہیں",
    "volume": 7,
    "page": 92
  },
  {
    "topic": "قضا نمازوں کے ہوتے ہوئے صلوٰۃ التسبیح پڑھنا",
    "volume": 2,
    "page": 93
  },
  {
    "topic": "خطبۂ جمعہ کے دوران بیٹھنے کی ہیئت",
    "volume": 4,
    "page": 93
  },
  {
    "topic": "قراءت میں متشابہ لگنا اور یاد آنے پر واپسی اسی جگہ سے پڑھنا",
    "volume": 5,
    "page": 93
  },
  {
    "topic": "مسجد میں چارپائی ڈال کر سونا",
    "volume": 9,
    "page": 93
  },
  {
    "topic": "”بکثرت قضا نمازیں باقی ہوں تو ان کی ادائیگی کےلیے سنن مؤکدہ چھوڑ سکتے ہیں“ اس مسئلے پر ایک فتویٰ اور اس کا جواب",
    "volume": 2,
    "page": 94
  },
  {
    "topic": "امام کے بارے میں متقدیوں کی ناپسندیدگی کا شرعی حکم",
    "volume": 5,
    "page": 94
  },
  {
    "topic": "نمازِ شکرانہ کا طریقہ",
    "volume": 6,
    "page": 94
  },
  {
    "topic": "فرض نماز کے بعد اجتماعی دعا کی شرعی حیثیت",
    "volume": 9,
    "page": 94
  },
  {
    "topic": "نمازِ تراویح کے اجتماعات میں تلفظ کی ادائیگی و قراءت کا حکم",
    "volume": 7,
    "page": 95
  },
  {
    "topic": "نوافل و سنن کے ممنوعہ اوقات",
    "volume": 8,
    "page": 96
  },
  {
    "topic": "عورت کا مسجد میںجماعت کے ساتھ نماز پڑھنے کے لیے با پردہ آنا",
    "volume": 5,
    "page": 97
  },
  {
    "topic": "نمازِ جمعہ کے بعد طویل دعا",
    "volume": 4,
    "page": 98
  },
  {
    "topic": "فرض نماز میں امام کے پیچھے کیا پڑھنا ضروری ہے",
    "volume": 6,
    "page": 99
  },
  {
    "topic": "وقت سے پہلے اذان دینے کا حکم",
    "volume": 8,
    "page": 99
  },
  {
    "topic": "کپڑا لٹکا کر چلنے یا گھسیٹے ہوئے چلنے کا حکم ، نماز میں کفِّ ثوب، جرِّ ثوب اور اسبال ازار کا حکم",
    "volume": 4,
    "page": 100
  },
  {
    "topic": "نماز کےلیے کپڑے اڑسنے، موڑنے اور سمیٹنے اور آستین چڑھا کر نماز پڑھنے کا مسائل",
    "volume": 2,
    "page": 101
  },
  {
    "topic": "کتنے وقفے کے بعد نماز قضا ہوجاتی ہے",
    "volume": 6,
    "page": 101
  },
  {
    "topic": "دعا کا طریقہ",
    "volume": 6,
    "page": 101
  },
  {
    "topic": "نماز میں عورت کے سجدہ کا طریقہ",
    "volume": 5,
    "page": 102
  },
  {
    "topic": "جائے نماز کا حکم مسجد کا نہیں ہے",
    "volume": 8,
    "page": 102
  },
  {
    "topic": "رمضان میں عشاء کی نماز تنہا پڑھنے والے شخص کی وتر کی جماعت میں شمولیت کا جواز",
    "volume": 11,
    "page": 102
  },
  {
    "topic": "کن صورتوں میں نماز توڑی جا سکتی ہے",
    "volume": 6,
    "page": 103
  },
  {
    "topic": "عورت کے نماز پڑھنے کا طریقہ",
    "volume": 8,
    "page": 103
  },
  {
    "topic": "نمازِ تراویح میں فاسد نماز کی قراءت کا اعادہ",
    "volume": 9,
    "page": 103
  },
  {
    "topic": "امام کا مسجد میں ہوائی جپل پہن کر پھرنا",
    "volume": 2,
    "page": 104
  },
  {
    "topic": "دعائے قنوت یاد نہ ہوتو؟",
    "volume": 6,
    "page": 105
  },
  {
    "topic": "جماعت میں ایک مقتدی اور ایک امام ہے اور مزید افراد آگئے",
    "volume": 6,
    "page": 105
  },
  {
    "topic": "نماز میں سُترے کی ہیئت",
    "volume": 9,
    "page": 105
  },
  {
    "topic": "جمعہ کی سنتیں",
    "volume": 2,
    "page": 106
  },
  {
    "topic": "نماز میں قصر کا حکم",
    "volume": 9,
    "page": 106
  },
  {
    "topic": "مسافر قصر نماز کہاں سے شروع کرے",
    "volume": 2,
    "page": 107
  },
  {
    "topic": "عورت کی نماز کن اموار میں مرد کی نماز سے جدا ہے",
    "volume": 5,
    "page": 107
  },
  {
    "topic": "قضا نمازوں کی ادائیگی سے بری الذمہ ہونے کا طریقہ",
    "volume": 6,
    "page": 107
  },
  {
    "topic": "آفات کے وقت اذان کہنا",
    "volume": 12,
    "page": 107
  },
  {
    "topic": "قصر واجب ہے",
    "volume": 2,
    "page": 108
  },
  {
    "topic": "سفر میں سنت مؤکدہ پڑھنے کا مسئلہ",
    "volume": 2,
    "page": 108
  },
  {
    "topic": "فجر کی قضا ظہر میں پڑھنا",
    "volume": 2,
    "page": 108
  },
  {
    "topic": "نمازوں کے فدیے کی ادائیگی",
    "volume": 6,
    "page": 108
  },
  {
    "topic": "نماز میں آستین فولڈ کرنا",
    "volume": 9,
    "page": 108
  },
  {
    "topic": "اذان کے پہلے کلمہ ”اللہ اکبر کو پڑھنے کا درست طریقہ “",
    "volume": 12,
    "page": 108
  },
  {
    "topic": "دعا کے وقت ہاتھ کیسے رکھے جائیں",
    "volume": 2,
    "page": 109
  },
  {
    "topic": "جاندارکی تصویر والا کپڑا پہن کر نماز پڑھنے کا حکم",
    "volume": 5,
    "page": 109
  },
  {
    "topic": "کئی سالوں کی قضا نمازوں کا حکم",
    "volume": 6,
    "page": 109
  },
  {
    "topic": "فدیۂ صلوٰۃ کی ادائیگی کے وقت نیت کافی ہے",
    "volume": 6,
    "page": 109
  },
  {
    "topic": "سجدۂشکر کا شرعی جواز",
    "volume": 5,
    "page": 110
  },
  {
    "topic": "تکبیر تحریمہ کے فضائل",
    "volume": 6,
    "page": 110
  },
  {
    "topic": "نماز میں کوئی سورت دوبارہ پڑھنا",
    "volume": 2,
    "page": 111
  },
  {
    "topic": "فرض نمازوں کے بعد دعا میں اختصار",
    "volume": 6,
    "page": 111
  },
  {
    "topic": "اقامت کا مفصّل و مدلّل مسئلہ",
    "volume": 10,
    "page": 111
  },
  {
    "topic": "نوافل تہجد کی جگہ قضاء پڑھنا",
    "volume": 2,
    "page": 112
  },
  {
    "topic": "تسبیحات فرض کے فوراً بعد پڑھی جائیں یا سُنن و نوافل کے بعد؟",
    "volume": 4,
    "page": 112
  },
  {
    "topic": "وضو اور نماز کے باطل ہونے کاغلط مسئلہ",
    "volume": 2,
    "page": 113
  },
  {
    "topic": "لاؤڈ اسپیکر کی آواز صرف حاضرین مجلس تک محدود ہونی چاہیے",
    "volume": 13,
    "page": 113
  },
  {
    "topic": "سفر کی قضا حضر میں اورحضر کی قضا سفر میں",
    "volume": 2,
    "page": 114
  },
  {
    "topic": "کیا توبہ کے بعد بھی قضائے عمری پڑھنا ضروری ہے ؟",
    "volume": 2,
    "page": 114
  },
  {
    "topic": "بعد نمازِ عشاء بآوازِ بلند تلاوتِ قرآن مجید کرنا جبکہ لوگ نماز میں مشغول ہوں",
    "volume": 5,
    "page": 114
  },
  {
    "topic": "سرِّی نماز میں امام کے پیچھے مقتدی کی تلاوت کا حکم",
    "volume": 12,
    "page": 114
  },
  {
    "topic": "صلوٰۃ التسبیح باجماعت پڑھنا",
    "volume": 2,
    "page": 115
  },
  {
    "topic": "نمازِ عید کا خطبہ سننا",
    "volume": 2,
    "page": 115
  },
  {
    "topic": "تارکُ الصلوٰۃ کا حکم",
    "volume": 2,
    "page": 116
  },
  {
    "topic": "التَّحیات کے پورے کلمات پڑھنا واجب ہیں",
    "volume": 12,
    "page": 116
  },
  {
    "topic": "سَمتِ قبلہ کا تعین ہونے کے باوجود صفیں درست نہ بنانے کا شرعی حکم",
    "volume": 13,
    "page": 116
  },
  {
    "topic": "ایک دکاندار یا کاروبار سے وابستہ مختلف افراد کا باری باری مختلف مساجد میں نمازِ جمعہ پڑھنا",
    "volume": 2,
    "page": 117
  },
  {
    "topic": "نماز امام کی اتباع کب نہیں کی جائے گی",
    "volume": 5,
    "page": 117
  },
  {
    "topic": "عورت کی امامت کا حکم",
    "volume": 6,
    "page": 117
  },
  {
    "topic": "ماسک پہن کر نماز پڑھنا",
    "volume": 12,
    "page": 117
  },
  {
    "topic": "نماز کے آگے کا فاصلہ",
    "volume": 1,
    "page": 118
  },
  {
    "topic": "نوافل بیٹھ کر پڑھنا",
    "volume": 2,
    "page": 118
  },
  {
    "topic": "گاؤں میں جمعہ کا قیام",
    "volume": 5,
    "page": 118
  },
  {
    "topic": "نفل نماز بیٹھ کر پڑھنا",
    "volume": 1,
    "page": 119
  },
  {
    "topic": "سورۂ فاتحہ کی آیت کا چھوٹ جانا",
    "volume": 2,
    "page": 119
  },
  {
    "topic": "خیانت کے مرتکب شخص کی اذان کا حکم",
    "volume": 13,
    "page": 119
  },
  {
    "topic": "نماز میں ٹوپی پہننے کا حکم",
    "volume": 1,
    "page": 120
  },
  {
    "topic": "نماز باجماعت میں دُعاءِ قنوت کا رہ جانا",
    "volume": 2,
    "page": 120
  },
  {
    "topic": "بیت اللہ کی طرف سجدہ کرنے اور حجرِ اسود کو بوسہ دینے پر صیہونیوں کا اعتراض",
    "volume": 2,
    "page": 120
  },
  {
    "topic": "جماعت میں چھوٹی سورتوں کی تلاوت",
    "volume": 5,
    "page": 120
  },
  {
    "topic": "مقتدی کو سہو ہوا تو اس پر سجدۂ سہو واجب نہیں ہے",
    "volume": 11,
    "page": 120
  },
  {
    "topic": "قراءت میں غلطی",
    "volume": 12,
    "page": 120
  },
  {
    "topic": "عشاء کے وقت کا آغاز شَفقِ اَحمر سے ہوتا ہے",
    "volume": 13,
    "page": 120
  },
  {
    "topic": "سلام کے الفاظ",
    "volume": 1,
    "page": 121
  },
  {
    "topic": "امام کے پیچھے قراءت کا حکم",
    "volume": 6,
    "page": 121
  },
  {
    "topic": "مقتدیوں کا بھول کر سلام پھیرنا",
    "volume": 11,
    "page": 121
  },
  {
    "topic": "قضا نمازوں کا حکم",
    "volume": 1,
    "page": 122
  },
  {
    "topic": "بہت سی قضا نمازوں کو تخفیف کے ساتھ پڑھنے کا مسئلہ",
    "volume": 1,
    "page": 122
  },
  {
    "topic": "مانع حمل ذرائع اختیار کرنے کا جواز",
    "volume": 5,
    "page": 122
  },
  {
    "topic": "نماز میں مُصحف سے دیکھ کر پڑھنے کا حکم",
    "volume": 6,
    "page": 122
  },
  {
    "topic": "اذان کے غلط تلفظ کاحکم",
    "volume": 10,
    "page": 122
  },
  {
    "topic": "نماز میں سورتوں کی ترتیب",
    "volume": 10,
    "page": 122
  },
  {
    "topic": "مسجد اور اس سے ملحقہ مدرسے کو دانستہ بم سے اڑانے والوں کا شرعی حکم",
    "volume": 2,
    "page": 123
  },
  {
    "topic": "نمازِ عید سے پہلے نفل پڑھنا",
    "volume": 11,
    "page": 123
  },
  {
    "topic": "اذان سے پہلے صلوٰۃ و سلام پڑھنا منع نہیں ہے",
    "volume": 11,
    "page": 123
  },
  {
    "topic": "ایسی نماز بلا کراہت جائز ہے",
    "volume": 12,
    "page": 123
  },
  {
    "topic": "قضا نمازیں ادا کرنا",
    "volume": 1,
    "page": 124
  },
  {
    "topic": "خطابت کی اہلیت اور خطیب کے فرائض",
    "volume": 5,
    "page": 124
  },
  {
    "topic": "نماز میں لقمہ دینے کا شرعی حکم",
    "volume": 6,
    "page": 124
  },
  {
    "topic": "زوالِ غروب کے وقت زاذکار و تسبیحات پڑھنا بہتر ہے",
    "volume": 11,
    "page": 124
  },
  {
    "topic": "امام کا نابالغ بچے کو ساتھ بٹھا کر نماز پڑھانا",
    "volume": 12,
    "page": 124
  },
  {
    "topic": "قضائے عمرے سے کیا مراد ہے؟",
    "volume": 1,
    "page": 125
  },
  {
    "topic": "چار رکعت والی نماز کے قعدۂ اولیٰ میں بھول کر کھڑا ہوجانا",
    "volume": 6,
    "page": 125
  },
  {
    "topic": "نماز میں فاتحہ یا ختمِ سورت کے بعد بھول کر تَشہُّد پڑھنے کا حکم",
    "volume": 10,
    "page": 125
  },
  {
    "topic": "نماز باجماعت کی صف بندی میں بچوں کی رعایت",
    "volume": 11,
    "page": 125
  },
  {
    "topic": "قرآن اور تلاوت قرآن کے آداب",
    "volume": 2,
    "page": 126
  },
  {
    "topic": "بے شعور بچوں کا مسجد میں آنا منع ہے",
    "volume": 13,
    "page": 126
  },
  {
    "topic": "جنازہ گاہ میں نماز باجماعت کی ادائیگی",
    "volume": 5,
    "page": 127
  },
  {
    "topic": "کھلے میدان میں نمازِ عید ادا کرنا افضل اور سنت ہے",
    "volume": 10,
    "page": 127
  },
  {
    "topic": "نماز کے اندر قرأت میں غلطی کا مسئلہ",
    "volume": 2,
    "page": 128
  },
  {
    "topic": "اذانِ مغرب اور جماعت کے درمیان وقفہ",
    "volume": 5,
    "page": 128
  },
  {
    "topic": "عذر کی بنا پر غیرسَمتِ قبلہ پر نماز پڑھنے کا حکم",
    "volume": 10,
    "page": 128
  },
  {
    "topic": "نماز میں دو سجدوں کے درمیان دعا پڑھنا",
    "volume": 12,
    "page": 128
  },
  {
    "topic": "جسمانی نقص والے کی امامت کا حکم",
    "volume": 13,
    "page": 128
  },
  {
    "topic": "قضا میں سنتوں کا چھوڑنا",
    "volume": 1,
    "page": 129
  },
  {
    "topic": "قضائے عمری پرھنے کا کوئی خاص طریقہ ہے ؟",
    "volume": 1,
    "page": 129
  },
  {
    "topic": "فجر اور عصر سے پہلے نفل ، قضائے عمری ، وترکی قضا",
    "volume": 1,
    "page": 129
  },
  {
    "topic": "سفر کی قضا سنتوں کی قضا",
    "volume": 1,
    "page": 129
  },
  {
    "topic": "فجر اور عصر سے پہلے قضائے عمری",
    "volume": 1,
    "page": 129
  },
  {
    "topic": "مستحب پر دوام",
    "volume": 2,
    "page": 129
  },
  {
    "topic": "مسافر کے پندرہ دن سے کم قیام پر قصر ہے",
    "volume": 6,
    "page": 129
  },
  {
    "topic": "طہر یا جمعہ کی ابتدائی چارسنتیں رہ جائیں تو کب پڑھیں ؟",
    "volume": 1,
    "page": 130
  },
  {
    "topic": "مسجد نبوی ﷺ میں چالیس نمازوں کی فضیلت",
    "volume": 2,
    "page": 130
  },
  {
    "topic": "معذور بیٹھ کر نماز پڑھ سکتا ہے",
    "volume": 11,
    "page": 130
  },
  {
    "topic": "جمعہ کے دن اسکول کالج کے طلبہ کی نمازِ جمعہ کا مسئلہ",
    "volume": 12,
    "page": 130
  },
  {
    "topic": "دیہی علاقے میں نمازِ جمعہ پڑھنے کا مسئلہ",
    "volume": 13,
    "page": 130
  },
  {
    "topic": "کیا عبادت میں نیابت جائز ہے ؟",
    "volume": 1,
    "page": 131
  },
  {
    "topic": "سلام پڑھنے کی منت",
    "volume": 2,
    "page": 131
  },
  {
    "topic": "کیا بخار کی حالت میں نماز قضا کی جا سکتی ہے ؟",
    "volume": 1,
    "page": 132
  },
  {
    "topic": "دعا بعد الصلوٰۃ کی شرعی حیثیت",
    "volume": 5,
    "page": 132
  },
  {
    "topic": "دورانِ جماعت جب مقتدی جماعت میں شامل ہو",
    "volume": 11,
    "page": 132
  },
  {
    "topic": "سواری پر وتر کی نماز",
    "volume": 12,
    "page": 132
  },
  {
    "topic": "صلوٰۃ التسبیح کا مناسب وقت",
    "volume": 14,
    "page": 132
  },
  {
    "topic": "نماز میں صاحب ترتیب کون ہے ؟",
    "volume": 1,
    "page": 133
  },
  {
    "topic": "صاحب ترتیب پہلے قضا پڑھے",
    "volume": 1,
    "page": 133
  },
  {
    "topic": "نمازی کے آگے جوتے رکھنا ، فجر کی سنتوں کی قضا",
    "volume": 1,
    "page": 133
  },
  {
    "topic": "نماز باجماعت کی صف بندی میں بچوں کا مقام",
    "volume": 2,
    "page": 133
  },
  {
    "topic": "قصر نماز کا حکم",
    "volume": 13,
    "page": 133
  },
  {
    "topic": "جماعت کھڑی ہو چکی اور فجر کی سنتیں",
    "volume": 1,
    "page": 134
  },
  {
    "topic": "اوقات مکروہہ",
    "volume": 1,
    "page": 134
  },
  {
    "topic": "مغفرت وایثالِ ثواب کےلیے اجتماعی دعا",
    "volume": 5,
    "page": 134
  },
  {
    "topic": "نابینا کی امامت",
    "volume": 11,
    "page": 134
  },
  {
    "topic": "نماز باجماعت میں صفوں کی درستی کی بابت تاکید اور ترک پر وعید",
    "volume": 14,
    "page": 134
  },
  {
    "topic": "رمضان میں فرض جماعت سے نہ پڑھے ، وتر جماعت سے پڑھے یا نہیں ؟",
    "volume": 1,
    "page": 135
  },
  {
    "topic": "شرعی معذورہ کے نماز ، فدیۂصیام اور حج کے بارے میں چند سوالات",
    "volume": 10,
    "page": 135
  },
  {
    "topic": "نماز کے اندر قراءت میں غلطی کا حکم",
    "volume": 13,
    "page": 135
  },
  {
    "topic": "نماز میں بلا ضرورت امام کو لقمہ دینا اور امام کا لقمہ لینا",
    "volume": 1,
    "page": 136
  },
  {
    "topic": "نمازِ تہجد کا افضل وقت",
    "volume": 11,
    "page": 136
  },
  {
    "topic": "صلوٰۃِ قصر کا مسئلہ",
    "volume": 2,
    "page": 137
  },
  {
    "topic": "نمازِ عشاء کی بابت ایک سوال",
    "volume": 11,
    "page": 137
  },
  {
    "topic": "جَہری و سِرّی نمازوں میں تلاوت کا حکم",
    "volume": 13,
    "page": 137
  },
  {
    "topic": "وتر کے بعد نفل پڑھنا ممنوع نہیں ہے",
    "volume": 10,
    "page": 138
  },
  {
    "topic": "لازمی خدمات کی وجہ سے ترکِ جمعہ",
    "volume": 12,
    "page": 138
  },
  {
    "topic": "تراویح کی دو رکعت کے بعد قعدے پر نہ بیٹھنا اور چار رکعات مکمل کرکے سلام پھیرنے کا حکم",
    "volume": 14,
    "page": 138
  },
  {
    "topic": "الٹی شلوار اور قمیص پہن کر نماز پڑھنا",
    "volume": 1,
    "page": 139
  },
  {
    "topic": "لباس کو ٹخنوں تک لٹکانے کا شرعی حکم",
    "volume": 1,
    "page": 139
  },
  {
    "topic": "سنتوں کی قضا",
    "volume": 2,
    "page": 139
  },
  {
    "topic": "مرضِ ریاح میں نماز کی ادائیگی",
    "volume": 2,
    "page": 140
  },
  {
    "topic": "ہومیو پیتھک ڈاکٹر کی امامت کا مسئلہ",
    "volume": 10,
    "page": 140
  },
  {
    "topic": "قرآن کی تلاوت کے دوران ”ن“ آجائے تو کس طرح پڑھیں",
    "volume": 2,
    "page": 141
  },
  {
    "topic": "عورتوں کی جماعت",
    "volume": 2,
    "page": 141
  },
  {
    "topic": "عشاکی نیت میں غلطی سے ظہر یا عصر کہہ دینا",
    "volume": 11,
    "page": 141
  },
  {
    "topic": "مساجد میں خواتین کی نماز باجماعت میں شرکت",
    "volume": 12,
    "page": 141
  },
  {
    "topic": "سجدۂ تلاوت بھول جائیں تو",
    "volume": 2,
    "page": 142
  },
  {
    "topic": "ایک جگہ پنج وقتہ نماز ادا کی جارہی تھی ، اب قریب مسجد بن گئی تو",
    "volume": 2,
    "page": 142
  },
  {
    "topic": "نماز میں قصر، وطنِ اصلی اور وطنِ اقامت کے مسائل",
    "volume": 2,
    "page": 142
  },
  {
    "topic": "نفلی عبادات کا ایصالِ ثواب",
    "volume": 10,
    "page": 142
  },
  {
    "topic": "فرض نماز میں قراءت کا حکم",
    "volume": 13,
    "page": 142
  },
  {
    "topic": "رکوع میں بھول کر سجدہ کی تسبیح پڑھنا",
    "volume": 1,
    "page": 143
  },
  {
    "topic": "تکبیر بھول جائے تو؟",
    "volume": 1,
    "page": 143
  },
  {
    "topic": "مسبوق کی نماز اور سرِّی نماز میں ثناء پڑھنے کا مسئلہ",
    "volume": 11,
    "page": 143
  },
  {
    "topic": "امام تکبیر تحریمہ کا آغاز کب کرے؟",
    "volume": 13,
    "page": 143
  },
  {
    "topic": "نماز میں بھول ، سجدۂ سہو",
    "volume": 1,
    "page": 144
  },
  {
    "topic": "نماز وتر میں دعائے قنوت بھول کر رکوع میں چلا گیا تو کیا کرے؟",
    "volume": 1,
    "page": 144
  },
  {
    "topic": "امام کی اقتدا کے لیے اتصال صفوف ضروری ہے",
    "volume": 14,
    "page": 144
  },
  {
    "topic": "کیا سجدۂ سہو کی ضرورت ہے",
    "volume": 1,
    "page": 145
  },
  {
    "topic": "عیدین میں سجدۂ سہو",
    "volume": 1,
    "page": 145
  },
  {
    "topic": "عنین کی امامت کا حکم",
    "volume": 12,
    "page": 145
  },
  {
    "topic": "مُصلّے پر خیالی شبیہ کا حکم",
    "volume": 13,
    "page": 145
  },
  {
    "topic": "سجدۂ تلاوت کا طریقہ",
    "volume": 1,
    "page": 146
  },
  {
    "topic": "فجر اور عصر کے بعد سجدۂ تلاوت کا حکم",
    "volume": 1,
    "page": 146
  },
  {
    "topic": "نماز میں مقررہ وقت میں تاخیر کرنا",
    "volume": 11,
    "page": 146
  },
  {
    "topic": "قعدہ میں السلام علیک ایھا النبی کی تکرار کرنے کا شرعی حکم",
    "volume": 13,
    "page": 146
  },
  {
    "topic": "عورت کا باپردہ مسجد میں جا کر مسئلہ پوچھنا اور سجدۂ تلاوت",
    "volume": 1,
    "page": 147
  },
  {
    "topic": "کیسٹس پر تلاوت سننا اور سجدۂ تلاوت",
    "volume": 1,
    "page": 148
  },
  {
    "topic": "سجدۂ شکر کی شرعی حیثیت",
    "volume": 1,
    "page": 148
  },
  {
    "topic": "نماز میں فرض قراءت کا معیار",
    "volume": 13,
    "page": 148
  },
  {
    "topic": "ترجمۂ قرآن پڑھنے سے تلاوت کا ثواب",
    "volume": 1,
    "page": 149
  },
  {
    "topic": "مُصلّے پر خیالی شبیہہ کا حکم",
    "volume": 12,
    "page": 149
  },
  {
    "topic": "نماز کی قصر",
    "volume": 1,
    "page": 150
  },
  {
    "topic": "صحت اقتدا کے لیے امام اور مقتدی کی نماز کا ایک ہونا ضروری ہے",
    "volume": 11,
    "page": 150
  },
  {
    "topic": "گھر پر یا خارجِ مسجد باجماعت نماز کا حکم",
    "volume": 12,
    "page": 150
  },
  {
    "topic": "نماز میں دو سجدوں کی حکم",
    "volume": 13,
    "page": 150
  },
  {
    "topic": "جب التحیات پڑھتے ہوئے امام کی اقتدا میں تیسری رکعت فوت ہو جائے",
    "volume": 14,
    "page": 150
  },
  {
    "topic": "مسافتِ قصر، آغازِ قصر",
    "volume": 1,
    "page": 151
  },
  {
    "topic": "قصر کب تک پڑھے؟",
    "volume": 1,
    "page": 151
  },
  {
    "topic": "مسلسل تین جمعوں کے چھوڑنے کا حکم",
    "volume": 1,
    "page": 152
  },
  {
    "topic": "فیکٹری ، کارخانےمیں نماز جمعہ",
    "volume": 1,
    "page": 152
  },
  {
    "topic": "خطیب کے سامنے مسجد میں اذانِ جمعہ",
    "volume": 10,
    "page": 152
  },
  {
    "topic": "امام کی اقتدا میں مقتدی کے لیے قراءت کا حکم",
    "volume": 11,
    "page": 152
  },
  {
    "topic": "باجماعت نماز کا آن لائن یا ورچوئل متبادل",
    "volume": 12,
    "page": 152
  },
  {
    "topic": "کیا نماز جمعہ کی قضا ہے ؟",
    "volume": 1,
    "page": 153
  },
  {
    "topic": "ہر قعدے میں تشہُّد پورا پڑھنا واجب ہے",
    "volume": 11,
    "page": 153
  },
  {
    "topic": "کن مقامات پر نماز پڑھنا جائز نہیں",
    "volume": 13,
    "page": 153
  },
  {
    "topic": "دورانِ جماعت صف میں کرسی کہاں رکھی جائے",
    "volume": 14,
    "page": 153
  },
  {
    "topic": "کیا شوہراپنی بیوی کی میت کو غسل دے سکتا ہے ؟",
    "volume": 1,
    "page": 154
  },
  {
    "topic": "امام کی پیروی میں مقتدی تکبیرات آہستہ کہے",
    "volume": 11,
    "page": 154
  },
  {
    "topic": "صف بندی میں فاصلہ رکھنا",
    "volume": 12,
    "page": 154
  },
  {
    "topic": "دونوں سجدوں کے درمیان تسبیحات پڑھنے کا حکم",
    "volume": 12,
    "page": 154
  },
  {
    "topic": "ایک سے زائد میتوں کی نماز جنازہ ایک ساتھ پڑھنے کا حکم",
    "volume": 1,
    "page": 155
  },
  {
    "topic": "نماز کے بعد وظائف پر شوہر کا اعتراض",
    "volume": 11,
    "page": 155
  },
  {
    "topic": "نماز کے دوران سائڈ کی جیب میں یا پسِ پشت کی چین کے ساتھ باتصویر آئی ڈی کارڈ کا حکم",
    "volume": 14,
    "page": 155
  },
  {
    "topic": "نماز جنازہ کی تکرار",
    "volume": 1,
    "page": 156
  },
  {
    "topic": "میت کا سوگ",
    "volume": 1,
    "page": 156
  },
  {
    "topic": "شرعی مسافتِ سفر",
    "volume": 10,
    "page": 156
  },
  {
    "topic": "نماز توڑنے کے شرعی اعذار اور ان کے احکام",
    "volume": 12,
    "page": 156
  },
  {
    "topic": "کیا میت کی آنکھ سے لینس نکالنے ضروری ہیں ؟",
    "volume": 1,
    "page": 157
  },
  {
    "topic": "ادا بہ نیتِ قضایا قضا بہ نیتِ ادا پڑھنا",
    "volume": 11,
    "page": 157
  },
  {
    "topic": "چھوٹی مساجد میں پنج وقتہ نمازوں میں لاؤڈ اسپیکر کا استعمال",
    "volume": 13,
    "page": 157
  },
  {
    "topic": "نماز جنازہ میں تکبیر کا چھوٹنا",
    "volume": 1,
    "page": 158
  },
  {
    "topic": "دفن کے بعد میت کو دوسری جگہ منتقل کرنا",
    "volume": 1,
    "page": 158
  },
  {
    "topic": "نمازِ فجر کے بعد سونے کا حکم",
    "volume": 10,
    "page": 158
  },
  {
    "topic": "غیر ملکی ٹوپی پہننا",
    "volume": 14,
    "page": 158
  },
  {
    "topic": "امانتاً میت کو قبر میں دفن کرنا",
    "volume": 1,
    "page": 159
  },
  {
    "topic": "میت کے اہل خانہ کے لیے کھانا بھیجنا",
    "volume": 1,
    "page": 159
  },
  {
    "topic": "تکبیرِ اولٰی کا ثواب اور رکوع میں شامل ہونے پر رکعت کا ملنا",
    "volume": 13,
    "page": 159
  },
  {
    "topic": "دانتوں میں پھنسے ذرات نماز کے دوران نگل لینے کا حکم",
    "volume": 14,
    "page": 159
  },
  {
    "topic": "میت کے گھر ضیافت کا اہتمام",
    "volume": 1,
    "page": 160
  },
  {
    "topic": "امام مسجد کا تنہا جماعت کرانا",
    "volume": 14,
    "page": 160
  },
  {
    "topic": "ایصالِ ثواب کی حقیقت",
    "volume": 1,
    "page": 161
  },
  {
    "topic": "میت کے ترکے سے ایصال ثواب کے لیے صدقہ کرنا",
    "volume": 1,
    "page": 161
  },
  {
    "topic": "اقامت کے وقت کہاں کھڑا ہو",
    "volume": 10,
    "page": 161
  },
  {
    "topic": "فرض کے بعد والی سنتیں پہلے ادا کرنے ، سنتوں اور فرض کے درمیان نوافل پڑھنے کا حکم",
    "volume": 11,
    "page": 161
  },
  {
    "topic": "تکبیراتِ انتقالات چھوٹ جائیں ، تب بھی نماز ادا ہوجائے گی",
    "volume": 13,
    "page": 161
  },
  {
    "topic": "سوئم، دسواں اور چالسواں",
    "volume": 1,
    "page": 163
  },
  {
    "topic": "خواتین کی امامت",
    "volume": 10,
    "page": 163
  },
  {
    "topic": "نمازِ وتر میں دعاءِ قنوت پڑھے بغیر رکوع میں چلا گیا",
    "volume": 11,
    "page": 163
  },
  {
    "topic": "جماعت کھڑی ہونے پر منفرد کے نماز توڑنے کا حکم",
    "volume": 14,
    "page": 163
  },
  {
    "topic": "مفاد عامہ کےلیے مختص اور ہر قسم کی تعمیرات کے لیے ممنوع جگہ پر مسجد بنانا",
    "volume": 1,
    "page": 164
  },
  {
    "topic": "نماز کے دوران عملِ قلیل مفسدِ نماز نہیں ہے",
    "volume": 10,
    "page": 165
  },
  {
    "topic": "عید کی نماز میں درمیان میں شامل ہونے والا تکبیرات کس طرح کہے",
    "volume": 11,
    "page": 165
  },
  {
    "topic": "نمازِ عید میں سجدۂ سہو ترک کیا جا سکتا ہے",
    "volume": 11,
    "page": 166
  },
  {
    "topic": "ایک مسبوق کی اقتداء میں دوسرے شخص کی نماز کا حکم",
    "volume": 14,
    "page": 166
  },
  {
    "topic": "وطنِ اقامت کے باطل ہونے کی صورتیں",
    "volume": 10,
    "page": 167
  },
  {
    "topic": "اگر کسی کی نماز عید رہ جائے تو کیا کرے",
    "volume": 11,
    "page": 167
  },
  {
    "topic": "خطبے اور نماز کے درمیان چندہ",
    "volume": 11,
    "page": 167
  },
  {
    "topic": "ایک مسجد کی رقم یا مال دوسری مسجد پر خرچ کرنا",
    "volume": 1,
    "page": 168
  },
  {
    "topic": "مسجد کی تعمیر میں غیر مسلم کا چندہ لگانا",
    "volume": 1,
    "page": 169
  },
  {
    "topic": "معذور کے لیے نماز کا طریقہ",
    "volume": 11,
    "page": 169
  },
  {
    "topic": "مساجد و مدارس میں تعلیم القرآن کےلیے زکوٰۃ و فطرے کا استعمال",
    "volume": 1,
    "page": 170
  },
  {
    "topic": "نوافل کے ممنوع اوقات اور ماقبل ومابعد فرض سنتوں کی ترتیب",
    "volume": 10,
    "page": 170
  },
  {
    "topic": "حساس اداروں کی سیکیورٹی پر مامور عملے کی نماز کا مسئلہ",
    "volume": 14,
    "page": 170
  },
  {
    "topic": "مسجد کے فنڈ سے چراغاں",
    "volume": 1,
    "page": 171
  },
  {
    "topic": "مسجد میں محراب نہیں ہے",
    "volume": 1,
    "page": 172
  },
  {
    "topic": "مسجد میں گیس لیمپ اور ڈیٹول سے غسل",
    "volume": 1,
    "page": 172
  },
  {
    "topic": "غیر مسلم ممالک میں نمازِ جمعہ کی دوسری جماعت کا مسئلہ",
    "volume": 11,
    "page": 172
  },
  {
    "topic": "وقتِ زوال کا دورانیہ کتنا ہوتا ہے",
    "volume": 14,
    "page": 172
  },
  {
    "topic": "مصلےٰ کو موڑنا",
    "volume": 1,
    "page": 173
  },
  {
    "topic": "مسجد میں سلام کا جواب دینا",
    "volume": 1,
    "page": 173
  },
  {
    "topic": "قراءت کی غلطی کی شکایت",
    "volume": 11,
    "page": 173
  },
  {
    "topic": "غیر مسلموں کا مسجد بنانا",
    "volume": 1,
    "page": 174
  },
  {
    "topic": "طالبات کا مدرسہ بنانا",
    "volume": 11,
    "page": 174
  },
  {
    "topic": "تارک الصلٰوۃ بیوی",
    "volume": 12,
    "page": 174
  },
  {
    "topic": "اشراقاور چاشت کی نماز",
    "volume": 10,
    "page": 175
  },
  {
    "topic": "شہر کی مسجد میں نمازِ جمعہ کا اجرا",
    "volume": 11,
    "page": 175
  },
  {
    "topic": "عیدین کی تکبیرات میں بھول چُوک کا مسئلہ",
    "volume": 14,
    "page": 175
  },
  {
    "topic": "استخارہ کیا ہے ؟",
    "volume": 1,
    "page": 176
  },
  {
    "topic": "استخارہ سے فیصلہ",
    "volume": 1,
    "page": 177
  },
  {
    "topic": "عید سے قبل مطلقاًاور بعد میں عیدگاہ میں نوافل کی ممانعت",
    "volume": 10,
    "page": 177
  },
  {
    "topic": "بیٹھ کر نماز پڑھانے والے امام کی اقتداء",
    "volume": 14,
    "page": 177
  },
  {
    "topic": "مسجد میں سوال کرنے اور سائل کو دینے کا شرعی حکم",
    "volume": 1,
    "page": 178
  },
  {
    "topic": "کمیونٹی ہال میں نمازِ تراویح کا اہتمام کرنا",
    "volume": 11,
    "page": 178
  },
  {
    "topic": "امام کی قراءت کے بارے میں سوال",
    "volume": 12,
    "page": 178
  },
  {
    "topic": "نیا جمعہ قائم کرنا",
    "volume": 12,
    "page": 179
  },
  {
    "topic": "صلوٰۃ الاوّابین",
    "volume": 10,
    "page": 180
  },
  {
    "topic": "عورتوں کی نماز کا طریقہ",
    "volume": 11,
    "page": 180
  },
  {
    "topic": "مسافر کی اقتدا میں مقیم کی نماز",
    "volume": 11,
    "page": 181
  },
  {
    "topic": "جمعہ اور عید کا جمع ہونا",
    "volume": 12,
    "page": 181
  },
  {
    "topic": "مسافر مقیم کے پیچھے نماز پوری پڑھے گا",
    "volume": 11,
    "page": 182
  },
  {
    "topic": "قصر اور پوری نماز کا مسئلہ",
    "volume": 14,
    "page": 182
  },
  {
    "topic": "مسجد کے فنڈ سے امام مسجد کے بیٹے کو وظیفہ دینا",
    "volume": 1,
    "page": 183
  },
  {
    "topic": "عورت پر نماز عید واجب نہیں ہے",
    "volume": 10,
    "page": 184
  },
  {
    "topic": "فوج کا جنگل میں پڑاء شرعی اقامت نہیں ہے",
    "volume": 11,
    "page": 184
  },
  {
    "topic": "دیہات میں نمازِ جمعہ کا شرعی حکم",
    "volume": 14,
    "page": 184
  },
  {
    "topic": "نمازِ تراویح میں ختمِ قرآن کا رائج طریقہ",
    "volume": 12,
    "page": 185
  },
  {
    "topic": "بارڈر ایریا فوجی یونٹ میں نمازِ جمعہ کا قیام",
    "volume": 14,
    "page": 186
  },
  {
    "topic": "نماز جمعہ سے متعلق چند سوالات",
    "volume": 10,
    "page": 187
  },
  {
    "topic": "فجر کی جماعت کے بعد نماز کی ادائیگی",
    "volume": 11,
    "page": 187
  },
  {
    "topic": "رمضانِ مبارک میں وتر میں قنوت پڑھنا بھول جائے تو کیا کرے؟",
    "volume": 12,
    "page": 187
  },
  {
    "topic": "شیشے کا دروازہ نمازی کا سُترہ بن سکتا ہے",
    "volume": 11,
    "page": 188
  },
  {
    "topic": "سفر سے وطنِ اقامت کب باطل ہوتاہے",
    "volume": 14,
    "page": 188
  },
  {
    "topic": "تیمم کا حکم",
    "volume": 11,
    "page": 189
  },
  {
    "topic": "گاؤں میں عیدین کی نماز",
    "volume": 12,
    "page": 193
  },
  {
    "topic": "لپٹی ہوئی برہنہ تصویر جیب میں ڈال کر نماز پڑھنے کا حکم",
    "volume": 10,
    "page": 194
  },
  {
    "topic": "دورانِ سفردو نمازوں کو جمع کرنا",
    "volume": 12,
    "page": 194
  },
  {
    "topic": "نوافل کی جماعت",
    "volume": 10,
    "page": 196
  },
  {
    "topic": "مسافر پر جمعہ فرض نہیں ہے",
    "volume": 11,
    "page": 202
  },
  {
    "topic": "قصر نماز کا مسئلہ",
    "volume": 11,
    "page": 203
  },
  {
    "topic": "حضور ﷺ کو بکریاں چرانے والا کہنا",
    "volume": 2,
    "page": 337
  },
  {
    "topic": "حضرت خضر علیہ السلام کے نبی یا فرشہ ہونے کی بحث",
    "volume": 2,
    "page": 338
  },
  {
    "topic": "امام اعظم رضی اللہ عنہ کی کُنِیت ابو حنیفہ کی حکمت",
    "volume": 2,
    "page": 348
  },
  {
    "topic": "تاریخ یوم ولادت سید المرسلینﷺ",
    "volume": 1,
    "page": 358
  },
  {
    "topic": "نبی کریم ﷺ کے نام کے ساتھ(ۢ) لکھنے پر اکتفا کرنا",
    "volume": 1,
    "page": 358
  },
  {
    "topic": "حضرت خضر علیہ السلام کون ہیں ؟",
    "volume": 1,
    "page": 359
  },
  {
    "topic": "جمعۃ الوداع کی شرعی حیثیت",
    "volume": 9,
    "page": 151
  },
  {
    "topic": "نفلی صدقات کا حکم",
    "volume": 7,
    "page": 155
  },
  {
    "topic": "روزے کی نیت کا شرعی حکم",
    "volume": 7,
    "page": 156
  },
  {
    "topic": "روزے کی حالت میں ازدواجی تعلق قائم کرنے والے پر قضا و کفارہ لازم ہے",
    "volume": 7,
    "page": 158
  },
  {
    "topic": "رمضان المبارک میں ملازمین کو دوپہر کا کھانا دینا",
    "volume": 7,
    "page": 159
  },
  {
    "topic": "اعتکاف کن صورتوں میں فاسد ہوجاتا ہے",
    "volume": 7,
    "page": 161
  },
  {
    "topic": "اعتکاف رمضان المبارک",
    "volume": 3,
    "page": 163
  },
  {
    "topic": "معتکف کا محراب مسجد میں جانا",
    "volume": 3,
    "page": 163
  },
  {
    "topic": "حالت اعتکاف میں غسلِ مسنون کا مسئلہ",
    "volume": 3,
    "page": 164
  },
  {
    "topic": "مسجد کے اندر رہتے ہوئے معتکف کا ٹوٹی پر ہاتھ دھونا",
    "volume": 3,
    "page": 164
  },
  {
    "topic": "اعتکاف کے لیے مسجد کی شرط",
    "volume": 7,
    "page": 164
  },
  {
    "topic": "رخصتِ رمضان کی اباحت،افضلیت اور وجوب کا بیان",
    "volume": 9,
    "page": 165
  },
  {
    "topic": "عاشورۂ محرم کا روزہ",
    "volume": 7,
    "page": 168
  },
  {
    "topic": "رمضان المبارک کے حوالے سے چند اہم سوالات",
    "volume": 9,
    "page": 169
  },
  {
    "topic": "شبِ قدر کی برکات",
    "volume": 9,
    "page": 172
  },
  {
    "topic": "روزے کے چند ضروری مسائل",
    "volume": 8,
    "page": 177
  },
  {
    "topic": "صدقۂ فطر کی مقدار",
    "volume": 9,
    "page": 177
  },
  {
    "topic": "روزے میں انجیکشن لگانے کا حکم",
    "volume": 9,
    "page": 179
  },
  {
    "topic": "دودھ پلانے والی ماں کے لیے روزے کا حکم",
    "volume": 4,
    "page": 181
  },
  {
    "topic": "قارِن پر جنایت کے سبب ایک یا دو دَم لازم آنے کا ضابطہ",
    "volume": 9,
    "page": 181
  },
  {
    "topic": "عذر کی بنا پر روزے چھوڑنا",
    "volume": 4,
    "page": 183
  },
  {
    "topic": "نفلی اعتکاف کے لیے کوئی شرط نہیں",
    "volume": 8,
    "page": 183
  },
  {
    "topic": "غسل واجب ہو اور صبح صادق",
    "volume": 4,
    "page": 184
  },
  {
    "topic": "اعتکاف کےلیے مسجد کا جامع ہونا شرط نہیں",
    "volume": 8,
    "page": 184
  },
  {
    "topic": "عمرے کا طریقہ",
    "volume": 9,
    "page": 184
  },
  {
    "topic": "اعتکاف کی قضا",
    "volume": 8,
    "page": 186
  },
  {
    "topic": "مخصوص ایام میں اِحرام باندھنے کا شرعی حکم",
    "volume": 9,
    "page": 186
  },
  {
    "topic": "کیا روزے کی زبانی نیت ضروری ہے ؟",
    "volume": 1,
    "page": 187
  },
  {
    "topic": "تراویح کی رکعات کتنی ہیں",
    "volume": 2,
    "page": 187
  },
  {
    "topic": "کیا تراویح بیٹھ کر پڑھی جا سکتی ہیں",
    "volume": 2,
    "page": 187
  },
  {
    "topic": "عذر کے سبب اعتکاف نہ ہونے کا گناہ نہیں",
    "volume": 8,
    "page": 187
  },
  {
    "topic": "عمرہ کے بعد حج کی فرضیت کا حکم",
    "volume": 9,
    "page": 187
  },
  {
    "topic": "روزہ اور غسل واجب",
    "volume": 1,
    "page": 188
  },
  {
    "topic": "سائرن، ٹی وی ، اذان سے سحری کا اختتام",
    "volume": 1,
    "page": 188
  },
  {
    "topic": "شوال المکرم کے چھ روزے",
    "volume": 1,
    "page": 188
  },
  {
    "topic": "پانچ روزہ تراویح",
    "volume": 2,
    "page": 188
  },
  {
    "topic": "روزے کی حالت میں سرپر مہندی اور خوشبو لگانا",
    "volume": 2,
    "page": 188
  },
  {
    "topic": "مسنون دعاء افطار کب پڑھی جائے",
    "volume": 2,
    "page": 188
  },
  {
    "topic": "روزے میں جھوٹ ، چغلی اور غیبت کا حکم",
    "volume": 1,
    "page": 189
  },
  {
    "topic": "کیا دس سالہ بچی پر روزہ فرض ہے",
    "volume": 2,
    "page": 189
  },
  {
    "topic": "ڈاکٹر کا ٹیوبلائزیشن کے ذریعے بچوں کی ولادت کا آپریشن کرنا",
    "volume": 2,
    "page": 189
  },
  {
    "topic": "روزے کی حالت میں خون دینا ، آنکھ کان میں دوا ڈالنا وغیرہ",
    "volume": 1,
    "page": 190
  },
  {
    "topic": "روزے میں خواتین کا میک اپ کرنا",
    "volume": 1,
    "page": 190
  },
  {
    "topic": "روزے کی حالت میں اگربتی سلگانا",
    "volume": 2,
    "page": 190
  },
  {
    "topic": "روزے میں Inhalerکا استعمال",
    "volume": 2,
    "page": 190
  },
  {
    "topic": "روزے کی حالت میں آنکھ میں سرمہ لگانا یا دوا کے ڈراپ ڈالنا",
    "volume": 2,
    "page": 190
  },
  {
    "topic": "روزے میں مسواک کا حکم",
    "volume": 1,
    "page": 191
  },
  {
    "topic": "روزے میں خون دینا",
    "volume": 1,
    "page": 191
  },
  {
    "topic": "روزے میں وکس لگانے کا حکم",
    "volume": 1,
    "page": 191
  },
  {
    "topic": "روزے کی حالت میں لپ اسٹک لگانا",
    "volume": 2,
    "page": 191
  },
  {
    "topic": "معتکف خاتون کا اپنے لیے کھانا خود تیار کرنا",
    "volume": 2,
    "page": 191
  },
  {
    "topic": "روزے میں سحری کے بعد اگر غسل واجب ہوجائے تو روزہ رہے گا",
    "volume": 2,
    "page": 191
  },
  {
    "topic": "بیوی ”بائی پاس آپریشن “ کی وجہ سے روزہ نہیں رکھ سکتی",
    "volume": 2,
    "page": 191
  },
  {
    "topic": "روزے میں آنکھ ، ناک ، کان میں دوا کا استعمال",
    "volume": 1,
    "page": 192
  },
  {
    "topic": "مفسدات صوم وجدید مسائل",
    "volume": 1,
    "page": 192
  },
  {
    "topic": "سحری میں اذان شروع ہونے کے بعد کھانا اور پینا",
    "volume": 2,
    "page": 192
  },
  {
    "topic": "کوئی شخص دوسرے ملک میں رمضان کے روزے رکھ کر آئے تو اب تکمیل کس حساب سے کرے",
    "volume": 2,
    "page": 192
  },
  {
    "topic": "بچے کی ولادت کے کتنے دن بعد روزہ رکھا جائے",
    "volume": 1,
    "page": 193
  },
  {
    "topic": "رمضان المبارک کی ستائسویں شب کو بعد نمازِ تراویح مخصوص سورتیں پڑھنا",
    "volume": 2,
    "page": 193
  },
  {
    "topic": "روزے کی حالت میں خون دینا",
    "volume": 2,
    "page": 194
  },
  {
    "topic": "حاملہ عورت کو الٹی آجائے تو کیا روزہ توڑ دے",
    "volume": 2,
    "page": 195
  },
  {
    "topic": "رمضان المبارک میں عشاء کی نماز تنہا پڑھنے والا ، وتر جماعت کے ساتھ پڑھے یا تنہا",
    "volume": 2,
    "page": 195
  },
  {
    "topic": "قضا روزے",
    "volume": 1,
    "page": 197
  },
  {
    "topic": "ایام مخصوص میں چھوڑے ہوئے روزوں کی قضا اور نماز کی معافی",
    "volume": 1,
    "page": 198
  },
  {
    "topic": "تین روزہ ، پانچ روزہ یا دس روزہ تراویح",
    "volume": 1,
    "page": 199
  },
  {
    "topic": "روزے میں سرمہ لگانے کے جواز پر ایک دلچسپ اور مفید علمی بحث جدید طبی تحقیقات کی روشنی میں بعض فقہی مسائل پر نظرِ ثانی کی ضرورت",
    "volume": 2,
    "page": 200
  },
  {
    "topic": "رمضان المبارک کی عشرۂ اخیرہ میں شبینوں کا اہتمام",
    "volume": 1,
    "page": 201
  },
  {
    "topic": "عورتوں کا اجتماعی اعتکاف",
    "volume": 1,
    "page": 201
  },
  {
    "topic": "بچوں کو روزہ رکھوانے کا حکم",
    "volume": 6,
    "page": 201
  },
  {
    "topic": "مسجد الحرام میں اعتکاف کے مسائل",
    "volume": 1,
    "page": 202
  },
  {
    "topic": "مسجد میں افطار کرنے کا حکم",
    "volume": 6,
    "page": 202
  },
  {
    "topic": "رویت ہلال، چاند کے چھوٹا بڑا ہونے کا مسئلہ",
    "volume": 1,
    "page": 203
  },
  {
    "topic": "قے سے روزہ ٹوٹنے کا حکم",
    "volume": 6,
    "page": 203
  },
  {
    "topic": "یوم شک کا روزہ",
    "volume": 1,
    "page": 204
  },
  {
    "topic": "کیا مسلسل تین دن کے کئی قمری مہینے ہو سکتے ہیں ؟",
    "volume": 1,
    "page": 204
  },
  {
    "topic": "روزے کی حالت میں بچے کو دودھ پلانے کا حکم",
    "volume": 6,
    "page": 204
  },
  {
    "topic": "عید کے دو مہینے ناقص نہ ہونے کا مطلب",
    "volume": 1,
    "page": 205
  },
  {
    "topic": "روزے کی حالت میں احتلام ہونے سے روزہ نہیں ٹوٹتا",
    "volume": 6,
    "page": 205
  },
  {
    "topic": "پاکستان میں رمضان شروع کرکے سعودی عرب میں عید منانا",
    "volume": 1,
    "page": 206
  },
  {
    "topic": "عیدی دینا",
    "volume": 1,
    "page": 207
  },
  {
    "topic": "ایک ہی ملک میں روزہ اور عید الگ الگ کیوں ہوتے ہیں",
    "volume": 2,
    "page": 207
  },
  {
    "topic": "اسلامک ایجوکیشن انٹرنیشنل (برطانیہ )کی جانب سے رویتِ ہلال کے مسئلے پر استفسار",
    "volume": 2,
    "page": 207
  },
  {
    "topic": "نمازِ تراویح کے اجتماعات میں تلفظ کی ادائیگی و قراءت کا حکم",
    "volume": 6,
    "page": 207
  },
  {
    "topic": "کیا جمعہ کے دن نفلی روزہ رکھنا مکروہ ہے ؟",
    "volume": 1,
    "page": 208
  },
  {
    "topic": "صدقۂ فطر کس پر واجب ہے",
    "volume": 6,
    "page": 209
  },
  {
    "topic": "صدقۂ فطر کی ادائیگی کے لیے قرض لیا جا سکتا ہے ؟",
    "volume": 6,
    "page": 210
  },
  {
    "topic": "تیس رمضان کو دن کے وقت چاند نظر آنے سے متعلق شرعی مسائل رویتِ ہلال سے متعلق چند اہم مسائل",
    "volume": 6,
    "page": 211
  },
  {
    "topic": "سفر میں روزے کا شرعی حکم",
    "volume": 5,
    "page": 213
  },
  {
    "topic": "دائمی عذر کے سبب روزہ نہ رکھنے والے پر فدیہ ہے ، کفارہ نہیں",
    "volume": 5,
    "page": 217
  },
  {
    "topic": "نمازِ تراویح سنتِ مؤکدہ ہے",
    "volume": 5,
    "page": 218
  },
  {
    "topic": "روزے کی حالت میں جان بوجھ کر بام یا وکس کی دھونی لینا مفسدِصوم ہے",
    "volume": 12,
    "page": 241
  },
  {
    "topic": "عذر کی بنا پر روزہ چھوڑنے کی رخصت",
    "volume": 12,
    "page": 243
  },
  {
    "topic": "شوال المکرم کے چھ روزوں کی شرعی حیثیت",
    "volume": 14,
    "page": 246
  },
  {
    "topic": "نفلی روزے توڑنے پر کفارہ نہیں",
    "volume": 10,
    "page": 247
  },
  {
    "topic": "روزے کی حالت میں مسواک کا استعمال",
    "volume": 12,
    "page": 247
  },
  {
    "topic": "رمضان کا روزہ عذر کے بغیر چھوڑ دینا",
    "volume": 10,
    "page": 249
  },
  {
    "topic": "روزے کی قضا فی الفور واجب نہیں",
    "volume": 12,
    "page": 249
  },
  {
    "topic": "صومِ یومِ عرفہ کی فضیلت اور حاجی کےلیے عرفہ کے روزے کا حکم",
    "volume": 10,
    "page": 252
  },
  {
    "topic": "دبئی میں سحری کا وقت",
    "volume": 12,
    "page": 252
  },
  {
    "topic": "رمضان مبارک یا عید کی مبارکباد دینا کیسا ہے !",
    "volume": 12,
    "page": 254
  },
  {
    "topic": "روزے کی قضا",
    "volume": 12,
    "page": 256
  },
  {
    "topic": "روزے کی حالت میں ٹیسٹ کرانا",
    "volume": 12,
    "page": 257
  },
  {
    "topic": "کورونا کی پابندیوں کے زمانے میں نمازِ عید کا حکم",
    "volume": 12,
    "page": 258
  },
  {
    "topic": "روزے کی حالت میں مسواک کا استعمال",
    "volume": 11,
    "page": 273
  },
  {
    "topic": "روزے کی قضا فی الفور واجب نہیں",
    "volume": 11,
    "page": 275
  },
  {
    "topic": "دینی طالبات کا مخصوص ایام کے دوران اوراقِ قرآن کو چھونا",
    "volume": 8,
    "page": 27
  },
  {
    "topic": "معذور کے وضو کا حکم",
    "volume": 8,
    "page": 32
  },
  {
    "topic": "استعمال شدہ پانی کے قطرے صاف پانی میں گرنے کا حکم",
    "volume": 8,
    "page": 33
  },
  {
    "topic": "وقفے سے کلی کرنے اور ناک میں پانی ڈالنے سے غسل واجب ادا ہوجاتا ہے",
    "volume": 8,
    "page": 37
  },
  {
    "topic": "واشنگ مشین میں کپڑوں کی دھلائی",
    "volume": 9,
    "page": 37
  },
  {
    "topic": "قالین کی طہارت",
    "volume": 9,
    "page": 38
  },
  {
    "topic": "موجودہ زمانے میں ناپاکی کے مسائل میں درھم کی مقدار کتنی ہے؟",
    "volume": 3,
    "page": 39
  },
  {
    "topic": "ناک میں پانی نہ ڈالنے اور کلی کے بغیر وضو کا حکم",
    "volume": 3,
    "page": 39
  },
  {
    "topic": "دائمی معذور کی نماز اور مسجد میں جانے کا حکم",
    "volume": 9,
    "page": 40
  },
  {
    "topic": "غسل کے بعد وضو",
    "volume": 4,
    "page": 47
  },
  {
    "topic": "بچے کی پیدائش کے بعد زچہ اور بچہ کا غسل",
    "volume": 4,
    "page": 48
  },
  {
    "topic": "غسل کے بعد وضو",
    "volume": 1,
    "page": 49
  },
  {
    "topic": "نیل پالش اور وضو",
    "volume": 1,
    "page": 49
  },
  {
    "topic": "کیا جھوٹ بولنے سے وضو ٹوٹتا ہے",
    "volume": 1,
    "page": 50
  },
  {
    "topic": "دوران نماز وضو کا ٹوٹنا",
    "volume": 1,
    "page": 50
  },
  {
    "topic": "وضو کی جگہ پر جوتے دھونا",
    "volume": 1,
    "page": 50
  },
  {
    "topic": "ہاتھ پاک کرنا",
    "volume": 1,
    "page": 51
  },
  {
    "topic": "آنسو بہنے سے وضو پر اثر",
    "volume": 1,
    "page": 51
  },
  {
    "topic": "حائض اور جنب کے لیے قرآن کی تلاوت اور چھونے کا حکم",
    "volume": 1,
    "page": 52
  },
  {
    "topic": "معلمات اور طالبات کا ایام کے دوران تعلیم قرآن",
    "volume": 1,
    "page": 52
  },
  {
    "topic": "پان یا نسوار منہ میں رکھ کر سلام کا جواب دینا",
    "volume": 1,
    "page": 52
  },
  {
    "topic": "ڈرائی کلین کیے ہوئے کپڑوں کی طہارت کا مسئلہ",
    "volume": 1,
    "page": 53
  },
  {
    "topic": "کنویں میں جانور کا گرنا",
    "volume": 5,
    "page": 53
  },
  {
    "topic": "پانی کے پاک یاناپاک ہونے کی شرائط",
    "volume": 7,
    "page": 53
  },
  {
    "topic": "بغل اور زیرناف بالوں کے ازالے کے لیے کون ساطریقہ بہتر ہے ؟",
    "volume": 1,
    "page": 54
  },
  {
    "topic": "وضو کے دوران سلام کا جواب دینا",
    "volume": 7,
    "page": 56
  },
  {
    "topic": "پانی کے کنویں میں گٹر کا پانی رِس کرآنا اور اس سے پیدا شدہ مسائل",
    "volume": 5,
    "page": 57
  },
  {
    "topic": "غسلِ مسنون کا طریقہ",
    "volume": 6,
    "page": 57
  },
  {
    "topic": "ستر کھولنے سے وضو نہیں ٹوٹتا",
    "volume": 6,
    "page": 59
  },
  {
    "topic": "فٹ پاتھ پر وضو خانہ",
    "volume": 5,
    "page": 60
  },
  {
    "topic": "حالتِ اعتکاف میں غسلِ مسنون کا حکم",
    "volume": 6,
    "page": 60
  },
  {
    "topic": "عذر کے سبب وضو قائم نہ رہنے کی صورت میں عبادات کی ادائیگی کا حکم",
    "volume": 5,
    "page": 61
  },
  {
    "topic": "محض خواب دیکھنے پر غسل کا وجوب",
    "volume": 2,
    "page": 65
  },
  {
    "topic": "ناپاک بدن پر پاک کپڑے",
    "volume": 2,
    "page": 65
  },
  {
    "topic": "ناپاک کپڑا پہننے سے کیا بدن پاک ہوجاتاہے",
    "volume": 2,
    "page": 65
  },
  {
    "topic": "بالغ کے ختنہ اور فالج زدہ شخص کے زیرِ ناف بال زائل کرنے کا حکم",
    "volume": 5,
    "page": 65
  },
  {
    "topic": "جلد سے جڑے ہوئے مصنوعی بالوں کی طہارت کا مسئلہ",
    "volume": 2,
    "page": 66
  },
  {
    "topic": "حضرت علی رضی اللہ عنہ کا حضرت فاطمہ کو غسل دینا (وضاحتی نوٹ)",
    "volume": 2,
    "page": 66
  },
  {
    "topic": "نفاس کی مدت",
    "volume": 2,
    "page": 68
  },
  {
    "topic": "کیا ڈیڑھ سالہ بچی کے پیشاب سے کپڑے ناپاک ہوجاتے ہیں",
    "volume": 2,
    "page": 69
  },
  {
    "topic": "خواتین کا ایام مخصوص میں مہندی لگانا",
    "volume": 2,
    "page": 69
  },
  {
    "topic": "گلی کوچوں کے ناپاک پانی کا بدن یا کپڑوں پر لگنا",
    "volume": 2,
    "page": 69
  },
  {
    "topic": "ٹھوس نجاست سے آلودہ خشک زمین کا حکم",
    "volume": 11,
    "page": 69
  },
  {
    "topic": "طہارت کا ایک مسئلہ",
    "volume": 11,
    "page": 70
  },
  {
    "topic": "وضو کے بارے میں ایک پیچیدہ مسئلہ",
    "volume": 11,
    "page": 71
  },
  {
    "topic": "وضو سے پہلے بسم اللہ پڑھنے کا حکم",
    "volume": 10,
    "page": 85
  },
  {
    "topic": "حسی ناپاکی اور معنوی ناپاکی میں فرق ہے",
    "volume": 10,
    "page": 89
  },
  {
    "topic": "لیکوریا کی رطوبت پاک ہے",
    "volume": 10,
    "page": 94
  },
  {
    "topic": "تیمم کا طریقہ",
    "volume": 10,
    "page": 96
  },
  {
    "topic": "نجاست کھانے والے جانوروں کا حکم",
    "volume": 10,
    "page": 96
  },
  {
    "topic": "عمامہ پر مسح کرنے کا شرعی حکم",
    "volume": 12,
    "page": 97
  },
  {
    "topic": "طہارت کا مسئلہ",
    "volume": 10,
    "page": 99
  },
  {
    "topic": "اَعضائے وضو کا دھونا فرض ہے",
    "volume": 12,
    "page": 100
  },
  {
    "topic": "سینی ٹائزر کا استعمال",
    "volume": 12,
    "page": 103
  },
  {
    "topic": "کموڈ کی صفائی کا طریقہ",
    "volume": 13,
    "page": 103
  },
  {
    "topic": "بغیر وضو لیپ ٹاپ یا موبائل اسکرین پر قرآن مجید کی تلاوت کرنا",
    "volume": 13,
    "page": 104
  },
  {
    "topic": "کپڑوں کی طہارت کا مسئلہ",
    "volume": 10,
    "page": 105
  },
  {
    "topic": "استنجا کرنے میں مبالغہ کی ایک صورت",
    "volume": 13,
    "page": 106
  },
  {
    "topic": "بیت الخلاء کا رُخ",
    "volume": 13,
    "page": 108
  },
  {
    "topic": "شدید سردی میں تیمم کی رخصت",
    "volume": 14,
    "page": 122
  },
  {
    "topic": "قے میں آنے والے خون کا حکم",
    "volume": 14,
    "page": 124
  },
  {
    "topic": "دائمی معذور کے وضو کا مسئلہ",
    "volume": 14,
    "page": 126
  },
  {
    "topic": "جائے نماز اور ٹوپی دھونے میں احتیاط",
    "volume": 14,
    "page": 129
  },
  {
    "topic": "طہارت کا حکم",
    "volume": 14,
    "page": 129
  },
  {
    "topic": "موبائل SMSکے ذریعے طلاق",
    "volume": 9,
    "page": 209
  },
  {
    "topic": "ثبوتِ طلاق کے لیے شوہر کا اقرار کافی ہے",
    "volume": 9,
    "page": 212
  },
  {
    "topic": "طلاق کا حکم",
    "volume": 9,
    "page": 214
  },
  {
    "topic": "طلاق کا ایک مسئلہ",
    "volume": 9,
    "page": 215
  },
  {
    "topic": "توکیلِ طلاق",
    "volume": 9,
    "page": 219
  },
  {
    "topic": "غیر منقسم ترکے کے کاروبار میں ورثاء کا استحقاق",
    "volume": 9,
    "page": 220
  },
  {
    "topic": "فسخِ نکاح کی شرعی حیثیت",
    "volume": 7,
    "page": 243
  },
  {
    "topic": "طلاق اور خلع میں فرق",
    "volume": 7,
    "page": 247
  },
  {
    "topic": "بیوی کو ماں کہنے سے ظہار نہیں ہوگا",
    "volume": 7,
    "page": 249
  },
  {
    "topic": "طلاق کا احسن طریقہ",
    "volume": 1,
    "page": 251
  },
  {
    "topic": "تحریری طلاق اور نفقہ",
    "volume": 3,
    "page": 251
  },
  {
    "topic": "طلاقِ رجعی",
    "volume": 3,
    "page": 251
  },
  {
    "topic": "ماں کا تربیت اولاد کا حق کب ساقط ہوتا ہے؟",
    "volume": 7,
    "page": 251
  },
  {
    "topic": "طلاق لینے کا طریقہ",
    "volume": 1,
    "page": 252
  },
  {
    "topic": "تحریری طلاق",
    "volume": 1,
    "page": 252
  },
  {
    "topic": "خلع کی صورت میں حق مہر کا حکم",
    "volume": 7,
    "page": 252
  },
  {
    "topic": "طلاق مغلّظہ کے باوجود بیوی کا شوہر کے ساتھ رہنا اور اولاد کے نسب کا مسئلہ",
    "volume": 1,
    "page": 253
  },
  {
    "topic": "ایک طلاق تصور ہوگی",
    "volume": 3,
    "page": 253
  },
  {
    "topic": "خلع کی صورت میں شوہر پر نفقہ واجب ہے",
    "volume": 7,
    "page": 254
  },
  {
    "topic": "حاملہ کو طلاق دینا",
    "volume": 1,
    "page": 255
  },
  {
    "topic": "حق پرورش کے استحقاق کے لیے عمر کا تعین",
    "volume": 7,
    "page": 255
  },
  {
    "topic": "طلاق کا حق بیوی کو دینا",
    "volume": 1,
    "page": 256
  },
  {
    "topic": "طلاق بائن کا ایک دقیق فقہی مسئلہ",
    "volume": 1,
    "page": 257
  },
  {
    "topic": "موضوع بحث، پس منظر ،الاستفتاء",
    "volume": 1,
    "page": 257
  },
  {
    "topic": "مسئلہ طلاق",
    "volume": 3,
    "page": 257
  },
  {
    "topic": "جواب",
    "volume": 1,
    "page": 258
  },
  {
    "topic": "مسئلہ طلاق وحقوق ازدواج",
    "volume": 3,
    "page": 259
  },
  {
    "topic": "مسئلہ دو طلاق رجعی",
    "volume": 3,
    "page": 261
  },
  {
    "topic": "مسئلہ تفویض طلاق",
    "volume": 3,
    "page": 262
  },
  {
    "topic": "طلاق واقع ہونے کے لیے شوہر کا اقرار بھی کافی ہے",
    "volume": 8,
    "page": 263
  },
  {
    "topic": "متابعۃ الجواب",
    "volume": 1,
    "page": 264
  },
  {
    "topic": "عدت گزرنے کے بعد فسخِ نکاح کی شرعی حیثیت نہیں",
    "volume": 8,
    "page": 264
  },
  {
    "topic": "طلاقِ بائن",
    "volume": 8,
    "page": 265
  },
  {
    "topic": "کورٹ میرج کے نتیجے میں رخصتی سے قبل طلاق کا حکم",
    "volume": 2,
    "page": 267
  },
  {
    "topic": "عدالتیں ’’فسخِ نکاح‘‘ اور ’’خلع‘‘ میں فرق کریں",
    "volume": 3,
    "page": 267
  },
  {
    "topic": "طلاقِ رجعی کے بعد رجوع کا طریقہ",
    "volume": 8,
    "page": 267
  },
  {
    "topic": "شوہر کا طلاق سے انکار، دیانت وقضا کا فرق",
    "volume": 2,
    "page": 268
  },
  {
    "topic": "طلاقِ بائن",
    "volume": 8,
    "page": 269
  },
  {
    "topic": "رد’’متابعۃ الجواب‘‘",
    "volume": 1,
    "page": 271
  },
  {
    "topic": "مسلمہ اصول کی خلاف ورزی",
    "volume": 1,
    "page": 271
  },
  {
    "topic": "استفتاء میں لفظی ومعنوی تحریف",
    "volume": 1,
    "page": 271
  },
  {
    "topic": "تفویض طلاق",
    "volume": 2,
    "page": 271
  },
  {
    "topic": "عدالتی طلاق",
    "volume": 2,
    "page": 272
  },
  {
    "topic": "ارادۂ طلاق ،طلاق نہیں",
    "volume": 2,
    "page": 272
  },
  {
    "topic": "طلاق معلق بالشرط کا حکم",
    "volume": 8,
    "page": 272
  },
  {
    "topic": "علامہ مفتی عبدالعزیز حنفی کا اپنے سابق جواب پر استقرار سے گریز",
    "volume": 1,
    "page": 273
  },
  {
    "topic": "اصل فتویٰ کی ’’بناء استدلال‘‘ کا ذکر",
    "volume": 1,
    "page": 273
  },
  {
    "topic": "علامہ مفتی عبدالعزیز حنفی کا نظریہ",
    "volume": 1,
    "page": 274
  },
  {
    "topic": "علامہ مفتی عبدالعزیز حنفی کی تازہ بنائے استدلال",
    "volume": 1,
    "page": 274
  },
  {
    "topic": "البحر الرائق کی اصل عبارت اور اس کا صحیح مفہوم",
    "volume": 1,
    "page": 274
  },
  {
    "topic": "طلاقِ ثلاثہ کا مسئلہ",
    "volume": 2,
    "page": 274
  },
  {
    "topic": "بیوی کو محض اذیت دینے کی خاطر لٹکائے رکھنا",
    "volume": 3,
    "page": 274
  },
  {
    "topic": "طلاق کا مسئلہ",
    "volume": 2,
    "page": 275
  },
  {
    "topic": "’’دلالتِ حال‘‘ نسبتِ طلاق کے لیے کافی ہے",
    "volume": 4,
    "page": 275
  },
  {
    "topic": "طلاق کے مؤثر ہونے کے لیے بیوی کو طلاق نامہ ملنا ضروری نہیں ہے",
    "volume": 8,
    "page": 275
  },
  {
    "topic": "جد الممتار کی عبارت سے استدلال",
    "volume": 1,
    "page": 276
  },
  {
    "topic": "لکھ کر دینا ’’طاق دیا ہوں‘‘",
    "volume": 2,
    "page": 276
  },
  {
    "topic": "دو طلاق کے بعد رجوع",
    "volume": 3,
    "page": 276
  },
  {
    "topic": "کسی شرط کے ساتھ معلق کی گئی طلاق سے کیسے نجات حاصل کی جائے؟",
    "volume": 2,
    "page": 277
  },
  {
    "topic": "عدالتی خلع کا شرعی حکم",
    "volume": 2,
    "page": 277
  },
  {
    "topic": "محض ارادۂ طلاق سے طلاق واقع نہیں ہوتی",
    "volume": 3,
    "page": 277
  },
  {
    "topic": "ازدواجی تعلقات میں کشیدگی اور طلاق",
    "volume": 4,
    "page": 277
  },
  {
    "topic": "تحریری طلاق اقرار یا گواہوں سے ثابت ہو تو مؤثر ہوتی ہے",
    "volume": 8,
    "page": 277
  },
  {
    "topic": "تین طلاق کا مسئلہ",
    "volume": 3,
    "page": 278
  },
  {
    "topic": "خاتون کا نکاح ہوا، رخصتی نہیں ہوئی اور اسے طلاق ہوگئی یا شوہر کا انتقال ہوگیا، عدت ومہر کے احکام",
    "volume": 2,
    "page": 279
  },
  {
    "topic": "ایک طلاقِ رجعی عدت گزرنے پر بائن ہوجاتی ہے",
    "volume": 8,
    "page": 279
  },
  {
    "topic": "طلاق نامے پر جعلی یا فرضی دستخط سے طلاق واقع نہیں ہوتی",
    "volume": 2,
    "page": 280
  },
  {
    "topic": "کیا ماں کے کہنے پر شرعاً بیوی کو طلاق دینا ضروری ہے؟",
    "volume": 2,
    "page": 280
  },
  {
    "topic": "تحریری طلاق کا حکم",
    "volume": 3,
    "page": 280
  },
  {
    "topic": "طلاقِ ثلاثہ کے بعد شوہراول سے نکاح کا حکم",
    "volume": 4,
    "page": 280
  },
  {
    "topic": "بیوی کو دیے ہوئے زیورات کا حکم",
    "volume": 8,
    "page": 280
  },
  {
    "topic": "پس نوشت",
    "volume": 1,
    "page": 281
  },
  {
    "topic": "الفاظِ طلاق",
    "volume": 4,
    "page": 281
  },
  {
    "topic": "طلاق غصے ہی میں دی جاتی ہے",
    "volume": 8,
    "page": 281
  },
  {
    "topic": "طلاق نامہ پر شوہر کے جعلی دستخط",
    "volume": 3,
    "page": 282
  },
  {
    "topic": "مذکراۂ طلاق",
    "volume": 4,
    "page": 283
  },
  {
    "topic": "دائمی تفویضِ طلاق",
    "volume": 8,
    "page": 283
  },
  {
    "topic": "حالتِ حمل میں نفاذِ طلاق",
    "volume": 3,
    "page": 284
  },
  {
    "topic": "عدت کا خرچہ کس طرح دیا جائے گا",
    "volume": 8,
    "page": 285
  },
  {
    "topic": "تین طلاق کا حکم",
    "volume": 4,
    "page": 286
  },
  {
    "topic": "طلاق کا ایک مسئلہ",
    "volume": 8,
    "page": 286
  },
  {
    "topic": "جائز شرعی وجوہ کی بنا پر عورت عدالت سے فسخِ نکاح کی استدعا کرسکتی ہے",
    "volume": 3,
    "page": 287
  },
  {
    "topic": "طلاق کا مطالبہ کرنے والی عورت کا حکم",
    "volume": 8,
    "page": 287
  },
  {
    "topic": "طلاق کا مسئلہ(لڑنے جگھڑنے پر )",
    "volume": 12,
    "page": 287
  },
  {
    "topic": "عدت کے احکام",
    "volume": 3,
    "page": 289
  },
  {
    "topic": "طلاق میں اضافت",
    "volume": 4,
    "page": 289
  },
  {
    "topic": "شک کی صورت میں طلاق کی بنا کم پر ہوگی",
    "volume": 8,
    "page": 289
  },
  {
    "topic": "کسی کا یہ کہنا : میں نے اپنی بیوی کو تین طلاقیں دے دی ہیں",
    "volume": 12,
    "page": 290
  },
  {
    "topic": "بیوی کو مشروط طلاق دینا",
    "volume": 4,
    "page": 292
  },
  {
    "topic": "طلاق کے الفاظ",
    "volume": 12,
    "page": 292
  },
  {
    "topic": "طلاق کے کاغذ پر مکان کے کاغذ کہہ کر دھوکے سے دستخط لینا",
    "volume": 3,
    "page": 293
  },
  {
    "topic": "خلع اور حقِ حضانت",
    "volume": 4,
    "page": 293
  },
  {
    "topic": "ایلاء",
    "volume": 3,
    "page": 295
  },
  {
    "topic": "طلاقِ بائن کو بائن لاحق نہیں ہوتی",
    "volume": 4,
    "page": 295
  },
  {
    "topic": "طلاقِ صریح",
    "volume": 12,
    "page": 295
  },
  {
    "topic": "الفاظِ صریح یا کنایہ کا تعین",
    "volume": 3,
    "page": 298
  },
  {
    "topic": "’’تم تو میری بیوی نہیں ہو‘‘ الفاظِ طلاق نہیں",
    "volume": 4,
    "page": 298
  },
  {
    "topic": "دو طلاق کا حکم",
    "volume": 3,
    "page": 299
  },
  {
    "topic": "مسئلہ طلاق",
    "volume": 4,
    "page": 299
  },
  {
    "topic": "طلاق کے چند الفاظ کا حکم",
    "volume": 12,
    "page": 299
  },
  {
    "topic": "تعلیقِ طلاق",
    "volume": 3,
    "page": 300
  },
  {
    "topic": "مشروط طلاق",
    "volume": 4,
    "page": 301
  },
  {
    "topic": "تصدیقات وتائیدات علمائے کرام",
    "volume": 1,
    "page": 302
  },
  {
    "topic": "نکاح سے پہلے طلاق مؤثر نہیں ہوتی",
    "volume": 3,
    "page": 302
  },
  {
    "topic": "طلاق کا مسئلہ (1)",
    "volume": 12,
    "page": 302
  },
  {
    "topic": "طلاق معلق بالشرط",
    "volume": 4,
    "page": 303
  },
  {
    "topic": "طلاق کا مسئلہ (2)",
    "volume": 12,
    "page": 303
  },
  {
    "topic": "خلع",
    "volume": 4,
    "page": 304
  },
  {
    "topic": "زوج مفقود الخبر",
    "volume": 4,
    "page": 304
  },
  {
    "topic": "طلاق کا مسئلہ (3)",
    "volume": 12,
    "page": 305
  },
  {
    "topic": "طلاق کا مسئلہ (4)",
    "volume": 12,
    "page": 306
  },
  {
    "topic": "دوطلاق کے بعد رجوع",
    "volume": 1,
    "page": 307
  },
  {
    "topic": "بہن سے قطع تعلق کی قسم کھانا",
    "volume": 1,
    "page": 307
  },
  {
    "topic": "مشروط طلاق دینا، دارالعلوم کراچی کے فتویٰ کا رد",
    "volume": 1,
    "page": 309
  },
  {
    "topic": "تحریری طلاق نامہ لڑکی کو نہ ملے تب بھی طلاق واقع ہوجاتی ہے",
    "volume": 4,
    "page": 309
  },
  {
    "topic": "طلاقِ مغلظہ کے بعد تعلقات",
    "volume": 4,
    "page": 311
  },
  {
    "topic": "ثبوتِ طلاق کے طریقے",
    "volume": 4,
    "page": 312
  },
  {
    "topic": "دو طلاق کے بعد نکاح پھر تیسری طلاق",
    "volume": 1,
    "page": 313
  },
  {
    "topic": "دوران عدت گھر سے باہر نکلنا",
    "volume": 1,
    "page": 313
  },
  {
    "topic": "ایک طلاق دے کر تین طلاقیں مراد لینے کا حکم",
    "volume": 6,
    "page": 313
  },
  {
    "topic": "طلاقِ غیر مدخولہ",
    "volume": 4,
    "page": 314
  },
  {
    "topic": "نکاح کے بعد عائد کردہ شرطِ طلاق لاگو ہوتی ہے یا نہیں؟",
    "volume": 6,
    "page": 314
  },
  {
    "topic": "بدزبان بیوی",
    "volume": 1,
    "page": 315
  },
  {
    "topic": "نکمے مفت خور شوہر سے نجات",
    "volume": 1,
    "page": 315
  },
  {
    "topic": "تحلیلِ شرعی کے لیے شخصِ غیر کی قید",
    "volume": 4,
    "page": 315
  },
  {
    "topic": "یہ فسخِ نکاح کی جائز بنیاد نہیں",
    "volume": 6,
    "page": 315
  },
  {
    "topic": "ماں کے نام سے نسبت",
    "volume": 1,
    "page": 316
  },
  {
    "topic": "لے پالک",
    "volume": 1,
    "page": 316
  },
  {
    "topic": "طلاق ہوئی یا نہیں؟",
    "volume": 4,
    "page": 316
  },
  {
    "topic": "لے پالک کا نسب",
    "volume": 1,
    "page": 317
  },
  {
    "topic": "جبری طلاق کی ایک صورت",
    "volume": 4,
    "page": 317
  },
  {
    "topic": "والدہ کے حکم پر بیوی کو طلاق دینا",
    "volume": 6,
    "page": 317
  },
  {
    "topic": "’’عاق ‘‘ کی شرعی حیثیت",
    "volume": 1,
    "page": 320
  },
  {
    "topic": "لاوارث بچی کی ولدیت کا مسئلہ",
    "volume": 1,
    "page": 321
  },
  {
    "topic": "مطلقہ غیر مدخولہ کا مہر (1)",
    "volume": 4,
    "page": 321
  },
  {
    "topic": "مطلقہ غیر مدخولہ کا مہر (2)",
    "volume": 4,
    "page": 322
  },
  {
    "topic": "امام شافعی کے نزدیک تین طلاق کا حکم",
    "volume": 4,
    "page": 324
  },
  {
    "topic": "انکارِ طلاق کی صورت میں شرعاً کیا حکم ہے",
    "volume": 4,
    "page": 325
  },
  {
    "topic": "طلاقِ مدہوش",
    "volume": 4,
    "page": 329
  },
  {
    "topic": "فیملی کورٹس کے فاضل جج صاحبان کی خدمت میں مؤدّبانہ گزارشات",
    "volume": 4,
    "page": 330
  },
  {
    "topic": "نشے کی حالت میں دی جانے والی طلاق کا حکم",
    "volume": 6,
    "page": 331
  },
  {
    "topic": "مہر اور ایام عدت کا نفقہ",
    "volume": 13,
    "page": 331
  },
  {
    "topic": "طلاق دینے پر جرمانہ",
    "volume": 13,
    "page": 331
  },
  {
    "topic": "موبائل ایس ایم ایس یا واٹس اپ پر دی جانے والی طلاق کا حکم",
    "volume": 13,
    "page": 333
  },
  {
    "topic": "ماں کا حق نگہداشت ساقط ہونے کی صورتیں",
    "volume": 4,
    "page": 337
  },
  {
    "topic": "نشے کی حالت میں طلاق",
    "volume": 6,
    "page": 337
  },
  {
    "topic": "تعلیقِ طلاق",
    "volume": 13,
    "page": 338
  },
  {
    "topic": "مجنون کی طلاق کا حکم",
    "volume": 13,
    "page": 339
  },
  {
    "topic": "بچوں کی کفالت",
    "volume": 4,
    "page": 340
  },
  {
    "topic": "طلاق کا ایک مسئلہ",
    "volume": 13,
    "page": 340
  },
  {
    "topic": "قرآن و حدیث کی روشنی میں طلاقِ بائن کا حکم",
    "volume": 13,
    "page": 344
  },
  {
    "topic": "طلاق کے الفاظ",
    "volume": 11,
    "page": 347
  },
  {
    "topic": "حضرت حفصہ رضی اللہ عنہا کی طلاق کے بارے میں ایک حدیث کی تحقیق",
    "volume": 13,
    "page": 347
  },
  {
    "topic": "طلاقِ صریح",
    "volume": 11,
    "page": 349
  },
  {
    "topic": "طلاق کی صورت میں مہر ساقط نہیں ہوگا",
    "volume": 13,
    "page": 351
  },
  {
    "topic": "حرمت کا شرعی مسئلہ",
    "volume": 6,
    "page": 352
  },
  {
    "topic": "طلاق کا ایک پیچیدہ مسئلہ",
    "volume": 13,
    "page": 353
  },
  {
    "topic": "موبائل SMSکے ذریعے طلاق کا حکم",
    "volume": 6,
    "page": 354
  },
  {
    "topic": "بیوی شوہر کو طلاق نہیں دے سکتی",
    "volume": 11,
    "page": 354
  },
  {
    "topic": "طلاق واقع ہوگئی",
    "volume": 13,
    "page": 356
  },
  {
    "topic": "مسلۂ طلاق",
    "volume": 13,
    "page": 357
  },
  {
    "topic": "تحریری طلاق",
    "volume": 13,
    "page": 359
  },
  {
    "topic": "وقوعِ طلاق کے لیے شوہر کا اقرار کافی ہے",
    "volume": 13,
    "page": 360
  },
  {
    "topic": "طلاق کی گواہی کا نصاب",
    "volume": 13,
    "page": 362
  },
  {
    "topic": "مرتَد علیحدگی کے بعد بیوی کو عدت کے اندر طلاق دے تو وہ مؤثر ہوگی",
    "volume": 5,
    "page": 367
  },
  {
    "topic": "کورٹ میرج اور طلاق",
    "volume": 5,
    "page": 369
  },
  {
    "topic": "طلاقِ کنایہ",
    "volume": 6,
    "page": 369
  },
  {
    "topic": "مختلف الفاظِ طلاق کا حکم",
    "volume": 6,
    "page": 370
  },
  {
    "topic": "طلاق کو شرط کے ساتھ معلق کرنا",
    "volume": 5,
    "page": 372
  },
  {
    "topic": "میں نے تمہیں چھوڑ دیا ،طلاقِ صریح ہے",
    "volume": 5,
    "page": 372
  },
  {
    "topic": "شوہر نے ایک طلاق لکھنے کا کہا، زائد طلاقیں موثر نہیں",
    "volume": 6,
    "page": 373
  },
  {
    "topic": "خبر دینے کی نیت سے کہے گئے الفاظ سے جدید طلاق واقع نہ ہوگی",
    "volume": 6,
    "page": 374
  },
  {
    "topic": "جبری طلاق کا حکم",
    "volume": 5,
    "page": 375
  },
  {
    "topic": "طلاقِ تعلیق",
    "volume": 6,
    "page": 375
  },
  {
    "topic": "طلاق واقع نہیں ہوئی",
    "volume": 6,
    "page": 376
  },
  {
    "topic": "طلاقِ صریح ،طلاق بائن کو لاحق ہوجاتی ہے",
    "volume": 5,
    "page": 377
  },
  {
    "topic": "اضافتِ طلاق",
    "volume": 6,
    "page": 378
  },
  {
    "topic": "طلاق نامے پر شوہر کا دستخط کرنا اسے قبول کرنا ہے",
    "volume": 14,
    "page": 378
  },
  {
    "topic": "کنایات کے الفاظ سے طلاق کا حکم",
    "volume": 14,
    "page": 379
  },
  {
    "topic": "طلاق واقع ہوگئی",
    "volume": 5,
    "page": 380
  },
  {
    "topic": "طلاق سُنّی",
    "volume": 6,
    "page": 380
  },
  {
    "topic": "بیوی کے قسم کھانے سے ایلاء نہیں ہوتا",
    "volume": 6,
    "page": 381
  },
  {
    "topic": "شوہر کے حقِ طلاق پر جرمانہ عائد کرنا",
    "volume": 10,
    "page": 381
  },
  {
    "topic": "طلاق کا ایک مسئلہ",
    "volume": 14,
    "page": 381
  },
  {
    "topic": "متفرق مواقع پر دی گئی طلاقیں مؤثر رہتی ہیں",
    "volume": 5,
    "page": 382
  },
  {
    "topic": "اخرس (گونگے) کی گواہی کا شرعی حکم",
    "volume": 10,
    "page": 382
  },
  {
    "topic": "غصے میں دی جانے والی طلاق کا حکم",
    "volume": 14,
    "page": 382
  },
  {
    "topic": "زنا کی مرتکب عورت کے لیے شرعی حکم",
    "volume": 6,
    "page": 383
  },
  {
    "topic": "تحریری طور پر تین طلاق کا حکم",
    "volume": 5,
    "page": 384
  },
  {
    "topic": "بوجہ مرض حیض نہ آنے والی عورت کی عدت",
    "volume": 6,
    "page": 385
  },
  {
    "topic": "یہ طلاق کے الفاظ نہیں ہیں",
    "volume": 14,
    "page": 385
  },
  {
    "topic": "الفاظ بدل کر طلاق دینا",
    "volume": 5,
    "page": 386
  },
  {
    "topic": "خلوتِ صحیحہ نہ ہونے کی صورت میں طلاق کے احکام",
    "volume": 14,
    "page": 386
  },
  {
    "topic": "’’میری طرف سے بھی سمجھو چھٹی‘‘ سے طلاق واقع نہیں ہوتی",
    "volume": 5,
    "page": 387
  },
  {
    "topic": "تعلیم کے لیے طلاق کے الفاظ استعمال کرنا",
    "volume": 5,
    "page": 389
  },
  {
    "topic": "طلاق کا مسئلہ",
    "volume": 14,
    "page": 389
  },
  {
    "topic": "یہ فسخِ نکاح شرعاً مؤثر نہیں",
    "volume": 5,
    "page": 390
  },
  {
    "topic": "اپنی بیوی کو ماں ، بہن یا بیٹی کہنے کا حکم",
    "volume": 14,
    "page": 390
  },
  {
    "topic": "نشے میں طلاق کا حکم",
    "volume": 5,
    "page": 391
  },
  {
    "topic": "عدالت کا فسخِ نکاح",
    "volume": 14,
    "page": 392
  },
  {
    "topic": "طلاق کا مسئلہ",
    "volume": 14,
    "page": 395
  },
  {
    "topic": "شوہر کی اجازت کے بغیر تفویضِ طلاق مؤثر نہیں ہے",
    "volume": 14,
    "page": 395
  },
  {
    "topic": "تعلیقِ طلاق کی ایک صورت",
    "volume": 10,
    "page": 398
  },
  {
    "topic": "مہر کی ادائیگی",
    "volume": 14,
    "page": 399
  },
  {
    "topic": "وٹس ایپ پر طلاق دینا",
    "volume": 10,
    "page": 400
  },
  {
    "topic": "دو طلاقوں کا حکم",
    "volume": 10,
    "page": 402
  },
  {
    "topic": "بیوی کو بہن کہنے پر طلاق کا حکم",
    "volume": 10,
    "page": 404
  },
  {
    "topic": "حاملہ عورت کی طلاق کا حکم",
    "volume": 10,
    "page": 404
  },
  {
    "topic": "طلاق کا ایک مسئلہ",
    "volume": 10,
    "page": 405
  },
  {
    "topic": "طلاق معلق کا حکم",
    "volume": 10,
    "page": 411
  },
  {
    "topic": "مطلقہ کے نفقے کا تعین",
    "volume": 10,
    "page": 413
  },
  {
    "topic": "غیر حائض مطلقہ عورت کی عدت",
    "volume": 10,
    "page": 416
  },
  {
    "topic": "عدت کے دوران دینی مقاصد کے لیے نکلنے کا حکم",
    "volume": 10,
    "page": 417
  },
  {
    "topic": "کتابتِ طلاق کا حکم",
    "volume": 10,
    "page": 419
  },
  {
    "topic": "حاملہ بیوہ کی عدت",
    "volume": 10,
    "page": 432
  },
  {
    "topic": "ماہِ ذوالحجہ میں ناخن اور بال کٹوانے کا حکم",
    "volume": 8,
    "page": 201
  },
  {
    "topic": "حلال جانور کے ذبح کا شرعی طریقہ",
    "volume": 7,
    "page": 203
  },
  {
    "topic": "آسٹریلوی گائے کی قربانی کا حکم",
    "volume": 8,
    "page": 203
  },
  {
    "topic": "قربانی کے کسی حصے دار کی وفات کی صورت میں قربانی کا حکم",
    "volume": 8,
    "page": 204
  },
  {
    "topic": "قربانی کا بدل مالِ صدقہ نہیں ہے",
    "volume": 8,
    "page": 205
  },
  {
    "topic": "قربانی کا جانور سالم خریدا پھر عیب دار ہوگیا",
    "volume": 8,
    "page": 206
  },
  {
    "topic": "حلال جانور کو ذبح سے پہلے سُن (Senseless) کرنا",
    "volume": 7,
    "page": 207
  },
  {
    "topic": "بیرونِ ملک مقیم مسلمانوں کو پاکستان میں قربانی کے لیے وہاں کے ایامِ نحر کا اعتبار کرنا ہوگا",
    "volume": 8,
    "page": 207
  },
  {
    "topic": "مشینی ذبیحے کا حکم",
    "volume": 7,
    "page": 212
  },
  {
    "topic": "عقیقے کے جانور کی شرائط",
    "volume": 7,
    "page": 214
  },
  {
    "topic": "ذبح کے وقت جانور کی گردن الگ ہوجائے تو جانور حرام نہیں ہوتا",
    "volume": 7,
    "page": 215
  },
  {
    "topic": "”قربانی“ قربانی کا وجوب",
    "volume": 1,
    "page": 230
  },
  {
    "topic": "خصی جانور کی قربانی",
    "volume": 1,
    "page": 231
  },
  {
    "topic": "قربانی کے فضائل ومسائل",
    "volume": 1,
    "page": 232
  },
  {
    "topic": "اگر ایامِ قربانی میں قربانی نہ کی ہو؟",
    "volume": 2,
    "page": 235
  },
  {
    "topic": "ذبح کا طریقہ",
    "volume": 1,
    "page": 236
  },
  {
    "topic": "خصی جانور کی قربانی کا حکم",
    "volume": 2,
    "page": 236
  },
  {
    "topic": "سات سے کم افراد گائے کی قربانی میں مساوی طور پر شریک ہوسکتے ہیں؟",
    "volume": 2,
    "page": 236
  },
  {
    "topic": "حلال جانور کے ممنوع اجزاء",
    "volume": 2,
    "page": 237
  },
  {
    "topic": "دمِ مسفوح سے کیا مراد ہے",
    "volume": 2,
    "page": 237
  },
  {
    "topic": "دین کے فرائض وواجبات کو ساقط کرنے کا کسی کو اختیار نہیں",
    "volume": 6,
    "page": 251
  },
  {
    "topic": "قربانی کا وقت گزرنے کے بعد قربانی کا جانور زندہ صدقہ کردیا جائے",
    "volume": 6,
    "page": 255
  },
  {
    "topic": "قربانی کے جانور میں عقیقے کا حکم",
    "volume": 6,
    "page": 257
  },
  {
    "topic": "لڑکے اور لڑکی کے عقیقے کا فرق",
    "volume": 6,
    "page": 258
  },
  {
    "topic": "طوطے کی حلت یا حرمت کا شرعی حکم",
    "volume": 6,
    "page": 260
  },
  {
    "topic": "قربانی کے جواز کی بابت سوال",
    "volume": 13,
    "page": 267
  },
  {
    "topic": "ذبح کے وقت بھول کر بسم اللہ نہ پڑھنا",
    "volume": 12,
    "page": 269
  },
  {
    "topic": "ثواب کا مدار قربانی کے جانور کی مالیت اور گوشت کی مقدار پر ہے",
    "volume": 13,
    "page": 270
  },
  {
    "topic": "قربانی کے حصہ دار پر اپنے حصے کی رقم قرض ہے",
    "volume": 12,
    "page": 272
  },
  {
    "topic": "قربانی کے واجب ہونے کا نصاب",
    "volume": 13,
    "page": 272
  },
  {
    "topic": "فاسق و گہنگار کے ذبیحے کا شرعی حکم",
    "volume": 13,
    "page": 274
  },
  {
    "topic": "جس جانور کے پیدائشی کان نہ ہوں",
    "volume": 13,
    "page": 278
  },
  {
    "topic": "دنیا داری کی خاطر قربانی کرنے اور نیاز کا حکم",
    "volume": 5,
    "page": 289
  },
  {
    "topic": "بھینس نر یا مادہ کی قربانی جائز ہے",
    "volume": 5,
    "page": 291
  },
  {
    "topic": "ایسے جانور کی قربانی جائز ہے جس کا سینگ نکال دیا گیا ہو",
    "volume": 5,
    "page": 292
  },
  {
    "topic": "قربانی کی کھال کا مصرف",
    "volume": 5,
    "page": 296
  },
  {
    "topic": "قربانی کے جانور کو خصی کرانے کا حکم",
    "volume": 5,
    "page": 299
  },
  {
    "topic": "مہر بند حلال گوشت کا شرعی حکم",
    "volume": 10,
    "page": 299
  },
  {
    "topic": "مشینی ذبیحے کا حکم",
    "volume": 5,
    "page": 301
  },
  {
    "topic": "حلال ذبیحہ جانور کے مکروہ اجزاء کا حدیث سے ثبوت",
    "volume": 5,
    "page": 303
  },
  {
    "topic": "قربانی کے جانور نے بچہ دیا",
    "volume": 10,
    "page": 303
  },
  {
    "topic": "اگر قربانی کے جانور کا پیدائشی طور پر ایک خصیہ نہ ہو تو اس کی قربانی جائز ہے",
    "volume": 10,
    "page": 304
  },
  {
    "topic": "سیہہ (Hedgehog) کا شرعی حکم",
    "volume": 5,
    "page": 305
  },
  {
    "topic": "قربانی کی بابت ایک سوال",
    "volume": 10,
    "page": 306
  },
  {
    "topic": "مصنوعی طریقے سے سینگ کے نظر نہ آنے یا انتہائی چھوٹا کیے ہوئے جانور کی قربانی کا حکم",
    "volume": 10,
    "page": 306
  },
  {
    "topic": "خنثیٰ جانور کی قربانی کا حکم",
    "volume": 10,
    "page": 311
  },
  {
    "topic": "گائے کی قربانی میں زیادہ سے زیادہ سات شراکت دار ہوسکتے ہیں، کم پر کوئی پابندی نہیں",
    "volume": 10,
    "page": 311
  },
  {
    "topic": "گیارہویں اور بارہویں ذوالحجہ کی رات میں قربانی مکروہ ہے، کی تو ادا ہوجائے گی",
    "volume": 10,
    "page": 312
  },
  {
    "topic": "قربانی کے عیب دار جانور کا مسئلہ",
    "volume": 10,
    "page": 313
  },
  {
    "topic": "عقیقے کے جانور کی عمر",
    "volume": 10,
    "page": 314
  },
  {
    "topic": "نبی ﷺ اور اپنے فوت شدہ والدین کے نام پر قربانی کرنے کا شرعی حکم",
    "volume": 10,
    "page": 315
  },
  {
    "topic": "گائے بھینس اور اونٹنی کا صرف ایک تھن ناقص ہو تو اس کی قربانی جائز ہے",
    "volume": 14,
    "page": 315
  },
  {
    "topic": "کمیٹی کی رقم پر قربانی کا حکم",
    "volume": 14,
    "page": 316
  },
  {
    "topic": "قربانی میں افضلیت کا معیار",
    "volume": 14,
    "page": 317
  },
  {
    "topic": "ولی کا سب کی طرف سے قربانی کرنا",
    "volume": 10,
    "page": 320
  },
  {
    "topic": "بڑے جانور میں سات حصے ہوتے ہیں",
    "volume": 14,
    "page": 320
  },
  {
    "topic": "قربانی کی بجائے رقم ضرورت مندوں پر صدقہ کرنے کا شرعی حکم",
    "volume": 14,
    "page": 321
  },
  {
    "topic": "مسلمان عورت اور اہلِ کتاب کے ذبیحے کا حکم",
    "volume": 10,
    "page": 323
  },
  {
    "topic": "غُدّ، غدود کو کہتے ہیں",
    "volume": 14,
    "page": 324
  },
  {
    "topic": "اگر کوئی صاحب نصاب ہو ، لیکن رقم مِلک میں نہیں آئی ، اس کی قربانی کا حکم",
    "volume": 14,
    "page": 329
  },
  {
    "topic": "اجتماعی قربانی میں گوشت کی تقسیم کس طرح ہونی چاہیے",
    "volume": 14,
    "page": 330
  },
  {
    "topic": "قربانی کے جانوروں کی نگہداشت کے اخراجات کا حکم",
    "volume": 14,
    "page": 332
  },
  {
    "topic": "گونگے مسلمان کے ذبیحے کا حکم",
    "volume": 14,
    "page": 334
  },
  {
    "topic": "گم شدہ گائے کا حکم",
    "volume": 9,
    "page": 360
  },
  {
    "topic": "قسم کی قسمیں",
    "volume": 1,
    "page": 343
  },
  {
    "topic": "کافر ملت پر معلق کر کے قسم کھانا",
    "volume": 1,
    "page": 343
  },
  {
    "topic": "قسم کی شدت",
    "volume": 1,
    "page": 345
  },
  {
    "topic": "مشروط قسم",
    "volume": 1,
    "page": 345
  },
  {
    "topic": "اللہ تعالیٰ سے وعدہ",
    "volume": 1,
    "page": 345
  },
  {
    "topic": "قسم توڑ دے اور کفارہ ادا کرے",
    "volume": 1,
    "page": 346
  },
  {
    "topic": "قسم توڑنا",
    "volume": 1,
    "page": 347
  },
  {
    "topic": "جھوٹی قسم",
    "volume": 1,
    "page": 348
  },
  {
    "topic": "وعدہ کے وقت ان شاء اللہ کہنا",
    "volume": 1,
    "page": 348
  },
  {
    "topic": "وعدہ معاف گواہ کا حکم",
    "volume": 1,
    "page": 349
  },
  {
    "topic": "شادی کی قسم کھانا",
    "volume": 3,
    "page": 405
  },
  {
    "topic": "بلاضرورت قسم کھانے کا حکم",
    "volume": 3,
    "page": 406
  },
  {
    "topic": "خیراتی فنڈ پر زکوٰۃ نہیں",
    "volume": 7,
    "page": 141
  },
  {
    "topic": "کسی چیز کو محض مستحق کے تصرُّف میں دینے سے زکوٰۃ ادا نہیں ہوتی",
    "volume": 7,
    "page": 142
  },
  {
    "topic": "زکوٰۃ کے چند مسائل",
    "volume": 8,
    "page": 143
  },
  {
    "topic": "قرض کی اقسام (دین)",
    "volume": 8,
    "page": 143
  },
  {
    "topic": "زکوٰۃ کی رقم تعمیراتی مَد میں استعمال نہیں کی جا سکتی",
    "volume": 7,
    "page": 145
  },
  {
    "topic": "زکوٰۃ وفطرہ اور صدقاتِ واجبہ کی دائیگی کے بارے میں روزنامہ اُمت کے سوالوں کے جوابات",
    "volume": 7,
    "page": 146
  },
  {
    "topic": "ایک فقیر کو نصابِ زکوٰۃ سے زیادہ مال دینا",
    "volume": 8,
    "page": 147
  },
  {
    "topic": "زکوٰۃ کی رقم سے افطار کا اہتمام کرنا",
    "volume": 7,
    "page": 149
  },
  {
    "topic": "قرضِ حسن پر زکوٰۃ",
    "volume": 7,
    "page": 150
  },
  {
    "topic": "عُشر اصل پیداوار پر مصارف وضع کیے بغیر ادا کیا جائے گا",
    "volume": 8,
    "page": 150
  },
  {
    "topic": "پلاٹ پر زکوٰۃ کس صورت میں ہوگی",
    "volume": 7,
    "page": 151
  },
  {
    "topic": "شرعی فقیر پر زکوٰۃ ، فطرہ اور حج فرض نہیں",
    "volume": 7,
    "page": 152
  },
  {
    "topic": "گزشتہ سالوں کی زکوٰۃ",
    "volume": 8,
    "page": 152
  },
  {
    "topic": "سونا اور چاندی کے نصاب ہونے میں فرق",
    "volume": 8,
    "page": 153
  },
  {
    "topic": "مسائلِ زکوٰۃ",
    "volume": 3,
    "page": 155
  },
  {
    "topic": "زکوٰۃ کا ایک مسئلہ",
    "volume": 8,
    "page": 156
  },
  {
    "topic": "مسئلہ زکوٰۃ",
    "volume": 3,
    "page": 157
  },
  {
    "topic": "مسئلہ زکوٰۃ",
    "volume": 3,
    "page": 157
  },
  {
    "topic": "زکوٰۃ کی رقم نکال کر علیحدہ رکھنے کا حکم",
    "volume": 8,
    "page": 157
  },
  {
    "topic": "صاحبِ زکوٰۃ کے لیے تاریخ کے تعین کا مسئلہ",
    "volume": 8,
    "page": 159
  },
  {
    "topic": "نصاب کا تعین",
    "volume": 8,
    "page": 159
  },
  {
    "topic": "زکوٰۃ ، فطرہ صدقات واجبہ اور قربانی کی کھال کے مصارف",
    "volume": 3,
    "page": 160
  },
  {
    "topic": "تاریخ سے پہلے زکوٰۃ ادا کرنے کی صورت میں نصاب کس تاریخ معتبر ہوگا",
    "volume": 8,
    "page": 160
  },
  {
    "topic": "زکوٰۃ کرائے پر یا اصل قیمت پر",
    "volume": 8,
    "page": 160
  },
  {
    "topic": "گزشتہ سالوں کی زکوٰۃ کی ادائیگی کا طریقہ",
    "volume": 8,
    "page": 161
  },
  {
    "topic": "زکوٰۃ فنڈ سے تعمیر کردہ فلیٹ/مکان",
    "volume": 8,
    "page": 161
  },
  {
    "topic": "زکوٰۃ : اہمیت ، فضیلت اور مسائل",
    "volume": 2,
    "page": 163
  },
  {
    "topic": "زکوٰۃ ادا نہ کرنے والوں کےلیے قرآنی وعیدیں",
    "volume": 2,
    "page": 163
  },
  {
    "topic": "زکوٰۃ کا مسئلہ",
    "volume": 8,
    "page": 164
  },
  {
    "topic": "زکوٰۃ کی رقم سے قرض کی ادائی",
    "volume": 4,
    "page": 165
  },
  {
    "topic": "زکوٰۃ کی رقم سے نادارکے قرض کی ادائی",
    "volume": 4,
    "page": 165
  },
  {
    "topic": "زکوٰۃ کی رقم ھبہ یا قرض کہہ کر دینا",
    "volume": 4,
    "page": 166
  },
  {
    "topic": "رفاہی انجمنوں کےلیے زکوٰۃ کی رقوم کے استعمال کا شرعی طریقہ",
    "volume": 8,
    "page": 166
  },
  {
    "topic": "زکوٰۃ کی تشخیص، ادائیگی اور پیچیدہ مسائل",
    "volume": 2,
    "page": 167
  },
  {
    "topic": "زکوٰۃ کا مفہوم",
    "volume": 2,
    "page": 167
  },
  {
    "topic": "وجوبِ زکوٰۃ",
    "volume": 2,
    "page": 167
  },
  {
    "topic": "نصابِ زکوٰۃ",
    "volume": 2,
    "page": 167
  },
  {
    "topic": "ادھار کی رقم سے زکوٰۃ کی ادائیگی",
    "volume": 4,
    "page": 167
  },
  {
    "topic": "حولانِ حول کا مفہوم",
    "volume": 2,
    "page": 168
  },
  {
    "topic": "اموالِ تجارت پر زکوٰۃ",
    "volume": 2,
    "page": 168
  },
  {
    "topic": "اسپتال کے لیے زکوٰۃ کی رقم سے آلاتِ طب کی خریداری",
    "volume": 4,
    "page": 168
  },
  {
    "topic": "زکوٰۃ کی رقم سے مقامی بچوں کےلیے تعلیم القرآن کا مدرسہ چلانا",
    "volume": 4,
    "page": 168
  },
  {
    "topic": "صنعت کاروں کی تشخیص",
    "volume": 2,
    "page": 169
  },
  {
    "topic": "تشخیصِ زکوٰہ کے وقت واجب الادا قرض کا مسئلہ",
    "volume": 2,
    "page": 169
  },
  {
    "topic": "طویل میعادی قرض اور صنعتی قرض کا مسئلہ/td>",
    "volume": 2,
    "page": 169
  },
  {
    "topic": "ترکے کی تقسیم سے پہلے کی مدت پر زکوٰۃ واجب نہیں",
    "volume": 4,
    "page": 169
  },
  {
    "topic": "زکوٰۃ کی شرح کا بیان",
    "volume": 8,
    "page": 169
  },
  {
    "topic": "مکان، دکان، فلیٹس اورپلاٹوں پر زکوٰۃ",
    "volume": 2,
    "page": 170
  },
  {
    "topic": "استعمال کے زیورات پر زکوٰۃ",
    "volume": 2,
    "page": 171
  },
  {
    "topic": "بچوں کی شادی کےلیے مختص زیورات پر زکوٰۃ",
    "volume": 2,
    "page": 172
  },
  {
    "topic": "حج کےلیے جمع شدہ رقم پر زکوٰۃ",
    "volume": 2,
    "page": 172
  },
  {
    "topic": "پھنسا ہوا قرض زکوٰۃ کے لیے محسوب نہیں ہوتا",
    "volume": 2,
    "page": 172
  },
  {
    "topic": "زکوٰۃ کہاں صرف کی جائے",
    "volume": 2,
    "page": 172
  },
  {
    "topic": "زکوٰۃ کی رقم سے ڈائلیسس مشین کی خریداری",
    "volume": 4,
    "page": 172
  },
  {
    "topic": "زکوٰۃ کا سب سے اہم شعبہ",
    "volume": 2,
    "page": 173
  },
  {
    "topic": "مدارس تعلیم القرآن",
    "volume": 2,
    "page": 174
  },
  {
    "topic": "کمیونٹیز اور برادری کے رفاہی فنڈ",
    "volume": 2,
    "page": 174
  },
  {
    "topic": "مساجد کی تعمیر و مصارف پر زکوٰۃ خرچ کرنا",
    "volume": 2,
    "page": 174
  },
  {
    "topic": "مقامی مدارس میں زکوٰۃ اور نفلی صدقات کا استعمال",
    "volume": 4,
    "page": 174
  },
  {
    "topic": "ہسپتالوں میں زکوٰۃ سے نادار مریضوں کا علاج",
    "volume": 2,
    "page": 175
  },
  {
    "topic": "جامعات کے مستحق طلبہ کی اعانت",
    "volume": 2,
    "page": 175
  },
  {
    "topic": "زکوٰۃ کی ادائیگی میں تملیک کی شرط",
    "volume": 4,
    "page": 175
  },
  {
    "topic": "محض رقم الگ کردینے سے زکوٰۃ ادا نہیں ہوتی",
    "volume": 2,
    "page": 176
  },
  {
    "topic": "دورانِ سال زکوٰۃ کی پیشگی ادائیگی",
    "volume": 2,
    "page": 176
  },
  {
    "topic": "زکوٰۃ کا استحقاق",
    "volume": 4,
    "page": 176
  },
  {
    "topic": "زکوٰۃ فنڈ سے قرضِ حسن",
    "volume": 2,
    "page": 177
  },
  {
    "topic": "زکوٰۃ فنڈ کا انویسٹمنٹ",
    "volume": 2,
    "page": 177
  },
  {
    "topic": "اپنے اصول و فروع کو زکوٰۃ نہیں دے سکتا",
    "volume": 2,
    "page": 177
  },
  {
    "topic": "ہرفرد مسئول ہے",
    "volume": 2,
    "page": 177
  },
  {
    "topic": "زکوٰۃ کی شرح اور حکمتِ زکوٰۃ",
    "volume": 2,
    "page": 178
  },
  {
    "topic": "تنگیٔ رزق بارِ قرض سے سبکدوش ہونے کا وظیفہ",
    "volume": 2,
    "page": 178
  },
  {
    "topic": "شوہر مقروض ہو اور بیوی کے پاس سونا ہو",
    "volume": 2,
    "page": 179
  },
  {
    "topic": "زکوٰۃ کا نصاب",
    "volume": 2,
    "page": 179
  },
  {
    "topic": "زکوٰۃ بینک کے منافع یا اصل رقم پر دی جائے",
    "volume": 2,
    "page": 179
  },
  {
    "topic": "بیٹی کی زکوٰۃ کی رقم سے انکم ٹیکس میں چھوٹ حاصل کرنا",
    "volume": 2,
    "page": 180
  },
  {
    "topic": "بنو ہاشم کےلیے بنو ہاشم کی زکوٰۃ",
    "volume": 2,
    "page": 180
  },
  {
    "topic": "سید کی غیر سیدہ بیوی کو زکوٰۃ دینا",
    "volume": 2,
    "page": 181
  },
  {
    "topic": "بیوی او ربہو کے سونے کی زکوٰۃ",
    "volume": 2,
    "page": 181
  },
  {
    "topic": "کیا دو سال کی زکوٰۃ اکٹھے دی جا سکتی ہے",
    "volume": 2,
    "page": 181
  },
  {
    "topic": "صدقات کے فنڈ سے قرضِ حسن",
    "volume": 2,
    "page": 182
  },
  {
    "topic": "زیورات پر زکوٰۃ جبکہ نقد رقم نہ ہو",
    "volume": 2,
    "page": 182
  },
  {
    "topic": "اگر عید الفطر کے دن صدقۂ فطر نہ ادا کر سکا ہو تو",
    "volume": 2,
    "page": 183
  },
  {
    "topic": "زکوٰۃ وفطرہ کی جبری وصولی",
    "volume": 6,
    "page": 183
  },
  {
    "topic": "زکوٰۃ کے مصارف اور اُن میں خرد بُرد",
    "volume": 6,
    "page": 188
  },
  {
    "topic": "زکوٰۃ اور کمیونٹی فنڈز",
    "volume": 6,
    "page": 190
  },
  {
    "topic": "زکوٰۃ فنڈ سے پگڑی پر مکان لینے کےلیے مدد کرنا",
    "volume": 6,
    "page": 192
  },
  {
    "topic": "پراویڈنٹ فنڈ پر زکوٰۃ",
    "volume": 6,
    "page": 194
  },
  {
    "topic": "بیوی کا مہر زکوٰۃ واجب ہونے سے مانع نہیں",
    "volume": 6,
    "page": 195
  },
  {
    "topic": "پینشن بینفٹ اکاؤنٹ کی رقم پر زکوٰۃ",
    "volume": 6,
    "page": 196
  },
  {
    "topic": "زکوٰۃ کے مسائل",
    "volume": 6,
    "page": 197
  },
  {
    "topic": "زکوٰۃ کی رقم مصارفِ مسجد میں استعمال نہیں کی جا سکتی",
    "volume": 5,
    "page": 199
  },
  {
    "topic": "زکوٰۃ محض وکیل کو دینے سے ادا نہیں ہوتی",
    "volume": 5,
    "page": 201
  },
  {
    "topic": "زکوٰۃ کے چند مسائل",
    "volume": 5,
    "page": 203
  },
  {
    "topic": "مسجد کی تعمیر میں زکوٰۃ کا استعمال",
    "volume": 5,
    "page": 208
  },
  {
    "topic": "سونے چاندی پر زکوٰۃ",
    "volume": 1,
    "page": 213
  },
  {
    "topic": "زیورات کی ملکیت ، زکوٰۃ",
    "volume": 1,
    "page": 214
  },
  {
    "topic": "زکوٰۃ فنڈ سے قرض حسنہ دینا",
    "volume": 1,
    "page": 215
  },
  {
    "topic": "زکوٰۃ فنڈ کی سود اسکیموں میں انویسٹمنٹ",
    "volume": 1,
    "page": 215
  },
  {
    "topic": "بینک اور زکوٰۃ کی کٹوتی",
    "volume": 1,
    "page": 216
  },
  {
    "topic": "پیشہ ور بھکاریوں کا مسئلہ",
    "volume": 1,
    "page": 217
  },
  {
    "topic": "بری اور جہیز کے سامان اور زیورات کی ملکیت کا مسئلہ",
    "volume": 1,
    "page": 218
  },
  {
    "topic": "زکوٰۃ مالک پر ہے",
    "volume": 13,
    "page": 237
  },
  {
    "topic": "کیٹل فارم اور ڈیری فارم کے جانوروں پر زکوٰۃ کا حکم",
    "volume": 13,
    "page": 238
  },
  {
    "topic": "زکوٰۃ کے مصارف کا بیان",
    "volume": 13,
    "page": 239
  },
  {
    "topic": "زکوٰۃ کی ادائی میں تملیک شرط",
    "volume": 13,
    "page": 242
  },
  {
    "topic": "زکوٰۃ کا مسئلہ",
    "volume": 13,
    "page": 245
  },
  {
    "topic": "زکوٰۃ سے متعلق چند سوالات",
    "volume": 13,
    "page": 248
  },
  {
    "topic": "وکیل کو زکوٰۃ کا مَصرف تبدیل کرنے کا اختیار نہیں ہے",
    "volume": 13,
    "page": 252
  },
  {
    "topic": "فقیر زکوٰۃ کی رقم کا مالک بننے کے بعد ہدیہ دے سکتا ہے",
    "volume": 13,
    "page": 253
  },
  {
    "topic": "زکوٰۃ کی رقم اسلامی بینک میں جمع کرنے کا شرعی حکم",
    "volume": 13,
    "page": 253
  },
  {
    "topic": "زکوٰۃ کی رقم سے ڈائلیسز مشین خریدنا",
    "volume": 13,
    "page": 256
  },
  {
    "topic": "مالِ وراثت پر زکوٰۃ کا مسئلہ",
    "volume": 13,
    "page": 257
  },
  {
    "topic": "اسپتال میں نادار بچوں کا زکوٰۃ سے علاج",
    "volume": 13,
    "page": 258
  },
  {
    "topic": "عاملین زکوٰہ کا مشاہرہ",
    "volume": 12,
    "page": 261
  },
  {
    "topic": "زکوٰۃ کی وکالت کا ایک مسئلہ",
    "volume": 13,
    "page": 261
  },
  {
    "topic": "سال کے آخر میں حاصل ہونے والے مال پر زکوٰۃ کا حکم",
    "volume": 13,
    "page": 262
  },
  {
    "topic": "پلاٹ پر زکوٰۃ",
    "volume": 10,
    "page": 265
  },
  {
    "topic": "مستحقِ زکوٰۃ قیدیوں کے زَرِ ضمانت یا جرمانے کی ادائیگی کےلیے زکوٰۃ کا استعمال",
    "volume": 10,
    "page": 265
  },
  {
    "topic": "مکان کے لیے پس انداز رقم پر زکوٰۃ",
    "volume": 10,
    "page": 268
  },
  {
    "topic": "بک کیے ہوئے پلاٹ کی زکوٰۃ",
    "volume": 10,
    "page": 272
  },
  {
    "topic": "بچوں کی تعلیم کے لیے جمع شدہ رقم کی زکوٰۃ",
    "volume": 10,
    "page": 273
  },
  {
    "topic": "استعمال کی گاڑیوں پر زکوٰۃ",
    "volume": 10,
    "page": 274
  },
  {
    "topic": "متفرق طور پر زکوٰۃ کی ادائیگی",
    "volume": 10,
    "page": 274
  },
  {
    "topic": "گاڑیوں کے کاروبار پر زکوٰۃ",
    "volume": 10,
    "page": 277
  },
  {
    "topic": "صنعتوں پر زکوٰۃ",
    "volume": 10,
    "page": 277
  },
  {
    "topic": "زکوٰۃ کی رقم سے ایمبولنس کی خریداری",
    "volume": 10,
    "page": 278
  },
  {
    "topic": "صنعتی مقصد میں استعمال ہونے والی مشینری پر زکوٰۃ کا حکم",
    "volume": 11,
    "page": 278
  },
  {
    "topic": "آلِ بنی ہاشم کا مصداق کون ہیں",
    "volume": 10,
    "page": 279
  },
  {
    "topic": "زکوٰۃ قمری سال کے حساب سے دی جائے گی",
    "volume": 11,
    "page": 279
  },
  {
    "topic": "بنو ہاشم زکوٰۃ کا مصرف نہیں ہیں",
    "volume": 14,
    "page": 279
  },
  {
    "topic": "جمع شدہ ایڈوانس یا زرِ ضمانت پر زکوٰہ نہیں ہے",
    "volume": 11,
    "page": 280
  },
  {
    "topic": "زکوٰۃ کے چند پیچیدہ مسائل",
    "volume": 11,
    "page": 281
  },
  {
    "topic": "وطنِ اقامت سے دوسرے ملک زکوٰۃ بھیجنے کا حکم",
    "volume": 14,
    "page": 281
  },
  {
    "topic": "فلیٹس کی قسط وار بیع اور زکوٰۃ و عُشر کے مسائل",
    "volume": 10,
    "page": 284
  },
  {
    "topic": "بلڈر کے اثاثوں پر زکوٰۃ",
    "volume": 14,
    "page": 285
  },
  {
    "topic": "زکوٰۃ کی رقم سے مستحقین کو قسطوں پر سامان خرید کردینے کا شرعی حکم",
    "volume": 14,
    "page": 288
  },
  {
    "topic": "پلاٹ پر زکوٰۃ کا حکم",
    "volume": 11,
    "page": 289
  },
  {
    "topic": "کرائے کی آمدنی پر زکوٰۃ کا حکم",
    "volume": 11,
    "page": 290
  },
  {
    "topic": "زکوٰۃ کے بارے میں متفرق سوالات",
    "volume": 14,
    "page": 290
  },
  {
    "topic": "گزشتہ سالوں کی زکوٰۃ ادا کرنی ہوگی",
    "volume": 11,
    "page": 291
  },
  {
    "topic": "مقروض پر زکوٰۃ کا حکم",
    "volume": 10,
    "page": 292
  },
  {
    "topic": "ذاتی استعمال کے لیے خرید کردہ پلاٹ پر زکوٰۃ نہیں ہے",
    "volume": 11,
    "page": 292
  },
  {
    "topic": "کرائے کے مکان کی قیمت پر زکوٰۃ عائد نہیں ہوگی",
    "volume": 11,
    "page": 292
  },
  {
    "topic": "تعمیری مصارف میں زکوٰۃ استعمال نہیں کی جاسکتی",
    "volume": 14,
    "page": 292
  },
  {
    "topic": "قرض کی رقم سے زیادہ دینے کا حکم",
    "volume": 10,
    "page": 293
  },
  {
    "topic": "زکوٰۃ میں غیر شرعی تصرُّف کی درستگی",
    "volume": 11,
    "page": 293
  },
  {
    "topic": "زکوٰۃ دیتے وقت مستحقِ زکوٰۃ کو بتانا ضروری نہیں ہے",
    "volume": 14,
    "page": 293
  },
  {
    "topic": "ڈاکٹر اپنی زکوٰۃ کی رقم سے اپنے زیرِ علاج مریضوں پر صرف کرسکتا ہے",
    "volume": 14,
    "page": 293
  },
  {
    "topic": "زکوٰۃ فنڈ سے عملے کو تنخواہ دینے کا حکم",
    "volume": 14,
    "page": 294
  },
  {
    "topic": "پلاٹ پر زکوٰۃ یا عشر",
    "volume": 10,
    "page": 295
  },
  {
    "topic": "زکوٰۃ کی رقم سے خریدی ہوئی ادویات سال بعد بھی بچی ہوں",
    "volume": 14,
    "page": 295
  },
  {
    "topic": "مقروض شخص پر زکوٰۃ کا حکم",
    "volume": 14,
    "page": 296
  },
  {
    "topic": "زکوٰۃ قیمتِ خرید پر یا مارکیٹ ویلیو پر دینی ہے",
    "volume": 14,
    "page": 296
  },
  {
    "topic": "بیعانے اور فلیٹ کی اقساط پر زکوٰۃ کس کے ذمے ہے",
    "volume": 14,
    "page": 297
  },
  {
    "topic": "مالِ زکوٰۃ سے حج کرانے کا حکم",
    "volume": 11,
    "page": 298
  },
  {
    "topic": "مکان خریدنے کے لیے رکھی رقم پر زکوٰۃ",
    "volume": 14,
    "page": 298
  },
  {
    "topic": "شراکتی کاروبار پر زکوٰۃ",
    "volume": 14,
    "page": 299
  },
  {
    "topic": "فیکٹری کے اَموال پر زکوٰۃ",
    "volume": 14,
    "page": 299
  }
];
